#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorComp_Ambience_Triggercheck

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActorComp_Ambience_Triggercheck.ActorComp_Ambience_Triggercheck_C.Debug_PrintEveryXSeconds
// 0x0010 (0x0010 - 0x0000)
struct ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds final
{
public:
	float                                         EveryXSeconds;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldWePrint;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds) == 0x000004, "Wrong alignment on ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds");
static_assert(sizeof(ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds) == 0x000010, "Wrong size on ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds, EveryXSeconds) == 0x000000, "Member 'ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds::EveryXSeconds' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds, Delta) == 0x000004, "Member 'ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds::Delta' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds, ShouldWePrint) == 0x000008, "Member 'ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds::ShouldWePrint' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000009, "Member 'ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'ActorComp_Ambience_Triggercheck_C_Debug_PrintEveryXSeconds::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function ActorComp_Ambience_Triggercheck.ActorComp_Ambience_Triggercheck_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ActorComp_Ambience_Triggercheck_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorComp_Ambience_Triggercheck_C_ReceiveTick) == 0x000004, "Wrong alignment on ActorComp_Ambience_Triggercheck_C_ReceiveTick");
static_assert(sizeof(ActorComp_Ambience_Triggercheck_C_ReceiveTick) == 0x000004, "Wrong size on ActorComp_Ambience_Triggercheck_C_ReceiveTick");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ActorComp_Ambience_Triggercheck_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ActorComp_Ambience_Triggercheck.ActorComp_Ambience_Triggercheck_C.ExecuteUbergraph_ActorComp_Ambience_Triggercheck
// 0x00D0 (0x00D0 - 0x0000)
struct ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Debug_PrintEveryXSeconds_ShouldWePrint;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AAmbience_NestedTrigger_C*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAmbience_NestedTrigger_C*              K2Node_DynamicCast_AsAmbience_Nested_Trigger;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck) == 0x000008, "Wrong alignment on ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck");
static_assert(sizeof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck) == 0x0000D0, "Wrong size on ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, EntryPoint) == 0x000000, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Debug_PrintEveryXSeconds_ShouldWePrint) == 0x000010, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Debug_PrintEveryXSeconds_ShouldWePrint' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Conv_IntToString_ReturnValue1) == 0x000030, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, Temp_int_Array_Index_Variable) == 0x000040, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Concat_StrStr_ReturnValue1) == 0x000058, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Concat_StrStr_ReturnValue2) == 0x000068, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_GetAllActorsOfClass_OutActors) == 0x000078, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Concat_StrStr_ReturnValue3) == 0x000088, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_GetOwner_ReturnValue1) == 0x000098, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, K2Node_DynamicCast_AsAmbience_Nested_Trigger) == 0x0000B0, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::K2Node_DynamicCast_AsAmbience_Nested_Trigger' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_IsOverlappingActor_ReturnValue) == 0x0000B9, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Conv_BoolToInt_ReturnValue) == 0x0000C0, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Add_IntInt_ReturnValue1) == 0x0000C8, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck, CallFunc_Array_Length_ReturnValue1) == 0x0000CC, "Member 'ActorComp_Ambience_Triggercheck_C_ExecuteUbergraph_ActorComp_Ambience_Triggercheck::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");

}

