#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Anal_Probe_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Anal_Probe_AnimBP.Anal_Probe_AnimBP_C.ExecuteUbergraph_Anal_Probe_AnimBP
// 0x0048 (0x0048 - 0x0000)
struct Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGAnimation_Variables*                CallFunc_GetVariables_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGAnimation_Variables*                CallFunc_GetVariables_ReturnValue1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGAnimation_Variables*                CallFunc_GetVariables_ReturnValue2;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGAnimation_Variables*                CallFunc_GetVariables_ReturnValue3;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP) == 0x000008, "Wrong alignment on Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP");
static_assert(sizeof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP) == 0x000048, "Wrong size on Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, EntryPoint) == 0x000000, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_GetVariables_ReturnValue) == 0x000008, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_GetVariables_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000011, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_GetVariables_ReturnValue1) == 0x000018, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_GetVariables_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_GetVariables_ReturnValue2) == 0x000020, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_GetVariables_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000028, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_Not_PreBool_ReturnValue1) == 0x000029, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_GetVariables_ReturnValue3) == 0x000030, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_GetVariables_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x000038, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_BooleanAND_ReturnValue1) == 0x000039, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x00003C, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000040, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP, K2Node_Event_DeltaTimeX) == 0x000044, "Member 'Anal_Probe_AnimBP_C_ExecuteUbergraph_Anal_Probe_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function Anal_Probe_AnimBP.Anal_Probe_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Anal_Probe_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Anal_Probe_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Anal_Probe_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Anal_Probe_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Anal_Probe_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Anal_Probe_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Anal_Probe_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Anal_Probe_AnimBP.Anal_Probe_AnimBP_C.HandleSpin
// 0x0008 (0x0008 - 0x0000)
struct Anal_Probe_AnimBP_C_HandleSpin final
{
public:
	class UBFGAnimation_Variables*                CallFunc_GetVariables_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Anal_Probe_AnimBP_C_HandleSpin) == 0x000008, "Wrong alignment on Anal_Probe_AnimBP_C_HandleSpin");
static_assert(sizeof(Anal_Probe_AnimBP_C_HandleSpin) == 0x000008, "Wrong size on Anal_Probe_AnimBP_C_HandleSpin");
static_assert(offsetof(Anal_Probe_AnimBP_C_HandleSpin, CallFunc_GetVariables_ReturnValue) == 0x000000, "Member 'Anal_Probe_AnimBP_C_HandleSpin::CallFunc_GetVariables_ReturnValue' has a wrong offset!");

// Function Anal_Probe_AnimBP.Anal_Probe_AnimBP_C.PlayShootMontage
// 0x0010 (0x0010 - 0x0000)
struct Anal_Probe_AnimBP_C_PlayShootMontage final
{
public:
	class UBFGAnimation_Variables*                CallFunc_GetVariables_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue1;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Anal_Probe_AnimBP_C_PlayShootMontage) == 0x000008, "Wrong alignment on Anal_Probe_AnimBP_C_PlayShootMontage");
static_assert(sizeof(Anal_Probe_AnimBP_C_PlayShootMontage) == 0x000010, "Wrong size on Anal_Probe_AnimBP_C_PlayShootMontage");
static_assert(offsetof(Anal_Probe_AnimBP_C_PlayShootMontage, CallFunc_GetVariables_ReturnValue) == 0x000000, "Member 'Anal_Probe_AnimBP_C_PlayShootMontage::CallFunc_GetVariables_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_PlayShootMontage, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000008, "Member 'Anal_Probe_AnimBP_C_PlayShootMontage::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_PlayShootMontage, CallFunc_EqualEqual_BoolBool_ReturnValue1) == 0x000009, "Member 'Anal_Probe_AnimBP_C_PlayShootMontage::CallFunc_EqualEqual_BoolBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_PlayShootMontage, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'Anal_Probe_AnimBP_C_PlayShootMontage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_PlayShootMontage, CallFunc_Montage_Play_ReturnValue) == 0x00000C, "Member 'Anal_Probe_AnimBP_C_PlayShootMontage::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function Anal_Probe_AnimBP.Anal_Probe_AnimBP_C.SetPreviousVars
// 0x0008 (0x0008 - 0x0000)
struct Anal_Probe_AnimBP_C_SetPreviousVars final
{
public:
	class UBFGAnimation_Variables*                CallFunc_GetVariables_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Anal_Probe_AnimBP_C_SetPreviousVars) == 0x000008, "Wrong alignment on Anal_Probe_AnimBP_C_SetPreviousVars");
static_assert(sizeof(Anal_Probe_AnimBP_C_SetPreviousVars) == 0x000008, "Wrong size on Anal_Probe_AnimBP_C_SetPreviousVars");
static_assert(offsetof(Anal_Probe_AnimBP_C_SetPreviousVars, CallFunc_GetVariables_ReturnValue) == 0x000000, "Member 'Anal_Probe_AnimBP_C_SetPreviousVars::CallFunc_GetVariables_ReturnValue' has a wrong offset!");

// Function Anal_Probe_AnimBP.Anal_Probe_AnimBP_C.RemapMiniGameValue
// 0x0018 (0x0018 - 0x0000)
struct Anal_Probe_AnimBP_C_RemapMiniGameValue final
{
public:
	class UBFGAnimation_Variables*                CallFunc_GetVariables_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Anal_Probe_AnimBP_C_RemapMiniGameValue) == 0x000008, "Wrong alignment on Anal_Probe_AnimBP_C_RemapMiniGameValue");
static_assert(sizeof(Anal_Probe_AnimBP_C_RemapMiniGameValue) == 0x000018, "Wrong size on Anal_Probe_AnimBP_C_RemapMiniGameValue");
static_assert(offsetof(Anal_Probe_AnimBP_C_RemapMiniGameValue, CallFunc_GetVariables_ReturnValue) == 0x000000, "Member 'Anal_Probe_AnimBP_C_RemapMiniGameValue::CallFunc_GetVariables_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_RemapMiniGameValue, CallFunc_NormalizeToRange_ReturnValue) == 0x000008, "Member 'Anal_Probe_AnimBP_C_RemapMiniGameValue::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_RemapMiniGameValue, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'Anal_Probe_AnimBP_C_RemapMiniGameValue::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_RemapMiniGameValue, CallFunc_MapRangeClamped_ReturnValue) == 0x000010, "Member 'Anal_Probe_AnimBP_C_RemapMiniGameValue::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Anal_Probe_AnimBP_C_RemapMiniGameValue, CallFunc_MapRangeClamped_ReturnValue1) == 0x000014, "Member 'Anal_Probe_AnimBP_C_RemapMiniGameValue::CallFunc_MapRangeClamped_ReturnValue1' has a wrong offset!");

}

