#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP__deathRay_water_hit

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP__deathRay_water_hit.BP__deathRay_water_hit_C.ExecuteUbergraph_BP__deathRay_water_hit
// 0x0090 (0x0090 - 0x0000)
struct BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* _pActor, class UBFGActorStat_Bool* _pStat)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsShooting_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingCutscene_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DeathRay;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Weapon_UFO_DeathRay_C*              K2Node_DynamicCast_AsBP_Weapon_UFO_Death_Ray;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent__pActor;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorStat_Bool*                     K2Node_CustomEvent__pStat;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_PawnStats*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorStat_Bool*                     CallFunc_GetIsDeadStat_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsObjectPendingKill_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue1;                   // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit) == 0x000008, "Wrong alignment on BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit");
static_assert(sizeof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit) == 0x000090, "Wrong size on BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, EntryPoint) == 0x000000, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_IsShooting_ReturnValue) == 0x000018, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_IsShooting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000020, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_SpawnEmitterAttached_ReturnValue1) == 0x000028, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_SpawnEmitterAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_IsPlayingCutscene_ReturnValue) == 0x00003C, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_IsPlayingCutscene_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_BooleanAND_ReturnValue) == 0x00003D, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, K2Node_CustomEvent_DeathRay) == 0x000040, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::K2Node_CustomEvent_DeathRay' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, K2Node_DynamicCast_AsBP_Weapon_UFO_Death_Ray) == 0x000050, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::K2Node_DynamicCast_AsBP_Weapon_UFO_Death_Ray' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_GetOwner_ReturnValue) == 0x000060, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, K2Node_CustomEvent__pActor) == 0x000068, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::K2Node_CustomEvent__pActor' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, K2Node_CustomEvent__pStat) == 0x000070, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::K2Node_CustomEvent__pStat' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_GetComponentByClass_ReturnValue) == 0x000078, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_GetIsDeadStat_ReturnValue) == 0x000080, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_GetIsDeadStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_IsObjectPendingKill_ReturnValue) == 0x000088, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_IsObjectPendingKill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_IsPlaying_ReturnValue) == 0x000089, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit, CallFunc_IsPlaying_ReturnValue1) == 0x00008A, "Member 'BP__deathRay_water_hit_C_ExecuteUbergraph_BP__deathRay_water_hit::CallFunc_IsPlaying_ReturnValue1' has a wrong offset!");

// Function BP__deathRay_water_hit.BP__deathRay_water_hit_C.OnDeath
// 0x0010 (0x0010 - 0x0000)
struct BP__deathRay_water_hit_C_OnDeath final
{
public:
	class AActor*                                 _pActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorStat_Bool*                     _pStat;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP__deathRay_water_hit_C_OnDeath) == 0x000008, "Wrong alignment on BP__deathRay_water_hit_C_OnDeath");
static_assert(sizeof(BP__deathRay_water_hit_C_OnDeath) == 0x000010, "Wrong size on BP__deathRay_water_hit_C_OnDeath");
static_assert(offsetof(BP__deathRay_water_hit_C_OnDeath, _pActor) == 0x000000, "Member 'BP__deathRay_water_hit_C_OnDeath::_pActor' has a wrong offset!");
static_assert(offsetof(BP__deathRay_water_hit_C_OnDeath, _pStat) == 0x000008, "Member 'BP__deathRay_water_hit_C_OnDeath::_pStat' has a wrong offset!");

// Function BP__deathRay_water_hit.BP__deathRay_water_hit_C.RegisterOwner
// 0x0008 (0x0008 - 0x0000)
struct BP__deathRay_water_hit_C_RegisterOwner final
{
public:
	class AActor*                                 DeathRay_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP__deathRay_water_hit_C_RegisterOwner) == 0x000008, "Wrong alignment on BP__deathRay_water_hit_C_RegisterOwner");
static_assert(sizeof(BP__deathRay_water_hit_C_RegisterOwner) == 0x000008, "Wrong size on BP__deathRay_water_hit_C_RegisterOwner");
static_assert(offsetof(BP__deathRay_water_hit_C_RegisterOwner, DeathRay_0) == 0x000000, "Member 'BP__deathRay_water_hit_C_RegisterOwner::DeathRay_0' has a wrong offset!");

// Function BP__deathRay_water_hit.BP__deathRay_water_hit_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP__deathRay_water_hit_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP__deathRay_water_hit_C_ReceiveTick) == 0x000004, "Wrong alignment on BP__deathRay_water_hit_C_ReceiveTick");
static_assert(sizeof(BP__deathRay_water_hit_C_ReceiveTick) == 0x000004, "Wrong size on BP__deathRay_water_hit_C_ReceiveTick");
static_assert(offsetof(BP__deathRay_water_hit_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP__deathRay_water_hit_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

