#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Animal_Base

#include "Basic.hpp"

#include "Enum_WhichBehaviorSound_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Animal_Base.BP_Animal_Base_C.CheckIfElectrocuteDamage
// 0x0048 (0x0048 - 0x0000)
struct BP_Animal_Base_C_CheckIfElectrocuteDamage final
{
public:
	const class UBFGDamageType*                   IncomingDamge;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          YesElectrocute;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorStat_Float*                    CallFunc_GetHealthStat_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRatio_ReturnValue;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Animal_Base_C_CheckIfElectrocuteDamage) == 0x000008, "Wrong alignment on BP_Animal_Base_C_CheckIfElectrocuteDamage");
static_assert(sizeof(BP_Animal_Base_C_CheckIfElectrocuteDamage) == 0x000048, "Wrong size on BP_Animal_Base_C_CheckIfElectrocuteDamage");
static_assert(offsetof(BP_Animal_Base_C_CheckIfElectrocuteDamage, IncomingDamge) == 0x000000, "Member 'BP_Animal_Base_C_CheckIfElectrocuteDamage::IncomingDamge' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_CheckIfElectrocuteDamage, YesElectrocute) == 0x000008, "Member 'BP_Animal_Base_C_CheckIfElectrocuteDamage::YesElectrocute' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_CheckIfElectrocuteDamage, CallFunc_GetHealthStat_ReturnValue) == 0x000010, "Member 'BP_Animal_Base_C_CheckIfElectrocuteDamage::CallFunc_GetHealthStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_CheckIfElectrocuteDamage, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_Animal_Base_C_CheckIfElectrocuteDamage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_CheckIfElectrocuteDamage, CallFunc_GetRatio_ReturnValue) == 0x00001C, "Member 'BP_Animal_Base_C_CheckIfElectrocuteDamage::CallFunc_GetRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_CheckIfElectrocuteDamage, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Animal_Base_C_CheckIfElectrocuteDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_CheckIfElectrocuteDamage, CallFunc_Conv_FloatToString_ReturnValue) == 0x000028, "Member 'BP_Animal_Base_C_CheckIfElectrocuteDamage::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_CheckIfElectrocuteDamage, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BP_Animal_Base_C_CheckIfElectrocuteDamage::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_Animal_Base.BP_Animal_Base_C.HandleVOBehavior
// 0x0018 (0x0018 - 0x0000)
struct BP_Animal_Base_C_HandleVOBehavior final
{
public:
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_WhichBehaviorSound                       Temp_byte_Variable;                                // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Animal_Base_C_HandleVOBehavior) == 0x000008, "Wrong alignment on BP_Animal_Base_C_HandleVOBehavior");
static_assert(sizeof(BP_Animal_Base_C_HandleVOBehavior) == 0x000018, "Wrong size on BP_Animal_Base_C_HandleVOBehavior");
static_assert(offsetof(BP_Animal_Base_C_HandleVOBehavior, Temp_bool_Has_Been_Initd_Variable) == 0x000000, "Member 'BP_Animal_Base_C_HandleVOBehavior::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_HandleVOBehavior, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_Animal_Base_C_HandleVOBehavior::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_HandleVOBehavior, Temp_bool_IsClosed_Variable) == 0x000002, "Member 'BP_Animal_Base_C_HandleVOBehavior::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_HandleVOBehavior, CallFunc_IsPlaying_ReturnValue) == 0x000003, "Member 'BP_Animal_Base_C_HandleVOBehavior::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_HandleVOBehavior, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000004, "Member 'BP_Animal_Base_C_HandleVOBehavior::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_HandleVOBehavior, Temp_byte_Variable) == 0x000005, "Member 'BP_Animal_Base_C_HandleVOBehavior::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_HandleVOBehavior, CallFunc_Map_Find_Value) == 0x000008, "Member 'BP_Animal_Base_C_HandleVOBehavior::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_HandleVOBehavior, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'BP_Animal_Base_C_HandleVOBehavior::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_Animal_Base.BP_Animal_Base_C.PlayBehaviorVO_simplified
// 0x0040 (0x0040 - 0x0000)
struct BP_Animal_Base_C_PlayBehaviorVO_simplified final
{
public:
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue1;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_Map_Find_Value1;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue2;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorStat_Bool*                     CallFunc_GetIsDeadStat_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValue_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Animal_Base_C_PlayBehaviorVO_simplified) == 0x000008, "Wrong alignment on BP_Animal_Base_C_PlayBehaviorVO_simplified");
static_assert(sizeof(BP_Animal_Base_C_PlayBehaviorVO_simplified) == 0x000040, "Wrong size on BP_Animal_Base_C_PlayBehaviorVO_simplified");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_IsPlaying_ReturnValue) == 0x000000, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_IsPlaying_ReturnValue1) == 0x000008, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_IsPlaying_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_Map_Find_Value) == 0x000010, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_BooleanAND_ReturnValue1) == 0x00001B, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_Map_Find_Value1) == 0x000020, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_Map_Find_Value1' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_Map_Find_ReturnValue1) == 0x000028, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_Map_Find_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_IsPlaying_ReturnValue2) == 0x000029, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_IsPlaying_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_Not_PreBool_ReturnValue1) == 0x00002A, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_GetIsDeadStat_ReturnValue) == 0x000030, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_GetIsDeadStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_GetValue_ReturnValue) == 0x000038, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_PlayBehaviorVO_simplified, CallFunc_Not_PreBool_ReturnValue2) == 0x000039, "Member 'BP_Animal_Base_C_PlayBehaviorVO_simplified::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");

// Function BP_Animal_Base.BP_Animal_Base_C.BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_1_BFGGameplayEffectTags_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_1_BFGGameplayEffectTags_Event__DelegateSignature final
{
public:
	struct FGameplayTag                           _rTag;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_1_BFGGameplayEffectTags_Event__DelegateSignature) == 0x000004, "Wrong alignment on BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_1_BFGGameplayEffectTags_Event__DelegateSignature");
static_assert(sizeof(BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_1_BFGGameplayEffectTags_Event__DelegateSignature) == 0x000008, "Wrong size on BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_1_BFGGameplayEffectTags_Event__DelegateSignature");
static_assert(offsetof(BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_1_BFGGameplayEffectTags_Event__DelegateSignature, _rTag) == 0x000000, "Member 'BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_1_BFGGameplayEffectTags_Event__DelegateSignature::_rTag' has a wrong offset!");

// Function BP_Animal_Base.BP_Animal_Base_C.BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_3_BFGGameplayEffectTags_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_3_BFGGameplayEffectTags_Event__DelegateSignature final
{
public:
	struct FGameplayTag                           _rTag;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_3_BFGGameplayEffectTags_Event__DelegateSignature) == 0x000004, "Wrong alignment on BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_3_BFGGameplayEffectTags_Event__DelegateSignature");
static_assert(sizeof(BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_3_BFGGameplayEffectTags_Event__DelegateSignature) == 0x000008, "Wrong size on BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_3_BFGGameplayEffectTags_Event__DelegateSignature");
static_assert(offsetof(BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_3_BFGGameplayEffectTags_Event__DelegateSignature, _rTag) == 0x000000, "Member 'BP_Animal_Base_C_BndEvt__m_pGameplayEffectTagsComponent_K2Node_ComponentBoundEvent_3_BFGGameplayEffectTags_Event__DelegateSignature::_rTag' has a wrong offset!");

// Function BP_Animal_Base.BP_Animal_Base_C.BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature final
{
public:
	class UBFGActorComponent_PawnDamage*          _pPawnDamage;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _fDamage;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 _pDamageCauser;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UBFGDamageType*                   _pDamageType;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _rShotDirection;                                   // 0x0020(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             _oHitResult;                                       // 0x002C(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature");
static_assert(sizeof(BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature) == 0x0000B8, "Wrong size on BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature");
static_assert(offsetof(BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature, _pPawnDamage) == 0x000000, "Member 'BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature::_pPawnDamage' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature, _fDamage) == 0x000008, "Member 'BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature::_fDamage' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature, _pDamageCauser) == 0x000010, "Member 'BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature::_pDamageCauser' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature, _pDamageType) == 0x000018, "Member 'BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature::_pDamageType' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature, _rShotDirection) == 0x000020, "Member 'BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature::_rShotDirection' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature, _oHitResult) == 0x00002C, "Member 'BP_Animal_Base_C_BndEvt__m_pDamageComponent_K2Node_ComponentBoundEvent_0_BFGActorComponent_PawnDamage_PointDamageEvent__DelegateSignature::_oHitResult' has a wrong offset!");

// Function BP_Animal_Base.BP_Animal_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Animal_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Animal_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Animal_Base_C_ReceiveTick");
static_assert(sizeof(BP_Animal_Base_C_ReceiveTick) == 0x000004, "Wrong size on BP_Animal_Base_C_ReceiveTick");
static_assert(offsetof(BP_Animal_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Animal_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Animal_Base.BP_Animal_Base_C.ExecuteUbergraph_BP_Animal_Base
// 0x0118 (0x0118 - 0x0000)
struct BP_Animal_Base_C_ExecuteUbergraph_BP_Animal_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_ComponentBoundEvent__rTag1;                 // 0x0004(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue1;      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue2;      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue3;      // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue4;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_ComponentBoundEvent__rTag;                  // 0x0014(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue5;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorStat_Bool*                     CallFunc_GetIsDeadStat_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValue_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorStat_Bool*                     CallFunc_GetIsDeadStat_ReturnValue1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValue_ReturnValue1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorComponent_PawnDamage*          K2Node_ComponentBoundEvent__pPawnDamage;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent__fDamage;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent__pDamageCauser;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UBFGDamageType*                   K2Node_ComponentBoundEvent__pDamageType;           // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent__rShotDirection;        // 0x0060(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent__oHitResult;            // 0x006C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CheckIfElectrocuteDamage_yesElectrocute;  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorStat_Bool*                     CallFunc_GetIsDeadStat_ReturnValue2;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValue_ReturnValue2;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorStat_Bool*                     CallFunc_GetIsDeadStat_ReturnValue3;               // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValue_ReturnValue3;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Animal_Base_C_ExecuteUbergraph_BP_Animal_Base) == 0x000008, "Wrong alignment on BP_Animal_Base_C_ExecuteUbergraph_BP_Animal_Base");
static_assert(sizeof(BP_Animal_Base_C_ExecuteUbergraph_BP_Animal_Base) == 0x000118, "Wrong size on BP_Animal_Base_C_ExecuteUbergraph_BP_Animal_Base");
static_assert(offsetof(BP_Animal_Base_C_ExecuteUbergraph_BP_Animal_Base, EntryPoint) == 0x000000, "Member 'BP_Animal_Base_C_ExecuteUbergraph_BP_Animal_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Animal_Base_C_ExecuteUbergraph_BP_Animal_Base, K2Node_ComponentBoundEvent__rTag1) == 0x000004, "Member 'BP_Animal_Base_C_ExecuteUbergraph_BP_Animal_Base::K2Node_ComponentBoundEvent__rTag1' has a wrong offset!");
