#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BrainExtract_Decals

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BrainExtract_Decals.BP_BrainExtract_Decals_C.Ground_Decals
// 0x0090 (0x0090 - 0x0000)
struct BP_BrainExtract_Decals_C_Ground_Decals final
{
public:
	float                                         Decal_Size;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Max_Brightness;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Power;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Dissolve_Min;                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Dissolve_Max;                                // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Spawn_Location;                                    // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Decal_Dyn_Mat;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue3;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainExtract_Decals_C_Ground_Decals) == 0x000008, "Wrong alignment on BP_BrainExtract_Decals_C_Ground_Decals");
static_assert(sizeof(BP_BrainExtract_Decals_C_Ground_Decals) == 0x000090, "Wrong size on BP_BrainExtract_Decals_C_Ground_Decals");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, Decal_Size) == 0x000000, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::Decal_Size' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, Decal_Max_Brightness) == 0x000004, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::Decal_Max_Brightness' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, Decal_Power) == 0x000008, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::Decal_Power' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, Decal_Dissolve_Min) == 0x00000C, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::Decal_Dissolve_Min' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, Decal_Dissolve_Max) == 0x000010, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::Decal_Dissolve_Max' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, Spawn_Location) == 0x000014, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::Spawn_Location' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, Decal_Dyn_Mat) == 0x000020, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::Decal_Dyn_Mat' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_RandomFloatInRange_ReturnValue) == 0x00002C, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_RandomFloatInRange_ReturnValue1) == 0x000040, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_RandomFloatInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000048, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000058, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000060, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000068, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_FClamp_ReturnValue) == 0x000074, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000078, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x00007C, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000080, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000084, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000088, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_Ground_Decals, CallFunc_RandomFloatInRange_ReturnValue3) == 0x00008C, "Member 'BP_BrainExtract_Decals_C_Ground_Decals::CallFunc_RandomFloatInRange_ReturnValue3' has a wrong offset!");

// Function BP_BrainExtract_Decals.BP_BrainExtract_Decals_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BrainExtract_Decals_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainExtract_Decals_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BrainExtract_Decals_C_ReceiveTick");
static_assert(sizeof(BP_BrainExtract_Decals_C_ReceiveTick) == 0x000004, "Wrong size on BP_BrainExtract_Decals_C_ReceiveTick");
static_assert(offsetof(BP_BrainExtract_Decals_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BrainExtract_Decals_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BrainExtract_Decals.BP_BrainExtract_Decals_C.OnRetrieveFromPool
// 0x0001 (0x0001 - 0x0000)
struct BP_BrainExtract_Decals_C_OnRetrieveFromPool final
{
public:
	bool                                          _bAutomaticallyReactivateComponents;               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrainExtract_Decals_C_OnRetrieveFromPool) == 0x000001, "Wrong alignment on BP_BrainExtract_Decals_C_OnRetrieveFromPool");
static_assert(sizeof(BP_BrainExtract_Decals_C_OnRetrieveFromPool) == 0x000001, "Wrong size on BP_BrainExtract_Decals_C_OnRetrieveFromPool");
static_assert(offsetof(BP_BrainExtract_Decals_C_OnRetrieveFromPool, _bAutomaticallyReactivateComponents) == 0x000000, "Member 'BP_BrainExtract_Decals_C_OnRetrieveFromPool::_bAutomaticallyReactivateComponents' has a wrong offset!");

// Function BP_BrainExtract_Decals.BP_BrainExtract_Decals_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_BrainExtract_Decals_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BrainExtract_Decals_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_BrainExtract_Decals_C_ReceiveEndPlay");
static_assert(sizeof(BP_BrainExtract_Decals_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_BrainExtract_Decals_C_ReceiveEndPlay");
static_assert(offsetof(BP_BrainExtract_Decals_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_BrainExtract_Decals_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_BrainExtract_Decals.BP_BrainExtract_Decals_C.ExecuteUbergraph_BP_BrainExtract_Decals
// 0x00C0 (0x00C0 - 0x0000)
struct BP_BrainExtract_Decals_C_ExecuteUbergraph_BP_BrainExtract_Decals final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardBool_BB_Value;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBlackboardBool_BB_Value1;              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardVector_BB_Value;             // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetBlackboardVector_BB_Value1;            // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardVector_BB_Value2;            // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetAttachSocketName_ReturnValue;          // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event__bAutomaticallyReactivateComponents;  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BrainExtract_Decals_C_ExecuteUbergraph_BP_BrainExtract_Decals) == 0x000008, "Wrong alignment on BP_BrainExtract_Decals_C_ExecuteUbergraph_BP_BrainExtract_Decals");
static_assert(sizeof(BP_BrainExtract_Decals_C_ExecuteUbergraph_BP_BrainExtract_Decals) == 0x0000C0, "Wrong size on BP_BrainExtract_Decals_C_ExecuteUbergraph_BP_BrainExtract_Decals");
static_assert(offsetof(BP_BrainExtract_Decals_C_ExecuteUbergraph_BP_BrainExtract_Decals, EntryPoint) == 0x000000, "Member 'BP_BrainExtract_Decals_C_ExecuteUbergraph_BP_BrainExtract_Decals::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BrainExtract_Decals_C_ExecuteUbergraph_BP_BrainExtract_Decals, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_BrainExtract_Decals_C_ExecuteUbergraph_BP_BrainExtract_Decals::K2Node_Event_DeltaSeconds' has a wrong offset!");
