#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuildingEffectEditHelper

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BuildingEffectEditHelper.BP_BuildingEffectEditHelper_C
// 0x01C8 (0x05A0 - 0x03D8)
class ABP_BuildingEffectEditHelper_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Cube;                                              // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGBuildingFluffEffects               FluffEffectsData;                                  // 0x03F0(0x0060)(Edit, BlueprintVisible, NoDestructor)
	struct FBFGBuildingDestructionCloudEffects    CloudsEffectData;                                  // 0x0450(0x0060)(Edit, BlueprintVisible, NoDestructor)
	struct FBFGBuildingDestructionDetailEffects   DetailEffectData;                                  // 0x04B0(0x0080)(Edit, BlueprintVisible, NoDestructor)
	struct FBFGBuildingDestructionPropagationEffects PropagationEffectData;                             // 0x0530(0x0060)(Edit, BlueprintVisible, NoDestructor)
	class AActor*                                 EffectToEdit;                                      // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UpdateEffect();
	void GetSettingsData();
	void UpdateEffectData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BuildingEffectEditHelper_C">();
	}
	static class ABP_BuildingEffectEditHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BuildingEffectEditHelper_C>();
	}
};
static_assert(alignof(ABP_BuildingEffectEditHelper_C) == 0x000010, "Wrong alignment on ABP_BuildingEffectEditHelper_C");
static_assert(sizeof(ABP_BuildingEffectEditHelper_C) == 0x0005A0, "Wrong size on ABP_BuildingEffectEditHelper_C");
static_assert(offsetof(ABP_BuildingEffectEditHelper_C, Cube) == 0x0003D8, "Member 'ABP_BuildingEffectEditHelper_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_BuildingEffectEditHelper_C, DefaultSceneRoot) == 0x0003E0, "Member 'ABP_BuildingEffectEditHelper_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BuildingEffectEditHelper_C, FluffEffectsData) == 0x0003F0, "Member 'ABP_BuildingEffectEditHelper_C::FluffEffectsData' has a wrong offset!");
static_assert(offsetof(ABP_BuildingEffectEditHelper_C, CloudsEffectData) == 0x000450, "Member 'ABP_BuildingEffectEditHelper_C::CloudsEffectData' has a wrong offset!");
static_assert(offsetof(ABP_BuildingEffectEditHelper_C, DetailEffectData) == 0x0004B0, "Member 'ABP_BuildingEffectEditHelper_C::DetailEffectData' has a wrong offset!");
static_assert(offsetof(ABP_BuildingEffectEditHelper_C, PropagationEffectData) == 0x000530, "Member 'ABP_BuildingEffectEditHelper_C::PropagationEffectData' has a wrong offset!");
static_assert(offsetof(ABP_BuildingEffectEditHelper_C, EffectToEdit) == 0x000590, "Member 'ABP_BuildingEffectEditHelper_C::EffectToEdit' has a wrong offset!");

}

