#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Challenge_StartingPoint

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Challenge_StartingPoint.BP_Challenge_StartingPoint_C.ExecuteUbergraph_BP_Challenge_StartingPoint
// 0x05A0 (0x05A0 - 0x0000)
struct BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0008(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0138(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x0270(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x03A0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x04D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x04D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorComponent_RadarObject*         CallFunc_GetComponentByClass_ReturnValue;          // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBFGRadarObjectInterface> K2Node_DynamicCast_AsBFGRadar_Object_Interface;    // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBFGRadarObjectInterface> K2Node_DynamicCast_AsBFGRadar_Object_Interface1;   // 0x0510(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBFGRadarObjectInterface> K2Node_DynamicCast_AsBFGRadar_Object_Interface2;   // 0x0528(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBFGRadarObjectInterface> K2Node_DynamicCast_AsBFGRadar_Object_Interface3;   // 0x0540(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBFGRadarObjectInterface> K2Node_DynamicCast_AsBFGRadar_Object_Interface4;   // 0x0558(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGDataAsset_ChallengeInfo*            K2Node_DynamicCast_AsBFGData_Asset_Challenge_Info; // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0581(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_582[0x6];                                      // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue1; // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGDataAsset_ChallengeInfo*            K2Node_DynamicCast_AsBFGData_Asset_Challenge_Info1; // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x059A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGChallengeStartingPoint_Visibility         K2Node_Event__eVisibility;                         // 0x059B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x059D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint) == 0x000008, "Wrong alignment on BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint");
static_assert(sizeof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint) == 0x0005A0, "Wrong size on BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, EntryPoint) == 0x000000, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, Temp_struct_Variable) == 0x000008, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, Temp_struct_Variable1) == 0x000138, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_PlayVoiceover__outResult) == 0x000268, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_PlayVoiceover__outResult1) == 0x000269, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_SwitchEnum_CmpSuccess) == 0x00026A, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_SwitchEnum1_CmpSuccess) == 0x00026B, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, Temp_struct_Variable2) == 0x000270, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, Temp_struct_Variable3) == 0x0003A0, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_PlayVoiceover__outResult2) == 0x0004D0, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_PlayVoiceover__outResult2' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_PlayVoiceover__outResult3) == 0x0004D1, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_PlayVoiceover__outResult3' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_SwitchEnum2_CmpSuccess) == 0x0004D2, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_SwitchEnum3_CmpSuccess) == 0x0004D3, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_CreateDelegate_OutputDelegate) == 0x0004D4, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_GetComponentByClass_ReturnValue) == 0x0004E8, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0004F0, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_AsBFGRadar_Object_Interface) == 0x0004F8, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_AsBFGRadar_Object_Interface' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_bSuccess) == 0x000508, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_AsBFGRadar_Object_Interface1) == 0x000510, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_AsBFGRadar_Object_Interface1' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_bSuccess1) == 0x000520, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_AsBFGRadar_Object_Interface2) == 0x000528, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_AsBFGRadar_Object_Interface2' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_bSuccess2) == 0x000538, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_AsBFGRadar_Object_Interface3) == 0x000540, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_AsBFGRadar_Object_Interface3' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_bSuccess3) == 0x000550, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_AsBFGRadar_Object_Interface4) == 0x000558, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_AsBFGRadar_Object_Interface4' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_bSuccess4) == 0x000568, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000570, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_AsBFGData_Asset_Challenge_Info) == 0x000578, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_AsBFGData_Asset_Challenge_Info' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_bSuccess5) == 0x000580, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_IsValid_ReturnValue) == 0x000581, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue1) == 0x000588, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_AsBFGData_Asset_Challenge_Info1) == 0x000590, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_AsBFGData_Asset_Challenge_Info1' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_DynamicCast_bSuccess6) == 0x000598, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, CallFunc_IsValid_ReturnValue1) == 0x000599, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_SwitchEnum4_CmpSuccess) == 0x00059A, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_Event__eVisibility) == 0x00059B, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_Event__eVisibility' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_SwitchEnum5_CmpSuccess) == 0x00059C, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint, K2Node_SwitchEnum6_CmpSuccess) == 0x00059D, "Member 'BP_Challenge_StartingPoint_C_ExecuteUbergraph_BP_Challenge_StartingPoint::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");

// Function BP_Challenge_StartingPoint.BP_Challenge_StartingPoint_C.OnPanelVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Challenge_StartingPoint_C_OnPanelVisibilityChanged final
{
public:
	EBFGChallengeStartingPoint_Visibility         _eVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Challenge_StartingPoint_C_OnPanelVisibilityChanged) == 0x000001, "Wrong alignment on BP_Challenge_StartingPoint_C_OnPanelVisibilityChanged");
static_assert(sizeof(BP_Challenge_StartingPoint_C_OnPanelVisibilityChanged) == 0x000001, "Wrong size on BP_Challenge_StartingPoint_C_OnPanelVisibilityChanged");
static_assert(offsetof(BP_Challenge_StartingPoint_C_OnPanelVisibilityChanged, _eVisibility) == 0x000000, "Member 'BP_Challenge_StartingPoint_C_OnPanelVisibilityChanged::_eVisibility' has a wrong offset!");

}

