#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectActor_VehicleDirt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EffectActor_VehicleDirt.BP_EffectActor_VehicleDirt_C
// 0x0088 (0x04D0 - 0x0448)
class ABP_EffectActor_VehicleDirt_C final : public ABFGEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ADH1WheeledVehicle*                     OwnerVehicle;                                      // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHittingSensibleSurface;                         // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentDirtValue;                                  // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         bonePointer;                                       // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  bWheelHittingState;                                // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UParticleSystemComponent*>       WheelEmitters;                                     // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           bonesToTrack;                                      // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         DirtDelta;                                         // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActiveTickFrequency;                               // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IdleTickFrequency;                                 // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 VehicleMesh;                                       // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwnerActor;                                        // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialized;                                    // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Material_Number;                                   // 0x04C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGEffectBlackboard*                   Blackboard;                                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EffectActor_VehicleDirt(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void IsSurfaceSensible(const struct FHitResult& Hit, bool* bIsSensibleSurface);
	void PerformGlobalCheck(const struct FVector& TraceStartLocation, bool* bIsSensibleSurface, EPhysicalSurface* Surface, bool* Raytrace_Hit);
	void GetEmitterFromPointer(class UParticleSystemComponent** Output);
	void Audio_HandoverSurface(EPhysicalSurface InSurface, bool Raytrace_Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EffectActor_VehicleDirt_C">();
	}
	static class ABP_EffectActor_VehicleDirt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EffectActor_VehicleDirt_C>();
	}
};
static_assert(alignof(ABP_EffectActor_VehicleDirt_C) == 0x000008, "Wrong alignment on ABP_EffectActor_VehicleDirt_C");
static_assert(sizeof(ABP_EffectActor_VehicleDirt_C) == 0x0004D0, "Wrong size on ABP_EffectActor_VehicleDirt_C");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, UberGraphFrame) == 0x000448, "Member 'ABP_EffectActor_VehicleDirt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, DefaultSceneRoot) == 0x000450, "Member 'ABP_EffectActor_VehicleDirt_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, OwnerVehicle) == 0x000458, "Member 'ABP_EffectActor_VehicleDirt_C::OwnerVehicle' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, bIsHittingSensibleSurface) == 0x000460, "Member 'ABP_EffectActor_VehicleDirt_C::bIsHittingSensibleSurface' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, CurrentDirtValue) == 0x000464, "Member 'ABP_EffectActor_VehicleDirt_C::CurrentDirtValue' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, bonePointer) == 0x000468, "Member 'ABP_EffectActor_VehicleDirt_C::bonePointer' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, bWheelHittingState) == 0x000470, "Member 'ABP_EffectActor_VehicleDirt_C::bWheelHittingState' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, WheelEmitters) == 0x000480, "Member 'ABP_EffectActor_VehicleDirt_C::WheelEmitters' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, bonesToTrack) == 0x000490, "Member 'ABP_EffectActor_VehicleDirt_C::bonesToTrack' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, DirtDelta) == 0x0004A0, "Member 'ABP_EffectActor_VehicleDirt_C::DirtDelta' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, ActiveTickFrequency) == 0x0004A4, "Member 'ABP_EffectActor_VehicleDirt_C::ActiveTickFrequency' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, IdleTickFrequency) == 0x0004A8, "Member 'ABP_EffectActor_VehicleDirt_C::IdleTickFrequency' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, VehicleMesh) == 0x0004B0, "Member 'ABP_EffectActor_VehicleDirt_C::VehicleMesh' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, OwnerActor) == 0x0004B8, "Member 'ABP_EffectActor_VehicleDirt_C::OwnerActor' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, bIsInitialized) == 0x0004C0, "Member 'ABP_EffectActor_VehicleDirt_C::bIsInitialized' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, Material_Number) == 0x0004C4, "Member 'ABP_EffectActor_VehicleDirt_C::Material_Number' has a wrong offset!");
static_assert(offsetof(ABP_EffectActor_VehicleDirt_C, Blackboard) == 0x0004C8, "Member 'ABP_EffectActor_VehicleDirt_C::Blackboard' has a wrong offset!");

}

