#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Farm_Windmill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BFGActorBuilding_classes.hpp"
#include "BFGCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Farm_Windmill.BP_Farm_Windmill_C
// 0x0028 (0x0818 - 0x07F0)
class ABP_Farm_Windmill_C final : public ABP_BFGActorBuilding_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Farm_Windmill_C;                 // 0x07F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         WindWheelRotation;                                 // 0x07F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindWheelRotationTick;                             // 0x07FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpolationWaitTime;                             // 0x0800(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpolationTimer;                                // 0x0804(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindWheelRotationTarget;                           // 0x0808(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpolationSpeed;                                // 0x080C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_BuildingLevel*       WindmillWheel;                                     // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Farm_Windmill(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Farm_Windmill_C">();
	}
	static class ABP_Farm_Windmill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Farm_Windmill_C>();
	}
};
static_assert(alignof(ABP_Farm_Windmill_C) == 0x000008, "Wrong alignment on ABP_Farm_Windmill_C");
static_assert(sizeof(ABP_Farm_Windmill_C) == 0x000818, "Wrong size on ABP_Farm_Windmill_C");
static_assert(offsetof(ABP_Farm_Windmill_C, UberGraphFrame_BP_Farm_Windmill_C) == 0x0007F0, "Member 'ABP_Farm_Windmill_C::UberGraphFrame_BP_Farm_Windmill_C' has a wrong offset!");
static_assert(offsetof(ABP_Farm_Windmill_C, WindWheelRotation) == 0x0007F8, "Member 'ABP_Farm_Windmill_C::WindWheelRotation' has a wrong offset!");
static_assert(offsetof(ABP_Farm_Windmill_C, WindWheelRotationTick) == 0x0007FC, "Member 'ABP_Farm_Windmill_C::WindWheelRotationTick' has a wrong offset!");
static_assert(offsetof(ABP_Farm_Windmill_C, InterpolationWaitTime) == 0x000800, "Member 'ABP_Farm_Windmill_C::InterpolationWaitTime' has a wrong offset!");
static_assert(offsetof(ABP_Farm_Windmill_C, InterpolationTimer) == 0x000804, "Member 'ABP_Farm_Windmill_C::InterpolationTimer' has a wrong offset!");
static_assert(offsetof(ABP_Farm_Windmill_C, WindWheelRotationTarget) == 0x000808, "Member 'ABP_Farm_Windmill_C::WindWheelRotationTarget' has a wrong offset!");
static_assert(offsetof(ABP_Farm_Windmill_C, InterpolationSpeed) == 0x00080C, "Member 'ABP_Farm_Windmill_C::InterpolationSpeed' has a wrong offset!");
static_assert(offsetof(ABP_Farm_Windmill_C, WindmillWheel) == 0x000810, "Member 'ABP_Farm_Windmill_C::WindmillWheel' has a wrong offset!");

}

