#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Holobob_Crypto_End

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EffectActor_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Holobob_Crypto_End.BP_Holobob_Crypto_End_C
// 0x0068 (0x04C0 - 0x0458)
class ABP_Holobob_Crypto_End_C final : public ABP_EffectActor_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Holobob_Crypto_End_C;            // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Holobob_Animation_Dissolve_13EC1D794305DD4019A42F80ECCA18E0; // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Holobob_Animation__Direction_13EC1D794305DD4019A42F80ECCA18E0; // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Holobob_Animation;                                 // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkellMesh_Holobob;                                 // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WOFST_Height;                                      // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Crypto_Mesh;                                       // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dissolve_Curve;                                    // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Emissive_Curve;                                    // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Diff_Height_Ratio;                                 // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WOFST_Height_Anim;                                 // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Emissive_Strengh;                                  // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   Hat;                                               // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Crypto_Weapon;                                     // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                Holobob_Accessories;                               // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void SetScalerOnMeshes(class FName Name_0, float Value);
	void Holobob_Animation__FinishedFunc();
	void Holobob_Animation__UpdateFunc();
	void Holobob_Animation__visibility__EventFunc();
	void ReceiveTick(float DeltaSeconds);
	void OnTriggerEffect();
	void Holobob_Stop_Effect();
	void Holobob_NPC_Visibility();
	void Holobob_Reveal_Update(float Dissolve);
	void Holobob_Anim();
	void ExecuteUbergraph_BP_Holobob_Crypto_End(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Holobob_Crypto_End_C">();
	}
	static class ABP_Holobob_Crypto_End_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Holobob_Crypto_End_C>();
	}
};
static_assert(alignof(ABP_Holobob_Crypto_End_C) == 0x000008, "Wrong alignment on ABP_Holobob_Crypto_End_C");
static_assert(sizeof(ABP_Holobob_Crypto_End_C) == 0x0004C0, "Wrong size on ABP_Holobob_Crypto_End_C");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, UberGraphFrame_BP_Holobob_Crypto_End_C) == 0x000458, "Member 'ABP_Holobob_Crypto_End_C::UberGraphFrame_BP_Holobob_Crypto_End_C' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Holobob_Animation_Dissolve_13EC1D794305DD4019A42F80ECCA18E0) == 0x000460, "Member 'ABP_Holobob_Crypto_End_C::Holobob_Animation_Dissolve_13EC1D794305DD4019A42F80ECCA18E0' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Holobob_Animation__Direction_13EC1D794305DD4019A42F80ECCA18E0) == 0x000464, "Member 'ABP_Holobob_Crypto_End_C::Holobob_Animation__Direction_13EC1D794305DD4019A42F80ECCA18E0' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Holobob_Animation) == 0x000468, "Member 'ABP_Holobob_Crypto_End_C::Holobob_Animation' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, SkellMesh_Holobob) == 0x000470, "Member 'ABP_Holobob_Crypto_End_C::SkellMesh_Holobob' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, WOFST_Height) == 0x000478, "Member 'ABP_Holobob_Crypto_End_C::WOFST_Height' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Crypto_Mesh) == 0x000480, "Member 'ABP_Holobob_Crypto_End_C::Crypto_Mesh' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Dissolve_Curve) == 0x000488, "Member 'ABP_Holobob_Crypto_End_C::Dissolve_Curve' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Emissive_Curve) == 0x00048C, "Member 'ABP_Holobob_Crypto_End_C::Emissive_Curve' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Diff_Height_Ratio) == 0x000490, "Member 'ABP_Holobob_Crypto_End_C::Diff_Height_Ratio' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, WOFST_Height_Anim) == 0x000494, "Member 'ABP_Holobob_Crypto_End_C::WOFST_Height_Anim' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Emissive_Strengh) == 0x000498, "Member 'ABP_Holobob_Crypto_End_C::Emissive_Strengh' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Hat) == 0x0004A0, "Member 'ABP_Holobob_Crypto_End_C::Hat' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Crypto_Weapon) == 0x0004A8, "Member 'ABP_Holobob_Crypto_End_C::Crypto_Weapon' has a wrong offset!");
static_assert(offsetof(ABP_Holobob_Crypto_End_C, Holobob_Accessories) == 0x0004B0, "Member 'ABP_Holobob_Crypto_End_C::Holobob_Accessories' has a wrong offset!");

}

