#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MentalAbility_Transmogrify

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MentalAbility_Transmogrify.BP_MentalAbility_Transmogrify_C
// 0x0048 (0x0238 - 0x01F0)
class UBP_MentalAbility_Transmogrify_C final : public UBFGMentalAbility_Transmogrify
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Spawned_Loop;                                      // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             ListOfMaterials;                                   // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 DetectedMaterial;                                  // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UAudioComponent*                        Spawned_MaterialLoop;                              // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             MaterialSoundToPlay;                               // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AchievementSmashCounter;                           // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MentalAbility_Transmogrify(int32 EntryPoint);
	void OnAbilityActivationFailed(EAbilityActivationResult _abilityFailReason);
	void StoppedMentalLink(bool _wasSuccessfull);
	void OnSmashedDuringLink();
	void OnSmashedDuringEffect();
	void OnAbilityEffect();
	void UpdateAbilityDressing(float _fDeltaTime);
	void OnAbilityEnd();
	void StartedMentalLink();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MentalAbility_Transmogrify_C">();
	}
	static class UBP_MentalAbility_Transmogrify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MentalAbility_Transmogrify_C>();
	}
};
static_assert(alignof(UBP_MentalAbility_Transmogrify_C) == 0x000008, "Wrong alignment on UBP_MentalAbility_Transmogrify_C");
static_assert(sizeof(UBP_MentalAbility_Transmogrify_C) == 0x000238, "Wrong size on UBP_MentalAbility_Transmogrify_C");
static_assert(offsetof(UBP_MentalAbility_Transmogrify_C, UberGraphFrame) == 0x0001F0, "Member 'UBP_MentalAbility_Transmogrify_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MentalAbility_Transmogrify_C, Spawned_Loop) == 0x0001F8, "Member 'UBP_MentalAbility_Transmogrify_C::Spawned_Loop' has a wrong offset!");
static_assert(offsetof(UBP_MentalAbility_Transmogrify_C, ListOfMaterials) == 0x000200, "Member 'UBP_MentalAbility_Transmogrify_C::ListOfMaterials' has a wrong offset!");
static_assert(offsetof(UBP_MentalAbility_Transmogrify_C, DetectedMaterial) == 0x000210, "Member 'UBP_MentalAbility_Transmogrify_C::DetectedMaterial' has a wrong offset!");
static_assert(offsetof(UBP_MentalAbility_Transmogrify_C, Spawned_MaterialLoop) == 0x000220, "Member 'UBP_MentalAbility_Transmogrify_C::Spawned_MaterialLoop' has a wrong offset!");
static_assert(offsetof(UBP_MentalAbility_Transmogrify_C, MaterialSoundToPlay) == 0x000228, "Member 'UBP_MentalAbility_Transmogrify_C::MaterialSoundToPlay' has a wrong offset!");
static_assert(offsetof(UBP_MentalAbility_Transmogrify_C, AchievementSmashCounter) == 0x000230, "Member 'UBP_MentalAbility_Transmogrify_C::AchievementSmashCounter' has a wrong offset!");

}

