#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MissionTriggerZone_CustomShape

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"


namespace SDK::Params
{

// Function BP_MissionTriggerZone_CustomShape.BP_MissionTriggerZone_CustomShape_C.ExecuteUbergraph_BP_MissionTriggerZone_CustomShape
// 0x0008 (0x0008 - 0x0000)
struct BP_MissionTriggerZone_CustomShape_C_ExecuteUbergraph_BP_MissionTriggerZone_CustomShape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionTriggerZone_CustomShape_C_ExecuteUbergraph_BP_MissionTriggerZone_CustomShape) == 0x000004, "Wrong alignment on BP_MissionTriggerZone_CustomShape_C_ExecuteUbergraph_BP_MissionTriggerZone_CustomShape");
static_assert(sizeof(BP_MissionTriggerZone_CustomShape_C_ExecuteUbergraph_BP_MissionTriggerZone_CustomShape) == 0x000008, "Wrong size on BP_MissionTriggerZone_CustomShape_C_ExecuteUbergraph_BP_MissionTriggerZone_CustomShape");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_ExecuteUbergraph_BP_MissionTriggerZone_CustomShape, EntryPoint) == 0x000000, "Member 'BP_MissionTriggerZone_CustomShape_C_ExecuteUbergraph_BP_MissionTriggerZone_CustomShape::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_ExecuteUbergraph_BP_MissionTriggerZone_CustomShape, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_MissionTriggerZone_CustomShape_C_ExecuteUbergraph_BP_MissionTriggerZone_CustomShape::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_MissionTriggerZone_CustomShape.BP_MissionTriggerZone_CustomShape_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MissionTriggerZone_CustomShape_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionTriggerZone_CustomShape_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_MissionTriggerZone_CustomShape_C_ReceiveTick");
static_assert(sizeof(BP_MissionTriggerZone_CustomShape_C_ReceiveTick) == 0x000004, "Wrong size on BP_MissionTriggerZone_CustomShape_C_ReceiveTick");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_MissionTriggerZone_CustomShape_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_MissionTriggerZone_CustomShape.BP_MissionTriggerZone_CustomShape_C.UserConstructionScript
// 0x0400 (0x0400 - 0x0000)
struct BP_MissionTriggerZone_CustomShape_C_UserConstructionScript final
{
public:
	TArray<struct FVector2D>                      Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable1;                             // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        Temp_struct_Variable2;                             // 0x0020(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable3;                             // 0x0048(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      Temp_struct_Variable4;                             // 0x0070(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable5;                             // 0x0080(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculateCentroids_Centroid;              // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      Temp_struct_Variable6;                             // 0x00A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FLinearColor>                   Temp_struct_Variable7;                             // 0x00B8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FLinearColor>                   Temp_struct_Variable8;                             // 0x00C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_ConvertSplinePointToVector_OutVector;     // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_ConvertSplinePointToVector_OutVector1;    // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CallFunc_Triangulate_SplinePoints_ReturnValue;     // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CallFunc_Triangulate_SplinePoints_ReturnValue1;    // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CallFunc_ReverseWinding_OutTriangles;              // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	struct FSplinePoint                           CallFunc_Array_Get_Item;                           // 0x0128(0x0044)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           K2Node_MakeStruct_SplinePoint;                     // 0x0190(0x0044)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FProcMeshTangent>               Temp_struct_Variable9;                             // 0x01D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        Temp_struct_Variable10;                            // 0x01E8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable11;                            // 0x01F8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Temp_struct_Variable12;                            // 0x0210(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FSplinePoint                           CallFunc_Array_Get_Item1;                          // 0x0220(0x0044)(NoDestructor)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Temp_struct_Variable13;                            // 0x0268(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	float                                         CallFunc_BreakVector_X1;                           // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      Temp_struct_Variable14;                            // 0x0298(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FLinearColor>                   Temp_struct_Variable15;                            // 0x02A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FProcMeshTangent>               Temp_struct_Variable16;                            // 0x02B8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FProcMeshTangent>               Temp_struct_Variable17;                            // 0x02E0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Variable1;                                // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Temp_struct_Variable18;                            // 0x02F8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      Temp_struct_Variable19;                            // 0x0310(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable20;                            // 0x0320(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	ESplinePointType                              CallFunc_GetSplinePointType_ReturnValue;           // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0xF];                                      // 0x0331(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue;    // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue;      // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           K2Node_MakeStruct_SplinePoint1;                    // 0x03A4(0x0044)(NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_MissionTriggerZone_CustomShape_C_UserConstructionScript");
static_assert(sizeof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript) == 0x000400, "Wrong size on BP_MissionTriggerZone_CustomShape_C_UserConstructionScript");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable1) == 0x000010, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable2) == 0x000020, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000038, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable3) == 0x000048, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_int_Loop_Counter_Variable1) == 0x00005C, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue1) == 0x000064, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_int_Array_Index_Variable1) == 0x000068, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00006C, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable4) == 0x000070, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable5) == 0x000080, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_int_Variable) == 0x000090, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x000094, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue2) == 0x000098, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_CalculateCentroids_Centroid) == 0x00009C, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_CalculateCentroids_Centroid' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable6) == 0x0000A8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable7) == 0x0000B8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable8) == 0x0000C8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_ConvertSplinePointToVector_OutVector) == 0x0000D8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_ConvertSplinePointToVector_OutVector' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_ConvertSplinePointToVector_OutVector1) == 0x0000E8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_ConvertSplinePointToVector_OutVector1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Triangulate_SplinePoints_ReturnValue) == 0x0000F8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Triangulate_SplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Triangulate_SplinePoints_ReturnValue1) == 0x000108, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Triangulate_SplinePoints_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_ReverseWinding_OutTriangles) == 0x000118, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_ReverseWinding_OutTriangles' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000128, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x00016C, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue1) == 0x000170, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000174, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000178, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x00017C, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000184, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, K2Node_MakeStruct_SplinePoint) == 0x000190, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::K2Node_MakeStruct_SplinePoint' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x0001D4, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable9) == 0x0001D8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable10) == 0x0001E8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable10' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable11) == 0x0001F8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable11' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_int_Array_Index_Variable2) == 0x000208, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable12) == 0x000210, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable12' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Array_Get_Item1) == 0x000220, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable13) == 0x000268, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable13' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_BreakVector_X1) == 0x000278, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_BreakVector_Y1) == 0x00027C, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_BreakVector_Z1) == 0x000280, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000284, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue1) == 0x000288, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable14) == 0x000298, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable14' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable15) == 0x0002A8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable15' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable16) == 0x0002B8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable16' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue2) == 0x0002C8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue1) == 0x0002CC, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_int_Loop_Counter_Variable2) == 0x0002D0, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue2) == 0x0002D4, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue3) == 0x0002D8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable17) == 0x0002E0, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable17' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_int_Variable1) == 0x0002F0, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable18) == 0x0002F8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable18' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000308, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue4) == 0x00030C, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable19) == 0x000310, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable19' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, Temp_struct_Variable20) == 0x000320, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::Temp_struct_Variable20' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_GetSplinePointType_ReturnValue) == 0x000330, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_GetSplinePointType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_GetTransformAtSplinePoint_ReturnValue) == 0x000340, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_GetTransformAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_GetTangentAtSplinePoint_ReturnValue) == 0x000370, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_GetTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x00037C, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x000388, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000394, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0003A0, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, K2Node_MakeStruct_SplinePoint1) == 0x0003A4, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::K2Node_MakeStruct_SplinePoint1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x0003E8, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue1) == 0x0003EC, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue1) == 0x0003F0, "Member 'BP_MissionTriggerZone_CustomShape_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue1' has a wrong offset!");

// Function BP_MissionTriggerZone_CustomShape.BP_MissionTriggerZone_CustomShape_C.CalculateVertices
// 0x00B0 (0x00B0 - 0x0000)
struct BP_MissionTriggerZone_CustomShape_C_CalculateVertices final
{
public:
	TArray<struct FSplinePoint>                   ReferenceArray;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FSplinePoint>                   PointArray1;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          UseIndexPlus_Slot1;                                // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSplinePoint>                   PointArray2;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          UseIndexPlus_Slot2;                                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSplinePoint>                   PointArray3;                                       // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          UseIndexPlus_Slot3;                                // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexPlus;                                         // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vertex3;                                           // 0x0058(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vertex2;                                           // 0x0064(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vertex1;                                           // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index3;                                            // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index2;                                            // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index1;                                            // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices) == 0x000008, "Wrong alignment on BP_MissionTriggerZone_CustomShape_C_CalculateVertices");
static_assert(sizeof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices) == 0x0000B0, "Wrong size on BP_MissionTriggerZone_CustomShape_C_CalculateVertices");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, ReferenceArray) == 0x000000, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::ReferenceArray' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, PointArray1) == 0x000010, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::PointArray1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, UseIndexPlus_Slot1) == 0x000020, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::UseIndexPlus_Slot1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, PointArray2) == 0x000028, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::PointArray2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, UseIndexPlus_Slot2) == 0x000038, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::UseIndexPlus_Slot2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, PointArray3) == 0x000040, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::PointArray3' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, UseIndexPlus_Slot3) == 0x000050, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::UseIndexPlus_Slot3' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, IndexPlus) == 0x000054, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::IndexPlus' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, Vertex3) == 0x000058, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::Vertex3' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, Vertex2) == 0x000064, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::Vertex2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, Vertex1) == 0x000070, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::Vertex1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, Index3) == 0x00007C, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::Index3' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, Index2) == 0x000080, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::Index2' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, Index1) == 0x000084, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::Index1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, CallFunc_Subtract_IntInt_ReturnValue) == 0x00008C, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, K2Node_MakeArray_Array) == 0x000090, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, Temp_int_Variable) == 0x0000A0, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, CallFunc_LessEqual_IntInt_ReturnValue1) == 0x0000A9, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::CallFunc_LessEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_MissionTriggerZone_CustomShape_C_CalculateVertices, CallFunc_Add_IntInt_ReturnValue1) == 0x0000AC, "Member 'BP_MissionTriggerZone_CustomShape_C_CalculateVertices::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");

// Function BP_MissionTriggerZone_CustomShape.BP_MissionTriggerZone_CustomShape_C.CalculateOuterBounds
// 0x03E8 (0x03E8 - 0x0000)
struct BP_MissionTriggerZone_CustomShape_C_CalculateOuterBounds final
{
public:
	struct FVector                                CentroidOffset;                                    // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Positions;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	struct FVector                                PointSum;                                          // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetFlipper;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IndexPlus;                                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IndexMinus;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           CallFunc_Array_Get_Item;                           // 0x004C(0x0044)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue;             // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item1;                          // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           CallFunc_Array_Get_Item2;                          // 0x010C(0x0044)(NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           CallFunc_Array_Get_Item3;                          // 0x01BC(0x0044)(NoDestructor)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue1;      // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue5;            // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue6;            // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue1;            // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           K2Node_MakeStruct_SplinePoint;                     // 0x023C(0x0044)(NoDestructor)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue2;      // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue7;            // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue8;            // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue3;       // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSplinePoint                           K2Node_MakeStruct_SplinePoint1;                    // 0x02C0(0x0044)(NoDestructor)
	float                                         CallFunc_VSize_ReturnValue1;                       // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
