#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MentalAbility_Hypnotize_Follow

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MentalAbility_Hypnotize_Follow.BP_MentalAbility_Hypnotize_Follow_C.ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow
// 0x0008 (0x0008 - 0x0000)
struct BP_MentalAbility_Hypnotize_Follow_C_ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event__wasSuccessfull;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MentalAbility_Hypnotize_Follow_C_ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow) == 0x000004, "Wrong alignment on BP_MentalAbility_Hypnotize_Follow_C_ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow");
static_assert(sizeof(BP_MentalAbility_Hypnotize_Follow_C_ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow) == 0x000008, "Wrong size on BP_MentalAbility_Hypnotize_Follow_C_ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow");
static_assert(offsetof(BP_MentalAbility_Hypnotize_Follow_C_ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow, EntryPoint) == 0x000000, "Member 'BP_MentalAbility_Hypnotize_Follow_C_ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MentalAbility_Hypnotize_Follow_C_ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow, K2Node_Event__wasSuccessfull) == 0x000004, "Member 'BP_MentalAbility_Hypnotize_Follow_C_ExecuteUbergraph_BP_MentalAbility_Hypnotize_Follow::K2Node_Event__wasSuccessfull' has a wrong offset!");

// Function BP_MentalAbility_Hypnotize_Follow.BP_MentalAbility_Hypnotize_Follow_C.StoppedMentalLink
// 0x0001 (0x0001 - 0x0000)
struct BP_MentalAbility_Hypnotize_Follow_C_StoppedMentalLink final
{
public:
	bool                                          _wasSuccessfull;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MentalAbility_Hypnotize_Follow_C_StoppedMentalLink) == 0x000001, "Wrong alignment on BP_MentalAbility_Hypnotize_Follow_C_StoppedMentalLink");
static_assert(sizeof(BP_MentalAbility_Hypnotize_Follow_C_StoppedMentalLink) == 0x000001, "Wrong size on BP_MentalAbility_Hypnotize_Follow_C_StoppedMentalLink");
static_assert(offsetof(BP_MentalAbility_Hypnotize_Follow_C_StoppedMentalLink, _wasSuccessfull) == 0x000000, "Member 'BP_MentalAbility_Hypnotize_Follow_C_StoppedMentalLink::_wasSuccessfull' has a wrong offset!");

}

