#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCameraManager

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerCameraManager.BP_PlayerCameraManager_C.ExecuteUbergraph_BP_PlayerCameraManager
// 0x0050 (0x0050 - 0x0000)
struct BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_GetWorldFromContextObjectSafe_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     CallFunc_GetCurrentPostProcessVolume_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager) == 0x000008, "Wrong alignment on BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager");
static_assert(sizeof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager) == 0x000050, "Wrong size on BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager");
static_assert(offsetof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager, EntryPoint) == 0x000000, "Member 'BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager, CallFunc_GetWorldFromContextObjectSafe_ReturnValue) == 0x000028, "Member 'BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager::CallFunc_GetWorldFromContextObjectSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager, CallFunc_GetCurrentPostProcessVolume_ReturnValue) == 0x000030, "Member 'BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager::CallFunc_GetCurrentPostProcessVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000038, "Member 'BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_PlayerCameraManager_C_ExecuteUbergraph_BP_PlayerCameraManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

