#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pattern_Projectile_Scatter_OverHead

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pattern_Projectile_Scatter_OverHead.BP_Pattern_Projectile_Scatter_OverHead_C
// 0x00A8 (0x04C8 - 0x0420)
class ABP_Pattern_Projectile_Scatter_OverHead_C final : public ABFGPattern_Projectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker19;                          // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker18;                          // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker17;                          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker16;                          // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker15;                          // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker14;                          // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker13;                          // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker12;                          // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker11;                          // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker10;                          // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker9;                           // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker8;                           // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker7;                           // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker6;                           // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker5;                           // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker4;                           // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker3;                           // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker2;                           // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker1;                           // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker;                            // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Pattern_Projectile_Scatter_OverHead(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Pattern_Projectile_Scatter_OverHead_C">();
	}
	static class ABP_Pattern_Projectile_Scatter_OverHead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pattern_Projectile_Scatter_OverHead_C>();
	}
};
static_assert(alignof(ABP_Pattern_Projectile_Scatter_OverHead_C) == 0x000008, "Wrong alignment on ABP_Pattern_Projectile_Scatter_OverHead_C");
static_assert(sizeof(ABP_Pattern_Projectile_Scatter_OverHead_C) == 0x0004C8, "Wrong size on ABP_Pattern_Projectile_Scatter_OverHead_C");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, UberGraphFrame) == 0x000420, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker19) == 0x000428, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker19' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker18) == 0x000430, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker18' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker17) == 0x000438, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker17' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker16) == 0x000440, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker16' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker15) == 0x000448, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker15' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker14) == 0x000450, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker14' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker13) == 0x000458, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker13' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker12) == 0x000460, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker12' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker11) == 0x000468, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker11' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker10) == 0x000470, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker10' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker9) == 0x000478, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker9' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker8) == 0x000480, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker8' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker7) == 0x000488, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker7' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker6) == 0x000490, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker6' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker5) == 0x000498, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker5' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker4) == 0x0004A0, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker4' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker3) == 0x0004A8, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker3' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker2) == 0x0004B0, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker2' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker1) == 0x0004B8, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker1' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_Projectile_Scatter_OverHead_C, BFGPatternTargetMarker) == 0x0004C0, "Member 'ABP_Pattern_Projectile_Scatter_OverHead_C::BFGPatternTargetMarker' has a wrong offset!");

}

