#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD

#include "Basic.hpp"

#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pattern_RBP_AOE_AirMines_TRN_P2-P3_GRD.BP_Pattern_RBP_AOE_AirMines_TRN_P2-P3_GRD_C
// 0x00C0 (0x04C8 - 0x0408)
class ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C final : public ABFGPattern_AOE
{
public:
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker30;                          // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker29;                          // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker28;                          // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker27;                          // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker26;                          // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker25;                          // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker24;                          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker23;                          // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker20;                          // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker19;                          // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker18;                          // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker17;                          // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker16;                          // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker22;                          // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker3;                           // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker38;                          // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker7;                           // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker37;                          // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker21;                          // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker15;                          // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker12;                          // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker6;                           // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker5;                           // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBFGPatternTargetMarker*                BFGPatternTargetMarker2;                           // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Pattern_RBP_AOE_AirMines_TRN_P2-P3_GRD_C">();
	}
	static class ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C>();
	}
};
static_assert(alignof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C) == 0x000008, "Wrong alignment on ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C");
static_assert(sizeof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C) == 0x0004C8, "Wrong size on ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker30) == 0x000408, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker30' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker29) == 0x000410, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker29' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker28) == 0x000418, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker28' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker27) == 0x000420, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker27' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker26) == 0x000428, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker26' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker25) == 0x000430, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker25' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker24) == 0x000438, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker24' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker23) == 0x000440, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker23' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker20) == 0x000448, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker20' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker19) == 0x000450, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker19' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker18) == 0x000458, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker18' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker17) == 0x000460, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker17' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker16) == 0x000468, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker16' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker22) == 0x000470, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker22' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker3) == 0x000478, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker3' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker38) == 0x000480, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker38' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker7) == 0x000488, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker7' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker37) == 0x000490, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker37' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker21) == 0x000498, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker21' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker15) == 0x0004A0, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker15' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker12) == 0x0004A8, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker12' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker6) == 0x0004B0, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker6' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker5) == 0x0004B8, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker5' has a wrong offset!");
static_assert(offsetof(ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C, BFGPatternTargetMarker2) == 0x0004C0, "Member 'ABP_Pattern_RBP_AOE_AirMines_TRN_P2MinusP3_GRD_C::BFGPatternTargetMarker2' has a wrong offset!");

}

