#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PropActor_Drink_PaperBagBottle

#include "Basic.hpp"

#include "BFGCore_structs.hpp"


namespace SDK::Params
{

// Function BP_PropActor_Drink_PaperBagBottle.BP_PropActor_Drink_PaperBagBottle_C.ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle
// 0x0138 (0x0138 - 0x0000)
struct BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGInteractAnimationData              K2Node_Event__newData;                             // 0x0008(0x0060)(ConstParm, NoDestructor)
	struct FBFGInteractAnimationData              K2Node_Event__oldData;                             // 0x0068(0x0060)(ConstParm, NoDestructor)
	struct FBFGInteractAnimationData              K2Node_Event__animationData;                       // 0x00C8(0x0060)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle) == 0x000008, "Wrong alignment on BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle");
static_assert(sizeof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle) == 0x000138, "Wrong size on BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, EntryPoint) == 0x000000, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, K2Node_Event__newData) == 0x000008, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::K2Node_Event__newData' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, K2Node_Event__oldData) == 0x000068, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::K2Node_Event__oldData' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, K2Node_Event__animationData) == 0x0000C8, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::K2Node_Event__animationData' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000128, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000129, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00012A, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x00012B, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x00012C, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, CallFunc_EqualEqual_ByteByte_ReturnValue5) == 0x00012D, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::CallFunc_EqualEqual_ByteByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, CallFunc_BooleanOR_ReturnValue) == 0x00012E, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, CallFunc_BooleanOR_ReturnValue1) == 0x00012F, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle, CallFunc_BooleanAND_ReturnValue) == 0x000130, "Member 'BP_PropActor_Drink_PaperBagBottle_C_ExecuteUbergraph_BP_PropActor_Drink_PaperBagBottle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_PropActor_Drink_PaperBagBottle.BP_PropActor_Drink_PaperBagBottle_C.OnSwitchedToHighRes
// 0x0060 (0x0060 - 0x0000)
struct BP_PropActor_Drink_PaperBagBottle_C_OnSwitchedToHighRes final
{
public:
	struct FBFGInteractAnimationData              _animationData;                                    // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_PropActor_Drink_PaperBagBottle_C_OnSwitchedToHighRes) == 0x000008, "Wrong alignment on BP_PropActor_Drink_PaperBagBottle_C_OnSwitchedToHighRes");
static_assert(sizeof(BP_PropActor_Drink_PaperBagBottle_C_OnSwitchedToHighRes) == 0x000060, "Wrong size on BP_PropActor_Drink_PaperBagBottle_C_OnSwitchedToHighRes");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_OnSwitchedToHighRes, _animationData) == 0x000000, "Member 'BP_PropActor_Drink_PaperBagBottle_C_OnSwitchedToHighRes::_animationData' has a wrong offset!");

// Function BP_PropActor_Drink_PaperBagBottle.BP_PropActor_Drink_PaperBagBottle_C.OnInteractAnimationChanged
// 0x00C0 (0x00C0 - 0x0000)
struct BP_PropActor_Drink_PaperBagBottle_C_OnInteractAnimationChanged final
{
public:
	struct FBFGInteractAnimationData              _newData;                                          // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FBFGInteractAnimationData              _oldData;                                          // 0x0060(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_PropActor_Drink_PaperBagBottle_C_OnInteractAnimationChanged) == 0x000008, "Wrong alignment on BP_PropActor_Drink_PaperBagBottle_C_OnInteractAnimationChanged");
static_assert(sizeof(BP_PropActor_Drink_PaperBagBottle_C_OnInteractAnimationChanged) == 0x0000C0, "Wrong size on BP_PropActor_Drink_PaperBagBottle_C_OnInteractAnimationChanged");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_OnInteractAnimationChanged, _newData) == 0x000000, "Member 'BP_PropActor_Drink_PaperBagBottle_C_OnInteractAnimationChanged::_newData' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_OnInteractAnimationChanged, _oldData) == 0x000060, "Member 'BP_PropActor_Drink_PaperBagBottle_C_OnInteractAnimationChanged::_oldData' has a wrong offset!");

// Function BP_PropActor_Drink_PaperBagBottle.BP_PropActor_Drink_PaperBagBottle_C.SelectAttachBone
// 0x0010 (0x0010 - 0x0000)
struct BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone final
{
public:
	EBFGAnimation_Interact                        AnimationID;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachBone_0;                                      // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone) == 0x000004, "Wrong alignment on BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone");
static_assert(sizeof(BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone) == 0x000010, "Wrong size on BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone, AnimationID) == 0x000000, "Member 'BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone::AnimationID' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone, AttachBone_0) == 0x000004, "Member 'BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone::AttachBone_0' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x00000D, "Member 'BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00000E, "Member 'BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone, CallFunc_BooleanOR_ReturnValue) == 0x00000F, "Member 'BP_PropActor_Drink_PaperBagBottle_C_SelectAttachBone::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

