#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_HomingMissile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_HomingMissile.BP_Projectile_HomingMissile_C.ExecuteUbergraph_BP_Projectile_HomingMissile
// 0x0080 (0x0080 - 0x0000)
struct BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event__vLocation;                           // 0x0004(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event__fRadius;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectWithTransform_ReturnValue;  // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class UPhysicsHandleComponent*                K2Node_Event__pComponent;                          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTargetPlayer_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile) == 0x000010, "Wrong alignment on BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile");
static_assert(sizeof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile) == 0x000080, "Wrong size on BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile");
static_assert(offsetof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile, EntryPoint) == 0x000000, "Member 'BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile, K2Node_Event__vLocation) == 0x000004, "Member 'BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile::K2Node_Event__vLocation' has a wrong offset!");
static_assert(offsetof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile, K2Node_Event__fRadius) == 0x000010, "Member 'BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile::K2Node_Event__fRadius' has a wrong offset!");
static_assert(offsetof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile, CallFunc_ActivateEffectWithTransform_ReturnValue) == 0x000060, "Member 'BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile::CallFunc_ActivateEffectWithTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile, K2Node_Event__pComponent) == 0x000070, "Member 'BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile::K2Node_Event__pComponent' has a wrong offset!");
static_assert(offsetof(BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile, CallFunc_IsTargetPlayer_ReturnValue) == 0x000078, "Member 'BP_Projectile_HomingMissile_C_ExecuteUbergraph_BP_Projectile_HomingMissile::CallFunc_IsTargetPlayer_ReturnValue' has a wrong offset!");

// Function BP_Projectile_HomingMissile.BP_Projectile_HomingMissile_C.PKAttachTo
// 0x0008 (0x0008 - 0x0000)
struct BP_Projectile_HomingMissile_C_PKAttachTo final
{
public:
	class UPhysicsHandleComponent*                _pComponent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_HomingMissile_C_PKAttachTo) == 0x000008, "Wrong alignment on BP_Projectile_HomingMissile_C_PKAttachTo");
static_assert(sizeof(BP_Projectile_HomingMissile_C_PKAttachTo) == 0x000008, "Wrong size on BP_Projectile_HomingMissile_C_PKAttachTo");
static_assert(offsetof(BP_Projectile_HomingMissile_C_PKAttachTo, _pComponent) == 0x000000, "Member 'BP_Projectile_HomingMissile_C_PKAttachTo::_pComponent' has a wrong offset!");

// Function BP_Projectile_HomingMissile.BP_Projectile_HomingMissile_C.OnProjectileExplosion
// 0x0010 (0x0010 - 0x0000)
struct BP_Projectile_HomingMissile_C_OnProjectileExplosion final
{
public:
	struct FVector                                _vLocation;                                        // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _fRadius;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_HomingMissile_C_OnProjectileExplosion) == 0x000004, "Wrong alignment on BP_Projectile_HomingMissile_C_OnProjectileExplosion");
static_assert(sizeof(BP_Projectile_HomingMissile_C_OnProjectileExplosion) == 0x000010, "Wrong size on BP_Projectile_HomingMissile_C_OnProjectileExplosion");
static_assert(offsetof(BP_Projectile_HomingMissile_C_OnProjectileExplosion, _vLocation) == 0x000000, "Member 'BP_Projectile_HomingMissile_C_OnProjectileExplosion::_vLocation' has a wrong offset!");
static_assert(offsetof(BP_Projectile_HomingMissile_C_OnProjectileExplosion, _fRadius) == 0x00000C, "Member 'BP_Projectile_HomingMissile_C_OnProjectileExplosion::_fRadius' has a wrong offset!");

}

