#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Struct_SplineMeshBuilder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct BP_Struct_SplineMeshBuilder.BP_Struct_SplineMeshBuilder
// 0x0018 (0x0018 - 0x0000)
struct FBP_Struct_SplineMeshBuilder final
{
public:
	class UStaticMesh*                            MeshInSlot_3_B91A9A2041996AAE434A88B8E22657B9;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEmptySlot_6_24C02B254556C4F07C74C585A916EC81;   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlip_27_848DFD734049948E799E93AAE1D8E376;         // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              OffsetStartEnd_13_E80D02F646D012B484E2558045A0C3F1; // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastShadow_20_B440DF104BADF997AF515C9B26CB6621;   // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCollision_29_FBFDFDAA49C025190955FF8021F8D4C9; // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBP_Struct_SplineMeshBuilder) == 0x000008, "Wrong alignment on FBP_Struct_SplineMeshBuilder");
static_assert(sizeof(FBP_Struct_SplineMeshBuilder) == 0x000018, "Wrong size on FBP_Struct_SplineMeshBuilder");
static_assert(offsetof(FBP_Struct_SplineMeshBuilder, MeshInSlot_3_B91A9A2041996AAE434A88B8E22657B9) == 0x000000, "Member 'FBP_Struct_SplineMeshBuilder::MeshInSlot_3_B91A9A2041996AAE434A88B8E22657B9' has a wrong offset!");
static_assert(offsetof(FBP_Struct_SplineMeshBuilder, bIsEmptySlot_6_24C02B254556C4F07C74C585A916EC81) == 0x000008, "Member 'FBP_Struct_SplineMeshBuilder::bIsEmptySlot_6_24C02B254556C4F07C74C585A916EC81' has a wrong offset!");
static_assert(offsetof(FBP_Struct_SplineMeshBuilder, bFlip_27_848DFD734049948E799E93AAE1D8E376) == 0x000009, "Member 'FBP_Struct_SplineMeshBuilder::bFlip_27_848DFD734049948E799E93AAE1D8E376' has a wrong offset!");
static_assert(offsetof(FBP_Struct_SplineMeshBuilder, OffsetStartEnd_13_E80D02F646D012B484E2558045A0C3F1) == 0x00000C, "Member 'FBP_Struct_SplineMeshBuilder::OffsetStartEnd_13_E80D02F646D012B484E2558045A0C3F1' has a wrong offset!");
static_assert(offsetof(FBP_Struct_SplineMeshBuilder, bCastShadow_20_B440DF104BADF997AF515C9B26CB6621) == 0x000014, "Member 'FBP_Struct_SplineMeshBuilder::bCastShadow_20_B440DF104BADF997AF515C9B26CB6621' has a wrong offset!");
static_assert(offsetof(FBP_Struct_SplineMeshBuilder, bEnableCollision_29_FBFDFDAA49C025190955FF8021F8D4C9) == 0x000015, "Member 'FBP_Struct_SplineMeshBuilder::bEnableCollision_29_FBFDFDAA49C025190955FF8021F8D4C9' has a wrong offset!");

}

