#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UFOAbility_Drain

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UFOAbility_Drain.BP_UFOAbility_Drain_C.ExecuteUbergraph_BP_UFOAbility_Drain
// 0x01C0 (0x01C0 - 0x0000)
struct BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGGameState*                          CallFunc_GetBFGGameState_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGBasicVehicle*                       K2Node_DynamicCast_AsBFGBasic_Vehicle;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CallFunc_GetWorldFromContextObjectSafe_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event__wasSuccessfull;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetUser_ReturnValue;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event__fDamageAmount;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue;  // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetUser_ReturnValue1;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue1; // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue2;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacterEnemy_Mecha*            K2Node_DynamicCast_AsBFGNPCCharacter_Enemy_Mecha;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetUser_ReturnValue2;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue2; // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue3;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue4;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacter*                       CallFunc_CastObjectToClass_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacterEnemy_Mecha*            K2Node_DynamicCast_AsBFGNPCCharacter_Enemy_Mecha1; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue5;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue3; // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue6;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue7;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue4; // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	class ABFGNPCCharacter*                       CallFunc_CastObjectToClass_ReturnValue1;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue5; // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue8;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue9;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue6; // 0x0138(0x0010)(ZeroConstructor, ReferenceParm)
	class ABFGNPCCharacterEnemy_Mecha*            K2Node_DynamicCast_AsBFGNPCCharacter_Enemy_Mecha2; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue10;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue11;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABFGNPCCharacter*                       CallFunc_CastObjectToClass_ReturnValue2;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue7; // 0x0180(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue12;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActiveTarget_ReturnValue13;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue8; // 0x01A0(0x0010)(ZeroConstructor, ReferenceParm)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain) == 0x000008, "Wrong alignment on BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain");
static_assert(sizeof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain) == 0x0001C0, "Wrong size on BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, EntryPoint) == 0x000000, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue) == 0x000008, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetBFGGameState_ReturnValue) == 0x000010, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetBFGGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_DynamicCast_AsBFGBasic_Vehicle) == 0x000018, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_DynamicCast_AsBFGBasic_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetWorldFromContextObjectSafe_ReturnValue) == 0x000028, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetWorldFromContextObjectSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_Event__wasSuccessfull) == 0x000030, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_Event__wasSuccessfull' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue1) == 0x000038, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetUser_ReturnValue) == 0x000040, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_Event__fDamageAmount) == 0x000048, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_Event__fDamageAmount' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_ActivateEffectAttachToActor_ReturnValue) == 0x000050, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_ActivateEffectAttachToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetUser_ReturnValue1) == 0x000060, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetUser_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_ActivateEffectAttachToActor_ReturnValue1) == 0x000068, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_ActivateEffectAttachToActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue2) == 0x000078, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_DynamicCast_AsBFGNPCCharacter_Enemy_Mecha) == 0x000080, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_DynamicCast_AsBFGNPCCharacter_Enemy_Mecha' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_DynamicCast_bSuccess1) == 0x000088, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetUser_ReturnValue2) == 0x000090, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetUser_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_ActivateEffectAttachToActor_ReturnValue2) == 0x000098, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_ActivateEffectAttachToActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue3) == 0x0000A8, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue4) == 0x0000B0, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_CastObjectToClass_ReturnValue) == 0x0000B8, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_CastObjectToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_DynamicCast_AsBFGNPCCharacter_Enemy_Mecha1) == 0x0000C0, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_DynamicCast_AsBFGNPCCharacter_Enemy_Mecha1' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_DynamicCast_bSuccess2) == 0x0000C8, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_IsValid_ReturnValue1) == 0x0000C9, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue5) == 0x0000D0, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_ActivateEffectAttachToActor_ReturnValue3) == 0x0000D8, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_ActivateEffectAttachToActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue6) == 0x0000E8, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue7) == 0x0000F0, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_ActivateEffectAttachToActor_ReturnValue4) == 0x0000F8, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_ActivateEffectAttachToActor_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_CastObjectToClass_ReturnValue1) == 0x000108, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_CastObjectToClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_IsValid_ReturnValue2) == 0x000110, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_ActivateEffectAttachToActor_ReturnValue5) == 0x000118, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_ActivateEffectAttachToActor_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue8) == 0x000128, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue9) == 0x000130, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_ActivateEffectAttachToActor_ReturnValue6) == 0x000138, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_ActivateEffectAttachToActor_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_DynamicCast_AsBFGNPCCharacter_Enemy_Mecha2) == 0x000148, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_DynamicCast_AsBFGNPCCharacter_Enemy_Mecha2' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, K2Node_DynamicCast_bSuccess3) == 0x000150, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue10) == 0x000158, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue11) == 0x000160, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_IsValid_ReturnValue3) == 0x000168, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_CastObjectToClass_ReturnValue2) == 0x000170, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_CastObjectToClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_IsValid_ReturnValue4) == 0x000178, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_ActivateEffectAttachToActor_ReturnValue7) == 0x000180, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_ActivateEffectAttachToActor_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue12) == 0x000190, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_GetActiveTarget_ReturnValue13) == 0x000198, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_GetActiveTarget_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_ActivateEffectAttachToActor_ReturnValue8) == 0x0001A0, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_ActivateEffectAttachToActor_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001B0, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0001B8, "Member 'BP_UFOAbility_Drain_C_ExecuteUbergraph_BP_UFOAbility_Drain::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function BP_UFOAbility_Drain.BP_UFOAbility_Drain_C.OnDrainDamageTicked
// 0x0004 (0x0004 - 0x0000)
struct BP_UFOAbility_Drain_C_OnDrainDamageTicked final
{
public:
	float                                         _fDamageAmount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UFOAbility_Drain_C_OnDrainDamageTicked) == 0x000004, "Wrong alignment on BP_UFOAbility_Drain_C_OnDrainDamageTicked");
static_assert(sizeof(BP_UFOAbility_Drain_C_OnDrainDamageTicked) == 0x000004, "Wrong size on BP_UFOAbility_Drain_C_OnDrainDamageTicked");
static_assert(offsetof(BP_UFOAbility_Drain_C_OnDrainDamageTicked, _fDamageAmount) == 0x000000, "Member 'BP_UFOAbility_Drain_C_OnDrainDamageTicked::_fDamageAmount' has a wrong offset!");

// Function BP_UFOAbility_Drain.BP_UFOAbility_Drain_C.StoppedMentalLink
// 0x0001 (0x0001 - 0x0000)
struct BP_UFOAbility_Drain_C_StoppedMentalLink final
{
public:
	bool                                          _wasSuccessfull;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UFOAbility_Drain_C_StoppedMentalLink) == 0x000001, "Wrong alignment on BP_UFOAbility_Drain_C_StoppedMentalLink");
static_assert(sizeof(BP_UFOAbility_Drain_C_StoppedMentalLink) == 0x000001, "Wrong size on BP_UFOAbility_Drain_C_StoppedMentalLink");
static_assert(offsetof(BP_UFOAbility_Drain_C_StoppedMentalLink, _wasSuccessfull) == 0x000000, "Member 'BP_UFOAbility_Drain_C_StoppedMentalLink::_wasSuccessfull' has a wrong offset!");

}

