#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UFOAbility_BrainExtract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UFOAbility_BrainExtract.BP_UFOAbility_BrainExtract_C
// 0x0028 (0x02C8 - 0x02A0)
class UBP_UFOAbility_BrainExtract_C final : public UBFGUFOAbility_ExtractBrain
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Effect;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ExtractSound;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Victim;                                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LastVictim;                                        // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UFOAbility_BrainExtract(int32 EntryPoint);
	void WaitedForVFXToFinish();
	void StoppedMentalLink(bool _wasSuccessfull);
	void OnAbilityEnd();
	void StartedMentalLink();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UFOAbility_BrainExtract_C">();
	}
	static class UBP_UFOAbility_BrainExtract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UFOAbility_BrainExtract_C>();
	}
};
static_assert(alignof(UBP_UFOAbility_BrainExtract_C) == 0x000008, "Wrong alignment on UBP_UFOAbility_BrainExtract_C");
static_assert(sizeof(UBP_UFOAbility_BrainExtract_C) == 0x0002C8, "Wrong size on UBP_UFOAbility_BrainExtract_C");
static_assert(offsetof(UBP_UFOAbility_BrainExtract_C, UberGraphFrame) == 0x0002A0, "Member 'UBP_UFOAbility_BrainExtract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UFOAbility_BrainExtract_C, Effect) == 0x0002A8, "Member 'UBP_UFOAbility_BrainExtract_C::Effect' has a wrong offset!");
static_assert(offsetof(UBP_UFOAbility_BrainExtract_C, ExtractSound) == 0x0002B0, "Member 'UBP_UFOAbility_BrainExtract_C::ExtractSound' has a wrong offset!");
static_assert(offsetof(UBP_UFOAbility_BrainExtract_C, Victim) == 0x0002B8, "Member 'UBP_UFOAbility_BrainExtract_C::Victim' has a wrong offset!");
static_assert(offsetof(UBP_UFOAbility_BrainExtract_C, LastVictim) == 0x0002C0, "Member 'UBP_UFOAbility_BrainExtract_C::LastVictim' has a wrong offset!");

}

