#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_ZapMinusOMinusMatic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_Zap-O-Matic.BP_Weapon_Zap-O-Matic_C
// 0x0018 (0x0790 - 0x0778)
class ABP_Weapon_ZapMinusOMinusMatic_C final : public ABFGWeapon_ZapOMatic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHitting;                                         // 0x0788(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnFailedFireAttempt(EWeaponFireAttemptResult _weaponFireResult);
	void OnReloadEnd();
	void OnShotImpact(const struct FHitResult& _oHitResult);
	void ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Weapon_Zap-O-Matic_C">();
	}
	static class ABP_Weapon_ZapMinusOMinusMatic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_ZapMinusOMinusMatic_C>();
	}
};
static_assert(alignof(ABP_Weapon_ZapMinusOMinusMatic_C) == 0x000008, "Wrong alignment on ABP_Weapon_ZapMinusOMinusMatic_C");
static_assert(sizeof(ABP_Weapon_ZapMinusOMinusMatic_C) == 0x000790, "Wrong size on ABP_Weapon_ZapMinusOMinusMatic_C");
static_assert(offsetof(ABP_Weapon_ZapMinusOMinusMatic_C, UberGraphFrame) == 0x000778, "Member 'ABP_Weapon_ZapMinusOMinusMatic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_ZapMinusOMinusMatic_C, SkeletalMesh) == 0x000780, "Member 'ABP_Weapon_ZapMinusOMinusMatic_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_ZapMinusOMinusMatic_C, IsHitting) == 0x000788, "Member 'ABP_Weapon_ZapMinusOMinusMatic_C::IsHitting' has a wrong offset!");

}

