#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_ZapMinusOMinusMatic

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Weapon_Zap-O-Matic.BP_Weapon_Zap-O-Matic_C.OnFailedFireAttempt
// 0x0001 (0x0001 - 0x0000)
struct BP_Weapon_ZapMinusOMinusMatic_C_OnFailedFireAttempt final
{
public:
	EWeaponFireAttemptResult                      _weaponFireResult;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_ZapMinusOMinusMatic_C_OnFailedFireAttempt) == 0x000001, "Wrong alignment on BP_Weapon_ZapMinusOMinusMatic_C_OnFailedFireAttempt");
static_assert(sizeof(BP_Weapon_ZapMinusOMinusMatic_C_OnFailedFireAttempt) == 0x000001, "Wrong size on BP_Weapon_ZapMinusOMinusMatic_C_OnFailedFireAttempt");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_OnFailedFireAttempt, _weaponFireResult) == 0x000000, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_OnFailedFireAttempt::_weaponFireResult' has a wrong offset!");

// Function BP_Weapon_Zap-O-Matic.BP_Weapon_Zap-O-Matic_C.OnShotImpact
// 0x0088 (0x0088 - 0x0000)
struct BP_Weapon_ZapMinusOMinusMatic_C_OnShotImpact final
{
public:
	struct FHitResult                             _oHitResult;                                       // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Weapon_ZapMinusOMinusMatic_C_OnShotImpact) == 0x000004, "Wrong alignment on BP_Weapon_ZapMinusOMinusMatic_C_OnShotImpact");
static_assert(sizeof(BP_Weapon_ZapMinusOMinusMatic_C_OnShotImpact) == 0x000088, "Wrong size on BP_Weapon_ZapMinusOMinusMatic_C_OnShotImpact");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_OnShotImpact, _oHitResult) == 0x000000, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_OnShotImpact::_oHitResult' has a wrong offset!");

// Function BP_Weapon_Zap-O-Matic.BP_Weapon_Zap-O-Matic_C.ExecuteUbergraph_BP_Weapon_Zap-O-Matic
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponFireAttemptResult                      K2Node_Event__weaponFireResult;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue1;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event__oHitResult;                          // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic) == 0x000008, "Wrong alignment on BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic");
static_assert(sizeof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic) == 0x0000B0, "Wrong size on BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic, EntryPoint) == 0x000000, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic, K2Node_Event__weaponFireResult) == 0x000010, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic::K2Node_Event__weaponFireResult' has a wrong offset!");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000012, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic, CallFunc_SpawnSound2D_ReturnValue1) == 0x000018, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic::CallFunc_SpawnSound2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic, K2Node_Event__oHitResult) == 0x000024, "Member 'BP_Weapon_ZapMinusOMinusMatic_C_ExecuteUbergraph_BP_Weapon_ZapMinusOMinusMatic::K2Node_Event__oHitResult' has a wrong offset!");

}

