#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZapMinusOMinusMaticBeam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Zap-O-MaticBeam.BP_Zap-O-MaticBeam_C
// 0x0030 (0x06E0 - 0x06B0)
class ABP_ZapMinusOMinusMaticBeam_C final : public ABFGProjectile_BeamZapomatic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TickDelta;                                         // 0x06C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABFGEffectActor*                        BeamEffect;                                        // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpawnedLoopSound;                                  // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpawnedTriggerSound;                               // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ZapMinusOMinusMaticBeam(int32 EntryPoint);
	void OnReturnToPool();
	void UpdateBeam(const struct FVector& _vTargetLocation, bool _bHitTarget, const struct FVector& _vImpactNormal);
	void StopBeam();
	void StartBeam(const struct FVector& _vTargetLocation, bool _bHitTarget, bool _bHitEnvironment, const struct FVector& _vImpactNormal);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Zap-O-MaticBeam_C">();
	}
	static class ABP_ZapMinusOMinusMaticBeam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ZapMinusOMinusMaticBeam_C>();
	}
};
static_assert(alignof(ABP_ZapMinusOMinusMaticBeam_C) == 0x000008, "Wrong alignment on ABP_ZapMinusOMinusMaticBeam_C");
static_assert(sizeof(ABP_ZapMinusOMinusMaticBeam_C) == 0x0006E0, "Wrong size on ABP_ZapMinusOMinusMaticBeam_C");
static_assert(offsetof(ABP_ZapMinusOMinusMaticBeam_C, UberGraphFrame) == 0x0006B0, "Member 'ABP_ZapMinusOMinusMaticBeam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ZapMinusOMinusMaticBeam_C, DefaultSceneRoot) == 0x0006B8, "Member 'ABP_ZapMinusOMinusMaticBeam_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ZapMinusOMinusMaticBeam_C, TickDelta) == 0x0006C0, "Member 'ABP_ZapMinusOMinusMaticBeam_C::TickDelta' has a wrong offset!");
static_assert(offsetof(ABP_ZapMinusOMinusMaticBeam_C, BeamEffect) == 0x0006C8, "Member 'ABP_ZapMinusOMinusMaticBeam_C::BeamEffect' has a wrong offset!");
static_assert(offsetof(ABP_ZapMinusOMinusMaticBeam_C, SpawnedLoopSound) == 0x0006D0, "Member 'ABP_ZapMinusOMinusMaticBeam_C::SpawnedLoopSound' has a wrong offset!");
static_assert(offsetof(ABP_ZapMinusOMinusMaticBeam_C, SpawnedTriggerSound) == 0x0006D8, "Member 'ABP_ZapMinusOMinusMaticBeam_C::SpawnedTriggerSound' has a wrong offset!");

}

