#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_HorizontalRating

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPW_HorizontalRating.BPW_HorizontalRating_C.ExecuteUbergraph_BPW_HorizontalRating
// 0x0040 (0x0040 - 0x0000)
struct BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating) == 0x000008, "Wrong alignment on BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating");
static_assert(sizeof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating) == 0x000040, "Wrong size on BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, EntryPoint) == 0x000000, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000018, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, Temp_int_Variable) == 0x000024, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, K2Node_MakeStruct_Margin) == 0x000028, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BPW_HorizontalRating_C_ExecuteUbergraph_BPW_HorizontalRating::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BPW_HorizontalRating.BPW_HorizontalRating_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPW_HorizontalRating_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_HorizontalRating_C_PreConstruct) == 0x000001, "Wrong alignment on BPW_HorizontalRating_C_PreConstruct");
static_assert(sizeof(BPW_HorizontalRating_C_PreConstruct) == 0x000001, "Wrong size on BPW_HorizontalRating_C_PreConstruct");
static_assert(offsetof(BPW_HorizontalRating_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPW_HorizontalRating_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPW_HorizontalRating.BPW_HorizontalRating_C.SetRating
// 0x0028 (0x0028 - 0x0000)
struct BPW_HorizontalRating_C_SetRating final
{
public:
	int32                                         InRating;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_HorizontalRating_C_SetRating) == 0x000008, "Wrong alignment on BPW_HorizontalRating_C_SetRating");
static_assert(sizeof(BPW_HorizontalRating_C_SetRating) == 0x000028, "Wrong size on BPW_HorizontalRating_C_SetRating");
static_assert(offsetof(BPW_HorizontalRating_C_SetRating, InRating) == 0x000000, "Member 'BPW_HorizontalRating_C_SetRating::InRating' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_SetRating, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BPW_HorizontalRating_C_SetRating::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_SetRating, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BPW_HorizontalRating_C_SetRating::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_SetRating, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'BPW_HorizontalRating_C_SetRating::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_SetRating, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BPW_HorizontalRating_C_SetRating::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_SetRating, CallFunc_Array_Get_Item) == 0x000018, "Member 'BPW_HorizontalRating_C_SetRating::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_SetRating, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BPW_HorizontalRating_C_SetRating::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_HorizontalRating_C_SetRating, CallFunc_Less_IntInt_ReturnValue1) == 0x000024, "Member 'BPW_HorizontalRating_C_SetRating::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");

// Function BPW_HorizontalRating.BPW_HorizontalRating_C.SetDisabled
// 0x0001 (0x0001 - 0x0000)
struct BPW_HorizontalRating_C_SetDisabled final
{
public:
	bool                                          InDisabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_HorizontalRating_C_SetDisabled) == 0x000001, "Wrong alignment on BPW_HorizontalRating_C_SetDisabled");
static_assert(sizeof(BPW_HorizontalRating_C_SetDisabled) == 0x000001, "Wrong size on BPW_HorizontalRating_C_SetDisabled");
static_assert(offsetof(BPW_HorizontalRating_C_SetDisabled, InDisabled) == 0x000000, "Member 'BPW_HorizontalRating_C_SetDisabled::InDisabled' has a wrong offset!");

}

