#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_UI_Minimap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_UI_Minimap.BPW_UI_Minimap_C
// 0x0020 (0x0318 - 0x02F8)
class UBPW_UI_Minimap_C final : public UBFGWidget_HUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPW_UI_HUDRadar_C*                     BPW_UI_HUDRadar;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_UI_Minimap_North_C*                BPW_UI_Minimap_North;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_FG;                                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BPW_UI_Minimap(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPW_UI_Minimap_C">();
	}
	static class UBPW_UI_Minimap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_UI_Minimap_C>();
	}
};
static_assert(alignof(UBPW_UI_Minimap_C) == 0x000008, "Wrong alignment on UBPW_UI_Minimap_C");
static_assert(sizeof(UBPW_UI_Minimap_C) == 0x000318, "Wrong size on UBPW_UI_Minimap_C");
static_assert(offsetof(UBPW_UI_Minimap_C, UberGraphFrame) == 0x0002F8, "Member 'UBPW_UI_Minimap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Minimap_C, BPW_UI_HUDRadar) == 0x000300, "Member 'UBPW_UI_Minimap_C::BPW_UI_HUDRadar' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Minimap_C, BPW_UI_Minimap_North) == 0x000308, "Member 'UBPW_UI_Minimap_C::BPW_UI_Minimap_North' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Minimap_C, I_FG) == 0x000310, "Member 'UBPW_UI_Minimap_C::I_FG' has a wrong offset!");

}

