#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_DialogOption_MainMenu_Entry

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPW_DialogOption_MainMenu_Entry.BPW_DialogOption_MainMenu_Entry_C.ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry
// 0x00E8 (0x00E8 - 0x0000)
struct BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGDialogOptionSelectionState                K2Node_Event__eState;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_ButtonText_ReturnValue;               // 0x0008(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x0048(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x0070(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor3;                     // 0x00A0(0x0028)()
	bool                                          K2Node_Event__bShow;                               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry) == 0x000008, "Wrong alignment on BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry");
static_assert(sizeof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry) == 0x0000E8, "Wrong size on BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, EntryPoint) == 0x000000, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, K2Node_Event__eState) == 0x000005, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::K2Node_Event__eState' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, CallFunc_Get_ButtonText_ReturnValue) == 0x000008, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::CallFunc_Get_ButtonText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, K2Node_MakeStruct_SlateColor1) == 0x000048, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::K2Node_MakeStruct_SlateColor1' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, K2Node_MakeStruct_SlateColor2) == 0x000070, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, K2Node_MakeStruct_SlateColor3) == 0x0000A0, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::K2Node_MakeStruct_SlateColor3' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, K2Node_Event__bShow) == 0x0000C8, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::K2Node_Event__bShow' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, CallFunc_PlayAnimation_ReturnValue1) == 0x0000D0, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, CallFunc_PlayAnimation_ReturnValue2) == 0x0000D8, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000E0, "Member 'BPW_DialogOption_MainMenu_Entry_C_ExecuteUbergraph_BPW_DialogOption_MainMenu_Entry::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BPW_DialogOption_MainMenu_Entry.BPW_DialogOption_MainMenu_Entry_C.OnHasNotification
// 0x0001 (0x0001 - 0x0000)
struct BPW_DialogOption_MainMenu_Entry_C_OnHasNotification final
{
public:
	bool                                          _bShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_DialogOption_MainMenu_Entry_C_OnHasNotification) == 0x000001, "Wrong alignment on BPW_DialogOption_MainMenu_Entry_C_OnHasNotification");
static_assert(sizeof(BPW_DialogOption_MainMenu_Entry_C_OnHasNotification) == 0x000001, "Wrong size on BPW_DialogOption_MainMenu_Entry_C_OnHasNotification");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_OnHasNotification, _bShow) == 0x000000, "Member 'BPW_DialogOption_MainMenu_Entry_C_OnHasNotification::_bShow' has a wrong offset!");

// Function BPW_DialogOption_MainMenu_Entry.BPW_DialogOption_MainMenu_Entry_C.OnOptionStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BPW_DialogOption_MainMenu_Entry_C_OnOptionStateChanged final
{
public:
	EBFGDialogOptionSelectionState                _eState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_DialogOption_MainMenu_Entry_C_OnOptionStateChanged) == 0x000001, "Wrong alignment on BPW_DialogOption_MainMenu_Entry_C_OnOptionStateChanged");
static_assert(sizeof(BPW_DialogOption_MainMenu_Entry_C_OnOptionStateChanged) == 0x000001, "Wrong size on BPW_DialogOption_MainMenu_Entry_C_OnOptionStateChanged");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_OnOptionStateChanged, _eState) == 0x000000, "Member 'BPW_DialogOption_MainMenu_Entry_C_OnOptionStateChanged::_eState' has a wrong offset!");

// Function BPW_DialogOption_MainMenu_Entry.BPW_DialogOption_MainMenu_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPW_DialogOption_MainMenu_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_DialogOption_MainMenu_Entry_C_PreConstruct) == 0x000001, "Wrong alignment on BPW_DialogOption_MainMenu_Entry_C_PreConstruct");
static_assert(sizeof(BPW_DialogOption_MainMenu_Entry_C_PreConstruct) == 0x000001, "Wrong size on BPW_DialogOption_MainMenu_Entry_C_PreConstruct");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPW_DialogOption_MainMenu_Entry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPW_DialogOption_MainMenu_Entry.BPW_DialogOption_MainMenu_Entry_C.Get_ButtonText
// 0x0038 (0x0038 - 0x0000)
struct BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsDialogOptionTextCustomized_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDialogOptionText_ReturnValue;          // 0x0020(0x0018)(ConstParm)
};
static_assert(alignof(BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText) == 0x000008, "Wrong alignment on BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText");
static_assert(sizeof(BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText) == 0x000038, "Wrong size on BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText, ReturnValue) == 0x000000, "Member 'BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText, CallFunc_IsDialogOptionTextCustomized_ReturnValue) == 0x000018, "Member 'BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText::CallFunc_IsDialogOptionTextCustomized_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText, CallFunc_GetDialogOptionText_ReturnValue) == 0x000020, "Member 'BPW_DialogOption_MainMenu_Entry_C_Get_ButtonText::CallFunc_GetDialogOptionText_ReturnValue' has a wrong offset!");

}

