#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_IngameMainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_IngameMainMenu.BPW_IngameMainMenu_C
// 0x0248 (0x0670 - 0x0428)
class UBPW_IngameMainMenu_C final : public UBFGWidget_IngameMainMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_EnterScreen;                                   // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderDNA;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_419;                                   // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_HorizontallyRatedLabeledItem_C*    ChallengeInfo_Collect;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_HorizontallyRatedLabeledItem_C*    ChallengeInfo_Deliver;                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_HorizontallyRatedLabeledItem_C*    ChallengeInfo_Race;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_HorizontallyRatedLabeledItem_C*    ChallengeInfo_Rampage;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_Deco_HeadlineShine;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_Deco_MenuBorder02;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_DNA;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_279;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Drone;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_DialogOption_Mothership_FlowEntry_C* Option_Accept;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_DialogOption_Mothership_FlowEntry_C* Option_Back;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_DialogOption_MainMenu_Entry_C*     Option_CancelChallenge;                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_DialogOption_MainMenu_Entry_C*     Option_Continue;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_DialogOption_MainMenu_Entry_C*     Option_Handbook;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_DialogOption_MainMenu_Entry_C*     Option_MainMenu;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_DialogOption_MainMenu_Entry_C*     Option_Mothership;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_DialogOption_MainMenu_Entry_C*     Option_Options;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_DialogOption_MainMenu_Entry_C*     Option_RestartMission;                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_WorldInfo;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTB_DNA;                                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTB_Extras;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTB_NumDronesCollected;                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         T_MenuHeader;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         T_MenuSubhead;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_DebugMenu;                               // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         LastTime_Hover;                                    // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastTime_Unhover;                                  // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_Now;                                          // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGWidget_DialogOption*                CurrentSelectedOption;                             // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInChallenge;                                      // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextExtras;                                        // 0x0548(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            BrushDrones;                                       // 0x0560(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            BrushDronesComplete;                               // 0x05E8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BPW_IngameMainMenu(int32 EntryPoint);
	void Construct();
	void SetDNAAmount(int32 _iDNAAmount);
	void SetChallengeDisabled(EBFGChallengeType _eType, bool _bDisabled);
	void SetChallengeRating(EBFGChallengeType _eType, int32 _iRating);
	void SetDroneCount(int32 _iMax, int32 _iCurrent);
	void SetWorldInfoEnabled(bool _bEnabled);
	void UpdateWorldDescription(const class FText& _oDescription);
	void OnSFX_OptionMouseReleased();
	void OnSFX_OptionMousePressed();
	void OnSFX_OptionGamepadKBAccept();
	void OnSFX_OptionMouseUnhover();
	void OnSFX_OptionMouseHover();
	void OnSFX_OptionGamepadKBSelect();
	void FadeIn();
	void FadeOut();
	void BackPressed();
	void Event_OnAccepted(int32 _iIndex);
	void OpenDebugMenuPressed();
	void OnInputDeviceChanged(bool _bIsGamepad);
	void ModeForwardPressed();
	void OpenDebugMenu();
	void InitMenu();
	void SetQuestOrMapName();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	ESlateVisibility GetDebugMenuVisibility();
	ESlateVisibility Get_TextBlock_DebugMenu_Visibility_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPW_IngameMainMenu_C">();
	}
	static class UBPW_IngameMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_IngameMainMenu_C>();
	}
};
static_assert(alignof(UBPW_IngameMainMenu_C) == 0x000008, "Wrong alignment on UBPW_IngameMainMenu_C");
static_assert(sizeof(UBPW_IngameMainMenu_C) == 0x000670, "Wrong size on UBPW_IngameMainMenu_C");
static_assert(offsetof(UBPW_IngameMainMenu_C, UberGraphFrame) == 0x000428, "Member 'UBPW_IngameMainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Ani_EnterScreen) == 0x000430, "Member 'UBPW_IngameMainMenu_C::Ani_EnterScreen' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, BorderDNA) == 0x000438, "Member 'UBPW_IngameMainMenu_C::BorderDNA' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, CanvasPanel_419) == 0x000440, "Member 'UBPW_IngameMainMenu_C::CanvasPanel_419' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, ChallengeInfo_Collect) == 0x000448, "Member 'UBPW_IngameMainMenu_C::ChallengeInfo_Collect' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, ChallengeInfo_Deliver) == 0x000450, "Member 'UBPW_IngameMainMenu_C::ChallengeInfo_Deliver' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, ChallengeInfo_Race) == 0x000458, "Member 'UBPW_IngameMainMenu_C::ChallengeInfo_Race' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, ChallengeInfo_Rampage) == 0x000460, "Member 'UBPW_IngameMainMenu_C::ChallengeInfo_Rampage' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, HorizontalBox_0) == 0x000468, "Member 'UBPW_IngameMainMenu_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, I_Deco_HeadlineShine) == 0x000470, "Member 'UBPW_IngameMainMenu_C::I_Deco_HeadlineShine' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, I_Deco_MenuBorder02) == 0x000478, "Member 'UBPW_IngameMainMenu_C::I_Deco_MenuBorder02' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, I_DNA) == 0x000480, "Member 'UBPW_IngameMainMenu_C::I_DNA' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Image_1) == 0x000488, "Member 'UBPW_IngameMainMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Image_279) == 0x000490, "Member 'UBPW_IngameMainMenu_C::Image_279' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, IMG_Drone) == 0x000498, "Member 'UBPW_IngameMainMenu_C::IMG_Drone' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Option_Accept) == 0x0004A0, "Member 'UBPW_IngameMainMenu_C::Option_Accept' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Option_Back) == 0x0004A8, "Member 'UBPW_IngameMainMenu_C::Option_Back' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Option_CancelChallenge) == 0x0004B0, "Member 'UBPW_IngameMainMenu_C::Option_CancelChallenge' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Option_Continue) == 0x0004B8, "Member 'UBPW_IngameMainMenu_C::Option_Continue' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Option_Handbook) == 0x0004C0, "Member 'UBPW_IngameMainMenu_C::Option_Handbook' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Option_MainMenu) == 0x0004C8, "Member 'UBPW_IngameMainMenu_C::Option_MainMenu' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Option_Mothership) == 0x0004D0, "Member 'UBPW_IngameMainMenu_C::Option_Mothership' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Option_Options) == 0x0004D8, "Member 'UBPW_IngameMainMenu_C::Option_Options' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Option_RestartMission) == 0x0004E0, "Member 'UBPW_IngameMainMenu_C::Option_RestartMission' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Overlay_WorldInfo) == 0x0004E8, "Member 'UBPW_IngameMainMenu_C::Overlay_WorldInfo' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, RTB_DNA) == 0x0004F0, "Member 'UBPW_IngameMainMenu_C::RTB_DNA' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, RTB_Extras) == 0x0004F8, "Member 'UBPW_IngameMainMenu_C::RTB_Extras' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, RTB_NumDronesCollected) == 0x000500, "Member 'UBPW_IngameMainMenu_C::RTB_NumDronesCollected' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, SafeZone_2) == 0x000508, "Member 'UBPW_IngameMainMenu_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, T_MenuHeader) == 0x000510, "Member 'UBPW_IngameMainMenu_C::T_MenuHeader' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, T_MenuSubhead) == 0x000518, "Member 'UBPW_IngameMainMenu_C::T_MenuSubhead' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, TextBlock_DebugMenu) == 0x000520, "Member 'UBPW_IngameMainMenu_C::TextBlock_DebugMenu' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, LastTime_Hover) == 0x000528, "Member 'UBPW_IngameMainMenu_C::LastTime_Hover' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, LastTime_Unhover) == 0x00052C, "Member 'UBPW_IngameMainMenu_C::LastTime_Unhover' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, Time_Now) == 0x000530, "Member 'UBPW_IngameMainMenu_C::Time_Now' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, CurrentSelectedOption) == 0x000538, "Member 'UBPW_IngameMainMenu_C::CurrentSelectedOption' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, bInChallenge) == 0x000540, "Member 'UBPW_IngameMainMenu_C::bInChallenge' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, TextExtras) == 0x000548, "Member 'UBPW_IngameMainMenu_C::TextExtras' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, BrushDrones) == 0x000560, "Member 'UBPW_IngameMainMenu_C::BrushDrones' has a wrong offset!");
static_assert(offsetof(UBPW_IngameMainMenu_C, BrushDronesComplete) == 0x0005E8, "Member 'UBPW_IngameMainMenu_C::BrushDronesComplete' has a wrong offset!");

}

