#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_SubquestEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BFGCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_SubquestEntry.BPW_SubquestEntry_C
// 0x0108 (0x03A8 - 0x02A0)
class UBPW_SubquestEntry_C final : public UBFGWidget_SubquestEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Succeeded;                                    // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Failed;                                       // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SucceededChallenge;                           // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 I_LensFlare;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_LensFlare2;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Failed;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Frame;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Objective;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Rewards;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Segments;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Succeeded;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Numerical;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Segments;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTB_NumericalAmount;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTB_Text;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTB_Timer;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Bar;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_InnerBar;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialSegments;                                  // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialSegmentsOriginal;                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           SpriteSegmentSucceeded;                            // 0x0348(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           SpriteSegmentFailed;                               // 0x0350(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 RewardPositions;                                   // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 RewardPositionsFinished;                           // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UTextureRenderTarget2D*                 RenderTargetRewards;                               // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RenderTargetSize;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MatInst_Reward;                                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Sprite_RewardEmpty;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Sprite_RewardFilled;                               // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCompleted;                                       // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FinishedPrevious;                                  // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPW_SubquestEntry(int32 EntryPoint);
	void TriggerFinishedAnimation(bool _bFailed);
	void RebuildLayoutNative();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void EnsureMaterial();
	void UpdateMaterial();

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPW_SubquestEntry_C">();
	}
	static class UBPW_SubquestEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_SubquestEntry_C>();
	}
};
static_assert(alignof(UBPW_SubquestEntry_C) == 0x000008, "Wrong alignment on UBPW_SubquestEntry_C");
static_assert(sizeof(UBPW_SubquestEntry_C) == 0x0003A8, "Wrong size on UBPW_SubquestEntry_C");
static_assert(offsetof(UBPW_SubquestEntry_C, UberGraphFrame) == 0x0002A0, "Member 'UBPW_SubquestEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, Anim_Succeeded) == 0x0002A8, "Member 'UBPW_SubquestEntry_C::Anim_Succeeded' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, Anim_Failed) == 0x0002B0, "Member 'UBPW_SubquestEntry_C::Anim_Failed' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, Anim_SucceededChallenge) == 0x0002B8, "Member 'UBPW_SubquestEntry_C::Anim_SucceededChallenge' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, I_LensFlare) == 0x0002C0, "Member 'UBPW_SubquestEntry_C::I_LensFlare' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, I_LensFlare2) == 0x0002C8, "Member 'UBPW_SubquestEntry_C::I_LensFlare2' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, IMG_Failed) == 0x0002D0, "Member 'UBPW_SubquestEntry_C::IMG_Failed' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, IMG_Frame) == 0x0002D8, "Member 'UBPW_SubquestEntry_C::IMG_Frame' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, IMG_Objective) == 0x0002E0, "Member 'UBPW_SubquestEntry_C::IMG_Objective' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, IMG_Rewards) == 0x0002E8, "Member 'UBPW_SubquestEntry_C::IMG_Rewards' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, IMG_Segments) == 0x0002F0, "Member 'UBPW_SubquestEntry_C::IMG_Segments' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, IMG_Succeeded) == 0x0002F8, "Member 'UBPW_SubquestEntry_C::IMG_Succeeded' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, Overlay_Numerical) == 0x000300, "Member 'UBPW_SubquestEntry_C::Overlay_Numerical' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, Overlay_Segments) == 0x000308, "Member 'UBPW_SubquestEntry_C::Overlay_Segments' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, RTB_NumericalAmount) == 0x000310, "Member 'UBPW_SubquestEntry_C::RTB_NumericalAmount' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, RTB_Text) == 0x000318, "Member 'UBPW_SubquestEntry_C::RTB_Text' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, RTB_Timer) == 0x000320, "Member 'UBPW_SubquestEntry_C::RTB_Timer' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, ScaleBox_Bar) == 0x000328, "Member 'UBPW_SubquestEntry_C::ScaleBox_Bar' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, SizeBox_InnerBar) == 0x000330, "Member 'UBPW_SubquestEntry_C::SizeBox_InnerBar' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, MaterialSegments) == 0x000338, "Member 'UBPW_SubquestEntry_C::MaterialSegments' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, MaterialSegmentsOriginal) == 0x000340, "Member 'UBPW_SubquestEntry_C::MaterialSegmentsOriginal' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, SpriteSegmentSucceeded) == 0x000348, "Member 'UBPW_SubquestEntry_C::SpriteSegmentSucceeded' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, SpriteSegmentFailed) == 0x000350, "Member 'UBPW_SubquestEntry_C::SpriteSegmentFailed' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, RewardPositions) == 0x000358, "Member 'UBPW_SubquestEntry_C::RewardPositions' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, RewardPositionsFinished) == 0x000368, "Member 'UBPW_SubquestEntry_C::RewardPositionsFinished' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, RenderTargetRewards) == 0x000378, "Member 'UBPW_SubquestEntry_C::RenderTargetRewards' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, RenderTargetSize) == 0x000380, "Member 'UBPW_SubquestEntry_C::RenderTargetSize' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, MatInst_Reward) == 0x000388, "Member 'UBPW_SubquestEntry_C::MatInst_Reward' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, Sprite_RewardEmpty) == 0x000390, "Member 'UBPW_SubquestEntry_C::Sprite_RewardEmpty' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, Sprite_RewardFilled) == 0x000398, "Member 'UBPW_SubquestEntry_C::Sprite_RewardFilled' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, IsCompleted) == 0x0003A0, "Member 'UBPW_SubquestEntry_C::IsCompleted' has a wrong offset!");
static_assert(offsetof(UBPW_SubquestEntry_C, FinishedPrevious) == 0x0003A4, "Member 'UBPW_SubquestEntry_C::FinishedPrevious' has a wrong offset!");

}

