#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_UI_HUD_AlertLevel

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_PreConstruct) == 0x000001, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_PreConstruct");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_PreConstruct) == 0x000001, "Wrong size on BPW_UI_HUD_AlertLevel_C_PreConstruct");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.SetAlertDevelopmentState
// 0x0008 (0x0008 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_SetAlertDevelopmentState final
{
public:
	int32                                         _iIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iState;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_SetAlertDevelopmentState) == 0x000004, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_SetAlertDevelopmentState");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_SetAlertDevelopmentState) == 0x000008, "Wrong size on BPW_UI_HUD_AlertLevel_C_SetAlertDevelopmentState");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_SetAlertDevelopmentState, _iIndex) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_SetAlertDevelopmentState::_iIndex' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_SetAlertDevelopmentState, _iState) == 0x000004, "Member 'BPW_UI_HUD_AlertLevel_C_SetAlertDevelopmentState::_iState' has a wrong offset!");

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.SetInvestigativeBarPercent
// 0x0004 (0x0004 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_SetInvestigativeBarPercent final
{
public:
	float                                         _fValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_SetInvestigativeBarPercent) == 0x000004, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_SetInvestigativeBarPercent");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_SetInvestigativeBarPercent) == 0x000004, "Wrong size on BPW_UI_HUD_AlertLevel_C_SetInvestigativeBarPercent");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_SetInvestigativeBarPercent, _fValue) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_SetInvestigativeBarPercent::_fValue' has a wrong offset!");

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.SetAlertBarPercent
// 0x0004 (0x0004 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_SetAlertBarPercent final
{
public:
	float                                         _fValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_SetAlertBarPercent) == 0x000004, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_SetAlertBarPercent");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_SetAlertBarPercent) == 0x000004, "Wrong size on BPW_UI_HUD_AlertLevel_C_SetAlertBarPercent");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_SetAlertBarPercent, _fValue) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_SetAlertBarPercent::_fValue' has a wrong offset!");

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.TriggerAnimationNewLevelReached
// 0x0004 (0x0004 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_TriggerAnimationNewLevelReached final
{
public:
	int32                                         _iIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_TriggerAnimationNewLevelReached) == 0x000004, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_TriggerAnimationNewLevelReached");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_TriggerAnimationNewLevelReached) == 0x000004, "Wrong size on BPW_UI_HUD_AlertLevel_C_TriggerAnimationNewLevelReached");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_TriggerAnimationNewLevelReached, _iIndex) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_TriggerAnimationNewLevelReached::_iIndex' has a wrong offset!");

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.SetIconPack
// 0x0228 (0x0228 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_SetIconPack final
{
public:
	int32                                         _iIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGAlertLevelIconPack                 _oIcon;                                            // 0x0008(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_SetIconPack) == 0x000008, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_SetIconPack");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_SetIconPack) == 0x000228, "Wrong size on BPW_UI_HUD_AlertLevel_C_SetIconPack");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_SetIconPack, _iIndex) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_SetIconPack::_iIndex' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_SetIconPack, _oIcon) == 0x000008, "Member 'BPW_UI_HUD_AlertLevel_C_SetIconPack::_oIcon' has a wrong offset!");

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.SetSeenLevel
// 0x0001 (0x0001 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_SetSeenLevel final
{
public:
	EBFGAlertSystemSeenState                      _eState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_SetSeenLevel) == 0x000001, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_SetSeenLevel");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_SetSeenLevel) == 0x000001, "Wrong size on BPW_UI_HUD_AlertLevel_C_SetSeenLevel");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_SetSeenLevel, _eState) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_SetSeenLevel::_eState' has a wrong offset!");

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.EnableStealthWarning
// 0x0001 (0x0001 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_EnableStealthWarning final
{
public:
	bool                                          _bEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_EnableStealthWarning) == 0x000001, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_EnableStealthWarning");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_EnableStealthWarning) == 0x000001, "Wrong size on BPW_UI_HUD_AlertLevel_C_EnableStealthWarning");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_EnableStealthWarning, _bEnable) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_EnableStealthWarning::_bEnable' has a wrong offset!");

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.SetStealthWarningLevel
// 0x0001 (0x0001 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_SetStealthWarningLevel final
{
public:
	EBFGAlertSystemState                          _eState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_SetStealthWarningLevel) == 0x000001, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_SetStealthWarningLevel");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_SetStealthWarningLevel) == 0x000001, "Wrong size on BPW_UI_HUD_AlertLevel_C_SetStealthWarningLevel");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_SetStealthWarningLevel, _eState) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_SetStealthWarningLevel::_eState' has a wrong offset!");

// Function BPW_UI_HUD_AlertLevel.BPW_UI_HUD_AlertLevel_C.ExecuteUbergraph_BPW_UI_HUD_AlertLevel
// 0x02A8 (0x02A8 - 0x0000)
struct BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event__iIndex2;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event__iState;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UI_AlertLevel_C*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event__fValue1;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event__fValue;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event__iIndex1;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event__iIndex;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGAlertLevelIconPack                 K2Node_Event__oIcon;                               // 0x0060(0x0220)(ConstParm)
	struct FVector2D                              CallFunc_Array_Get_Item1;                          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UI_AlertLevel_C*                    CallFunc_Array_Get_Item2;                          // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGAlertSystemSeenState                      K2Node_Event__eState1;                             // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event__bEnable;                             // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGAlertSystemState                          K2Node_Event__eState;                              // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel) == 0x000008, "Wrong alignment on BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel");
static_assert(sizeof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel) == 0x0002A8, "Wrong size on BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, EntryPoint) == 0x000000, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, Temp_byte_Variable) == 0x000004, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event_IsDesignTime) == 0x000005, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_Array_Add_ReturnValue1) == 0x00000C, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_Array_Add_ReturnValue2) == 0x000010, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_Array_Add_ReturnValue3) == 0x000014, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__iIndex2) == 0x000018, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__iIndex2' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__iState) == 0x00001C, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__iState' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, Temp_byte_Variable1) == 0x000020, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_Array_Get_Item) == 0x000028, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, Temp_bool_Variable) == 0x000034, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_Less_IntInt_ReturnValue) == 0x000035, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__fValue1) == 0x000040, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__fValue1' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__fValue) == 0x000044, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__fValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_IsValid_ReturnValue1) == 0x000049, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__iIndex1) == 0x00004C, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__iIndex1' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__iIndex) == 0x000058, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__iIndex' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__oIcon) == 0x000060, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__oIcon' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_Array_Get_Item1) == 0x000280, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_Array_Get_Item2) == 0x000288, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__eState1) == 0x000290, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__eState1' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_SwitchEnum_CmpSuccess) == 0x000291, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__bEnable) == 0x000292, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__bEnable' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Event__eState) == 0x000293, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Event__eState' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_Select_Default) == 0x000294, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, K2Node_SwitchEnum1_CmpSuccess) == 0x000295, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000298, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel, CallFunc_PlayAnimation_ReturnValue1) == 0x0002A0, "Member 'BPW_UI_HUD_AlertLevel_C_ExecuteUbergraph_BPW_UI_HUD_AlertLevel::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");

}

