#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_HUD_Quest_Timer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BFGCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_HUD_Quest_Timer.BPW_HUD_Quest_Timer_C
// 0x0058 (0x0350 - 0x02F8)
class UBPW_HUD_Quest_Timer_C final : public UBFGWidget_HUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PunchNew_1;                                        // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PunchNew;                                          // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Punch;                                             // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_TimerRoot;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Timer;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBFGQuest_Manager*                      QuestManagerRef;                                   // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalColor;                                       // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           WarningColor;                                      // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateQuestManagerReference();
	void UpdateTimers(TArray<class UBFGQuest_Timer*>& Timers__all_);
	void ClearData();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_BPW_HUD_Quest_Timer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPW_HUD_Quest_Timer_C">();
	}
	static class UBPW_HUD_Quest_Timer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_HUD_Quest_Timer_C>();
	}
};
static_assert(alignof(UBPW_HUD_Quest_Timer_C) == 0x000008, "Wrong alignment on UBPW_HUD_Quest_Timer_C");
static_assert(sizeof(UBPW_HUD_Quest_Timer_C) == 0x000350, "Wrong size on UBPW_HUD_Quest_Timer_C");
static_assert(offsetof(UBPW_HUD_Quest_Timer_C, UberGraphFrame) == 0x0002F8, "Member 'UBPW_HUD_Quest_Timer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPW_HUD_Quest_Timer_C, PunchNew_1) == 0x000300, "Member 'UBPW_HUD_Quest_Timer_C::PunchNew_1' has a wrong offset!");
static_assert(offsetof(UBPW_HUD_Quest_Timer_C, PunchNew) == 0x000308, "Member 'UBPW_HUD_Quest_Timer_C::PunchNew' has a wrong offset!");
static_assert(offsetof(UBPW_HUD_Quest_Timer_C, Punch) == 0x000310, "Member 'UBPW_HUD_Quest_Timer_C::Punch' has a wrong offset!");
static_assert(offsetof(UBPW_HUD_Quest_Timer_C, CanvasPanel_TimerRoot) == 0x000318, "Member 'UBPW_HUD_Quest_Timer_C::CanvasPanel_TimerRoot' has a wrong offset!");
static_assert(offsetof(UBPW_HUD_Quest_Timer_C, TextBlock_Timer) == 0x000320, "Member 'UBPW_HUD_Quest_Timer_C::TextBlock_Timer' has a wrong offset!");
static_assert(offsetof(UBPW_HUD_Quest_Timer_C, QuestManagerRef) == 0x000328, "Member 'UBPW_HUD_Quest_Timer_C::QuestManagerRef' has a wrong offset!");
static_assert(offsetof(UBPW_HUD_Quest_Timer_C, NormalColor) == 0x000330, "Member 'UBPW_HUD_Quest_Timer_C::NormalColor' has a wrong offset!");
static_assert(offsetof(UBPW_HUD_Quest_Timer_C, WarningColor) == 0x000340, "Member 'UBPW_HUD_Quest_Timer_C::WarningColor' has a wrong offset!");

}

