#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_UI_Slot_Weapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_UI_Slot_Weapon.BPW_UI_Slot_Weapon_C
// 0x00C8 (0x04E0 - 0x0418)
class UBPW_UI_Slot_Weapon_C final : public UBFGWidget_HUD_WeaponStats
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_Main;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_WeaponKeyHint;                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_WeaponWheelHint;                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_QuickSlots;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_WeaponBarBackground;                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_JammedEffect;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_Scanlines_Ammo;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 I_Scanlines_WeaponIcon;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Infinite;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_WeaponKeyHint;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_3;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_WeaponWheelHint;                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_ActiveSlot;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             T_Ammo;                                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Percent;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         OpacityGreyedOut;                                  // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsJammed;                                          // 0x049C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         WeaponClasses;                                     // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class ABFGWeapon*                             CurrentWeapon;                                     // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCanvasPanel*>                   BigWeaponIconCanvasPanels;                         // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UUserWidget*>                    QuickSlotWidgets;                                  // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         AmountOfWeaponsAvailable;                          // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ActiveSlotEnabled;                                 // 0x04DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetActiveSlot(class UBFGWeaponSlot* _pSlot);
	void Construct();
	void AddQuickSlotToLayout(class UBFGWeaponSlot* _pSlot);
	void ExecuteUbergraph_BPW_UI_Slot_Weapon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPW_UI_Slot_Weapon_C">();
	}
	static class UBPW_UI_Slot_Weapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_UI_Slot_Weapon_C>();
	}
};
static_assert(alignof(UBPW_UI_Slot_Weapon_C) == 0x000008, "Wrong alignment on UBPW_UI_Slot_Weapon_C");
static_assert(sizeof(UBPW_UI_Slot_Weapon_C) == 0x0004E0, "Wrong size on UBPW_UI_Slot_Weapon_C");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, UberGraphFrame) == 0x000418, "Member 'UBPW_UI_Slot_Weapon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, Canvas_Main) == 0x000420, "Member 'UBPW_UI_Slot_Weapon_C::Canvas_Main' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, CanvasPanel_WeaponKeyHint) == 0x000428, "Member 'UBPW_UI_Slot_Weapon_C::CanvasPanel_WeaponKeyHint' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, CanvasPanel_WeaponWheelHint) == 0x000430, "Member 'UBPW_UI_Slot_Weapon_C::CanvasPanel_WeaponWheelHint' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, HB_QuickSlots) == 0x000438, "Member 'UBPW_UI_Slot_Weapon_C::HB_QuickSlots' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, HorizontalBox_WeaponBarBackground) == 0x000440, "Member 'UBPW_UI_Slot_Weapon_C::HorizontalBox_WeaponBarBackground' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, I_JammedEffect) == 0x000448, "Member 'UBPW_UI_Slot_Weapon_C::I_JammedEffect' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, I_Scanlines_Ammo) == 0x000450, "Member 'UBPW_UI_Slot_Weapon_C::I_Scanlines_Ammo' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, I_Scanlines_WeaponIcon) == 0x000458, "Member 'UBPW_UI_Slot_Weapon_C::I_Scanlines_WeaponIcon' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, Overlay_Infinite) == 0x000460, "Member 'UBPW_UI_Slot_Weapon_C::Overlay_Infinite' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, Overlay_WeaponKeyHint) == 0x000468, "Member 'UBPW_UI_Slot_Weapon_C::Overlay_WeaponKeyHint' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, RichTextBlock_3) == 0x000470, "Member 'UBPW_UI_Slot_Weapon_C::RichTextBlock_3' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, RichTextBlock_WeaponWheelHint) == 0x000478, "Member 'UBPW_UI_Slot_Weapon_C::RichTextBlock_WeaponWheelHint' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, SB_ActiveSlot) == 0x000480, "Member 'UBPW_UI_Slot_Weapon_C::SB_ActiveSlot' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, T_Ammo) == 0x000488, "Member 'UBPW_UI_Slot_Weapon_C::T_Ammo' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, TextBlock_Percent) == 0x000490, "Member 'UBPW_UI_Slot_Weapon_C::TextBlock_Percent' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, OpacityGreyedOut) == 0x000498, "Member 'UBPW_UI_Slot_Weapon_C::OpacityGreyedOut' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, IsJammed) == 0x00049C, "Member 'UBPW_UI_Slot_Weapon_C::IsJammed' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, WeaponClasses) == 0x0004A0, "Member 'UBPW_UI_Slot_Weapon_C::WeaponClasses' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, CurrentWeapon) == 0x0004B0, "Member 'UBPW_UI_Slot_Weapon_C::CurrentWeapon' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, BigWeaponIconCanvasPanels) == 0x0004B8, "Member 'UBPW_UI_Slot_Weapon_C::BigWeaponIconCanvasPanels' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, QuickSlotWidgets) == 0x0004C8, "Member 'UBPW_UI_Slot_Weapon_C::QuickSlotWidgets' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, AmountOfWeaponsAvailable) == 0x0004D8, "Member 'UBPW_UI_Slot_Weapon_C::AmountOfWeaponsAvailable' has a wrong offset!");
static_assert(offsetof(UBPW_UI_Slot_Weapon_C, ActiveSlotEnabled) == 0x0004DC, "Member 'UBPW_UI_Slot_Weapon_C::ActiveSlotEnabled' has a wrong offset!");

}

