#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_UI_Radiobox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPW_UI_Radiobox.BPW_UI_Radiobox_C.SequenceEvent_0
// 0x0060 (0x0060 - 0x0000)
struct BPW_UI_Radiobox_C_SequenceEvent_0 final
{
public:
	float                                         CallFunc_GetAnimProgression_Prgression;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetChoppedText_ChoppedText;               // 0x0018(0x0018)()
	class FString                                 CallFunc_GetStringNoDecorators_ReturnValue;        // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetScrambledText_ScrambledText;           // 0x0048(0x0018)()
};
static_assert(alignof(BPW_UI_Radiobox_C_SequenceEvent_0) == 0x000008, "Wrong alignment on BPW_UI_Radiobox_C_SequenceEvent_0");
static_assert(sizeof(BPW_UI_Radiobox_C_SequenceEvent_0) == 0x000060, "Wrong size on BPW_UI_Radiobox_C_SequenceEvent_0");
static_assert(offsetof(BPW_UI_Radiobox_C_SequenceEvent_0, CallFunc_GetAnimProgression_Prgression) == 0x000000, "Member 'BPW_UI_Radiobox_C_SequenceEvent_0::CallFunc_GetAnimProgression_Prgression' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_SequenceEvent_0, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'BPW_UI_Radiobox_C_SequenceEvent_0::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_SequenceEvent_0, CallFunc_GetChoppedText_ChoppedText) == 0x000018, "Member 'BPW_UI_Radiobox_C_SequenceEvent_0::CallFunc_GetChoppedText_ChoppedText' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_SequenceEvent_0, CallFunc_GetStringNoDecorators_ReturnValue) == 0x000030, "Member 'BPW_UI_Radiobox_C_SequenceEvent_0::CallFunc_GetStringNoDecorators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_SequenceEvent_0, CallFunc_Len_ReturnValue) == 0x000040, "Member 'BPW_UI_Radiobox_C_SequenceEvent_0::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_SequenceEvent_0, CallFunc_GetScrambledText_ScrambledText) == 0x000048, "Member 'BPW_UI_Radiobox_C_SequenceEvent_0::CallFunc_GetScrambledText_ScrambledText' has a wrong offset!");

// Function BPW_UI_Radiobox.BPW_UI_Radiobox_C.Update_ProgressiveSubtitle
// 0x0040 (0x0040 - 0x0000)
struct BPW_UI_Radiobox_C_Update_ProgressiveSubtitle final
{
public:
	float                                         CallFunc_GetAnimProgression_Prgression;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetScrambledTextForFurocom_ReturnValue;   // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(BPW_UI_Radiobox_C_Update_ProgressiveSubtitle) == 0x000008, "Wrong alignment on BPW_UI_Radiobox_C_Update_ProgressiveSubtitle");
static_assert(sizeof(BPW_UI_Radiobox_C_Update_ProgressiveSubtitle) == 0x000040, "Wrong size on BPW_UI_Radiobox_C_Update_ProgressiveSubtitle");
static_assert(offsetof(BPW_UI_Radiobox_C_Update_ProgressiveSubtitle, CallFunc_GetAnimProgression_Prgression) == 0x000000, "Member 'BPW_UI_Radiobox_C_Update_ProgressiveSubtitle::CallFunc_GetAnimProgression_Prgression' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_Update_ProgressiveSubtitle, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'BPW_UI_Radiobox_C_Update_ProgressiveSubtitle::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_Update_ProgressiveSubtitle, CallFunc_GetScrambledTextForFurocom_ReturnValue) == 0x000018, "Member 'BPW_UI_Radiobox_C_Update_ProgressiveSubtitle::CallFunc_GetScrambledTextForFurocom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_Update_ProgressiveSubtitle, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BPW_UI_Radiobox_C_Update_ProgressiveSubtitle::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BPW_UI_Radiobox.BPW_UI_Radiobox_C.Tick
// 0x003C (0x003C - 0x0000)
struct BPW_UI_Radiobox_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_UI_Radiobox_C_Tick) == 0x000004, "Wrong alignment on BPW_UI_Radiobox_C_Tick");
static_assert(sizeof(BPW_UI_Radiobox_C_Tick) == 0x00003C, "Wrong size on BPW_UI_Radiobox_C_Tick");
static_assert(offsetof(BPW_UI_Radiobox_C_Tick, MyGeometry) == 0x000000, "Member 'BPW_UI_Radiobox_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_Tick, InDeltaTime) == 0x000038, "Member 'BPW_UI_Radiobox_C_Tick::InDeltaTime' has a wrong offset!");

// Function BPW_UI_Radiobox.BPW_UI_Radiobox_C.ExecuteUbergraph_BPW_UI_Radiobox
// 0x0140 (0x0140 - 0x0000)
struct BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlaybackSpeedFromTextLength_PlaybackSpeed; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0018(0x0088)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue2;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue1;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartsWith_ReturnValue1;                  // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0120(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox) == 0x000008, "Wrong alignment on BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox");
static_assert(sizeof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox) == 0x000140, "Wrong size on BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, EntryPoint) == 0x000000, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_GetPlaybackSpeedFromTextLength_PlaybackSpeed) == 0x000004, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_GetPlaybackSpeedFromTextLength_PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, K2Node_MakeStruct_SlateBrush) == 0x000018, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, K2Node_Event_MyGeometry) == 0x0000A0, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, K2Node_Event_InDeltaTime) == 0x0000D8, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_PlayAnimation_ReturnValue1) == 0x0000E0, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_PlayAnimation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000E8, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_PlayAnimation_ReturnValue2) == 0x0000F0, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_PlayAnimation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_GetCurrentLanguage_ReturnValue) == 0x0000F8, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_StartsWith_ReturnValue) == 0x000108, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_StartsWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_IsAnimationPlaying_ReturnValue1) == 0x000109, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_IsAnimationPlaying_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_StartsWith_ReturnValue1) == 0x00010A, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_StartsWith_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_BooleanOR_ReturnValue) == 0x00010B, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_IsValid_ReturnValue) == 0x00010C, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_Conv_TextToString_ReturnValue) == 0x000110, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_Map_Find_Value) == 0x000120, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox, CallFunc_Map_Find_ReturnValue) == 0x000138, "Member 'BPW_UI_Radiobox_C_ExecuteUbergraph_BPW_UI_Radiobox::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

