#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_HUD_Quest_ProximityMonitor

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPW_HUD_Quest_ProximityMonitor.BPW_HUD_Quest_ProximityMonitor_C.OnDistanceTextChanged
// 0x0018 (0x0018 - 0x0000)
struct BPW_HUD_Quest_ProximityMonitor_C_OnDistanceTextChanged final
{
public:
	class FText                                   StrDistance;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPW_HUD_Quest_ProximityMonitor_C_OnDistanceTextChanged) == 0x000008, "Wrong alignment on BPW_HUD_Quest_ProximityMonitor_C_OnDistanceTextChanged");
static_assert(sizeof(BPW_HUD_Quest_ProximityMonitor_C_OnDistanceTextChanged) == 0x000018, "Wrong size on BPW_HUD_Quest_ProximityMonitor_C_OnDistanceTextChanged");
static_assert(offsetof(BPW_HUD_Quest_ProximityMonitor_C_OnDistanceTextChanged, StrDistance) == 0x000000, "Member 'BPW_HUD_Quest_ProximityMonitor_C_OnDistanceTextChanged::StrDistance' has a wrong offset!");

// Function BPW_HUD_Quest_ProximityMonitor.BPW_HUD_Quest_ProximityMonitor_C.OnWarningAreaChanged
// 0x0001 (0x0001 - 0x0000)
struct BPW_HUD_Quest_ProximityMonitor_C_OnWarningAreaChanged final
{
public:
	bool                                          Entered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_HUD_Quest_ProximityMonitor_C_OnWarningAreaChanged) == 0x000001, "Wrong alignment on BPW_HUD_Quest_ProximityMonitor_C_OnWarningAreaChanged");
static_assert(sizeof(BPW_HUD_Quest_ProximityMonitor_C_OnWarningAreaChanged) == 0x000001, "Wrong size on BPW_HUD_Quest_ProximityMonitor_C_OnWarningAreaChanged");
static_assert(offsetof(BPW_HUD_Quest_ProximityMonitor_C_OnWarningAreaChanged, Entered) == 0x000000, "Member 'BPW_HUD_Quest_ProximityMonitor_C_OnWarningAreaChanged::Entered' has a wrong offset!");

// Function BPW_HUD_Quest_ProximityMonitor.BPW_HUD_Quest_ProximityMonitor_C.ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor
// 0x0058 (0x0058 - 0x0000)
struct BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_strDistance;                          // 0x0008(0x0018)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Entered;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0030(0x0028)()
};
static_assert(alignof(BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor) == 0x000008, "Wrong alignment on BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor");
static_assert(sizeof(BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor) == 0x000058, "Wrong size on BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor");
static_assert(offsetof(BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor, EntryPoint) == 0x000000, "Member 'BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor, K2Node_Event_strDistance) == 0x000008, "Member 'BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor::K2Node_Event_strDistance' has a wrong offset!");
static_assert(offsetof(BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor, K2Node_Event_Entered) == 0x000028, "Member 'BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor::K2Node_Event_Entered' has a wrong offset!");
static_assert(offsetof(BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor, Temp_bool_Variable) == 0x000029, "Member 'BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor, K2Node_Select_Default) == 0x000030, "Member 'BPW_HUD_Quest_ProximityMonitor_C_ExecuteUbergraph_BPW_HUD_Quest_ProximityMonitor::K2Node_Select_Default' has a wrong offset!");

}

