#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_UI_3StarCrosshair

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_UI_3StarCrosshair.BPW_UI_3StarCrosshair_C
// 0x0038 (0x0330 - 0x02F8)
class UBPW_UI_3StarCrosshair_C final : public UBFGWidget_HUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HitFatalAnimation;                                 // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HitAnimation;                                      // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CrosshairLeft;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CrosshairRight;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CrosshairTop;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBFGActorComponent_GameplayToHud*       GameplayToHud;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPW_UI_3StarCrosshair(int32 EntryPoint);
	void CrosshairOpacityChanged(float _fNewValue);
	void Crosshair_Location_Changed(const struct FVector2D& _vNewValue);
	void On_Hit_Feedback(bool _bFatalHit);
	void Construct();
	bool ComputeDesiredVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPW_UI_3StarCrosshair_C">();
	}
	static class UBPW_UI_3StarCrosshair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_UI_3StarCrosshair_C>();
	}
};
static_assert(alignof(UBPW_UI_3StarCrosshair_C) == 0x000008, "Wrong alignment on UBPW_UI_3StarCrosshair_C");
static_assert(sizeof(UBPW_UI_3StarCrosshair_C) == 0x000330, "Wrong size on UBPW_UI_3StarCrosshair_C");
static_assert(offsetof(UBPW_UI_3StarCrosshair_C, UberGraphFrame) == 0x0002F8, "Member 'UBPW_UI_3StarCrosshair_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPW_UI_3StarCrosshair_C, HitFatalAnimation) == 0x000300, "Member 'UBPW_UI_3StarCrosshair_C::HitFatalAnimation' has a wrong offset!");
static_assert(offsetof(UBPW_UI_3StarCrosshair_C, HitAnimation) == 0x000308, "Member 'UBPW_UI_3StarCrosshair_C::HitAnimation' has a wrong offset!");
static_assert(offsetof(UBPW_UI_3StarCrosshair_C, CrosshairLeft) == 0x000310, "Member 'UBPW_UI_3StarCrosshair_C::CrosshairLeft' has a wrong offset!");
static_assert(offsetof(UBPW_UI_3StarCrosshair_C, CrosshairRight) == 0x000318, "Member 'UBPW_UI_3StarCrosshair_C::CrosshairRight' has a wrong offset!");
static_assert(offsetof(UBPW_UI_3StarCrosshair_C, CrosshairTop) == 0x000320, "Member 'UBPW_UI_3StarCrosshair_C::CrosshairTop' has a wrong offset!");
static_assert(offsetof(UBPW_UI_3StarCrosshair_C, GameplayToHud) == 0x000328, "Member 'UBPW_UI_3StarCrosshair_C::GameplayToHud' has a wrong offset!");

}

