#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_QuestEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPW_QuestEntry.BPW_QuestEntry_C.ExecuteUbergraph_BPW_QuestEntry
// 0x0058 (0x0058 - 0x0000)
struct BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGWidget_SubquestEntry*               K2Node_Event__pSubquestEntry;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event__title;                               // 0x0010(0x0018)(ConstParm)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event__vSize;                               // 0x004C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry) == 0x000008, "Wrong alignment on BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry");
static_assert(sizeof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry) == 0x000058, "Wrong size on BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry");
static_assert(offsetof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry, EntryPoint) == 0x000000, "Member 'BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry, K2Node_Event__pSubquestEntry) == 0x000008, "Member 'BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry::K2Node_Event__pSubquestEntry' has a wrong offset!");
static_assert(offsetof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry, K2Node_Event__title) == 0x000010, "Member 'BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry::K2Node_Event__title' has a wrong offset!");
static_assert(offsetof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000028, "Member 'BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000030, "Member 'BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry, CallFunc_PlayAnimationForward_ReturnValue1) == 0x000038, "Member 'BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry::CallFunc_PlayAnimationForward_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry, K2Node_Event_Animation) == 0x000040, "Member 'BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry, K2Node_Event__vSize) == 0x00004C, "Member 'BPW_QuestEntry_C_ExecuteUbergraph_BPW_QuestEntry::K2Node_Event__vSize' has a wrong offset!");

// Function BPW_QuestEntry.BPW_QuestEntry_C.AddSubquestEntry
// 0x0008 (0x0008 - 0x0000)
struct BPW_QuestEntry_C_AddSubquestEntry final
{
public:
	class UBFGWidget_SubquestEntry*               _pSubquestEntry;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_QuestEntry_C_AddSubquestEntry) == 0x000008, "Wrong alignment on BPW_QuestEntry_C_AddSubquestEntry");
static_assert(sizeof(BPW_QuestEntry_C_AddSubquestEntry) == 0x000008, "Wrong size on BPW_QuestEntry_C_AddSubquestEntry");
static_assert(offsetof(BPW_QuestEntry_C_AddSubquestEntry, _pSubquestEntry) == 0x000000, "Member 'BPW_QuestEntry_C_AddSubquestEntry::_pSubquestEntry' has a wrong offset!");

// Function BPW_QuestEntry.BPW_QuestEntry_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct BPW_QuestEntry_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_QuestEntry_C_OnAnimationFinished) == 0x000008, "Wrong alignment on BPW_QuestEntry_C_OnAnimationFinished");
static_assert(sizeof(BPW_QuestEntry_C_OnAnimationFinished) == 0x000008, "Wrong size on BPW_QuestEntry_C_OnAnimationFinished");
static_assert(offsetof(BPW_QuestEntry_C_OnAnimationFinished, Animation) == 0x000000, "Member 'BPW_QuestEntry_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function BPW_QuestEntry.BPW_QuestEntry_C.SetSpacerSize
// 0x0008 (0x0008 - 0x0000)
struct BPW_QuestEntry_C_SetSpacerSize final
{
public:
	struct FVector2D                              _vSize;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_QuestEntry_C_SetSpacerSize) == 0x000004, "Wrong alignment on BPW_QuestEntry_C_SetSpacerSize");
static_assert(sizeof(BPW_QuestEntry_C_SetSpacerSize) == 0x000008, "Wrong size on BPW_QuestEntry_C_SetSpacerSize");
static_assert(offsetof(BPW_QuestEntry_C_SetSpacerSize, _vSize) == 0x000000, "Member 'BPW_QuestEntry_C_SetSpacerSize::_vSize' has a wrong offset!");

// Function BPW_QuestEntry.BPW_QuestEntry_C.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct BPW_QuestEntry_C_SetTitle final
{
public:
	class FText                                   _title;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPW_QuestEntry_C_SetTitle) == 0x000008, "Wrong alignment on BPW_QuestEntry_C_SetTitle");
static_assert(sizeof(BPW_QuestEntry_C_SetTitle) == 0x000018, "Wrong size on BPW_QuestEntry_C_SetTitle");
static_assert(offsetof(BPW_QuestEntry_C_SetTitle, _title) == 0x000000, "Member 'BPW_QuestEntry_C_SetTitle::_title' has a wrong offset!");

}

