#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_CC02_CapitolCarnage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_CC02_CapitolCarnage.CH_CC02_CapitolCarnage_C
// 0x0010 (0x0248 - 0x0238)
class UCH_CC02_CapitolCarnage_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DoOnce_AlmostVO;                                   // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DoOnce_HalfwayVO;                                  // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CH_CC02_CapitolCarnage(int32 EntryPoint);
	void BndEvt__07BAD5F7Minus409BDC3CMinus909B37A7Minus83BE03F2_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4A68656FMinus43B77142MinusA97FB698Minus7A5DFAFF_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__58CB9391Minus425C3F66Minus535DE5B9Minus2A0133EC_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__B86EDA5CMinus4135242AMinus229C4FBFMinus8AA10633_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature(class UBFGQuest_ElementWaitTime* _Element, int32 _Index, const struct FTimespan& _TimeLimit);
	void BndEvt__DDA9C4A2Minus41EA9E92MinusA73BFCA6MinusDDBF8724_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E8403F66Minus4D76EC24Minus3DAADD87MinusC630C2F0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E8403F66Minus4D76EC24Minus3DAADD87MinusC630C2F0_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E8403F66Minus4D76EC24Minus3DAADD87MinusC630C2F0_BFGK2Node_BoundQuestEvent_52_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E8403F66Minus4D76EC24Minus3DAADD87MinusC630C2F0_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_CC02_CapitolCarnage_C">();
	}
	static class UCH_CC02_CapitolCarnage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCH_CC02_CapitolCarnage_C>();
	}
};
static_assert(alignof(UCH_CC02_CapitolCarnage_C) == 0x000008, "Wrong alignment on UCH_CC02_CapitolCarnage_C");
static_assert(sizeof(UCH_CC02_CapitolCarnage_C) == 0x000248, "Wrong size on UCH_CC02_CapitolCarnage_C");
static_assert(offsetof(UCH_CC02_CapitolCarnage_C, UberGraphFrame) == 0x000238, "Member 'UCH_CC02_CapitolCarnage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCH_CC02_CapitolCarnage_C, DoOnce_AlmostVO) == 0x000240, "Member 'UCH_CC02_CapitolCarnage_C::DoOnce_AlmostVO' has a wrong offset!");
static_assert(offsetof(UCH_CC02_CapitolCarnage_C, DoOnce_HalfwayVO) == 0x000241, "Member 'UCH_CC02_CapitolCarnage_C::DoOnce_HalfwayVO' has a wrong offset!");

}

