#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_CC03_CapitolTour

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_CC03_CapitolTour.CH_CC03_CapitolTour_C
// 0x0010 (0x0248 - 0x0238)
class UCH_CC03_CapitolTour_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DoOnce_AlmostVO;                                   // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DoOnce_HalfwayVO;                                  // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CH_CC03_CapitolTour(int32 EntryPoint);
	void BndEvt__7E7AFE5FMinus46F909EBMinusA51DA2A3Minus16AAED86_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7E7AFE5FMinus46F909EBMinusA51DA2A3Minus16AAED86_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7E7AFE5FMinus46F909EBMinusA51DA2A3Minus16AAED86_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F862DFD4Minus4FEE58BDMinusE2F6F5ACMinusD942368B_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__0BAD2A89Minus4B5EE3E3MinusC7C6BE8DMinusBDCC53DE_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__83897182Minus40CA8869Minus703AFF92MinusC975ADC3_BFGK2Node_BoundQuestEvent_5_BFGActorEvent_ResourceValueCounted__DelegateSignature(class UBFGQuest_Element* _Element, float ValueAdded, float ValueTotal);
	void BndEvt__7E7AFE5FMinus46F909EBMinusA51DA2A3Minus16AAED86_BFGK2Node_BoundQuestEvent_11_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__9A337851Minus48B22AC0Minus72AB9A9BMinus83838763_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__BF1B4FEBMinus468F1C17Minus9B08C68CMinusDEFCD904_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature(class UBFGQuest_ElementWaitTime* _Element, int32 _Index, const struct FTimespan& _TimeLimit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_CC03_CapitolTour_C">();
	}
	static class UCH_CC03_CapitolTour_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCH_CC03_CapitolTour_C>();
	}
};
static_assert(alignof(UCH_CC03_CapitolTour_C) == 0x000008, "Wrong alignment on UCH_CC03_CapitolTour_C");
static_assert(sizeof(UCH_CC03_CapitolTour_C) == 0x000248, "Wrong size on UCH_CC03_CapitolTour_C");
static_assert(offsetof(UCH_CC03_CapitolTour_C, UberGraphFrame) == 0x000238, "Member 'UCH_CC03_CapitolTour_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCH_CC03_CapitolTour_C, DoOnce_AlmostVO) == 0x000240, "Member 'UCH_CC03_CapitolTour_C::DoOnce_AlmostVO' has a wrong offset!");
static_assert(offsetof(UCH_CC03_CapitolTour_C, DoOnce_HalfwayVO) == 0x000241, "Member 'UCH_CC03_CapitolTour_C::DoOnce_HalfwayVO' has a wrong offset!");

}

