#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_CC01_Deliver

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function CH_CC01_Deliver.CH_CC01_Deliver_C.ExecuteUbergraph_CH_CC01_Deliver
// 0x1A28 (0x1A28 - 0x0000)
struct CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0010(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0140(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x0278(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x03A8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x04DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x04E0(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x0610(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult5;                // 0x0741(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0742(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x0743(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x0748(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x0878(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult6;                // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult7;                // 0x09A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x09AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x09AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable8;                             // 0x09B0(0x0130)(ConstParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0AE0(0x0048)()
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult8;                // 0x0B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x0B29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2A[0x6];                                      // 0x0B2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable9;                             // 0x0B30(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable10;                            // 0x0C60(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult9;                // 0x0D90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult10;               // 0x0D91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x0D92(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x0D93(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D94[0x4];                                      // 0x0D94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable11;                            // 0x0D98(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable12;                            // 0x0EC8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult11;               // 0x0FF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult12;               // 0x0FF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x0FFA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x0FFB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FFC[0x4];                                      // 0x0FFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable13;                            // 0x1000(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable14;                            // 0x1130(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult13;               // 0x1260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult14;               // 0x1261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum13_CmpSuccess;                    // 0x1262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum14_CmpSuccess;                    // 0x1263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1264[0x4];                                     // 0x1264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable15;                            // 0x1268(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable16;                            // 0x1398(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult15;               // 0x14C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult16;               // 0x14C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum15_CmpSuccess;                    // 0x14CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum16_CmpSuccess;                    // 0x14CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14CC[0x4];                                     // 0x14CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable17;                            // 0x14D0(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable18;                            // 0x1600(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult17;               // 0x1730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult18;               // 0x1731(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum17_CmpSuccess;                    // 0x1732(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum18_CmpSuccess;                    // 0x1733(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1734[0x4];                                     // 0x1734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable19;                            // 0x1738(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement8;              // 0x1868(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex1;       // 0x1870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue1;                // 0x1874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal1;                // 0x1878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_187C[0x4];                                     // 0x187C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext1;          // 0x1880(0x0050)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult19;               // 0x18D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x18D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum19_CmpSuccess;                    // 0x18D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D3[0x5];                                     // 0x18D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Challenge*                    CallFunc_GetChallenge_ReturnValue;                 // 0x18D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement7;              // 0x18E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x18E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18E9[0x3];                                     // 0x18E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentScore_ReturnValue;              // 0x18EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGDataAsset_ChallengeInfo*            CallFunc_GetChallengeAsset_ReturnValue;            // 0x18F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x18F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x18FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18FD[0x3];                                     // 0x18FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue1;        // 0x1900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x1904(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x1908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1909[0x3];                                     // 0x1909(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x190C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue2;        // 0x1910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x1914(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x1915(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x1916(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1917[0x1];                                     // 0x1917(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue3;        // 0x1918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x191C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191D[0x3];                                     // 0x191D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x1920(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_ElementWaitTime*              BFGK2Node_BoundQuestEvent__Element;                // 0x1928(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__Index;                  // 0x1930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1934[0x4];                                     // 0x1934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              BFGK2Node_BoundQuestEvent__TimeLimit;              // 0x1938(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue4;        // 0x1940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x1944(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger5_CmpSuccess;                  // 0x1945(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1946[0x2];                                     // 0x1946(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue5;        // 0x1948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger6_CmpSuccess;                  // 0x194C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_194D[0x3];                                     // 0x194D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x1950(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex;        // 0x1958(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue;                 // 0x195C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal;                 // 0x1960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1964[0x4];                                     // 0x1964(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext;           // 0x1968(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x19B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x19C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19C1[0x7];                                     // 0x19C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x19C8(0x0048)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x1A10(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x1A18(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x1A20(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver) == 0x000008, "Wrong alignment on CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver");
static_assert(sizeof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver) == 0x001A28, "Wrong size on CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, EntryPoint) == 0x000000, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__pElement) == 0x000008, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__pElement' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable) == 0x000010, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable1) == 0x000140, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult) == 0x000270, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult1) == 0x000271, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum_CmpSuccess) == 0x000272, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum1_CmpSuccess) == 0x000273, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable2) == 0x000278, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable3) == 0x0003A8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult2) == 0x0004D8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult2' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult3) == 0x0004D9, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult3' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum2_CmpSuccess) == 0x0004DA, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum3_CmpSuccess) == 0x0004DB, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable4) == 0x0004E0, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable5) == 0x000610, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult4) == 0x000740, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult4' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult5) == 0x000741, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult5' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum4_CmpSuccess) == 0x000742, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum5_CmpSuccess) == 0x000743, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable6) == 0x000748, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable7) == 0x000878, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult6) == 0x0009A8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult6' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult7) == 0x0009A9, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult7' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum6_CmpSuccess) == 0x0009AA, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum7_CmpSuccess) == 0x0009AB, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable8) == 0x0009B0, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000AE0, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult8) == 0x000B28, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult8' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum8_CmpSuccess) == 0x000B29, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum8_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable9) == 0x000B30, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable10) == 0x000C60, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable10' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult9) == 0x000D90, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult9' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult10) == 0x000D91, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult10' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum9_CmpSuccess) == 0x000D92, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum9_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum10_CmpSuccess) == 0x000D93, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum10_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable11) == 0x000D98, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable11' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable12) == 0x000EC8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable12' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult11) == 0x000FF8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult11' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult12) == 0x000FF9, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult12' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum11_CmpSuccess) == 0x000FFA, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum11_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum12_CmpSuccess) == 0x000FFB, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum12_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable13) == 0x001000, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable13' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable14) == 0x001130, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable14' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult13) == 0x001260, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult13' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult14) == 0x001261, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult14' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum13_CmpSuccess) == 0x001262, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum13_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum14_CmpSuccess) == 0x001263, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum14_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable15) == 0x001268, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable15' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable16) == 0x001398, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable16' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult15) == 0x0014C8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult15' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult16) == 0x0014C9, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult16' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum15_CmpSuccess) == 0x0014CA, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum15_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum16_CmpSuccess) == 0x0014CB, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum16_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable17) == 0x0014D0, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable17' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable18) == 0x001600, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable18' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult17) == 0x001730, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult17' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult18) == 0x001731, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult18' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum17_CmpSuccess) == 0x001732, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum17_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum18_CmpSuccess) == 0x001733, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum18_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, Temp_struct_Variable19) == 0x001738, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::Temp_struct_Variable19' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__pElement8) == 0x001868, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__pElement8' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__iObjectiveIndex1) == 0x001870, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__iObjectiveIndex1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__iValue1) == 0x001874, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__iValue1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__iTotal1) == 0x001878, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__iTotal1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__eventContext1) == 0x001880, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__eventContext1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_PlayVoiceover__outResult19) == 0x0018D0, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_PlayVoiceover__outResult19' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0018D1, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchEnum19_CmpSuccess) == 0x0018D2, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchEnum19_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_GetChallenge_ReturnValue) == 0x0018D8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_GetChallenge_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__pElement7) == 0x0018E0, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__pElement7' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_IsValid_ReturnValue) == 0x0018E8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_GetCurrentScore_ReturnValue) == 0x0018EC, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_GetCurrentScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_GetChallengeAsset_ReturnValue) == 0x0018F0, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_GetChallengeAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0018F8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchInteger_CmpSuccess) == 0x0018FC, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_RandomIntegerInRange_ReturnValue1) == 0x001900, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_RandomIntegerInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_Conv_IntToFloat_ReturnValue) == 0x001904, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchInteger1_CmpSuccess) == 0x001908, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchInteger1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00190C, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_RandomIntegerInRange_ReturnValue2) == 0x001910, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_RandomIntegerInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x001914, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchInteger2_CmpSuccess) == 0x001915, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x001916, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_RandomIntegerInRange_ReturnValue3) == 0x001918, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_RandomIntegerInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchInteger3_CmpSuccess) == 0x00191C, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__pElement6) == 0x001920, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__pElement6' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__Element) == 0x001928, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__Element' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__Index) == 0x001930, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__Index' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__TimeLimit) == 0x001938, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__TimeLimit' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_RandomIntegerInRange_ReturnValue4) == 0x001940, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_RandomIntegerInRange_ReturnValue4' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchInteger4_CmpSuccess) == 0x001944, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchInteger5_CmpSuccess) == 0x001945, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchInteger5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_RandomIntegerInRange_ReturnValue5) == 0x001948, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_RandomIntegerInRange_ReturnValue5' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, K2Node_SwitchInteger6_CmpSuccess) == 0x00194C, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::K2Node_SwitchInteger6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__pElement5) == 0x001950, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__pElement5' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__iObjectiveIndex) == 0x001958, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__iValue) == 0x00195C, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__iValue' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__iTotal) == 0x001960, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__iTotal' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__eventContext) == 0x001968, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__eventContext' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__pElement4) == 0x0019B8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__pElement4' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x0019C0, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, CallFunc_MakeGameplayTagQuery_ReturnValue1) == 0x0019C8, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::CallFunc_MakeGameplayTagQuery_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__pElement3) == 0x001A10, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__pElement3' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__pElement2) == 0x001A18, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__pElement2' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver, BFGK2Node_BoundQuestEvent__pElement1) == 0x001A20, "Member 'CH_CC01_Deliver_C_ExecuteUbergraph_CH_CC01_Deliver::BFGK2Node_BoundQuestEvent__pElement1' has a wrong offset!");

// Function CH_CC01_Deliver.CH_CC01_Deliver_C.BndEvt__029C0026-411485D6-AF55F084-7F6F0362_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_CC01_Deliver.CH_CC01_Deliver_C.BndEvt__029C0026-411485D6-AF55F084-7F6F0362_BFGK2Node_BoundQuestEvent_116_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_116_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_116_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_116_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_116_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_116_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_116_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_116_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_CC01_Deliver.CH_CC01_Deliver_C.BndEvt__029C0026-411485D6-AF55F084-7F6F0362_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_CC01_Deliver.CH_CC01_Deliver_C.BndEvt__029C0026-411485D6-AF55F084-7F6F0362_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_CC01_Deliver_C_BndEvt__029C0026Minus411485D6MinusAF55F084Minus7F6F0362_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_CC01_Deliver.CH_CC01_Deliver_C.BndEvt__6E45D51D-45D2E964-E3A9BDBB-55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature final
{
public:
	class UBFGQuest_ElementWaitTime*              _Element;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Index;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              _TimeLimit;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature) == 0x000008, "Wrong alignment on CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature");
static_assert(sizeof(CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature) == 0x000018, "Wrong size on CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature");
static_assert(offsetof(CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature, _Element) == 0x000000, "Member 'CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature::_Element' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature, _Index) == 0x000008, "Member 'CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature::_Index' has a wrong offset!");
static_assert(offsetof(CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature, _TimeLimit) == 0x000010, "Member 'CH_CC01_Deliver_C_BndEvt__6E45D51DMinus45D2E964MinusE3A9BDBBMinus55911092_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature::_TimeLimit' has a wrong offset!");

// Function CH_CC01_Deliver.CH_CC01_Deliver_C.BndEvt__838CD10B-4761AA80-084F41AE-DAFE9208_BFGK2Node_BoundQuestEvent_16_BFGQuestElement_Event_VarCounter__DelegateSignature
// 0x0068 (0x0068 - 0x0000)
struct CH_CC01_Deliver_C_BndEvt__838CD10BMinus4761AA80Minus084F41AEMinusDAFE9208_BFGK2Node_BoundQuestEvent_16_BFGQuestElement_Event_VarCounter__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iObjectiveIndex;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iValue;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iTotal;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       _eventContext;                                     // 0x0018(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CH_CC01_Deliver_C_BndEvt__838CD10BMinus4761AA80Minus084F41AEMinusDAFE9208_BFGK2Node_BoundQuestEvent_16_BFGQuestElement_Event_VarCounter__DelegateSignature) == 0x000008, "Wrong alignment on CH_CC01_Deliver_C_BndEvt__838CD10BMinus4761AA80Minus084F41AEMinusDAFE9208_BFGK2Node_BoundQuestEvent_16_BFGQuestElement_Event_VarCounter__DelegateSignature");
