#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_RW03_CruisingThroughTown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_RW03_CruisingThroughTown.CH_RW03_CruisingThroughTown_C
// 0x0010 (0x0248 - 0x0238)
class UCH_RW03_CruisingThroughTown_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DoOnce_AlmostVO;                                   // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DoOnce_HalfwayVO;                                  // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CH_RW03_CruisingThroughTown(int32 EntryPoint);
	void BndEvt__A2567D92Minus46317EB2Minus4A390A80Minus76A9B6E7_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__A2567D92Minus46317EB2Minus4A390A80Minus76A9B6E7_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__A2567D92Minus46317EB2Minus4A390A80Minus76A9B6E7_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__8B603EEEMinus457D487FMinus52AFD3A1MinusCA2DEF62_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__BF1C09F4Minus43A6F606MinusE84531B6Minus88956A5C_BFGK2Node_BoundQuestEvent_76_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__A2567D92Minus46317EB2Minus4A390A80Minus76A9B6E7_BFGK2Node_BoundQuestEvent_104_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__8BD04E71Minus4DC6F349Minus739C32ADMinus23F7FFB6_BFGK2Node_BoundQuestEvent_0_BFGActorEvent_ResourceValueCounted__DelegateSignature(class UBFGQuest_Element* _Element, float ValueAdded, float ValueTotal);
	void BndEvt__58DA3BDBMinus4305249DMinus93EC2381Minus2E82425C_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature(class UBFGQuest_ElementWaitTime* _Element, int32 _Index, const struct FTimespan& _TimeLimit);
	void BndEvt__D23F44E2Minus4220F216MinusF642B291Minus56E44158_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_RW03_CruisingThroughTown_C">();
	}
	static class UCH_RW03_CruisingThroughTown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCH_RW03_CruisingThroughTown_C>();
	}
};
static_assert(alignof(UCH_RW03_CruisingThroughTown_C) == 0x000008, "Wrong alignment on UCH_RW03_CruisingThroughTown_C");
static_assert(sizeof(UCH_RW03_CruisingThroughTown_C) == 0x000248, "Wrong size on UCH_RW03_CruisingThroughTown_C");
static_assert(offsetof(UCH_RW03_CruisingThroughTown_C, UberGraphFrame) == 0x000238, "Member 'UCH_RW03_CruisingThroughTown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCH_RW03_CruisingThroughTown_C, DoOnce_AlmostVO) == 0x000240, "Member 'UCH_RW03_CruisingThroughTown_C::DoOnce_AlmostVO' has a wrong offset!");
static_assert(offsetof(UCH_RW03_CruisingThroughTown_C, DoOnce_HalfwayVO) == 0x000241, "Member 'UCH_RW03_CruisingThroughTown_C::DoOnce_HalfwayVO' has a wrong offset!");

}

