#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_SM06_TBD

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function CH_SM06_TBD.CH_SM06_TBD_C.ExecuteUbergraph_CH_SM06_TBD
// 0x1A28 (0x1A28 - 0x0000)
struct CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0008(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0138(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x0270(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x03A0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x04D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x04D8(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x0608(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult5;                // 0x0739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x073A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x073B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x0740(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x0870(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult6;                // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult7;                // 0x09A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x09A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x09A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A4[0x4];                                      // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable8;                             // 0x09A8(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable9;                             // 0x0AD8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult8;                // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult9;                // 0x0C09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x0C0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x0C0B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C0C[0x4];                                      // 0x0C0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable10;                            // 0x0C10(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable11;                            // 0x0D40(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult10;               // 0x0E70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult11;               // 0x0E71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x0E72(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x0E73(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable12;                            // 0x0E78(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable13;                            // 0x0FA8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult12;               // 0x10D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult13;               // 0x10D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x10DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum13_CmpSuccess;                    // 0x10DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10DC[0x4];                                     // 0x10DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable14;                            // 0x10E0(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable15;                            // 0x1210(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult14;               // 0x1340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult15;               // 0x1341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum14_CmpSuccess;                    // 0x1342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum15_CmpSuccess;                    // 0x1343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1344[0x4];                                     // 0x1344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable16;                            // 0x1348(0x0130)(ConstParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x1478(0x0048)()
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult16;               // 0x14C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum16_CmpSuccess;                    // 0x14C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14C2[0x6];                                     // 0x14C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable17;                            // 0x14C8(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable18;                            // 0x15F8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult17;               // 0x1728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult18;               // 0x1729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum17_CmpSuccess;                    // 0x172A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum18_CmpSuccess;                    // 0x172B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172C[0x4];                                     // 0x172C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x1730(0x0048)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement8;              // 0x1778(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement7;              // 0x1780(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex1;       // 0x1788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue1;                // 0x178C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal1;                // 0x1790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1794[0x4];                                     // 0x1794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext1;          // 0x1798(0x0050)(ConstParm)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x17E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x17EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x17ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17EE[0x2];                                     // 0x17EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Challenge*                    CallFunc_GetChallenge_ReturnValue;                 // 0x17F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue1;        // 0x17F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x17FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x17FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17FE[0x2];                                     // 0x17FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentScore_ReturnValue;              // 0x1800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1804[0x4];                                     // 0x1804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGDataAsset_ChallengeInfo*            CallFunc_GetChallengeAsset_ReturnValue;            // 0x1808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x1810(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue2;        // 0x1818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x181C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181D[0x3];                                     // 0x181D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x1820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue3;        // 0x1824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x1828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x182C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x182D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x182E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182F[0x1];                                     // 0x182F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x1830(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_ElementWaitTime*              BFGK2Node_BoundQuestEvent__Element;                // 0x1838(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__Index;                  // 0x1840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1844[0x4];                                     // 0x1844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              BFGK2Node_BoundQuestEvent__TimeLimit;              // 0x1848(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue4;        // 0x1850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x1854(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger5_CmpSuccess;                  // 0x1855(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1856[0x2];                                     // 0x1856(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue5;        // 0x1858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger6_CmpSuccess;                  // 0x185C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185D[0x3];                                     // 0x185D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x1860(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex;        // 0x1868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue;                 // 0x186C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal;                 // 0x1870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1874[0x4];                                     // 0x1874(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext;           // 0x1878(0x0050)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x18C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18C9[0x7];                                     // 0x18C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x18D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable19;                            // 0x18D8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult19;               // 0x1A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum19_CmpSuccess;                    // 0x1A09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A0A[0x6];                                     // 0x1A0A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x1A10(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x1A18(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x1A20(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD) == 0x000008, "Wrong alignment on CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD");
static_assert(sizeof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD) == 0x001A28, "Wrong size on CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, EntryPoint) == 0x000000, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable) == 0x000008, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable1) == 0x000138, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult) == 0x000268, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult1) == 0x000269, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum_CmpSuccess) == 0x00026A, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum1_CmpSuccess) == 0x00026B, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable2) == 0x000270, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable3) == 0x0003A0, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult2) == 0x0004D0, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult2' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult3) == 0x0004D1, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult3' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum2_CmpSuccess) == 0x0004D2, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum3_CmpSuccess) == 0x0004D3, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable4) == 0x0004D8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable5) == 0x000608, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult4) == 0x000738, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult4' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult5) == 0x000739, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult5' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum4_CmpSuccess) == 0x00073A, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum5_CmpSuccess) == 0x00073B, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable6) == 0x000740, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable7) == 0x000870, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult6) == 0x0009A0, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult6' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult7) == 0x0009A1, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult7' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum6_CmpSuccess) == 0x0009A2, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum7_CmpSuccess) == 0x0009A3, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable8) == 0x0009A8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable9) == 0x000AD8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult8) == 0x000C08, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult8' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult9) == 0x000C09, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult9' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum8_CmpSuccess) == 0x000C0A, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum8_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum9_CmpSuccess) == 0x000C0B, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum9_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable10) == 0x000C10, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable10' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable11) == 0x000D40, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable11' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult10) == 0x000E70, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult10' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult11) == 0x000E71, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult11' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum10_CmpSuccess) == 0x000E72, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum10_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum11_CmpSuccess) == 0x000E73, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum11_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable12) == 0x000E78, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable12' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable13) == 0x000FA8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable13' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult12) == 0x0010D8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult12' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult13) == 0x0010D9, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult13' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum12_CmpSuccess) == 0x0010DA, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum12_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum13_CmpSuccess) == 0x0010DB, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum13_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable14) == 0x0010E0, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable14' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable15) == 0x001210, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable15' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult14) == 0x001340, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult14' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult15) == 0x001341, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult15' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum14_CmpSuccess) == 0x001342, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum14_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum15_CmpSuccess) == 0x001343, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum15_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable16) == 0x001348, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable16' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x001478, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult16) == 0x0014C0, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult16' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum16_CmpSuccess) == 0x0014C1, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum16_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable17) == 0x0014C8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable17' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable18) == 0x0015F8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable18' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult17) == 0x001728, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult17' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult18) == 0x001729, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult18' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum17_CmpSuccess) == 0x00172A, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum17_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum18_CmpSuccess) == 0x00172B, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum18_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_MakeGameplayTagQuery_ReturnValue1) == 0x001730, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_MakeGameplayTagQuery_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__pElement8) == 0x001778, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__pElement8' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__pElement7) == 0x001780, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__pElement7' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__iObjectiveIndex1) == 0x001788, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__iObjectiveIndex1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__iValue1) == 0x00178C, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__iValue1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__iTotal1) == 0x001790, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__iTotal1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__eventContext1) == 0x001798, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__eventContext1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0017E8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0017EC, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchInteger_CmpSuccess) == 0x0017ED, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_GetChallenge_ReturnValue) == 0x0017F0, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_GetChallenge_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_RandomIntegerInRange_ReturnValue1) == 0x0017F8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_RandomIntegerInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_IsValid_ReturnValue) == 0x0017FC, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchInteger1_CmpSuccess) == 0x0017FD, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchInteger1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_GetCurrentScore_ReturnValue) == 0x001800, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_GetCurrentScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_GetChallengeAsset_ReturnValue) == 0x001808, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_GetChallengeAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__pElement6) == 0x001810, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__pElement6' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_RandomIntegerInRange_ReturnValue2) == 0x001818, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_RandomIntegerInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchInteger2_CmpSuccess) == 0x00181C, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_Conv_IntToFloat_ReturnValue) == 0x001820, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_RandomIntegerInRange_ReturnValue3) == 0x001824, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_RandomIntegerInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_Divide_FloatFloat_ReturnValue) == 0x001828, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchInteger3_CmpSuccess) == 0x00182C, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00182D, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x00182E, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__pElement5) == 0x001830, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__pElement5' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__Element) == 0x001838, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__Element' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__Index) == 0x001840, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__Index' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__TimeLimit) == 0x001848, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__TimeLimit' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_RandomIntegerInRange_ReturnValue4) == 0x001850, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_RandomIntegerInRange_ReturnValue4' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchInteger4_CmpSuccess) == 0x001854, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchInteger5_CmpSuccess) == 0x001855, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchInteger5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_RandomIntegerInRange_ReturnValue5) == 0x001858, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_RandomIntegerInRange_ReturnValue5' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchInteger6_CmpSuccess) == 0x00185C, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchInteger6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__pElement4) == 0x001860, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__pElement4' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__iObjectiveIndex) == 0x001868, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__iValue) == 0x00186C, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__iValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__iTotal) == 0x001870, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__iTotal' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__eventContext) == 0x001878, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__eventContext' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x0018C8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__pElement3) == 0x0018D0, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__pElement3' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, Temp_struct_Variable19) == 0x0018D8, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::Temp_struct_Variable19' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, CallFunc_PlayVoiceover__outResult19) == 0x001A08, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::CallFunc_PlayVoiceover__outResult19' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, K2Node_SwitchEnum19_CmpSuccess) == 0x001A09, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::K2Node_SwitchEnum19_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__pElement2) == 0x001A10, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__pElement2' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__pElement1) == 0x001A18, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__pElement1' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD, BFGK2Node_BoundQuestEvent__pElement) == 0x001A20, "Member 'CH_SM06_TBD_C_ExecuteUbergraph_CH_SM06_TBD::BFGK2Node_BoundQuestEvent__pElement' has a wrong offset!");

// Function CH_SM06_TBD.CH_SM06_TBD_C.BndEvt__32931AF3-4FA9B2EA-33D130B7-30667C21_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM06_TBD_C_BndEvt__32931AF3Minus4FA9B2EAMinus33D130B7Minus30667C21_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM06_TBD_C_BndEvt__32931AF3Minus4FA9B2EAMinus33D130B7Minus30667C21_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM06_TBD_C_BndEvt__32931AF3Minus4FA9B2EAMinus33D130B7Minus30667C21_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM06_TBD_C_BndEvt__32931AF3Minus4FA9B2EAMinus33D130B7Minus30667C21_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM06_TBD_C_BndEvt__32931AF3Minus4FA9B2EAMinus33D130B7Minus30667C21_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__32931AF3Minus4FA9B2EAMinus33D130B7Minus30667C21_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM06_TBD_C_BndEvt__32931AF3Minus4FA9B2EAMinus33D130B7Minus30667C21_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM06_TBD.CH_SM06_TBD_C.BndEvt__9D3E96DB-46B55F31-DB943887-C29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature
// 0x0068 (0x0068 - 0x0000)
struct CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iObjectiveIndex;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iValue;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iTotal;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       _eventContext;                                     // 0x0018(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature");
static_assert(sizeof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature) == 0x000068, "Wrong size on CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature::_pElement' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature, _iObjectiveIndex) == 0x000008, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature::_iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature, _iValue) == 0x00000C, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature::_iValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature, _iTotal) == 0x000010, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature::_iTotal' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature, _eventContext) == 0x000018, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature::_eventContext' has a wrong offset!");

// Function CH_SM06_TBD.CH_SM06_TBD_C.BndEvt__9D3E96DB-46B55F31-DB943887-C29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature
// 0x0068 (0x0068 - 0x0000)
struct CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iObjectiveIndex;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iValue;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iTotal;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       _eventContext;                                     // 0x0018(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature");
static_assert(sizeof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature) == 0x000068, "Wrong size on CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_pElement' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _iObjectiveIndex) == 0x000008, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _iValue) == 0x00000C, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_iValue' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _iTotal) == 0x000010, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_iTotal' has a wrong offset!");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _eventContext) == 0x000018, "Member 'CH_SM06_TBD_C_BndEvt__9D3E96DBMinus46B55F31MinusDB943887MinusC29DFBEC_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_eventContext' has a wrong offset!");

// Function CH_SM06_TBD.CH_SM06_TBD_C.BndEvt__BF3ADED3-452F3C35-5E4DC18F-CF21B7E1_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM06_TBD_C_BndEvt__BF3ADED3Minus452F3C35Minus5E4DC18FMinusCF21B7E1_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM06_TBD_C_BndEvt__BF3ADED3Minus452F3C35Minus5E4DC18FMinusCF21B7E1_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM06_TBD_C_BndEvt__BF3ADED3Minus452F3C35Minus5E4DC18FMinusCF21B7E1_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM06_TBD_C_BndEvt__BF3ADED3Minus452F3C35Minus5E4DC18FMinusCF21B7E1_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM06_TBD_C_BndEvt__BF3ADED3Minus452F3C35Minus5E4DC18FMinusCF21B7E1_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__BF3ADED3Minus452F3C35Minus5E4DC18FMinusCF21B7E1_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM06_TBD_C_BndEvt__BF3ADED3Minus452F3C35Minus5E4DC18FMinusCF21B7E1_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM06_TBD.CH_SM06_TBD_C.BndEvt__D16115FA-4A34B3E4-124334BD-E5F9759C_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM06_TBD_C_BndEvt__D16115FAMinus4A34B3E4Minus124334BDMinusE5F9759C_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM06_TBD_C_BndEvt__D16115FAMinus4A34B3E4Minus124334BDMinusE5F9759C_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM06_TBD_C_BndEvt__D16115FAMinus4A34B3E4Minus124334BDMinusE5F9759C_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM06_TBD_C_BndEvt__D16115FAMinus4A34B3E4Minus124334BDMinusE5F9759C_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM06_TBD_C_BndEvt__D16115FAMinus4A34B3E4Minus124334BDMinusE5F9759C_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM06_TBD_C_BndEvt__D16115FAMinus4A34B3E4Minus124334BDMinusE5F9759C_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM06_TBD_C_BndEvt__D16115FAMinus4A34B3E4Minus124334BDMinusE5F9759C_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM06_TBD.CH_SM06_TBD_C.BndEvt__D5326122-492B9908-C8D29B94-D13C50F6_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
