#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_SM01_ModestaMassacre

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BFGCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function CH_SM01_ModestaMassacre.CH_SM01_ModestaMassacre_C.ExecuteUbergraph_CH_SM01_ModestaMassacre
// 0x1628 (0x1628 - 0x0000)
struct CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0008(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0138(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x0270(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x03A0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x04D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x04D8(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x0608(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult5;                // 0x0739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x073A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x073B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x0740(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x0870(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult6;                // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult7;                // 0x09A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x09A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x09A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A4[0x4];                                      // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable8;                             // 0x09A8(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable9;                             // 0x0AD8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult8;                // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult9;                // 0x0C09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x0C0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x0C0B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C0C[0x4];                                      // 0x0C0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable10;                            // 0x0C10(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable11;                            // 0x0D40(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult10;               // 0x0E70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult11;               // 0x0E71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x0E72(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x0E73(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable12;                            // 0x0E78(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable13;                            // 0x0FA8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult12;               // 0x10D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult13;               // 0x10D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x10DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum13_CmpSuccess;                    // 0x10DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10DC[0x4];                                     // 0x10DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x10E0(0x0048)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable14;                            // 0x1128(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult14;               // 0x1258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1259[0x7];                                     // 0x1259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable15;                            // 0x1260(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum14_CmpSuccess;                    // 0x1390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult15;               // 0x1391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1392[0x6];                                     // 0x1392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable16;                            // 0x1398(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum15_CmpSuccess;                    // 0x14C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult16;               // 0x14C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum16_CmpSuccess;                    // 0x14CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14CB[0x1];                                     // 0x14CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x14CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue1;        // 0x14D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x14D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x14D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D6[0x2];                                     // 0x14D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue2;        // 0x14D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x14DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14DD[0x3];                                     // 0x14DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement7;              // 0x14E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_ElementWaitTime*              BFGK2Node_BoundQuestEvent__Element;                // 0x14E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__Index;                  // 0x14F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14F4[0x4];                                     // 0x14F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              BFGK2Node_BoundQuestEvent__TimeLimit;              // 0x14F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue3;        // 0x1500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x1504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x1505(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1506[0x2];                                     // 0x1506(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue4;        // 0x1508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger5_CmpSuccess;                  // 0x150C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_150D[0x3];                                     // 0x150D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x1510(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x1518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex;        // 0x1520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue;                 // 0x1524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal;                 // 0x1528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152C[0x4];                                     // 0x152C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext;           // 0x1530(0x0050)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x1580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1581[0x7];                                     // 0x1581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Challenge*                    CallFunc_GetChallenge_ReturnValue;                 // 0x1588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x1590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1591[0x3];                                     // 0x1591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentScore_ReturnValue;              // 0x1594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGDataAsset_ChallengeInfo*            CallFunc_GetChallengeAsset_ReturnValue;            // 0x1598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x15A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x15A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x15B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B4[0x4];                                     // 0x15B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x15B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x15C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C4[0x4];                                     // 0x15C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x15C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x15D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x15D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D2[0x6];                                     // 0x15D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x15D8(0x0048)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x1620(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre) == 0x000008, "Wrong alignment on CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre");
static_assert(sizeof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre) == 0x001628, "Wrong size on CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, EntryPoint) == 0x000000, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable) == 0x000008, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable1) == 0x000138, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult) == 0x000268, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult1) == 0x000269, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum_CmpSuccess) == 0x00026A, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum1_CmpSuccess) == 0x00026B, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable2) == 0x000270, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable3) == 0x0003A0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult2) == 0x0004D0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult2' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult3) == 0x0004D1, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult3' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum2_CmpSuccess) == 0x0004D2, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum3_CmpSuccess) == 0x0004D3, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable4) == 0x0004D8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable5) == 0x000608, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult4) == 0x000738, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult4' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult5) == 0x000739, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult5' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum4_CmpSuccess) == 0x00073A, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum5_CmpSuccess) == 0x00073B, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable6) == 0x000740, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable7) == 0x000870, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult6) == 0x0009A0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult6' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult7) == 0x0009A1, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult7' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum6_CmpSuccess) == 0x0009A2, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum7_CmpSuccess) == 0x0009A3, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable8) == 0x0009A8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable9) == 0x000AD8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult8) == 0x000C08, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult8' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult9) == 0x000C09, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult9' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum8_CmpSuccess) == 0x000C0A, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum8_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum9_CmpSuccess) == 0x000C0B, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum9_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable10) == 0x000C10, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable10' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable11) == 0x000D40, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable11' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult10) == 0x000E70, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult10' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult11) == 0x000E71, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult11' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum10_CmpSuccess) == 0x000E72, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum10_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum11_CmpSuccess) == 0x000E73, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum11_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable12) == 0x000E78, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable12' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable13) == 0x000FA8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable13' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult12) == 0x0010D8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult12' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult13) == 0x0010D9, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult13' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum12_CmpSuccess) == 0x0010DA, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum12_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum13_CmpSuccess) == 0x0010DB, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum13_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x0010E0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable14) == 0x001128, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable14' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult14) == 0x001258, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult14' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable15) == 0x001260, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable15' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum14_CmpSuccess) == 0x001390, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum14_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult15) == 0x001391, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult15' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, Temp_struct_Variable16) == 0x001398, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::Temp_struct_Variable16' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum15_CmpSuccess) == 0x0014C8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum15_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_PlayVoiceover__outResult16) == 0x0014C9, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_PlayVoiceover__outResult16' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchEnum16_CmpSuccess) == 0x0014CA, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchEnum16_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0014CC, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_RandomIntegerInRange_ReturnValue1) == 0x0014D0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_RandomIntegerInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchInteger_CmpSuccess) == 0x0014D4, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchInteger1_CmpSuccess) == 0x0014D5, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchInteger1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_RandomIntegerInRange_ReturnValue2) == 0x0014D8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_RandomIntegerInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchInteger2_CmpSuccess) == 0x0014DC, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__pElement7) == 0x0014E0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__pElement7' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__Element) == 0x0014E8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__Element' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__Index) == 0x0014F0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__Index' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__TimeLimit) == 0x0014F8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__TimeLimit' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_RandomIntegerInRange_ReturnValue3) == 0x001500, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_RandomIntegerInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchInteger3_CmpSuccess) == 0x001504, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchInteger4_CmpSuccess) == 0x001505, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_RandomIntegerInRange_ReturnValue4) == 0x001508, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_RandomIntegerInRange_ReturnValue4' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, K2Node_SwitchInteger5_CmpSuccess) == 0x00150C, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::K2Node_SwitchInteger5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__pElement6) == 0x001510, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__pElement6' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__pElement5) == 0x001518, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__pElement5' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__iObjectiveIndex) == 0x001520, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__iValue) == 0x001524, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__iValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__iTotal) == 0x001528, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__iTotal' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__eventContext) == 0x001530, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__eventContext' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x001580, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_GetChallenge_ReturnValue) == 0x001588, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_GetChallenge_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_IsValid_ReturnValue) == 0x001590, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_GetCurrentScore_ReturnValue) == 0x001594, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_GetCurrentScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_GetChallengeAsset_ReturnValue) == 0x001598, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_GetChallengeAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__pElement4) == 0x0015A0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__pElement4' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__pElement3) == 0x0015A8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__pElement3' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0015B0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__pElement2) == 0x0015B8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__pElement2' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0015C0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__pElement1) == 0x0015C8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__pElement1' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0015D0, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x0015D1, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, CallFunc_MakeGameplayTagQuery_ReturnValue1) == 0x0015D8, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::CallFunc_MakeGameplayTagQuery_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre, BFGK2Node_BoundQuestEvent__pElement) == 0x001620, "Member 'CH_SM01_ModestaMassacre_C_ExecuteUbergraph_CH_SM01_ModestaMassacre::BFGK2Node_BoundQuestEvent__pElement' has a wrong offset!");

// Function CH_SM01_ModestaMassacre.CH_SM01_ModestaMassacre_C.BndEvt__464217A6-4E3F0797-52691699-39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature final
{
public:
	class UBFGQuest_ElementWaitTime*              _Element;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Index;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              _TimeLimit;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature");
static_assert(sizeof(CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature) == 0x000018, "Wrong size on CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature, _Element) == 0x000000, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature::_Element' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature, _Index) == 0x000008, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature::_Index' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature, _TimeLimit) == 0x000010, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__464217A6Minus4E3F0797Minus52691699Minus39C0932E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature::_TimeLimit' has a wrong offset!");

// Function CH_SM01_ModestaMassacre.CH_SM01_ModestaMassacre_C.BndEvt__9399D43C-4D9209C9-ABEA2594-240214DB_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM01_ModestaMassacre_C_BndEvt__9399D43CMinus4D9209C9MinusABEA2594Minus240214DB_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM01_ModestaMassacre_C_BndEvt__9399D43CMinus4D9209C9MinusABEA2594Minus240214DB_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM01_ModestaMassacre_C_BndEvt__9399D43CMinus4D9209C9MinusABEA2594Minus240214DB_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM01_ModestaMassacre_C_BndEvt__9399D43CMinus4D9209C9MinusABEA2594Minus240214DB_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM01_ModestaMassacre_C_BndEvt__9399D43CMinus4D9209C9MinusABEA2594Minus240214DB_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__9399D43CMinus4D9209C9MinusABEA2594Minus240214DB_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__9399D43CMinus4D9209C9MinusABEA2594Minus240214DB_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM01_ModestaMassacre.CH_SM01_ModestaMassacre_C.BndEvt__97D76876-49F1C30C-689D9580-8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature
// 0x0068 (0x0068 - 0x0000)
struct CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iObjectiveIndex;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iValue;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iTotal;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       _eventContext;                                     // 0x0018(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature");
static_assert(sizeof(CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature) == 0x000068, "Wrong size on CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_pElement' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _iObjectiveIndex) == 0x000008, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _iValue) == 0x00000C, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_iValue' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _iTotal) == 0x000010, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_iTotal' has a wrong offset!");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature, _eventContext) == 0x000018, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__97D76876Minus49F1C30CMinus689D9580Minus8D8C5C36_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature::_eventContext' has a wrong offset!");

// Function CH_SM01_ModestaMassacre.CH_SM01_ModestaMassacre_C.BndEvt__A18C76E6-4E1D4DD6-A9E09EB0-50D059CF_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM01_ModestaMassacre_C_BndEvt__A18C76E6Minus4E1D4DD6MinusA9E09EB0Minus50D059CF_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM01_ModestaMassacre_C_BndEvt__A18C76E6Minus4E1D4DD6MinusA9E09EB0Minus50D059CF_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM01_ModestaMassacre_C_BndEvt__A18C76E6Minus4E1D4DD6MinusA9E09EB0Minus50D059CF_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM01_ModestaMassacre_C_BndEvt__A18C76E6Minus4E1D4DD6MinusA9E09EB0Minus50D059CF_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM01_ModestaMassacre_C_BndEvt__A18C76E6Minus4E1D4DD6MinusA9E09EB0Minus50D059CF_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__A18C76E6Minus4E1D4DD6MinusA9E09EB0Minus50D059CF_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__A18C76E6Minus4E1D4DD6MinusA9E09EB0Minus50D059CF_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM01_ModestaMassacre.CH_SM01_ModestaMassacre_C.BndEvt__BB4F67BA-47C0A1D3-78255E84-A5B33861_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM01_ModestaMassacre_C_BndEvt__BB4F67BAMinus47C0A1D3Minus78255E84MinusA5B33861_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM01_ModestaMassacre_C_BndEvt__BB4F67BAMinus47C0A1D3Minus78255E84MinusA5B33861_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM01_ModestaMassacre_C_BndEvt__BB4F67BAMinus47C0A1D3Minus78255E84MinusA5B33861_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM01_ModestaMassacre_C_BndEvt__BB4F67BAMinus47C0A1D3Minus78255E84MinusA5B33861_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM01_ModestaMassacre_C_BndEvt__BB4F67BAMinus47C0A1D3Minus78255E84MinusA5B33861_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__BB4F67BAMinus47C0A1D3Minus78255E84MinusA5B33861_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__BB4F67BAMinus47C0A1D3Minus78255E84MinusA5B33861_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM01_ModestaMassacre.CH_SM01_ModestaMassacre_C.BndEvt__C5482C62-49CBBD3F-7E1CF398-5D4B10D0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM01_ModestaMassacre.CH_SM01_ModestaMassacre_C.BndEvt__C5482C62-49CBBD3F-7E1CF398-5D4B10D0_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM01_ModestaMassacre_C_BndEvt__C5482C62Minus49CBBD3FMinus7E1CF398Minus5D4B10D0_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature");
