#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_SM05_AdiosSantaModesta

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BFGCore_structs.hpp"


namespace SDK::Params
{

// Function CH_SM05_AdiosSantaModesta.CH_SM05_AdiosSantaModesta_C.ExecuteUbergraph_CH_SM05_AdiosSantaModesta
// 0x1608 (0x1608 - 0x0000)
struct CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0010(0x0048)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0058(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0190(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x02C8(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x0400(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532[0x6];                                      // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x0538(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x0669(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66A[0x6];                                      // 0x066A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x0670(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult5;                // 0x07A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A2[0x6];                                      // 0x07A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x07A8(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult6;                // 0x08D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DA[0x6];                                      // 0x08DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x08E0(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult7;                // 0x0A11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A12[0x6];                                      // 0x0A12(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable8;                             // 0x0A18(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult8;                // 0x0B49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4A[0x6];                                      // 0x0B4A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable9;                             // 0x0B50(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x0C80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult9;                // 0x0C81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C82[0x6];                                      // 0x0C82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable10;                            // 0x0C88(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x0DB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult10;               // 0x0DB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DBA[0x6];                                      // 0x0DBA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable11;                            // 0x0DC0(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x0EF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult11;               // 0x0EF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF2[0x6];                                      // 0x0EF2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable12;                            // 0x0EF8(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x1028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult12;               // 0x1029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102A[0x6];                                     // 0x102A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable13;                            // 0x1030(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x1160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult13;               // 0x1161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1162[0x6];                                     // 0x1162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable14;                            // 0x1168(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum13_CmpSuccess;                    // 0x1298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult14;               // 0x1299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129A[0x6];                                     // 0x129A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable15;                            // 0x12A0(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum14_CmpSuccess;                    // 0x13D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult15;               // 0x13D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D2[0x6];                                     // 0x13D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x13D8(0x0048)()
	bool                                          K2Node_SwitchEnum15_CmpSuccess;                    // 0x1420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1421[0x3];                                     // 0x1421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x1424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue1;        // 0x1428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x142C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x142D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142E[0x2];                                     // 0x142E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue2;        // 0x1430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x1434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1435[0x3];                                     // 0x1435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x1438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_ElementVandalize*             BFGK2Node_BoundQuestEvent__Element1;               // 0x1440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__NewMonetaryValue;       // 0x1448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x144C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Challenge*                    CallFunc_GetChallenge_ReturnValue;                 // 0x1450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x1458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1459[0x3];                                     // 0x1459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentScore_ReturnValue;              // 0x145C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGDataAsset_ChallengeInfo*            CallFunc_GetChallengeAsset_ReturnValue;            // 0x1460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue1;        // 0x1468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x146C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x1470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x1474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1475[0x3];                                     // 0x1475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x1478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x147C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x147D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_147E[0x2];                                     // 0x147E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_ElementWaitTime*              BFGK2Node_BoundQuestEvent__Element;                // 0x1480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__Index;                  // 0x1488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148C[0x4];                                     // 0x148C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              BFGK2Node_BoundQuestEvent__TimeLimit;              // 0x1490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue3;        // 0x1498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x149C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x149D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149E[0x2];                                     // 0x149E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue4;        // 0x14A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger5_CmpSuccess;                  // 0x14A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A5[0x3];                                     // 0x14A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x14A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x14B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x14B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable16;                            // 0x14C0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult16;               // 0x15F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum16_CmpSuccess;                    // 0x15F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15F2[0x6];                                     // 0x15F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x15F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x1600(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta) == 0x000008, "Wrong alignment on CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta");
static_assert(sizeof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta) == 0x001608, "Wrong size on CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, EntryPoint) == 0x000000, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__pElement) == 0x000008, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__pElement' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000010, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable) == 0x000058, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult) == 0x000188, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable1) == 0x000190, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum_CmpSuccess) == 0x0002C0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult1) == 0x0002C1, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable2) == 0x0002C8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum1_CmpSuccess) == 0x0003F8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult2) == 0x0003F9, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult2' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable3) == 0x000400, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum2_CmpSuccess) == 0x000530, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult3) == 0x000531, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult3' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable4) == 0x000538, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum3_CmpSuccess) == 0x000668, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult4) == 0x000669, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult4' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable5) == 0x000670, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum4_CmpSuccess) == 0x0007A0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult5) == 0x0007A1, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult5' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable6) == 0x0007A8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum5_CmpSuccess) == 0x0008D8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult6) == 0x0008D9, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult6' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable7) == 0x0008E0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum6_CmpSuccess) == 0x000A10, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult7) == 0x000A11, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult7' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable8) == 0x000A18, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum7_CmpSuccess) == 0x000B48, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult8) == 0x000B49, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult8' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable9) == 0x000B50, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum8_CmpSuccess) == 0x000C80, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum8_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult9) == 0x000C81, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult9' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable10) == 0x000C88, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable10' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum9_CmpSuccess) == 0x000DB8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum9_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult10) == 0x000DB9, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult10' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable11) == 0x000DC0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable11' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum10_CmpSuccess) == 0x000EF0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum10_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult11) == 0x000EF1, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult11' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable12) == 0x000EF8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable12' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum11_CmpSuccess) == 0x001028, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum11_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult12) == 0x001029, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult12' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable13) == 0x001030, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable13' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum12_CmpSuccess) == 0x001160, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum12_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult13) == 0x001161, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult13' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable14) == 0x001168, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable14' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum13_CmpSuccess) == 0x001298, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum13_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult14) == 0x001299, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult14' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable15) == 0x0012A0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable15' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum14_CmpSuccess) == 0x0013D0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum14_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult15) == 0x0013D1, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult15' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_MakeGameplayTagQuery_ReturnValue1) == 0x0013D8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_MakeGameplayTagQuery_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum15_CmpSuccess) == 0x001420, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum15_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_RandomIntegerInRange_ReturnValue) == 0x001424, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_RandomIntegerInRange_ReturnValue1) == 0x001428, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_RandomIntegerInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchInteger_CmpSuccess) == 0x00142C, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchInteger1_CmpSuccess) == 0x00142D, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchInteger1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_RandomIntegerInRange_ReturnValue2) == 0x001430, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_RandomIntegerInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchInteger2_CmpSuccess) == 0x001434, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__pElement6) == 0x001438, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__pElement6' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__Element1) == 0x001440, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__Element1' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__NewMonetaryValue) == 0x001448, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__NewMonetaryValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00144C, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_GetChallenge_ReturnValue) == 0x001450, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_GetChallenge_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_IsValid_ReturnValue) == 0x001458, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_GetCurrentScore_ReturnValue) == 0x00145C, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_GetCurrentScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_GetChallengeAsset_ReturnValue) == 0x001460, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_GetChallengeAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_GetGameTimeInSeconds_ReturnValue1) == 0x001468, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_GetGameTimeInSeconds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_Add_FloatFloat_ReturnValue) == 0x00146C, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_Conv_IntToFloat_ReturnValue) == 0x001470, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_Greater_FloatFloat_ReturnValue) == 0x001474, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_Divide_FloatFloat_ReturnValue) == 0x001478, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00147C, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x00147D, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__Element) == 0x001480, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__Element' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__Index) == 0x001488, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__Index' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__TimeLimit) == 0x001490, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__TimeLimit' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_RandomIntegerInRange_ReturnValue3) == 0x001498, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_RandomIntegerInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchInteger3_CmpSuccess) == 0x00149C, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchInteger4_CmpSuccess) == 0x00149D, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_RandomIntegerInRange_ReturnValue4) == 0x0014A0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_RandomIntegerInRange_ReturnValue4' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchInteger5_CmpSuccess) == 0x0014A4, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchInteger5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__pElement5) == 0x0014A8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__pElement5' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__pElement4) == 0x0014B0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__pElement4' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__pElement3) == 0x0014B8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__pElement3' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, Temp_struct_Variable16) == 0x0014C0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::Temp_struct_Variable16' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, CallFunc_PlayVoiceover__outResult16) == 0x0015F0, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::CallFunc_PlayVoiceover__outResult16' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, K2Node_SwitchEnum16_CmpSuccess) == 0x0015F1, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::K2Node_SwitchEnum16_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__pElement2) == 0x0015F8, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__pElement2' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta, BFGK2Node_BoundQuestEvent__pElement1) == 0x001600, "Member 'CH_SM05_AdiosSantaModesta_C_ExecuteUbergraph_CH_SM05_AdiosSantaModesta::BFGK2Node_BoundQuestEvent__pElement1' has a wrong offset!");

// Function CH_SM05_AdiosSantaModesta.CH_SM05_AdiosSantaModesta_C.BndEvt__23DC1F3F-47B33EC9-5476E9B1-7A072B58_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM05_AdiosSantaModesta_C_BndEvt__23DC1F3FMinus47B33EC9Minus5476E9B1Minus7A072B58_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM05_AdiosSantaModesta_C_BndEvt__23DC1F3FMinus47B33EC9Minus5476E9B1Minus7A072B58_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM05_AdiosSantaModesta_C_BndEvt__23DC1F3FMinus47B33EC9Minus5476E9B1Minus7A072B58_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM05_AdiosSantaModesta_C_BndEvt__23DC1F3FMinus47B33EC9Minus5476E9B1Minus7A072B58_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM05_AdiosSantaModesta_C_BndEvt__23DC1F3FMinus47B33EC9Minus5476E9B1Minus7A072B58_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_BndEvt__23DC1F3FMinus47B33EC9Minus5476E9B1Minus7A072B58_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM05_AdiosSantaModesta_C_BndEvt__23DC1F3FMinus47B33EC9Minus5476E9B1Minus7A072B58_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM05_AdiosSantaModesta.CH_SM05_AdiosSantaModesta_C.BndEvt__2C434CB6-4D7ADEA4-DFEBE182-531FCA99_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM05_AdiosSantaModesta_C_BndEvt__2C434CB6Minus4D7ADEA4MinusDFEBE182Minus531FCA99_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM05_AdiosSantaModesta_C_BndEvt__2C434CB6Minus4D7ADEA4MinusDFEBE182Minus531FCA99_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM05_AdiosSantaModesta_C_BndEvt__2C434CB6Minus4D7ADEA4MinusDFEBE182Minus531FCA99_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM05_AdiosSantaModesta_C_BndEvt__2C434CB6Minus4D7ADEA4MinusDFEBE182Minus531FCA99_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM05_AdiosSantaModesta_C_BndEvt__2C434CB6Minus4D7ADEA4MinusDFEBE182Minus531FCA99_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_BndEvt__2C434CB6Minus4D7ADEA4MinusDFEBE182Minus531FCA99_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM05_AdiosSantaModesta_C_BndEvt__2C434CB6Minus4D7ADEA4MinusDFEBE182Minus531FCA99_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM05_AdiosSantaModesta.CH_SM05_AdiosSantaModesta_C.BndEvt__68BEBBF0-4B4B6744-9B98F1BF-4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct CH_SM05_AdiosSantaModesta_C_BndEvt__68BEBBF0Minus4B4B6744Minus9B98F1BFMinus4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature final
{
public:
	class UBFGQuest_ElementVandalize*             _Element;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _NewMonetaryValue;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM05_AdiosSantaModesta_C_BndEvt__68BEBBF0Minus4B4B6744Minus9B98F1BFMinus4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM05_AdiosSantaModesta_C_BndEvt__68BEBBF0Minus4B4B6744Minus9B98F1BFMinus4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature");
static_assert(sizeof(CH_SM05_AdiosSantaModesta_C_BndEvt__68BEBBF0Minus4B4B6744Minus9B98F1BFMinus4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature) == 0x000010, "Wrong size on CH_SM05_AdiosSantaModesta_C_BndEvt__68BEBBF0Minus4B4B6744Minus9B98F1BFMinus4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_BndEvt__68BEBBF0Minus4B4B6744Minus9B98F1BFMinus4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature, _Element) == 0x000000, "Member 'CH_SM05_AdiosSantaModesta_C_BndEvt__68BEBBF0Minus4B4B6744Minus9B98F1BFMinus4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature::_Element' has a wrong offset!");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_BndEvt__68BEBBF0Minus4B4B6744Minus9B98F1BFMinus4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature, _NewMonetaryValue) == 0x000008, "Member 'CH_SM05_AdiosSantaModesta_C_BndEvt__68BEBBF0Minus4B4B6744Minus9B98F1BFMinus4115F497_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VandalizeAmountChanged__DelegateSignature::_NewMonetaryValue' has a wrong offset!");

// Function CH_SM05_AdiosSantaModesta.CH_SM05_AdiosSantaModesta_C.BndEvt__81D20556-477C9264-130DC2B2-944F49A1_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM05_AdiosSantaModesta.CH_SM05_AdiosSantaModesta_C.BndEvt__81D20556-477C9264-130DC2B2-944F49A1_BFGK2Node_BoundQuestEvent_150_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_150_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_150_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_150_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_150_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_150_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_150_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_150_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM05_AdiosSantaModesta.CH_SM05_AdiosSantaModesta_C.BndEvt__81D20556-477C9264-130DC2B2-944F49A1_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM05_AdiosSantaModesta.CH_SM05_AdiosSantaModesta_C.BndEvt__81D20556-477C9264-130DC2B2-944F49A1_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_SM05_AdiosSantaModesta_C_BndEvt__81D20556Minus477C9264Minus130DC2B2Minus944F49A1_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_SM05_AdiosSantaModesta.CH_SM05_AdiosSantaModesta_C.BndEvt__CBB86E99-4A22290F-E4B7A9A2-B73543E2_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_SM05_AdiosSantaModesta_C_BndEvt__CBB86E99Minus4A22290FMinusE4B7A9A2MinusB73543E2_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SM05_AdiosSantaModesta_C_BndEvt__CBB86E99Minus4A22290FMinusE4B7A9A2MinusB73543E2_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_SM05_AdiosSantaModesta_C_BndEvt__CBB86E99Minus4A22290FMinusE4B7A9A2MinusB73543E2_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_SM05_AdiosSantaModesta_C_BndEvt__CBB86E99Minus4A22290FMinusE4B7A9A2MinusB73543E2_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_SM05_AdiosSantaModesta_C_BndEvt__CBB86E99Minus4A22290FMinusE4B7A9A2MinusB73543E2_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
