#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_TF01_CorneredBeef

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_TF01_CorneredBeef.CH_TF01_CorneredBeef_C
// 0x0010 (0x0248 - 0x0238)
class UCH_TF01_CorneredBeef_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DoOnce_AlmostVO;                                   // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DoOnce_HalfwayVO;                                  // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CH_TF01_CorneredBeef(int32 EntryPoint);
	void BndEvt__002E05A0Minus4D24AC24MinusE95566A1Minus6B2FFC51_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__3DF7A43BMinus44D85230MinusC8A66491MinusD9CC2237_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature(class UBFGQuest_ElementWaitTime* _Element, int32 _Index, const struct FTimespan& _TimeLimit);
	void BndEvt__46548141Minus491FD750Minus54E0B185MinusF44E4D12_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__46548141Minus491FD750Minus54E0B185MinusF44E4D12_BFGK2Node_BoundQuestEvent_11_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__46548141Minus491FD750Minus54E0B185MinusF44E4D12_BFGK2Node_BoundQuestEvent_14_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__46548141Minus491FD750Minus54E0B185MinusF44E4D12_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4C2C7503Minus4F489E95Minus17460E9FMinus3F4CC1D6_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__ADB80631Minus4D6923D3MinusD7499CB6MinusC619861A_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__C0FCA29AMinus4BCE4A5AMinusE5B51C95Minus7C0D4F8F_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__C0FCA29AMinus4BCE4A5AMinusE5B51C95Minus7C0D4F8F_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_TF01_CorneredBeef_C">();
	}
	static class UCH_TF01_CorneredBeef_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCH_TF01_CorneredBeef_C>();
	}
};
static_assert(alignof(UCH_TF01_CorneredBeef_C) == 0x000008, "Wrong alignment on UCH_TF01_CorneredBeef_C");
static_assert(sizeof(UCH_TF01_CorneredBeef_C) == 0x000248, "Wrong size on UCH_TF01_CorneredBeef_C");
static_assert(offsetof(UCH_TF01_CorneredBeef_C, UberGraphFrame) == 0x000238, "Member 'UCH_TF01_CorneredBeef_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCH_TF01_CorneredBeef_C, DoOnce_AlmostVO) == 0x000240, "Member 'UCH_TF01_CorneredBeef_C::DoOnce_AlmostVO' has a wrong offset!");
static_assert(offsetof(UCH_TF01_CorneredBeef_C, DoOnce_HalfwayVO) == 0x000241, "Member 'UCH_TF01_CorneredBeef_C::DoOnce_HalfwayVO' has a wrong offset!");

}

