#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_UT05_Rampage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_UT05_Rampage.CH_UT05_Rampage_C
// 0x0010 (0x0248 - 0x0238)
class UCH_UT05_Rampage_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          DoOnce_AlmostVO;                                   // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DoOnce_HalfwayVO;                                  // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CH_UT05_Rampage(int32 EntryPoint);
	void BndEvt__06491539Minus41CC86A7MinusDB0C1189Minus1B72324E_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__35117A65Minus4E6775FEMinus65FFA080Minus8152CAAB_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4B1FAE04Minus4FE68DD6Minus24115286Minus6E92DD50_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature(class UBFGQuest_ElementWaitTime* _Element, int32 _Index, const struct FTimespan& _TimeLimit);
	void BndEvt__71D6CEB8Minus4597EB6FMinus6A384E8FMinusC435CBD7_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__71D6CEB8Minus4597EB6FMinus6A384E8FMinusC435CBD7_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__71D6CEB8Minus4597EB6FMinus6A384E8FMinusC435CBD7_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__71D6CEB8Minus4597EB6FMinus6A384E8FMinusC435CBD7_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__745757B2Minus486ECD70Minus9705AD9CMinusCC995D7B_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__F081AC71Minus47B20C25Minus6BE808A5Minus11B59E98_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_UT05_Rampage_C">();
	}
	static class UCH_UT05_Rampage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCH_UT05_Rampage_C>();
	}
};
static_assert(alignof(UCH_UT05_Rampage_C) == 0x000008, "Wrong alignment on UCH_UT05_Rampage_C");
static_assert(sizeof(UCH_UT05_Rampage_C) == 0x000248, "Wrong size on UCH_UT05_Rampage_C");
static_assert(offsetof(UCH_UT05_Rampage_C, UberGraphFrame) == 0x000238, "Member 'UCH_UT05_Rampage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCH_UT05_Rampage_C, DoOnce_AlmostVO) == 0x000240, "Member 'UCH_UT05_Rampage_C::DoOnce_AlmostVO' has a wrong offset!");
static_assert(offsetof(UCH_UT05_Rampage_C, DoOnce_HalfwayVO) == 0x000241, "Member 'UCH_UT05_Rampage_C::DoOnce_HalfwayVO' has a wrong offset!");

}

