#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_UT02_UnionTownTour

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BFGCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.ExecuteUbergraph_CH_UT02_UnionTownTour
// 0x1490 (0x1490 - 0x0000)
struct CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0010(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0140(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x0278(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x03A8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x04DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x04E0(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x0610(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult5;                // 0x0741(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0742(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x0743(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x0748(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x0878(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult6;                // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult7;                // 0x09A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x09AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x09AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable8;                             // 0x09B0(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable9;                             // 0x0AE0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult8;                // 0x0C10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult9;                // 0x0C11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x0C12(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x0C13(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C14[0x4];                                      // 0x0C14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable10;                            // 0x0C18(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable11;                            // 0x0D48(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult10;               // 0x0E78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult11;               // 0x0E79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x0E7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x0E7B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E7C[0x4];                                      // 0x0E7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable12;                            // 0x0E80(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable13;                            // 0x0FB0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult12;               // 0x10E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult13;               // 0x10E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x10E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum13_CmpSuccess;                    // 0x10E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E4[0x4];                                     // 0x10E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable14;                            // 0x10E8(0x0130)(ConstParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x1218(0x0048)()
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult14;               // 0x1260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum14_CmpSuccess;                    // 0x1261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1262[0x6];                                     // 0x1262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x1268(0x0048)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x12B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x12B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__Element1;               // 0x12C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BFGK2Node_BoundQuestEvent_valueAdded;              // 0x12C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BFGK2Node_BoundQuestEvent_valueTotal;              // 0x12CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x12D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Challenge*                    CallFunc_GetChallenge_ReturnValue;                 // 0x12D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x12E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x12E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x12E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12E6[0x2];                                     // 0x12E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentScore_ReturnValue;              // 0x12E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12EC[0x4];                                     // 0x12EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGDataAsset_ChallengeInfo*            CallFunc_GetChallengeAsset_ReturnValue;            // 0x12F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue1;        // 0x12F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x12FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12FD[0x3];                                     // 0x12FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue2;        // 0x1300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x1304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x1308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1309[0x3];                                     // 0x1309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x130C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x1310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x1311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1312[0x6];                                     // 0x1312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_ElementWaitTime*              BFGK2Node_BoundQuestEvent__Element;                // 0x1318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__Index;                  // 0x1320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1324[0x4];                                     // 0x1324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              BFGK2Node_BoundQuestEvent__TimeLimit;              // 0x1328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue3;        // 0x1330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x1334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x1335(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1336[0x2];                                     // 0x1336(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue4;        // 0x1338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger5_CmpSuccess;                  // 0x133C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133D[0x3];                                     // 0x133D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable15;                            // 0x1340(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult15;               // 0x1470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum15_CmpSuccess;                    // 0x1471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1472[0x6];                                     // 0x1472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x1478(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x1480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x1488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour");
static_assert(sizeof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour) == 0x001490, "Wrong size on CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, EntryPoint) == 0x000000, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__pElement) == 0x000008, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__pElement' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable) == 0x000010, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable1) == 0x000140, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult) == 0x000270, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult1) == 0x000271, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum_CmpSuccess) == 0x000272, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum1_CmpSuccess) == 0x000273, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable2) == 0x000278, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable3) == 0x0003A8, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult2) == 0x0004D8, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult2' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult3) == 0x0004D9, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult3' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum2_CmpSuccess) == 0x0004DA, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum3_CmpSuccess) == 0x0004DB, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable4) == 0x0004E0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable5) == 0x000610, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult4) == 0x000740, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult4' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult5) == 0x000741, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult5' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum4_CmpSuccess) == 0x000742, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum5_CmpSuccess) == 0x000743, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable6) == 0x000748, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable7) == 0x000878, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult6) == 0x0009A8, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult6' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult7) == 0x0009A9, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult7' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum6_CmpSuccess) == 0x0009AA, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum7_CmpSuccess) == 0x0009AB, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable8) == 0x0009B0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable9) == 0x000AE0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable9' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult8) == 0x000C10, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult8' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult9) == 0x000C11, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult9' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum8_CmpSuccess) == 0x000C12, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum8_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum9_CmpSuccess) == 0x000C13, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum9_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable10) == 0x000C18, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable10' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable11) == 0x000D48, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable11' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult10) == 0x000E78, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult10' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult11) == 0x000E79, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult11' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum10_CmpSuccess) == 0x000E7A, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum10_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum11_CmpSuccess) == 0x000E7B, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum11_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable12) == 0x000E80, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable12' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable13) == 0x000FB0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable13' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult12) == 0x0010E0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult12' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult13) == 0x0010E1, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult13' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum12_CmpSuccess) == 0x0010E2, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum12_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum13_CmpSuccess) == 0x0010E3, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum13_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable14) == 0x0010E8, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable14' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x001218, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult14) == 0x001260, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult14' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum14_CmpSuccess) == 0x001261, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum14_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_MakeGameplayTagQuery_ReturnValue1) == 0x001268, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_MakeGameplayTagQuery_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__pElement6) == 0x0012B0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__pElement6' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__pElement5) == 0x0012B8, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__pElement5' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__Element1) == 0x0012C0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__Element1' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent_valueAdded) == 0x0012C8, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent_valueAdded' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent_valueTotal) == 0x0012CC, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent_valueTotal' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__pElement4) == 0x0012D0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__pElement4' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_GetChallenge_ReturnValue) == 0x0012D8, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_GetChallenge_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0012E0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_IsValid_ReturnValue) == 0x0012E4, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchInteger_CmpSuccess) == 0x0012E5, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_GetCurrentScore_ReturnValue) == 0x0012E8, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_GetCurrentScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_GetChallengeAsset_ReturnValue) == 0x0012F0, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_GetChallengeAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_RandomIntegerInRange_ReturnValue1) == 0x0012F8, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_RandomIntegerInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchInteger1_CmpSuccess) == 0x0012FC, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchInteger1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_RandomIntegerInRange_ReturnValue2) == 0x001300, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_RandomIntegerInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_Conv_IntToFloat_ReturnValue) == 0x001304, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchInteger2_CmpSuccess) == 0x001308, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00130C, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x001310, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x001311, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__Element) == 0x001318, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__Element' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__Index) == 0x001320, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__Index' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__TimeLimit) == 0x001328, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__TimeLimit' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_RandomIntegerInRange_ReturnValue3) == 0x001330, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_RandomIntegerInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchInteger3_CmpSuccess) == 0x001334, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchInteger4_CmpSuccess) == 0x001335, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_RandomIntegerInRange_ReturnValue4) == 0x001338, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_RandomIntegerInRange_ReturnValue4' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchInteger5_CmpSuccess) == 0x00133C, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchInteger5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, Temp_struct_Variable15) == 0x001340, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::Temp_struct_Variable15' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, CallFunc_PlayVoiceover__outResult15) == 0x001470, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::CallFunc_PlayVoiceover__outResult15' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, K2Node_SwitchEnum15_CmpSuccess) == 0x001471, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::K2Node_SwitchEnum15_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__pElement3) == 0x001478, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__pElement3' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__pElement2) == 0x001480, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__pElement2' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour, BFGK2Node_BoundQuestEvent__pElement1) == 0x001488, "Member 'CH_UT02_UnionTownTour_C_ExecuteUbergraph_CH_UT02_UnionTownTour::BFGK2Node_BoundQuestEvent__pElement1' has a wrong offset!");

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.BndEvt__4AE8164A-44672F00-3C11E69D-7936AE9E_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.BndEvt__4AE8164A-44672F00-3C11E69D-7936AE9E_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.BndEvt__4AE8164A-44672F00-3C11E69D-7936AE9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.BndEvt__F5241E69-4B6F9F6D-407CA394-CA678D68_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_UT02_UnionTownTour_C_BndEvt__F5241E69Minus4B6F9F6DMinus407CA394MinusCA678D68_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_BndEvt__F5241E69Minus4B6F9F6DMinus407CA394MinusCA678D68_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_BndEvt__F5241E69Minus4B6F9F6DMinus407CA394MinusCA678D68_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_UT02_UnionTownTour_C_BndEvt__F5241E69Minus4B6F9F6DMinus407CA394MinusCA678D68_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_UT02_UnionTownTour_C_BndEvt__F5241E69Minus4B6F9F6DMinus407CA394MinusCA678D68_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__F5241E69Minus4B6F9F6DMinus407CA394MinusCA678D68_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_UT02_UnionTownTour_C_BndEvt__F5241E69Minus4B6F9F6DMinus407CA394MinusCA678D68_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.BndEvt__2F1A64F7-4DB5921D-41D3AAAF-F120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature final
{
public:
	class UBFGQuest_ElementWaitTime*              _Element;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Index;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              _TimeLimit;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature");
static_assert(sizeof(CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature) == 0x000018, "Wrong size on CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature, _Element) == 0x000000, "Member 'CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature::_Element' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature, _Index) == 0x000008, "Member 'CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature::_Index' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature, _TimeLimit) == 0x000010, "Member 'CH_UT02_UnionTownTour_C_BndEvt__2F1A64F7Minus4DB5921DMinus41D3AAAFMinusF120EC9E_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature::_TimeLimit' has a wrong offset!");

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.BndEvt__92D06018-4AC9297B-B2A51896-9CD205A3_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_UT02_UnionTownTour_C_BndEvt__92D06018Minus4AC9297BMinusB2A51896Minus9CD205A3_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_BndEvt__92D06018Minus4AC9297BMinusB2A51896Minus9CD205A3_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_BndEvt__92D06018Minus4AC9297BMinusB2A51896Minus9CD205A3_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_UT02_UnionTownTour_C_BndEvt__92D06018Minus4AC9297BMinusB2A51896Minus9CD205A3_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_UT02_UnionTownTour_C_BndEvt__92D06018Minus4AC9297BMinusB2A51896Minus9CD205A3_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__92D06018Minus4AC9297BMinusB2A51896Minus9CD205A3_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_UT02_UnionTownTour_C_BndEvt__92D06018Minus4AC9297BMinusB2A51896Minus9CD205A3_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.BndEvt__B6ED0290-4F50B446-E57F42BA-BD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _Element;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ValueAdded;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ValueTotal;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature");
static_assert(sizeof(CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature) == 0x000010, "Wrong size on CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature, _Element) == 0x000000, "Member 'CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature::_Element' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature, ValueAdded) == 0x000008, "Member 'CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature::ValueAdded' has a wrong offset!");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature, ValueTotal) == 0x00000C, "Member 'CH_UT02_UnionTownTour_C_BndEvt__B6ED0290Minus4F50B446MinusE57F42BAMinusBD9F07A7_BFGK2Node_BoundQuestEvent_7_BFGActorEvent_ResourceValueCounted__DelegateSignature::ValueTotal' has a wrong offset!");

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.BndEvt__4AE8164A-44672F00-3C11E69D-7936AE9E_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'CH_UT02_UnionTownTour_C_BndEvt__4AE8164AMinus44672F00Minus3C11E69DMinus7936AE9E_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function CH_UT02_UnionTownTour.CH_UT02_UnionTownTour_C.BndEvt__E8FF8DC1-40773E2E-55237BB8-3FE61D7D_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CH_UT02_UnionTownTour_C_BndEvt__E8FF8DC1Minus40773E2EMinus55237BB8Minus3FE61D7D_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_UT02_UnionTownTour_C_BndEvt__E8FF8DC1Minus40773E2EMinus55237BB8Minus3FE61D7D_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on CH_UT02_UnionTownTour_C_BndEvt__E8FF8DC1Minus40773E2EMinus55237BB8Minus3FE61D7D_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(CH_UT02_UnionTownTour_C_BndEvt__E8FF8DC1Minus40773E2EMinus55237BB8Minus3FE61D7D_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on CH_UT02_UnionTownTour_C_BndEvt__E8FF8DC1Minus40773E2EMinus55237BB8Minus3FE61D7D_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature");
