#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cow_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass cow_AnimBP.cow_AnimBP_C
// 0x2AF0 (0x3050 - 0x0560)
class UCow_AnimBP_C final : public UBFGAnimationInstance_Animal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_47EC4C764421F33656077BBBF4FA545B; // 0x0568(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DDD336E14370878C2363A39A03894C41; // 0x0588(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_65801BCD4BB22E61712463A8DCD7A187; // 0x0600(0x00A0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_257FBC4245810B3CEA50AB9DBC3C2013; // 0x06A0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49CF04824A7779D39959D18DAD870D71; // 0x0768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DD0C91074DE93471494B79B3A773DD88; // 0x0790(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_183A3AF349469A89335B6A87FD35ECF6; // 0x07B8(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_AE354A4F4FA839DCD49E48AAB2BEA71B; // 0x0898(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A6537DB0480B36E193C4BEB576F476A1; // 0x0960(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4E83CEEB4CDC555BC25144950DAFD886; // 0x0A40(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B4F51BB244EBCCE372568EA64D811B64; // 0x0B08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A97100D24C7EFC83965D78A697956DB9; // 0x0B30(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_549A97AE4FADCBE7001A1FB45A10C580; // 0x0B58(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7AF2E552486B64FCF3A6ED820889EA11; // 0x0BF8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F71B9F754183402EC2D1DAA8D7E061E1; // 0x0C70(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A09F1BC249EFE7843A5E449B31C2FB6B; // 0x0CE8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_0B4DA7634D1B51C88BA11B8C045839F3; // 0x0D08(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_CF15E6B94C6E5CA776095F9060085B5C; // 0x0DE8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_551F4E6B4112FDFE8CAC57B7CCCD0B5B; // 0x0E08(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5BA8C2FF436006132FD075A3C8D8AD45; // 0x0E80(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6AF0ED87490DB8D5111DBA8D9272B711; // 0x0F30(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9B5806D3429178F93AD159A289CD6F31; // 0x0FA8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_F321465F42EB55A1ECBCDF9FE542118A; // 0x0FC8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2471739F47373FC1ABBE6CB39B6C789D; // 0x1078(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_01AA9AE44CFC647CBF59B8A7D23EBE2E; // 0x1098(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D1F8987D4A7581A186C44BA3714E4212; // 0x1110(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_250AFCD64C8CD0931DF260AC76016BEB; // 0x1188(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3B2C1A1A4E066799BA5595B5A8029C00; // 0x1200(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F1EEF9C4494DBE9A6800179985265C74; // 0x1278(0x0078)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_C3C35BFB4CEB374BEE66508642ECA7EC; // 0x12F0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_092B4822452745FA0B26F7B2A64E0A2C; // 0x1390(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_591336C74088D17F2E36A4AB2185D003; // 0x13B0(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_EA2C023B4AF3FFDFBEC352AFC226956E; // 0x1460(0x00B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_871075B5492AAF1C5B126398121DE028; // 0x1518(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0113447E4EE412F1184F8A9D2B6CCF4B; // 0x15E0(0x0078)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D8ECA374490814C8AF12568A7B25EA25; // 0x1658(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1CC30EE2497F33046E16E8A8F0BC9D1D; // 0x1680(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ADFB7CD849DBE0CE1A86B6A819AA3A0C; // 0x16A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_03652F6E490662794665DB8F09990AA4; // 0x16D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55BBE4D647EB91AB045E2BB3A68ADC64; // 0x16F8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1E60C1C74DFD2579DD15DDABB6DF82F1; // 0x1720(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7FC45CF14FDA6CA54909BF81B997728C; // 0x1798(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A4C982474A55BCE88BAD50966BE725A7; // 0x17B8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FB0DA3A149E339740B249894AB529E2F; // 0x1830(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3A2CE95243DAEEF6E30198BDB66DEA86; // 0x1850(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3CF5803C4D60A7E9144AB1B81A94C64A; // 0x18C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5670D3C74D83FDB7B777A79F228C043E; // 0x18E8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1532B0064EDA440CE0D69FA1525D1CA3; // 0x1960(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D56B24364D665867BE11538A301217AD; // 0x1980(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4127C5314C24A8DBABF268B3657117D5; // 0x1A30(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_506344554A1A72BA84AA2584003BBB08; // 0x1A50(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_002BE9F048A14089C4A0F898F548382C; // 0x1AC8(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_75308DC94D0984FFEDE86C85335E283E; // 0x1B40(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4AB094704FA43CC68E59A3BCECA71063; // 0x1C08(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3153DACE4162546383A1B78CD26900B9; // 0x1CD0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2EBF84A4483CC50DC3AFD68663A6D1E4; // 0x1D48(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_F294539C439E2B3C805808AA8F08BE08; // 0x1D68(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4FB0AF584EA30CE451E3A2AC6181AF80; // 0x1E18(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_59CEF6C940574D0E89A956B57A9F80C0; // 0x1E38(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6557682047C8F8EC173D8EBC8BCCC7B1; // 0x1EE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A77BE9C545FA2653D415518951F8D267; // 0x1F10(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CBBDB723420014325072C286B153CE16; // 0x1F38(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86422647474978508B1BC8AC1B62A18F; // 0x1FB0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9DE0419144D62419F89AC38F27B7E4A2; // 0x1FD0(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C614014346B4ECCCD21B83863CAA1794; // 0x20B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5511710C487B56698986AA95298D8D0D; // 0x20D0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_64D146DC409C0133FE3C3B9A88EAD28C; // 0x2180(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2EF63FE54A05108B913DE6A233B57EC3; // 0x2220(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_834002E94824BC81AF391784DFFD2172; // 0x2298(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A2EE6D3948CA7E92C404C8BFF09DE8E7; // 0x2338(0x0078)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_07823DE64AAC240347D9119D403CBE84; // 0x23B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_566327D641B0B917A6A988A9CC92195A; // 0x23D0(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_02FA02074F775D5E0F404D9DFBF794EE; // 0x23F0(0x0550)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4F3BCEBF42035DA4873B8A8B53EC387A; // 0x2940(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_56C7DCBF445243D7CE25649FE3B5412A; // 0x2A08(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_75053FAA451037BF3D4E8399CED999E7; // 0x2AE8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_960A43294DECE2EBBF4B43BD3BE6AFA1; // 0x2B30(0x00A0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot_1D707D1D402CBE06BD5A5DAE9F3F4AE6; // 0x2BD0(0x0090)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5EDACA8A43F2E16946F5A69836F269E7; // 0x2C60(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0AC5BB74467FE0CF234AD98EE1C9DFF2; // 0x2D18(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0718E98B474DF687E42C31BAB964B0A7; // 0x2D40(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A2DB055243F10660E11255A574676E4B; // 0x2D68(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_EB0B910E41F501E81CFE19BD56025A71; // 0x2E08(0x00A0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot_0A3FCEF2448BDDA467B53783ABA11085; // 0x2EA8(0x0090)()
	int32                                         CurrentElectrocutedState;                          // 0x2F38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayIdle;                                          // 0x2F3C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IdleEnded;                                         // 0x2F3D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3E[0x2];                                     // 0x2F3E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Animal_Cow_Base_C*                  BP_animal_cow;                                     // 0x2F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_NPCCharacterMovement* NPC_character_Movement;                            // 0x2F48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGNPCCharacter_MoveSpeed                    MoveState;                                         // 0x2F50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GalopStart;                                        // 0x2F51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F52[0x2];                                     // 0x2F52(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Add_tail_active;                                   // 0x2F54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   AdditiveIdle;                                      // 0x2F58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Add_ear_variation;                                 // 0x2F70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Add_ear_active;                                    // 0x2F74(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Add_ruminate_active;                               // 0x2F75(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Add_moo_active;                                    // 0x2F76(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EBFGNPCCharacter_MoveSpeed                    PreviousMoveState;                                 // 0x2F77(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTimeX;                                        // 0x2F78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Add_tail_active_target;                            // 0x2F7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAtDirection;                                   // 0x2F80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAtDirectionTarget;                             // 0x2F84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Locomotion_Bend;                                   // 0x2F88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Locomotion_Bend_target;                            // 0x2F8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Locomotion_Bank;                                   // 0x2F90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Locomotion_speed__Finterp_;                        // 0x2F94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tail_physicsBlend;                                 // 0x2F98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Walk_LfootDown;                                    // 0x2F9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9D[0x3];                                     // 0x2F9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ScaleCow;                                          // 0x2FA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tail_physicsBlend_target;                          // 0x2FAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Last_known_rotation;                               // 0x2FB0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RotationRate;                                      // 0x2FBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviousDistract;                                  // 0x2FC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AllowGrazing;                                      // 0x2FC1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FC2[0x2];                                     // 0x2FC2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElectrocutionTimer;                                // 0x2FC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElectrocutionSwitchTime;                           // 0x2FC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IdleTimer;                                         // 0x2FCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IdleSwitchTime;                                    // 0x2FD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ActorLocation;                                     // 0x2FD4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LookAtRotation;                                    // 0x2FE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CryptoClose;                                       // 0x2FEC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FED[0x3];                                     // 0x2FED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSnapshot                          RagdollPose;                                       // 0x2FF0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           GetUpMontage;                                      // 0x3028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStandingUp;                                      // 0x3030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSimulating;                                      // 0x3031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LookAtCrypto;                                      // 0x3032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3033[0x1];                                     // 0x3033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VectorToPlayer;                                    // 0x3034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToPlayer;                                  // 0x3040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviousDistanceToPlayer;                          // 0x3044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DistanceGate;                                      // 0x3048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3049[0x3];                                     // 0x3049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RuminateStartPosition;                             // 0x304C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShouldLookAtPlayer();
	void PlayerDetection();
	void TailFix();
	void LookAtPlayer();
	void TriggerIdleSelection();
	void TriggerElectrocutionSwitch();
	void HandleHypnotizeDistract();
	void Locomotion_ADD();
	void Gallop_start();
	void Additive_animations();
	void Fitnerps();
	void SetPreviousFrameVariables();
	void GetVars();
	void SwitchElectrocutedState();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_cow_AnimBP_AnimGraphNode_TransitionResult_55BBE4D647EB91AB045E2BB3A68ADC64();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_cow_AnimBP_AnimGraphNode_BlendSpacePlayer_0B4DA7634D1B51C88BA11B8C045839F3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_cow_AnimBP_AnimGraphNode_TransitionResult_ADFB7CD849DBE0CE1A86B6A819AA3A0C();
