#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Crypto_AnimBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ANIM_CryptoAccelerationDirection_structs.hpp"
#include "ANIM_CryptoMoveDirection_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"
#include "ANIM_AccelerationTurnDirection_Enum_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// DynamicClass Crypto_AnimBP.Crypto_AnimBP_C
// 0x12760 (0x12B60 - 0x0400)
class UCrypto_AnimBP_C final : public UBFGAnimationInstance_Crypto
{
public:
	struct FAnimNode_Slot                         AnimGraphNode_Slot_51A84D7F4214AAF562D6E8B972949B25; // 0x0400(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FC16620542DFCBDA9F7F0BAD78D7FE19; // 0x0448(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7A8714AD4054BC335B8AEC8FA39F2CDA; // 0x0470(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7C9BE1614BB33015C1735EBAA3CA33C0; // 0x0498(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59B414C64C589DF18EF700B28C503AE4; // 0x04C0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D69637F04A32043E6475A1B764CC6E17; // 0x04E8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143C832240878546FAC2FE8718B024A5; // 0x0510(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6FB537044AC1A005FB6467B4DFBBCE86; // 0x0538(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1514A97542E2BE8DAA6481BA0A11F0CF; // 0x0560(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4D8D811E4519A70C4F4DF49F18484469; // 0x0588(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4F5751664E1310650C140D80271C28AE; // 0x05B0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_724DF8EC481890E159DE11A404DB23A7; // 0x05D8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5CCD31114EBAB87C5BA4E292806CEA27; // 0x0600(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EFA66CC04678C0AF14614F88521B7242; // 0x0628(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97020AC64373335BF1F8D6BC9F7A4649; // 0x0650(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91C9532646AA551649E1318F35316412; // 0x0678(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A8F0D71847694C31E1DCE79AE6133F84; // 0x06A0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3C9837594004D3A3E9F8269238CE1F73; // 0x06C8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A89363174969CBF6D4D682A57C92E278; // 0x06F0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_05CA36AC464FE912250711889C028B2A; // 0x0718(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1B3A4F7D42C6C40CE2361DAF9D23688F; // 0x0740(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49216BFA46FA08807DA004BD1BA929C7; // 0x0768(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4CD8834C4816AC2E9B8AF68984A4FA61; // 0x0790(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9E8980674287CEFAEA9502ABC0BAA8ED; // 0x07B8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_9003E66F4479F0D8030B0FA69B75BAFB; // 0x07E0(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3861DD624E749409F7FDBD8AA3373624; // 0x0828(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_71C0E1C647751158D93A50937DDD777F; // 0x08C8(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_B16BB3E646913D0678149CB29D0D757D; // 0x0910(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E6C1DBA64E27879CBD4C59B2B2BFA193; // 0x0958(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_C7AB95864171E0FEA18460A684FB2D43; // 0x0978(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_430085D64B0CF8753B0A23B0536FD8E9; // 0x09C0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_092E864E4704A853F3EFADA464DE13D7; // 0x09E0(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68C229834ED51D4AFF8AB194E5C8A356; // 0x0A28(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_AAE32E224C0E4D28F2FD339B1DA98455; // 0x0A48(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_2AD63F2747EFCDD3A96E988669C5C2E2; // 0x0B30(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_9E6C4FD6424A471228DF078FBA194FE6; // 0x0C18(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_98C6C24E4EF013FFA8C8679DFA69FE69; // 0x0D00(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4A6E2A8E468A32CFC15BE983A7B86269; // 0x0DB8(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_212C9C494FFAC2A6C557D1B66533A41F; // 0x0E00(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3224E23C4A2767CEC403E59C22B8B3E6; // 0x0EC8(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_15D15772474595D19AF1F790186093BE; // 0x0F90(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_35559EA94B23FA77C6CD89B561D5DB6D; // 0x1058(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4F98860D4392C11291B1B89E839715D5; // 0x1120(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_64F5213F44F6C8E3D2C329BD41A92DBD; // 0x11C0(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_D42EE8C8432F1D3DCF8F90BFD0A1082C; // 0x1288(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_0FEFB10E497AB8C1C15842B114112872; // 0x1328(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8B4EBD4245934A845AD55D81AC43EA77; // 0x13D8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8486CE72431A6869206A04B5AE62047F; // 0x1450(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_E3DB1DEE4ABDCE4781FB15AFE209BFB2; // 0x14F0(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_1215EB43452CF95AEBDDB2ADCA7B6E4A; // 0x1538(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_F9E6B6864484F207DF4EE3823FD6371A; // 0x1620(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_2D3A78614F14AE521BCCDE9A564A9F04; // 0x1708(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_D2AFCA9C45F8BE21F753C89F2F54C2C0; // 0x17F0(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_4CD12B8C41C447117882728B4051538B; // 0x1838(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_62B5C54C40E6A96ADFD307A7AFB01134; // 0x1920(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_138F2E37435C2D93C00F6EB7354BD941; // 0x1968(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_7DD3DF554CF4D653EFFA4797E41D73F3; // 0x1A50(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A7EF34744168F70F52B4DB8ACE908962; // 0x1B38(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BDC848304517572AEC670690A31FE6A9; // 0x1BD8(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_C026E83D4B1EB2BE2AE50C9D5EF6C43A; // 0x1C78(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9D410D5C40859AC7F271F1BBA1D8D466; // 0x1D40(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9A1F5A984D86DFE282B8D597CD80FDCD; // 0x1E08(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_EDB67FC741D35218E9D5DB8A24E2CEF6; // 0x1ED0(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7202D1D04C16EADDDDFED1A4F7BFF0DA; // 0x1F98(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1EDFBBD541806DD3659B0E99736A5818; // 0x2060(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_5A710ACD41F42FE3C012A680210962DA; // 0x2100(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_D934F6B348BFFE0B74C5EB8963953F9E; // 0x21E8(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_678BE19C43459FDEA59359A2998C1905; // 0x22D0(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_D9E5A9FF445B595A54EE5F87AF5F96F1; // 0x23B8(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_32B718264FDB693D289BA3B8DC4BD372; // 0x24A0(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_18DA407C43E930C109E6188569889BCF; // 0x2588(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_909570794D857C63BAB1CBA4E54C44D5; // 0x2670(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A3A7BAE04C963A643A602087D0906C82; // 0x2710(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7AEF228A46F0FA34A4FFDD9F2B7B6225; // 0x27F0(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_07A5DF494EA3E8A8AC286E8B5D52141D; // 0x2838(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_E6C64FB848493F82383C7689C5549FE1; // 0x2880(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B9E4263F4A3DDCD207DFCDA671EFB851; // 0x2938(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B0D27D3F4A943CCC6E3DD4908202ED5E; // 0x2958(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3507E80B472A2A130CCBD590DC71559D; // 0x2980(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_43D5E34F4A62459ABAE87EBD9E84E0FB; // 0x29C8(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_44C35E524F8CB6B285F904AA0C7CA50C; // 0x2A90(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_59F6EF4949610EBA452165A628C70239; // 0x2AD8(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5072A8BB42704AF84A26BCB0F5A5D6BE; // 0x2B20(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_D96D6CD94E000DEDE142CF856DE91A0B; // 0x2B40(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_BD9A985947773590E83C01B4A5F9BE47; // 0x2B68(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0BB5F7444AE9CDBC4CA79FA3A6E7CCFA; // 0x2BB0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_FBF5D23E4C0CA9CBD54268BF720068A0; // 0x2C28(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51DB43CF4CAA4E12BA9BE8B5964E5B5F; // 0x2CD8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C60226784C919045B0715F8F426E03D0; // 0x2D50(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40C44BBB48788CCAB309C5A98B86DF49; // 0x2DF0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_82D561A84B9BFE373688A1A37F26D734; // 0x2E68(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_DF288009453627C19A0AF6AD7579D8E7; // 0x2F08(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6F459EBA495C678DF3AC0BA3CF9834C6; // 0x2FA8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43192052425A9294A0A2B68630D73320; // 0x3020(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4E7BE2B44EF1F8A39E1C2899BD3F5626; // 0x3098(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_AB25B9D948C568D986889DA90F7DE17E; // 0x30B8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_55796EA44E9E1B77F10D9FB61FE08A91; // 0x3168(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_290B367A4E421A176C70F589ED34F7C9; // 0x3248(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_D1D1AE90489F59C2849C9881A92FFADB; // 0x3328(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_B748F1514D7558776DD3BAB4B996D077; // 0x3408(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4B05D65D4374FC78D4D3E1A26B1FD805; // 0x34E8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1BA7CEBB4965A44EC361F29D6B475A44; // 0x3598(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_630574AC40A1D0400A13C68580382955; // 0x3678(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_0ECF5030427EF2146D75A183E7EE4E5F; // 0x3758(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_E58E09974FAC6C58747EDFA7BF835105; // 0x3838(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2B6FDA04452A2FAC98144C9733C7A545; // 0x3918(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2457185F446204F968CB05943626E534; // 0x39B8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A45624EA421F06FBDEEE46A2F4C396A3; // 0x3A68(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6C31395D4C454D25CFF3568BBC4C1E33; // 0x3AE0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EA76F4404E14BB0B9C9AC4949793EE25; // 0x3B00(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_D52C6AE9440C9C8187C55194222D546B; // 0x3B28(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D779E38447BF45868B9C1EA79DA4DFBA; // 0x3B70(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BC5FFD0D4D98329BB433AC886493A977; // 0x3B98(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7D7BBD494D7374F1BCD64A9BC3CA4D66; // 0x3BC0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_0973EB9448118E9425559DB843754E97; // 0x3C38(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19AC91F44C948E9AD802ABB46EA2E300; // 0x3CD8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4357894244313AEFB5F194BF998FF681; // 0x3D50(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_318FB88C432ACA3B425147905750FE0A; // 0x3DF0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_F718AA3C4ABD65C8D792B38D08632C99; // 0x3E68(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E411F75D4BC691DF26491AB7885D423B; // 0x3F08(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FE1094EC4E1F18DFBDD78FAF2A162394; // 0x3F80(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5033CD4C4187E8DC2FED96849DE6ABF4; // 0x3FA0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0AA4DF1541DA75D03E7AEBA909C5DC16; // 0x3FC8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64FE6ED94D9E3AC69376B1BFF73CB123; // 0x3FF0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_508F8A324754E7A1B93F97A1C84B8185; // 0x4068(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33419CA14369F36811F22185A21ABA3D; // 0x40E0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_90ECCBFC4D5336E28F04A7AEB72F2936; // 0x4158(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_90346EA04712D54A557D9299126AC937; // 0x41D0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_8680176B43C1777557E246B240F816BC; // 0x4248(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C6AF905545F60139372A61BE6AC103D6; // 0x42E8(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7E8065A14B04D9714ED62B807D72D3E6; // 0x4308(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_601BA56A448423A12EE9D4A6263CB3EE; // 0x4380(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19DBDFFE4633CBBD22B7D4BAB1EAEB18; // 0x4430(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_264A1DFE47B0219803B338BFDFFB2EB2; // 0x44A8(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A5AF6A7B4E61783C0DE5A2AFBEE9312E; // 0x4548(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14DBE403475B6F23837AAC81DC1A5D40; // 0x45C0(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_E50163804DA4A854AC2838A998295CDB; // 0x4660(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5108C6154A551EF2B9EAC3A3EE382E01; // 0x4700(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F3BAC93E424E8C86D26FB98017BB32AE; // 0x4778(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83FE2DA94ABB4A102D42519850449C0F; // 0x47F0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9036FE674A135713F879C98101F8F7D9; // 0x4810(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3DF48D3642C8379A94FE0080E0523C96; // 0x48C0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9517AB52434E3A3E4EBD3C99AA1E3878; // 0x48E0(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DB1E02B54F58428514564B9EE059D0B3; // 0x4990(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_9ECBC7F340C156BFACE0DF85E5448BA2; // 0x49B0(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2C28CE2246B6D3ABAE2AF8A04584982F; // 0x4A60(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_763415674FCAE525D38ED59D5CBA7415; // 0x4B10(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_0D1C39FB459F2D6EFC7777840E715DBE; // 0x4B88(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_F16630B54DE058F395763CBDD84035DA; // 0x4C28(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_601E29474F3A535E188338B10F0B3057; // 0x4CD8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_AEC8747346B1518EB6C6E694656E811F; // 0x4D88(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B88BE57846D83AC8245FFFB173AA5817; // 0x4E28(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_943EB33242B42FA1A8F870B10C72ED86; // 0x4EC8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C4AAD1A14A758EF933C2049CBA38ADC5; // 0x4F40(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6312F7CE4C80CCF5A6C54CBB04B1C4BE; // 0x4FB8(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7582641A4AEE94BEBA68FE863ADD4CB0; // 0x5098(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_F00FEC754A756513C95AF7930494D1AC; // 0x5178(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6B345BBD4B35E31A979DCDBD461C14C0; // 0x5228(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1A3925E34742BFF8A8CA68AD878F8C22; // 0x5308(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9B8583D44C5E1F41CFC2F4A81AC0FB81; // 0x53E8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DCCD6B8341DD307950168A8975CE7244; // 0x5460(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_CC4361274BAA7B5BFAAD60B13BBA32D3; // 0x54D8(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_529CE72E4EC3B7ADB406078371C77696; // 0x5578(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_30C9CE22402F89F0F7ECF79176539C4B; // 0x5628(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_41CE1DC449F0E89CBFF5E29E7DF0E3E4; // 0x56D8(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_016CCF1D4D8100C74AFBF7BD1C064608; // 0x57B8(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_96B9EF0D47B9BC179D205CBAD84F9E34; // 0x5898(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_839C64D04DDC542D77069C987D80C1CF; // 0x5978(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_C1BC5EB8410D6F0DC075DDB0CE241552; // 0x5A58(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_792903E24CF65B59296DD286C2A57FCA; // 0x5B38(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_309548954F6F31BFE0A02F87EC5D77EF; // 0x5C18(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_04CB28F449290ABE829F1FA0D492921A; // 0x5CF8(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5A5D47734CD9C2B2FE1DB491FB3C1231; // 0x5DD8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B549F5884EDC0A33449BC3AF5012DC89; // 0x5E50(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1243D67349D8B80D9488449153D5C3F3; // 0x5EC8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30F48A22413ECFF8E002C6B09BE24DA9; // 0x5F40(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_02103245408F65A607D9A99E8A0A0FB6; // 0x5FB8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5DFBCFED43A2F710A9CD77B6298CD46D; // 0x6068(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3F37E0B543D8AA27D05594BF2D26F66F; // 0x6108(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_962BC7D243006CDFB0348FAEFA545E30; // 0x61A8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36BF63434B33C4BCF48F10AA062169AA; // 0x6258(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_972AAF624F8881F37169A69A1FE49328; // 0x62D0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_AE4882D84FB42702A1BC01B9AC34A8A5; // 0x6348(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_DC3DFF22443695F0697D3286764B3585; // 0x63F8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8B560ADE4792C7F0407108A97B9C93E4; // 0x64A8(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4BEEC4F849F47A254DFC72A18A23DA52; // 0x6548(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_668E164F4AAE845F4E9D7AA8DC60333B; // 0x65C0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C88D83BB421722DF6BCF28A2428538D4; // 0x6638(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57BCF7B14D7E47979261D08038B1256F; // 0x66D8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AD5F3B43451EA90300DDD48D6C4B51CF; // 0x6750(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4BB1ABCE4ECC03FB33E8A1A70C6B1E30; // 0x67C8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A9AFA08D4A8D7CF9CD03979CCC789D0D; // 0x6840(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2A37761D4DBC43CE1010F1BA08688D40; // 0x68B8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_032ED6DC412E58AE95C449BB30FA4F80; // 0x6930(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7395C84F494CBD6398F98AB655DBAFAA; // 0x69A8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F7F861DB42BB092FD79BF79D33CE22A5; // 0x6A20(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CA3A9686487ECD5628986B8502852739; // 0x6A98(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_559653FF4DB09638DC107AA11B81AF64; // 0x6B10(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2B9C43F04C6942DEED693FAB79D2276E; // 0x6B88(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9F5812BB458A1721FC10AF87AA6B0FD3; // 0x6C00(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EA61488A4DEF6C4E6E794C97669D7C0C; // 0x6C78(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9FF3C09340447BE2EC67859D1DEC4F54; // 0x6CF0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F62759B64AD72ECADE5C568CEC6170F6; // 0x6D68(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3D0C7D874B4D7820DD36EDBF237ADA8E; // 0x6DE0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_F206BD1145DE06452110A9BCE46AFC38; // 0x6E00(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_47EB10FD46B5A380E26E678485CD0166; // 0x6EB0(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_AD6CCA0A474C06DAA00B1DAD2373A398; // 0x6F78(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5D0EB04B4A335D4E7F3A8592916A894F; // 0x6FC0(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91B76CFC40859A715B70FE9B0ED37090; // 0x7060(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69BE99FE492C957D1F4FCBA94913C922; // 0x7088(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80E2067B4D537055B098B0A84A2704F2; // 0x70B0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9B22423749787BE18E7E72B016058849; // 0x70D8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3ADF798E4B3C318FA623BFBC126574ED; // 0x7100(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_924EBACB41E603915731FCA9FC279CF7; // 0x7128(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C624BE7B42EBE1C4037FBCA9115458F1; // 0x71A0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C61017944C98A21851837FBAE0208902; // 0x71C0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32634ABC44C6681A01092C9FA81F0917; // 0x7238(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_281C0E634BDF88FD61E0BC8B926EDDE5; // 0x7258(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_908F0C0A416FAA29C1B405A306FEE80D; // 0x7338(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_454F04A64B002B2AF506A3857D606A4E; // 0x7358(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_164B6AAC44145E60418973A85CD602A0; // 0x73D0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B69D50DC42C6077B472FE2AB3AF89C0E; // 0x73F0(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_693C353A471131B0A6CFE1A936E84F60; // 0x74A0(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_D277B0A3404087473CADFCB702F9EFB8; // 0x7558(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43351F374969FA9743C52CA706F377A3; // 0x7610(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9EF377A249FEFBA937F05998D88E8D84; // 0x7638(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35D67AC04C3948B2E7157E98AAF6B6B0; // 0x76F0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E40D838A4B91D873AA0E849DDB253CEE; // 0x7718(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2E2CD7064B4102176F82C496CA1E6AB5; // 0x7740(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2EDB68F7455611C8D085EE9E82135008; // 0x7768(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CA29DE8148713DAB63041EAE3C61B2D8; // 0x7790(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F6BF6DFE4A7D86F31EE27099FC948D78; // 0x77B8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84921EDF4973B47E61342CA9D5F59870; // 0x77E0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3A4E2EB043A1A56917A3F6917CE9F59B; // 0x7808(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2D8DBBE94D827D3CBCA5D390F0B9DB8A; // 0x7880(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2D9B60A949F44D04A67CD1A06478C25F; // 0x78A0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6CAECF87477EBFB9D1E1A39857ADE071; // 0x7918(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C1F421CC49369A4D8B4DAEB5C114F6D6; // 0x7938(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F0D2D27C4B759AF6FB6676A43191C303; // 0x79B0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5A5430F3496012C6D4C094B5807401DA; // 0x79D0(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_B3A01A944B943708F0490DABA56FC60D; // 0x7A80(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_EF9CAD4F44FD23CA08984DB660E34CD6; // 0x7AC8(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6A9B03D444F2734AFAD9B3A3058C96F7; // 0x7B10(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_92D4ABEF46A5954FF2F02D95B39DFAEF; // 0x7B58(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_E40654B14EADB768A05D7FA7D61D9492; // 0x7C20(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_61ADF5E74F52DD576CA93FB81D8088CD; // 0x7CE8(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_A7775B3447A6A36CB2972C8A7E98E0FE; // 0x7D30(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_C3B57D6141779333B155109A9DAB4DCA; // 0x7D78(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BDAA6CF349727CDAD0775FB9C3B82E6A; // 0x7E28(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_A9D718D64B6A81CA87BB73920C5F9D23; // 0x7EC8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8AE5878E437BB94C82C7DBB72746A7A6; // 0x7F78(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47E499B34AD6FCFF55739CA6CD1F7167; // 0x7FF0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3155C90D43044911144DE08E5C663962; // 0x8018(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DC45AE1B4D317047A973AA93AB39EF28; // 0x8040(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2A0E728142DF0E7F590AF8B16569D012; // 0x8068(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16674CFD40950FD61AD8DB9834C259C2; // 0x8090(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8EF18C004C341EF9013133882512B5A7; // 0x80B8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_9D8D20134E276D9F9733A38941F36741; // 0x80E0(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F081185F47DC0C5C23086F83CDA2C76F; // 0x8128(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E9E9535D46A65071CAACACBDE0C7174F; // 0x81A0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_361E3ABE43E3FC51DF150B811FC7673A; // 0x81C0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2D7277D145543727975164AD0D518EC5; // 0x81E8(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E085503F4AFA7F2F8CB7B88A6D7C844E; // 0x8208(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_35F9F46743B030252CC3F380140C3514; // 0x8230(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8EDC958D41E90F09CA8D20805074B02A; // 0x8278(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29A8594F4C2A613FFE6266BF37E3468E; // 0x8318(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5013CCAC4A601B12C9F4978F96CCFB12; // 0x8390(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3BA402AC44764EAD76FD52AC88F9A1E3; // 0x8408(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8CB8E771426117803550F2A22D03790F; // 0x8480(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_14F4DA8240803F20EA7A9C83092B03A8; // 0x84F8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_51828B4E49ECE880F220B18638262054; // 0x85A8(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_79BC19CB4058811A5E90F88DAA2844E0; // 0x8688(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7ADFDF1346D476C6D1BF1E89AA916B2B; // 0x8728(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4CDB09ED4E84602BC75E0AA71AF817FD; // 0x8808(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19AB73174A5DA28DF028E5B9C6752762; // 0x8828(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6C65EAEC4F8F389CB7BC2580598ED8C1; // 0x88C8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7EDFA5524765A4113178A48629FDDCFA; // 0x8978(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F877647B47DAE1FF3E3A8B906097768F; // 0x89F0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6280E65B465718196E35E0812CC4D11E; // 0x8A68(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9B9A2780432AA53D923025A56B9036EA; // 0x8AE0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_F05F95CC450AA8EC217B6AA4D57A181A; // 0x8B58(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_780C97914BC7F65041EE91B8F832C0E2; // 0x8C38(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_49CF30B34BD65C9BA50B299F2905846F; // 0x8CD8(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_ECCEB6364606E4748FD9F99052896776; // 0x8DB8(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4823239242245425CB23CCB47C70EE56; // 0x8DD8(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C8F8334E49A210296C68BB8F87C10EA7; // 0x8E88(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_872DF0B04D3373AB568E89A7B240DD87; // 0x8F28(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24507B25410D7F2C8DA7F0BD52A463B0; // 0x8FE0(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B7AF7B47412EE15BBF0A6B89C92A086B; // 0x9098(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C2A5C03848D42B179EF42DB871FB5870; // 0x90C0(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43F67EF646021BD6AF7E068D4AB3F6EE; // 0x9108(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EF63F909479FFB6477643CBC0860CD59; // 0x9130(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E8EBDDF84114682D26FD2C81053FEA6C; // 0x9158(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BCCC252F4CA126F25D7E66A59B7FED24; // 0x9180(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_965BC0BF4FCB45C424F529B283CD7017; // 0x91A8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_83F8304A49A927086E8A77982A45E72E; // 0x91D0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0492DA4245D8B26DD433BCB025A770A0; // 0x9248(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5D0A59944F20576074A9428571B5E014; // 0x9268(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EB5B15DA4FE03D0C29A4DD88A245E5BF; // 0x9348(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_42BA786149877944D46B78A2DEAC82F9; // 0x9368(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6F4E927F49ED3311AD27E6B203631029; // 0x9448(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1102E398495630C8BD24B0A119BAE4EB; // 0x9468(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4BE4A0AD46463D9531B031B2F886CF91; // 0x9548(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_A65A0E90467503CCA65AFA9E92699113; // 0x9568(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2408A9C94030A8266E5892AAEFC2A27A; // 0x9618(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69799CF9451FD0B8DACD2DB0A0200EB8; // 0x96D0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_6E3C0FBE4F29A719C433119F277E44F7; // 0x96F8(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7C6DB42746CC0437B2EE36AE38CEF5C2; // 0x97C0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2F60382D4BE94D9EF40AC79C351CA0AD; // 0x97E8(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_DF79DC7149262801FB7F34A737775932; // 0x98B0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1304B5454E264DE5F183128596DB6ECB; // 0x98D0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_340626E644D1559176E4E4B0DF9D8EBE; // 0x98F0(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22E630C34841ED5BD8F28ABF64C0EC36; // 0x99A8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3C49AFDE429691EB4F0758BA04570452; // 0x99D0(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2002D70C4FF5F4A355867FA2E68F04AA; // 0x9A88(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_FF42BAF749C82DE24E8D51A7DC4DA93B; // 0x9B40(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_CEE279074C5AC51F1DC006968CFB5202; // 0x9B68(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_40BD9CFD4880062BA1A2CD9154D27D44; // 0x9C18(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8ED0E7944DE767FA0963E1BC82952AE5; // 0x9CB8(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_87D729A546D555D38479DE8A401F94B5; // 0x9D70(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6BD61FF94CE125A3119B0E8975082E35; // 0x9D98(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2B951C1C4D13D8147985A5A8286ADA04; // 0x9E60(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_CB179C0D4F309BA8001BADA0EEA04235; // 0x9E88(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_01B7053142EFE67FBA95C786D582CB66; // 0x9F40(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_306DCB98418A974285249C9DD7B7F6AE; // 0x9F68(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5E222ED94AFE5DDA07B90F86CBFCB084; // 0x9F90(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46E688D545894849F40C1F88C8D90173; // 0x9FB8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70ED0EBF42E12B66B608B38308E744D9; // 0x9FE0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_90482B474C9AC645CFDAEEBCBE0E366F; // 0xA008(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BA10823444215E9BC383728410916E06; // 0xA080(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B2EFF4C14A1F734FA4D1E1913AE49B71; // 0xA0A0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16A5EF084668193CD842D5B50825F1F2; // 0xA118(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CC701BBF4557AC99F6F309B08CE61512; // 0xA138(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2D41A539442D621DACAB0BA2F07B2E10; // 0xA1B0(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_D8B9BD97478E8A81105404A3468DDEBD; // 0xA278(0x00E0)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8457E52E48F0E6E62BCFF282A5870244; // 0xA358(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_713B4B9347BF9158FBC67484BBCA728F; // 0xA378(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4A077648442383282085DE81C04B73A7; // 0xA428(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5E0854054CDC914926C6CE808B74CFE9; // 0xA450(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E093CD3747CDAA45872C619A881CE021; // 0xA478(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8E3C186049B00C9EB5D8A9A044462E06; // 0xA4A0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_032A09E74D65FA2D4926FC8AD83E04FB; // 0xA518(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_828E6B1A421C581BD0874DB10B993C9E; // 0xA538(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46237C12403B91F0ACEDCEB06DCB893F; // 0xA5B0(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_94C2A6B0434BC03DC9968387A523D1AC; // 0xA5D0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B50F62424094F323A82454BD05D74E78; // 0xA648(0x0020)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6594C37947648BE1F1AE6BBAA73AD27E; // 0xA668(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_103DCA994218D3CFD59193B91952B134; // 0xA718(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4D8494D04039BF91B7C3DC9866DD3F93; // 0xA7D0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1557DD6549699E3886B2FEBE8E3FB5F2; // 0xA7F8(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_CBD5183646EFF68448734CBD4786E004; // 0xA870(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F1DFE0EF4874DD95B030DCBD585A2D79; // 0xA938(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_40EFE18B41271375B2C821BA51FB7634; // 0xA960(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_722C66FD406A00DFD48125B695F6FD9D; // 0xAA18(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4BE1F0C64B99316590BF5ABF557E3A3A; // 0xAAD0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16235BAF435E96097D4B94918A3D4475; // 0xAAF8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0643DEDE4A77FAF2875D7083089C585D; // 0xAB20(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8293DDDF4E2A1526CC23D0A3B2868281; // 0xAB48(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48245B334E7FD2C686565A9CC22E1AA3; // 0xAC00(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_6307BDB24D128896A0A67182A9868535; // 0xAC28(0x00F8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8205BE85421C07F245B7CABA8AAD0DBB; // 0xAD20(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_AC41B76E416BDCE09BC30283EB514869; // 0xADC0(0x0048)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5DB8D19C4DEE5F778AFD5281633FF747; // 0xAE08(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_AC83F269498894AA4919CF8CCD2B53E8; // 0xAEA8(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_E67BBE1B48261D2C252BBD8C54AB8B58; // 0xAF60(0x00B8)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F3360E9C4B6139E6CAE68CA47B066C69; // 0xB018(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_AE62B4F64FE42412EA99AA97F7F5C462; // 0xB040(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_F81034B14B4E58EACA05DFB4B0D06041; // 0xB068(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B46874674309EB0EC890E6A1A07DCF7C; // 0xB130(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BA20094E4B8EBB939E19659B6EFAEB16; // 0xB1A8(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CFF77282445107B5776E0982A76CD691; // 0xB248(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FAE3F1F549694710D67A96849A0281CE; // 0xB2C0(0x0078)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_EADB03BF4FC99FB6FF13AFB96F27F12E; // 0xB338(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18833D104262E86B872E368286A77694; // 0xB3E8(0x0078)(NativeAccessSpecifierPublic)
