#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Disintegrator_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Disintegrator_AnimBP.Disintegrator_AnimBP_C.PlayShootMontage
// 0x0010 (0x0010 - 0x0000)
struct Disintegrator_AnimBP_C_PlayShootMontage final
{
public:
	class UBFGAnimation_Variables*                CallFunc_GetVariables_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Disintegrator_AnimBP_C_PlayShootMontage) == 0x000008, "Wrong alignment on Disintegrator_AnimBP_C_PlayShootMontage");
static_assert(sizeof(Disintegrator_AnimBP_C_PlayShootMontage) == 0x000010, "Wrong size on Disintegrator_AnimBP_C_PlayShootMontage");
static_assert(offsetof(Disintegrator_AnimBP_C_PlayShootMontage, CallFunc_GetVariables_ReturnValue) == 0x000000, "Member 'Disintegrator_AnimBP_C_PlayShootMontage::CallFunc_GetVariables_ReturnValue' has a wrong offset!");
static_assert(offsetof(Disintegrator_AnimBP_C_PlayShootMontage, CallFunc_Montage_Play_ReturnValue) == 0x000008, "Member 'Disintegrator_AnimBP_C_PlayShootMontage::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function Disintegrator_AnimBP.Disintegrator_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Disintegrator_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Disintegrator_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Disintegrator_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Disintegrator_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Disintegrator_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Disintegrator_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Disintegrator_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Disintegrator_AnimBP.Disintegrator_AnimBP_C.ExecuteUbergraph_Disintegrator_AnimBP
// 0x0008 (0x0008 - 0x0000)
struct Disintegrator_AnimBP_C_ExecuteUbergraph_Disintegrator_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Disintegrator_AnimBP_C_ExecuteUbergraph_Disintegrator_AnimBP) == 0x000004, "Wrong alignment on Disintegrator_AnimBP_C_ExecuteUbergraph_Disintegrator_AnimBP");
static_assert(sizeof(Disintegrator_AnimBP_C_ExecuteUbergraph_Disintegrator_AnimBP) == 0x000008, "Wrong size on Disintegrator_AnimBP_C_ExecuteUbergraph_Disintegrator_AnimBP");
static_assert(offsetof(Disintegrator_AnimBP_C_ExecuteUbergraph_Disintegrator_AnimBP, EntryPoint) == 0x000000, "Member 'Disintegrator_AnimBP_C_ExecuteUbergraph_Disintegrator_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Disintegrator_AnimBP_C_ExecuteUbergraph_Disintegrator_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'Disintegrator_AnimBP_C_ExecuteUbergraph_Disintegrator_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

