#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Disintegrator_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Disintegrator_AnimBP.Disintegrator_AnimBP_C
// 0x00F8 (0x04F0 - 0x03F8)
class UDisintegrator_AnimBP_C final : public UBFGAnimationInstance
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_FEC7741846D950CAC2BFCDB3DA387260; // 0x0408(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9F792BFB4100C7A3D03CA1BE9582F806; // 0x0428(0x0078)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_E628AE7C4C42A986F4778E88422C835E; // 0x04A0(0x0048)()
	bool                                          ShootSwitch;                                       // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void PlayShootMontage();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Disintegrator_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Disintegrator_AnimBP_C">();
	}
	static class UDisintegrator_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisintegrator_AnimBP_C>();
	}
};
static_assert(alignof(UDisintegrator_AnimBP_C) == 0x000008, "Wrong alignment on UDisintegrator_AnimBP_C");
static_assert(sizeof(UDisintegrator_AnimBP_C) == 0x0004F0, "Wrong size on UDisintegrator_AnimBP_C");
static_assert(offsetof(UDisintegrator_AnimBP_C, UberGraphFrame) == 0x000400, "Member 'UDisintegrator_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDisintegrator_AnimBP_C, AnimGraphNode_Root_FEC7741846D950CAC2BFCDB3DA387260) == 0x000408, "Member 'UDisintegrator_AnimBP_C::AnimGraphNode_Root_FEC7741846D950CAC2BFCDB3DA387260' has a wrong offset!");
static_assert(offsetof(UDisintegrator_AnimBP_C, AnimGraphNode_SequencePlayer_9F792BFB4100C7A3D03CA1BE9582F806) == 0x000428, "Member 'UDisintegrator_AnimBP_C::AnimGraphNode_SequencePlayer_9F792BFB4100C7A3D03CA1BE9582F806' has a wrong offset!");
static_assert(offsetof(UDisintegrator_AnimBP_C, AnimGraphNode_Slot_E628AE7C4C42A986F4778E88422C835E) == 0x0004A0, "Member 'UDisintegrator_AnimBP_C::AnimGraphNode_Slot_E628AE7C4C42A986F4778E88422C835E' has a wrong offset!");
static_assert(offsetof(UDisintegrator_AnimBP_C, ShootSwitch) == 0x0004E8, "Member 'UDisintegrator_AnimBP_C::ShootSwitch' has a wrong offset!");

}

