#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Farmer_03_PostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Farmer_03_PostAnimBP.Farmer_03_PostAnimBP_C
// 0x0188 (0x0420 - 0x0298)
class UFarmer_03_PostAnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_FF42351F4CECB5E246529BB4E2E59D86; // 0x02A8(0x0020)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_8B9FC51B4E58DDECABE7B1B5F7F71F68; // 0x02C8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_AC94238241EFF4128AE6F791834371FC; // 0x0310(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3BB41E35453EF1BC34CAD696CE1E5A76; // 0x03D8(0x0048)()

public:
	void ExecuteUbergraph_Farmer_03_PostAnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Farmer_03_PostAnimBP_C">();
	}
	static class UFarmer_03_PostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFarmer_03_PostAnimBP_C>();
	}
};
static_assert(alignof(UFarmer_03_PostAnimBP_C) == 0x000008, "Wrong alignment on UFarmer_03_PostAnimBP_C");
static_assert(sizeof(UFarmer_03_PostAnimBP_C) == 0x000420, "Wrong size on UFarmer_03_PostAnimBP_C");
static_assert(offsetof(UFarmer_03_PostAnimBP_C, UberGraphFrame) == 0x0002A0, "Member 'UFarmer_03_PostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFarmer_03_PostAnimBP_C, AnimGraphNode_Root_FF42351F4CECB5E246529BB4E2E59D86) == 0x0002A8, "Member 'UFarmer_03_PostAnimBP_C::AnimGraphNode_Root_FF42351F4CECB5E246529BB4E2E59D86' has a wrong offset!");
static_assert(offsetof(UFarmer_03_PostAnimBP_C, AnimGraphNode_SubInput_8B9FC51B4E58DDECABE7B1B5F7F71F68) == 0x0002C8, "Member 'UFarmer_03_PostAnimBP_C::AnimGraphNode_SubInput_8B9FC51B4E58DDECABE7B1B5F7F71F68' has a wrong offset!");
static_assert(offsetof(UFarmer_03_PostAnimBP_C, AnimGraphNode_ApplyAdditive_AC94238241EFF4128AE6F791834371FC) == 0x000310, "Member 'UFarmer_03_PostAnimBP_C::AnimGraphNode_ApplyAdditive_AC94238241EFF4128AE6F791834371FC' has a wrong offset!");
static_assert(offsetof(UFarmer_03_PostAnimBP_C, AnimGraphNode_SequenceEvaluator_3BB41E35453EF1BC34CAD696CE1E5A76) == 0x0003D8, "Member 'UFarmer_03_PostAnimBP_C::AnimGraphNode_SequenceEvaluator_3BB41E35453EF1BC34CAD696CE1E5A76' has a wrong offset!");

}

