#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM04_AlienPoolParty

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function MM04_AlienPoolParty.MM04_AlienPoolParty_C.ExecuteUbergraph_MM04_AlienPoolParty
// 0x10D0 (0x10D0 - 0x0000)
struct MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0008(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0140(0x0130)(ConstParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement19;             // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement18;             // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex5;       // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue5;                // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal5;                // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext5;          // 0x0298(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement17;             // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement16;             // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement15;             // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex4;       // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue4;                // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal4;                // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext4;          // 0x0310(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement14;             // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement13;             // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue;        // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement12;             // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement11;             // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x03A0(0x0130)(ConstParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x04D0(0x0048)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement10;             // 0x0520(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex3;       // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue3;                // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal3;                // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext3;          // 0x0538(0x0050)(ConstParm)
	class APlayerController*                      CallFunc_GetPrimaryPlayerController_ReturnValue;   // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGWeapon*                             K2Node_CustomEvent_NewParam1;                      // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_EquipmentManager*    CallFunc_GetComponentByClass_ReturnValue;          // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGWeapon*                             CallFunc_GetCurrentWeapon_ReturnValue;             // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement9;              // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement8;              // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid;                    // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem;              // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_MusicSystem_valid1;                   // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D2[0x6];                                      // 0x05D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem1;             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement7;              // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex2;       // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue2;                // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal2;                // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext2;          // 0x05F8(0x0050)(ConstParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x0650(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue2;        // 0x0698(0x0048)()
	TArray<class ABFGNPCCharacterGameplay*>       CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors; // 0x06E0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAvailableShotRatio_ReturnValue;        // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F9[0x3];                                      // 0x06F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABFGWeapon* _pWeapon)>   K2Node_CreateDelegate_OutputDelegate;              // 0x06FC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ABFGWeapon* _pWeapon)>   K2Node_CreateDelegate_OutputDelegate1;             // 0x070C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue1;       // 0x071C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71D[0x3];                                      // 0x071D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x0728(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_GetWorldFromContextObjectSafe_ReturnValue; // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGGameState*                          K2Node_DynamicCast_AsBFGGame_State;                // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x0748(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid2;                   // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem2;             // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0760(0x0088)()
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x07F0(0x0130)(ConstParm)
	class ABFGGameState*                          CallFunc_GetGameState_ReturnValue1;                // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGStreamingLevelManager*              CallFunc_GetStreamingLevelManager_ReturnValue;     // 0x0930(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_939[0x7];                                      // 0x0939(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGStreamingLevelHandle*               CallFunc_RegisterLevel_ReturnValue;                // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGGameState*                          K2Node_Event__pGameState;                          // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Manager*                      K2Node_Event__pQuestManager;                       // 0x0950(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestInProgress_ReturnValue;            // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestToBeStarted_ReturnValue;           // 0x0959(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A[0x2];                                      // 0x095A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x095C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0961(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_962[0x2];                                      // 0x0962(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0964(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestState_ReturnValue;                 // 0x0968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_969[0x7];                                      // 0x0969(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABFGNPCCharacterGameplay*               CallFunc_Array_Get_Item;                           // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x097C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x097D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97E[0x2];                                      // 0x097E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x0980(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x0AB0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex1;       // 0x0AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue1;                // 0x0ABC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal1;                // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC4[0x4];                                      // 0x0AC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext1;          // 0x0AC8(0x0050)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x0B18(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x0C48(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x0C50(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTags_ReturnValue;       // 0x0C58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C59[0x7];                                      // 0x0C59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x0C60(0x0130)(ConstParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable4;                // 0x0D90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D91[0x7];                                      // 0x0D91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x0D98(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex;        // 0x0DA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue;                 // 0x0DA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal;                 // 0x0DA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DAC[0x4];                                      // 0x0DAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext;           // 0x0DB0(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x0E00(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x0E08(0x0130)(ConstParm)
	class ABFGWeapon*                             K2Node_CustomEvent_NewParam;                       // 0x0F38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABFGWeapon* _pWeapon)>   K2Node_CreateDelegate_OutputDelegate2;             // 0x0F40(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetAvailableShotRatio_ReturnValue1;       // 0x0F50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0F54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F55[0x3];                                      // 0x0F55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABFGWeapon* _pWeapon)>   K2Node_CreateDelegate_OutputDelegate3;             // 0x0F58(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable5;                // 0x0F68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F69[0x3];                                      // 0x0F69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABFGWeapon* _pWeapon)>   K2Node_CreateDelegate_OutputDelegate4;             // 0x0F6C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Get_MusicSystem_valid3;                   // 0x0F7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F7D[0x3];                                      // 0x0F7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem3;             // 0x0F80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacterGameplay*               CallFunc_Array_Get_Item1;                          // 0x0F88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0F90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0F94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0F95(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable4;                      // 0x0F96(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F97[0x1];                                      // 0x0F97(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable8;                             // 0x0F98(0x0130)(ConstParm)
	bool                                          Temp_bool_IsClosed_Variable5;                      // 0x10C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty) == 0x000008, "Wrong alignment on MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty");
static_assert(sizeof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty) == 0x0010D0, "Wrong size on MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, EntryPoint) == 0x000000, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_struct_Variable) == 0x000008, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_PlayVoiceover__outResult) == 0x000138, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_SwitchEnum_CmpSuccess) == 0x000139, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_bool_Has_Been_Initd_Variable) == 0x00013A, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_struct_Variable1) == 0x000140, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_bool_Has_Been_Initd_Variable1) == 0x000270, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_bool_IsClosed_Variable) == 0x000271, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_bool_Has_Been_Initd_Variable2) == 0x000272, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement19) == 0x000278, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement19' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement18) == 0x000280, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement18' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iObjectiveIndex5) == 0x000288, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iObjectiveIndex5' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iValue5) == 0x00028C, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iValue5' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iTotal5) == 0x000290, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iTotal5' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__eventContext5) == 0x000298, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__eventContext5' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement17) == 0x0002E8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement17' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement16) == 0x0002F0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement16' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement15) == 0x0002F8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement15' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iObjectiveIndex4) == 0x000300, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iObjectiveIndex4' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iValue4) == 0x000304, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iValue4' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iTotal4) == 0x000308, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iTotal4' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__eventContext4) == 0x000310, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__eventContext4' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement14) == 0x000360, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement14' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Add_IntInt_ReturnValue) == 0x000368, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00036C, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Divide_IntInt_ReturnValue) == 0x000370, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_SwitchInteger_CmpSuccess) == 0x000374, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement13) == 0x000378, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement13' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_bool_Has_Been_Initd_Variable3) == 0x000380, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_PlayerState_UnlockTag_ReturnValue) == 0x000381, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_PlayerState_UnlockTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement12) == 0x000388, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement12' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement11) == 0x000390, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement11' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_bool_IsClosed_Variable1) == 0x000398, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_struct_Variable2) == 0x0003A0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x0004D0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_int_Array_Index_Variable) == 0x000518, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement10) == 0x000520, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement10' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iObjectiveIndex3) == 0x000528, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iObjectiveIndex3' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iValue3) == 0x00052C, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iValue3' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iTotal3) == 0x000530, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iTotal3' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__eventContext3) == 0x000538, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__eventContext3' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GetPrimaryPlayerController_ReturnValue) == 0x000588, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GetPrimaryPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_CustomEvent_NewParam1) == 0x000590, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_CustomEvent_NewParam1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_K2_GetPawn_ReturnValue) == 0x000598, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GetComponentByClass_ReturnValue) == 0x0005A0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GetCurrentWeapon_ReturnValue) == 0x0005A8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement9) == 0x0005B0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement9' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement8) == 0x0005B8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement8' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Get_MusicSystem_valid) == 0x0005C0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Get_MusicSystem_valid' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Get_MusicSystem_MusicSystem) == 0x0005C8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Get_MusicSystem_MusicSystem' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_bool_IsClosed_Variable2) == 0x0005D0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Get_MusicSystem_valid1) == 0x0005D1, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Get_MusicSystem_valid1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Get_MusicSystem_MusicSystem1) == 0x0005D8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Get_MusicSystem_MusicSystem1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement7) == 0x0005E0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement7' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iObjectiveIndex2) == 0x0005E8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iObjectiveIndex2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iValue2) == 0x0005EC, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iValue2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iTotal2) == 0x0005F0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iTotal2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__eventContext2) == 0x0005F8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__eventContext2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_int_Loop_Counter_Variable) == 0x000648, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Add_IntInt_ReturnValue1) == 0x00064C, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_MakeGameplayTagQuery_ReturnValue1) == 0x000650, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_MakeGameplayTagQuery_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_MakeGameplayTagQuery_ReturnValue2) == 0x000698, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_MakeGameplayTagQuery_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors) == 0x0006E0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_int_Array_Index_Variable1) == 0x0006F0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GetAvailableShotRatio_ReturnValue) == 0x0006F4, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GetAvailableShotRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0006F8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_CreateDelegate_OutputDelegate) == 0x0006FC, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_CreateDelegate_OutputDelegate1) == 0x00070C, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_PlayerState_UnlockTag_ReturnValue1) == 0x00071C, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_PlayerState_UnlockTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GetGameState_ReturnValue) == 0x000720, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement6) == 0x000728, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement6' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GetWorldFromContextObjectSafe_ReturnValue) == 0x000730, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GetWorldFromContextObjectSafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_DynamicCast_AsBFGGame_State) == 0x000738, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_DynamicCast_AsBFGGame_State' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_DynamicCast_bSuccess) == 0x000740, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement5) == 0x000748, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement5' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Get_MusicSystem_valid2) == 0x000750, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Get_MusicSystem_valid2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Get_MusicSystem_MusicSystem2) == 0x000758, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Get_MusicSystem_MusicSystem2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_MakeStruct_SlateBrush) == 0x000760, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_bool_IsClosed_Variable3) == 0x0007E8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_struct_Variable3) == 0x0007F0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GetGameState_ReturnValue1) == 0x000920, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GetGameState_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_PlayVoiceover__outResult1) == 0x000928, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_GetStreamingLevelManager_ReturnValue) == 0x000930, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_GetStreamingLevelManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_SwitchEnum1_CmpSuccess) == 0x000938, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_RegisterLevel_ReturnValue) == 0x000940, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_RegisterLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_Event__pGameState) == 0x000948, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_Event__pGameState' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, K2Node_Event__pQuestManager) == 0x000950, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::K2Node_Event__pQuestManager' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_IsQuestInProgress_ReturnValue) == 0x000958, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_IsQuestInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_IsQuestToBeStarted_ReturnValue) == 0x000959, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_IsQuestToBeStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_int_Loop_Counter_Variable1) == 0x00095C, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_BooleanOR_ReturnValue) == 0x000960, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Not_PreBool_ReturnValue) == 0x000961, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Add_IntInt_ReturnValue2) == 0x000964, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_RequestState_ReturnValue) == 0x000968, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_RequestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Array_Get_Item) == 0x000970, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Array_Length_ReturnValue) == 0x000978, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_IsValid_ReturnValue) == 0x00097C, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_Less_IntInt_ReturnValue) == 0x00097D, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_struct_Variable4) == 0x000980, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement4) == 0x000AB0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement4' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iObjectiveIndex1) == 0x000AB8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iObjectiveIndex1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iValue1) == 0x000ABC, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iValue1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iTotal1) == 0x000AC0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iTotal1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__eventContext1) == 0x000AC8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__eventContext1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_struct_Variable5) == 0x000B18, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement3) == 0x000C48, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement3' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement2) == 0x000C50, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement2' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, CallFunc_PlayerState_UnlockTags_ReturnValue) == 0x000C58, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::CallFunc_PlayerState_UnlockTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_struct_Variable6) == 0x000C60, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_bool_Has_Been_Initd_Variable4) == 0x000D90, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_bool_Has_Been_Initd_Variable4' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement1) == 0x000D98, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement1' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iObjectiveIndex) == 0x000DA0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iValue) == 0x000DA4, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iValue' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__iTotal) == 0x000DA8, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__iTotal' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__eventContext) == 0x000DB0, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__eventContext' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, BFGK2Node_BoundQuestEvent__pElement) == 0x000E00, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::BFGK2Node_BoundQuestEvent__pElement' has a wrong offset!");
static_assert(offsetof(MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty, Temp_struct_Variable7) == 0x000E08, "Member 'MM04_AlienPoolParty_C_ExecuteUbergraph_MM04_AlienPoolParty::Temp_struct_Variable7' has a wrong offset!");
