#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM05_TelevisionsOfDoom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM05_TelevisionsOfDoom.MM05_TelevisionsOfDoom_C
// 0x00C8 (0x0300 - 0x0238)
class UMM05_TelevisionsOfDoom_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Stop_STEP_03_VO;                                   // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      MusicSystem;                                       // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  MoveToTarget_01;                                   // 0x0250(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  MoveToTarget_02;                                   // 0x0278(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class ABP_MissionTriggerZone_CustomShape_C*> LavaGrounds;                                       // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TSoftObjectPtr<class ADH1BasicVehicle>        MajesticCar;                                       // 0x02B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGMissionCinematicVolume> IntroCinematicVolume;                              // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM05_TelevisionsOfDoom(int32 EntryPoint);
	void BndEvt__A79A418DMinus42322B88Minus2932358CMinusE5BFAAF5_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__3DDDD108Minus444186D5MinusB48F23BEMinusF4A1F681_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__6E66FBBDMinus4966C49BMinusD3AB1ABCMinusBE088827_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__5EEC7397Minus4629F474MinusE524FDB5Minus1EE726A1_BFGK2Node_BoundQuestEvent_32_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature(class UBFGQuest_ElementWaitTime* _Element, int32 _Index, const struct FTimespan& _TimeLimit);
	void BndEvt__96134D85Minus4EF85F6DMinus7402F4AEMinus4DC7191E_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__28F5CC9BMinus431A385FMinus3E359E8EMinus5D1CA658_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__50E693F2Minus447546DBMinusED400CBFMinus80001A1F_BFGK2Node_BoundQuestEvent_55_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__2A68E6A5Minus4D1DA2DFMinus07C181B6Minus20AD82D8_BFGK2Node_BoundQuestEvent_42_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__C6967431Minus4BC4450DMinus08497293MinusE8980EFA_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__C02BFC60Minus445D935DMinusEF023F9DMinusB03F72A8_BFGK2Node_BoundQuestEvent_52_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__C3C34FEDMinus4AE3958EMinusA1392EB2Minus70C6F9B7_BFGK2Node_BoundQuestEvent_18_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void InterfaceUnfreezeDeadStat();
	void InterfaceSetVariables();
	void BndEvt__B3F0BA25Minus4F1C16D6MinusD2796390MinusADB86A27_BFGK2Node_BoundQuestEvent_141_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__C3C34FEDMinus4AE3958EMinusA1392EB2Minus70C6F9B7_BFGK2Node_BoundQuestEvent_196_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F866ADE6Minus41E580BCMinus101B13AEMinus2E0FBCAF_BFGK2Node_BoundQuestEvent_41_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F00B0C17Minus4AF8E355Minus220C5485MinusAD3DA89D_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__5875568BMinus4D007C2EMinus57DDE7ACMinusF1E6CAE2_BFGK2Node_BoundQuestEvent_16_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__5875568BMinus4D007C2EMinus57DDE7ACMinusF1E6CAE2_BFGK2Node_BoundQuestEvent_14_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__45940BA0Minus40EF2C25Minus942F37A3Minus562CE535_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__45940BA0Minus40EF2C25Minus942F37A3Minus562CE535_BFGK2Node_BoundQuestEvent_11_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D11B24F6Minus43471A81Minus0BDE33B7Minus17B1DD23_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D11B24F6Minus43471A81Minus0BDE33B7Minus17B1DD23_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__88F37F17Minus4CD51988MinusE42BCD91Minus86180120_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__88F37F17Minus4CD51988MinusE42BCD91Minus86180120_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__216E2895Minus4E637F6DMinusD5A6CE9BMinus5DDA0ED8_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__216E2895Minus4E637F6DMinusD5A6CE9BMinus5DDA0ED8_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void OnSkateStart(class UBFGActorComponent_JetpackPilot* _pJetpackComponent);
	void BndEvt__A79A418DMinus42322B88Minus2932358CMinusE5BFAAF5_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__F866ADE6Minus41E580BCMinus101B13AEMinus2E0FBCAF_BFGK2Node_BoundQuestEvent_24_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__C2521CEEMinus45127975MinusF366CEAAMinus1B2DA6D7_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__5EEC7397Minus4629F474MinusE524FDB5Minus1EE726A1_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__FADE64E1Minus4EA1F541Minus50609CAAMinusFBF4CD32_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__FADE64E1Minus4EA1F541Minus50609CAAMinusFBF4CD32_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__201694EFMinus4F7C73C8Minus10A83185MinusF0F3E1AD_BFGK2Node_BoundQuestEvent_16_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void OnDashTriggerd(class UBFGActorComponent_Dash* _pDashComponent);
	void BndEvt__B3F0BA25Minus4F1C16D6MinusD2796390MinusADB86A27_BFGK2Node_BoundQuestEvent_40_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__C2521CEEMinus45127975MinusF366CEAAMinus1B2DA6D7_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void Get_MusicSystem(bool* Valid, class ABP_MusicSystem_C** MusicSystem_0);
	void TagGroundState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM05_TelevisionsOfDoom_C">();
	}
	static class UMM05_TelevisionsOfDoom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMM05_TelevisionsOfDoom_C>();
	}
};
static_assert(alignof(UMM05_TelevisionsOfDoom_C) == 0x000008, "Wrong alignment on UMM05_TelevisionsOfDoom_C");
static_assert(sizeof(UMM05_TelevisionsOfDoom_C) == 0x000300, "Wrong size on UMM05_TelevisionsOfDoom_C");
static_assert(offsetof(UMM05_TelevisionsOfDoom_C, UberGraphFrame) == 0x000238, "Member 'UMM05_TelevisionsOfDoom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMM05_TelevisionsOfDoom_C, Stop_STEP_03_VO) == 0x000240, "Member 'UMM05_TelevisionsOfDoom_C::Stop_STEP_03_VO' has a wrong offset!");
static_assert(offsetof(UMM05_TelevisionsOfDoom_C, MusicSystem) == 0x000248, "Member 'UMM05_TelevisionsOfDoom_C::MusicSystem' has a wrong offset!");
static_assert(offsetof(UMM05_TelevisionsOfDoom_C, MoveToTarget_01) == 0x000250, "Member 'UMM05_TelevisionsOfDoom_C::MoveToTarget_01' has a wrong offset!");
static_assert(offsetof(UMM05_TelevisionsOfDoom_C, MoveToTarget_02) == 0x000278, "Member 'UMM05_TelevisionsOfDoom_C::MoveToTarget_02' has a wrong offset!");
static_assert(offsetof(UMM05_TelevisionsOfDoom_C, LavaGrounds) == 0x0002A0, "Member 'UMM05_TelevisionsOfDoom_C::LavaGrounds' has a wrong offset!");
static_assert(offsetof(UMM05_TelevisionsOfDoom_C, MajesticCar) == 0x0002B0, "Member 'UMM05_TelevisionsOfDoom_C::MajesticCar' has a wrong offset!");
static_assert(offsetof(UMM05_TelevisionsOfDoom_C, IntroCinematicVolume) == 0x0002D8, "Member 'UMM05_TelevisionsOfDoom_C::IntroCinematicVolume' has a wrong offset!");

}

