#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM08_TeenageZombiesFromOuterSpace

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MM08_TeenageZombiesFromOuterSpace.MM08_TeenageZombiesFromOuterSpace_C.ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace
// 0x11A0 (0x11A0 - 0x0000)
struct MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0008(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0138(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0270(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x02B8(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue2;        // 0x0300(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue3;        // 0x0348(0x0048)()
	TArray<class ABFGActorProxy*>                 CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors; // 0x0390(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class ABFGActorProxy*>                 CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors1; // 0x03A0(0x0010)(ZeroConstructor, ReferenceParm)
	class ABFGActorProxy*                         CallFunc_Array_Get_Item;                           // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGActorProxy*                         CallFunc_Array_Get_Item1;                          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_MM08ProjectorInterface_C> K2Node_DynamicCast_AsBP_MM08Projector_Interface;   // 0x03C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_MM08ProjectorInterface_C> K2Node_DynamicCast_AsBP_MM08Projector_Interface1;  // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue4;        // 0x03F0(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue5;        // 0x0438(0x0048)()
	TArray<class ABFGNPCCharacterGameplay*>       CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors2; // 0x0480(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors3; // 0x0490(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue6;        // 0x04B8(0x0048)()
	TArray<class ABFGActorProxy*>                 CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors4; // 0x0500(0x0010)(ZeroConstructor, ReferenceParm)
	struct FBFGVoiceoverPlaybackRequest           K2Node_MakeStruct_BFGVoiceoverPlaybackRequest;     // 0x0510(0x0130)()
	class ABFGActorProxy*                         CallFunc_Array_Get_Item3;                          // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_MM08ProjectorInterface_C> K2Node_DynamicCast_AsBP_MM08Projector_Interface2;  // 0x0650(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_662[0x6];                                      // 0x0662(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x0668(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement14;             // 0x0798(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex;        // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue;                 // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal;                 // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AC[0x4];                                      // 0x07AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext;           // 0x07B0(0x0050)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0801(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0802(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_803[0x5];                                      // 0x0803(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement13;             // 0x0808(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement12;             // 0x0810(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement11;             // 0x0818(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement10;             // 0x0820(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement9;              // 0x0828(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement8;              // 0x0830(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement7;              // 0x0838(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x0840(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x0970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0971(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_972[0x6];                                      // 0x0972(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x0978(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x0980(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x0988(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x0990(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x0998(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid;                    // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1[0x7];                                      // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem;              // 0x09A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid1;                   // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B1[0x7];                                      // 0x09B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem1;             // 0x09B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__Element1;               // 0x09C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__Wave;                   // 0x09C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x09CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x09CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9CE[0x2];                                      // 0x09CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x09D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D4[0x4];                                      // 0x09D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABFGNPCCharacterGameplay*               CallFunc_Array_Get_Item4;                          // 0x09D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_ElementDefend*                BFGK2Node_BoundQuestEvent__Element;                // 0x09E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BFGK2Node_BoundQuestEvent__Defendee;               // 0x09E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BFGK2Node_BoundQuestEvent__CurrentHealth;          // 0x09F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BFGK2Node_BoundQuestEvent__LastHealth;             // 0x09F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BFGK2Node_BoundQuestEvent__MaxHealth;              // 0x09F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x09FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0A00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0A01(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A02[0x2];                                      // 0x0A02(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0A04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A09[0x3];                                      // 0x0A09(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0A0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x0A10(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           K2Node_MakeStruct_BFGVoiceoverPlaybackRequest1;    // 0x0A18(0x0130)()
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult5;                // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x0B49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4A[0x6];                                      // 0x0B4A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x0B50(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult6;                // 0x0C80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x0C81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0C82(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C83[0x5];                                      // 0x0C83(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0C88(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue1;                 // 0x0C90(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x0C98(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0CA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0CA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA2[0x6];                                      // 0x0CA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           K2Node_MakeStruct_BFGVoiceoverPlaybackRequest2;    // 0x0CA8(0x0130)()
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult7;                // 0x0DD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD9[0x7];                                      // 0x0DD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x0DE0(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x0F10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult8;                // 0x0F11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F12[0x6];                                      // 0x0F12(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           K2Node_MakeStruct_BFGVoiceoverPlaybackRequest3;    // 0x0F18(0x0130)()
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x1048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult9;                // 0x1049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104A[0x6];                                     // 0x104A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           K2Node_MakeStruct_BFGVoiceoverPlaybackRequest4;    // 0x1050(0x0130)()
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x1180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult10;               // 0x1181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1182[0x6];                                     // 0x1182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x1188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x1190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_MusicSystem_valid2;                   // 0x1191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1192[0x6];                                     // 0x1192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem2;             // 0x1198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace) == 0x000008, "Wrong alignment on MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace");
static_assert(sizeof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace) == 0x0011A0, "Wrong size on MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, EntryPoint) == 0x000000, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_struct_Variable) == 0x000008, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_struct_Variable1) == 0x000138, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult) == 0x000268, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult1) == 0x000269, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum_CmpSuccess) == 0x00026A, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum1_CmpSuccess) == 0x00026B, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000270, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_MakeGameplayTagQuery_ReturnValue1) == 0x0002B8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_MakeGameplayTagQuery_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_MakeGameplayTagQuery_ReturnValue2) == 0x000300, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_MakeGameplayTagQuery_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_MakeGameplayTagQuery_ReturnValue3) == 0x000348, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_MakeGameplayTagQuery_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors) == 0x000390, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors1) == 0x0003A0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Array_Get_Item) == 0x0003B0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Array_Get_Item1) == 0x0003B8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_DynamicCast_AsBP_MM08Projector_Interface) == 0x0003C0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_DynamicCast_AsBP_MM08Projector_Interface' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_DynamicCast_bSuccess) == 0x0003D0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_DynamicCast_AsBP_MM08Projector_Interface1) == 0x0003D8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_DynamicCast_AsBP_MM08Projector_Interface1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_DynamicCast_bSuccess1) == 0x0003E8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_MakeGameplayTagQuery_ReturnValue4) == 0x0003F0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_MakeGameplayTagQuery_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_MakeGameplayTagQuery_ReturnValue5) == 0x000438, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_MakeGameplayTagQuery_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors2) == 0x000480, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors3) == 0x000490, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors3' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Array_Length_ReturnValue) == 0x0004A0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Array_Get_Item2) == 0x0004A8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Array_Length_ReturnValue1) == 0x0004B0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Greater_IntInt_ReturnValue) == 0x0004B4, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_MakeGameplayTagQuery_ReturnValue6) == 0x0004B8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_MakeGameplayTagQuery_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors4) == 0x000500, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors4' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_MakeStruct_BFGVoiceoverPlaybackRequest) == 0x000510, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_MakeStruct_BFGVoiceoverPlaybackRequest' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Array_Get_Item3) == 0x000640, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult2) == 0x000648, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_DynamicCast_AsBP_MM08Projector_Interface2) == 0x000650, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_DynamicCast_AsBP_MM08Projector_Interface2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_DynamicCast_bSuccess2) == 0x000660, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum2_CmpSuccess) == 0x000661, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_struct_Variable2) == 0x000668, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement14) == 0x000798, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement14' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__iObjectiveIndex) == 0x0007A0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__iValue) == 0x0007A4, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__iValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__iTotal) == 0x0007A8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__iTotal' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__eventContext) == 0x0007B0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__eventContext' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult3) == 0x000800, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult3' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000801, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum3_CmpSuccess) == 0x000802, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement13) == 0x000808, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement13' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement12) == 0x000810, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement12' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement11) == 0x000818, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement11' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement10) == 0x000820, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement10' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement9) == 0x000828, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement9' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement8) == 0x000830, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement8' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement7) == 0x000838, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement7' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_struct_Variable3) == 0x000840, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult4) == 0x000970, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult4' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum4_CmpSuccess) == 0x000971, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement6) == 0x000978, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement6' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement5) == 0x000980, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement5' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement4) == 0x000988, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement4' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement3) == 0x000990, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement3' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement2) == 0x000998, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Get_MusicSystem_valid) == 0x0009A0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Get_MusicSystem_valid' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Get_MusicSystem_MusicSystem) == 0x0009A8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Get_MusicSystem_MusicSystem' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Get_MusicSystem_valid1) == 0x0009B0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Get_MusicSystem_valid1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Get_MusicSystem_MusicSystem1) == 0x0009B8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Get_MusicSystem_MusicSystem1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__Element1) == 0x0009C0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__Element1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__Wave) == 0x0009C8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__Wave' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_bool_Has_Been_Initd_Variable) == 0x0009CC, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Less_IntInt_ReturnValue) == 0x0009CD, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_int_Array_Index_Variable) == 0x0009D0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Array_Get_Item4) == 0x0009D8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__Element) == 0x0009E0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__Element' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__Defendee) == 0x0009E8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__Defendee' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__CurrentHealth) == 0x0009F0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__CurrentHealth' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__LastHealth) == 0x0009F4, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__LastHealth' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__MaxHealth) == 0x0009F8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__MaxHealth' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0009FC, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Less_FloatFloat_ReturnValue) == 0x000A00, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Less_FloatFloat_ReturnValue1) == 0x000A01, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_int_Loop_Counter_Variable) == 0x000A04, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Less_IntInt_ReturnValue1) == 0x000A08, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Add_IntInt_ReturnValue) == 0x000A0C, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement1) == 0x000A10, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_MakeStruct_BFGVoiceoverPlaybackRequest1) == 0x000A18, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_MakeStruct_BFGVoiceoverPlaybackRequest1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult5) == 0x000B48, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult5' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum5_CmpSuccess) == 0x000B49, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_struct_Variable4) == 0x000B50, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult6) == 0x000C80, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult6' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum6_CmpSuccess) == 0x000C81, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_bool_IsClosed_Variable) == 0x000C82, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_K2_SetTimer_ReturnValue) == 0x000C88, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_K2_SetTimer_ReturnValue1) == 0x000C90, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_K2_SetTimer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_K2_SetTimer_ReturnValue2) == 0x000C98, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_bool_Has_Been_Initd_Variable1) == 0x000CA0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_bool_IsClosed_Variable1) == 0x000CA1, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_MakeStruct_BFGVoiceoverPlaybackRequest2) == 0x000CA8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_MakeStruct_BFGVoiceoverPlaybackRequest2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult7) == 0x000DD8, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult7' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, Temp_struct_Variable5) == 0x000DE0, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum7_CmpSuccess) == 0x000F10, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult8) == 0x000F11, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult8' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_MakeStruct_BFGVoiceoverPlaybackRequest3) == 0x000F18, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_MakeStruct_BFGVoiceoverPlaybackRequest3' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum8_CmpSuccess) == 0x001048, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum8_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult9) == 0x001049, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult9' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_MakeStruct_BFGVoiceoverPlaybackRequest4) == 0x001050, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_MakeStruct_BFGVoiceoverPlaybackRequest4' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum9_CmpSuccess) == 0x001180, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum9_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_PlayVoiceover__outResult10) == 0x001181, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_PlayVoiceover__outResult10' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, BFGK2Node_BoundQuestEvent__pElement) == 0x001188, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::BFGK2Node_BoundQuestEvent__pElement' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, K2Node_SwitchEnum10_CmpSuccess) == 0x001190, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::K2Node_SwitchEnum10_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Get_MusicSystem_valid2) == 0x001191, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Get_MusicSystem_valid2' has a wrong offset!");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace, CallFunc_Get_MusicSystem_MusicSystem2) == 0x001198, "Member 'MM08_TeenageZombiesFromOuterSpace_C_ExecuteUbergraph_MM08_TeenageZombiesFromOuterSpace::CallFunc_Get_MusicSystem_MusicSystem2' has a wrong offset!");

// Function MM08_TeenageZombiesFromOuterSpace.MM08_TeenageZombiesFromOuterSpace_C.BndEvt__CEC82623-473F7E5B-C540AA8A-F93375FB_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MM08_TeenageZombiesFromOuterSpace_C_BndEvt__CEC82623Minus473F7E5BMinusC540AA8AMinusF93375FB_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM08_TeenageZombiesFromOuterSpace_C_BndEvt__CEC82623Minus473F7E5BMinusC540AA8AMinusF93375FB_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on MM08_TeenageZombiesFromOuterSpace_C_BndEvt__CEC82623Minus473F7E5BMinusC540AA8AMinusF93375FB_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(MM08_TeenageZombiesFromOuterSpace_C_BndEvt__CEC82623Minus473F7E5BMinusC540AA8AMinusF93375FB_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on MM08_TeenageZombiesFromOuterSpace_C_BndEvt__CEC82623Minus473F7E5BMinusC540AA8AMinusF93375FB_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(MM08_TeenageZombiesFromOuterSpace_C_BndEvt__CEC82623Minus473F7E5BMinusC540AA8AMinusF93375FB_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'MM08_TeenageZombiesFromOuterSpace_C_BndEvt__CEC82623Minus473F7E5BMinusC540AA8AMinusF93375FB_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function MM08_TeenageZombiesFromOuterSpace.MM08_TeenageZombiesFromOuterSpace_C.BndEvt__F00B0C17-4AF8E355-220C5485-AD3DA89D_BFGK2Node_BoundQuestEvent_68_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
