#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM13_TheMutantMenace

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function MM13_TheMutantMenace.MM13_TheMutantMenace_C.ExecuteUbergraph_MM13_TheMutantMenace
// 0x2618 (0x2618 - 0x0000)
struct MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0008(0x0048)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0050(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0188(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x02C0(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x03F8(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52A[0x6];                                      // 0x052A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x0530(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_662[0x6];                                      // 0x0662(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x0668(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult5;                // 0x0799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79A[0x6];                                      // 0x079A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x07A0(0x0048)()
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABFGNPCCharacter_Interactable*>  CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors; // 0x07F0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue2;        // 0x0800(0x0048)()
	class ABFGNPCCharacter_Interactable*          CallFunc_Array_Get_Item;                           // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABFGNPCCharacter_Interactable*>  CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors1; // 0x0850(0x0010)(ZeroConstructor, ReferenceParm)
	class ABFGNPCCharacter_Interactable*          CallFunc_Array_Get_Item1;                          // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x086C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86D[0x3];                                      // 0x086D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_OverheadOpportunityWidgetComponent_C* CallFunc_GetComponentByClass_ReturnValue;          // 0x0870(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorComponent_MentallyInteractable* CallFunc_GetComponentByClass_ReturnValue1;         // 0x0880(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_OverheadOpportunityWidgetComponent_C* CallFunc_GetComponentByClass_ReturnValue2;         // 0x0888(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0891(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_892[0x6];                                      // 0x0892(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorComponent_MentallyInteractable* CallFunc_GetComponentByClass_ReturnValue3;         // 0x0898(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x08A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue1;             // 0x08A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A6[0x2];                                      // 0x08A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x08A8(0x0088)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x0930(0x0130)(ConstParm)
	TDelegate<void(class UBFGStreamingLevelHandle* _pHandle, bool _bIsLoaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0A60(0x0010)(ZeroConstructor, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult6;                // 0x0A70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A71[0x7];                                      // 0x0A71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x0A78(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x0BA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult7;                // 0x0BA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAA[0x6];                                      // 0x0BAA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable8;                             // 0x0BB0(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x0CE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult8;                // 0x0CE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE2[0x6];                                      // 0x0CE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable9;                             // 0x0CE8(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x0E18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult9;                // 0x0E19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1A[0x6];                                      // 0x0E1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable10;                            // 0x0E20(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x0F50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult10;               // 0x0F51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F52[0x6];                                      // 0x0F52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable11;                            // 0x0F58(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x1088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult11;               // 0x1089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108A[0x6];                                     // 0x108A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable12;                            // 0x1090(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x11C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult12;               // 0x11C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C2[0x6];                                     // 0x11C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable13;                            // 0x11C8(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x12F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult13;               // 0x12F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12FA[0x6];                                     // 0x12FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue3;        // 0x1300(0x0048)()
	bool                                          K2Node_SwitchEnum13_CmpSuccess;                    // 0x1348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1349[0x7];                                     // 0x1349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable14;                            // 0x1350(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable15;                            // 0x1480(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult14;               // 0x15B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult15;               // 0x15B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum14_CmpSuccess;                    // 0x15B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum15_CmpSuccess;                    // 0x15B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15B4[0x4];                                     // 0x15B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable16;                            // 0x15B8(0x0130)(ConstParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x16E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult16;               // 0x16EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum16_CmpSuccess;                    // 0x16ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16EE[0x2];                                     // 0x16EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue4;        // 0x16F0(0x0048)()
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x1738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x173C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x1740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x1744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue5;        // 0x1748(0x0048)()
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x1790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x1794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x1798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x179C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x17A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A4[0x4];                                     // 0x17A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement29;             // 0x17A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable17;                            // 0x17B0(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement28;             // 0x18E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult17;               // 0x18E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18E9[0x7];                                     // 0x18E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable18;                            // 0x18F0(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum17_CmpSuccess;                    // 0x1A20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult18;               // 0x1A21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A22[0x6];                                     // 0x1A22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement27;             // 0x1A28(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum18_CmpSuccess;                    // 0x1A30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A31[0x3];                                     // 0x1A31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x1A34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement26;             // 0x1A38(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex7;       // 0x1A40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue7;                // 0x1A44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal7;                // 0x1A48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4C[0x4];                                     // 0x1A4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext7;          // 0x1A50(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement25;             // 0x1AA0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement24;             // 0x1AA8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex6;       // 0x1AB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue6;                // 0x1AB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal6;                // 0x1AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ABC[0x4];                                     // 0x1ABC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext6;          // 0x1AC0(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement23;             // 0x1B10(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x1B18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B19[0x3];                                     // 0x1B19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x1B1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x1B20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x1B24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_Component_ChainReaction_C*>  CallFunc_GetChainReactionActorsByGameplayTagQuery_Chain_Reaction_Actors; // 0x1B28(0x0010)(ZeroConstructor, ReferenceParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement22;             // 0x1B38(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex5;       // 0x1B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue5;                // 0x1B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal5;                // 0x1B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4C[0x4];                                     // 0x1B4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext5;          // 0x1B50(0x0050)(ConstParm)
	class UBP_Component_ChainReaction_C*          CallFunc_Array_Get_Item2;                          // 0x1BA0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x1BA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BAC[0x4];                                     // 0x1BAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_Component_ChainReaction_C*>  CallFunc_GetChainReactionActorsByGameplayTagQuery_Chain_Reaction_Actors1; // 0x1BB0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x1BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC4[0x4];                                     // 0x1BC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement21;             // 0x1BC8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex4;       // 0x1BD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue4;                // 0x1BD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal4;                // 0x1BD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BDC[0x4];                                     // 0x1BDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext4;          // 0x1BE0(0x0050)(ConstParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue6;        // 0x1C30(0x0048)()
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x1C78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C79[0x7];                                     // 0x1C79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABFGNPCCharacterGameplay*>       CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors2; // 0x1C80(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue7;        // 0x1C90(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x1CD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CDC[0x4];                                     // 0x1CDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABFGNPCCharacterEnemyPsi*>       CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors3; // 0x1CE0(0x0010)(ZeroConstructor, ReferenceParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement20;             // 0x1CF0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex3;       // 0x1CF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue3;                // 0x1CFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal3;                // 0x1D00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D04[0x4];                                     // 0x1D04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext3;          // 0x1D08(0x0050)(ConstParm)
	class ABFGNPCCharacterEnemyPsi*               CallFunc_Array_Get_Item3;                          // 0x1D58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x1D60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D64[0x4];                                     // 0x1D64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_Component_ChainReaction_C*>  CallFunc_GetChainReactionActorsByGameplayTagQuery_Chain_Reaction_Actors2; // 0x1D68(0x0010)(ZeroConstructor, ReferenceParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement19;             // 0x1D78(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_ChainReaction_C*          CallFunc_Array_Get_Item4;                          // 0x1D80(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x1D88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x1D8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D8D[0x3];                                     // 0x1D8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x1D90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x1D94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D95[0x3];                                     // 0x1D95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x1D98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9C[0x4];                                     // 0x1D9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement18;             // 0x1DA0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex2;       // 0x1DA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue2;                // 0x1DAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal2;                // 0x1DB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB4[0x4];                                     // 0x1DB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext2;          // 0x1DB8(0x0050)(ConstParm)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x1E08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E09[0x7];                                     // 0x1E09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable19;                            // 0x1E10(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement17;             // 0x1F40(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult19;               // 0x1F48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F49[0x7];                                     // 0x1F49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement16;             // 0x1F50(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum19_CmpSuccess;                    // 0x1F58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F59[0x3];                                     // 0x1F59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x1F5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacterGameplay*               CallFunc_Array_Get_Item5;                          // 0x1F60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetFactionForActor_ReturnValue;           // 0x1F68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F69[0x7];                                     // 0x1F69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorStat_Float*                    CallFunc_GetHealthStat_ReturnValue;                // 0x1F70(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement15;             // 0x1F78(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement14;             // 0x1F80(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex1;       // 0x1F88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue1;                // 0x1F8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal1;                // 0x1F90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F94[0x4];                                     // 0x1F94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext1;          // 0x1F98(0x0050)(ConstParm)
	TArray<class UBP_Component_ChainReaction_C*>  CallFunc_GetChainReactionActorsByGameplayTagQuery_Chain_Reaction_Actors3; // 0x1FE8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x1FF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF9[0x7];                                     // 0x1FF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Component_ChainReaction_C*          CallFunc_Array_Get_Item6;                          // 0x2000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x2008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x200C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_200D[0x3];                                     // 0x200D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x2010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x2014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2015[0x3];                                     // 0x2015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x2018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201C[0x4];                                     // 0x201C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable20;                            // 0x2020(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult20;               // 0x2150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2151[0x7];                                     // 0x2151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement13;             // 0x2158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum20_CmpSuccess;                    // 0x2160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2161[0x7];                                     // 0x2161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement12;             // 0x2168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement11;             // 0x2170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement10;             // 0x2178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement9;              // 0x2180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement8;              // 0x2188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement7;              // 0x2190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid;                    // 0x2198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2199[0x7];                                     // 0x2199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem;              // 0x21A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid1;                   // 0x21A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A9[0x7];                                     // 0x21A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem1;             // 0x21B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable21;                            // 0x21B8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult21;               // 0x22E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum21_CmpSuccess;                    // 0x22E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22EA[0x2];                                     // 0x22EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x22EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x22F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x22F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22F9[0x3];                                     // 0x22F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x22FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x2300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x2308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGGameState*                          K2Node_DynamicCast_AsBFGGame_State;                // 0x2310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x2318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2319[0x7];                                     // 0x2319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue8;        // 0x2320(0x0048)()
	class UBFGAlertSystemManager*                 CallFunc_GetAlertSystemManager_ReturnValue;        // 0x2368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors4; // 0x2370(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetCurrentResponseLevelIndex_ReturnValue; // 0x2380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2384[0x4];                                     // 0x2384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item7;                          // 0x2388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x2390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyAndReportDamage_ReturnValue;         // 0x2394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x2398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239C[0x4];                                     // 0x239C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x23A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x23A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A9[0x7];                                     // 0x23A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x23B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGGameState*                          CallFunc_GetGameState_ReturnValue1;                // 0x23B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGStreamingLevelHandle*               K2Node_CustomEvent__pHandle;                       // 0x23C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent__bIsLoaded;                     // 0x23C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C9[0x7];                                     // 0x23C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGStreamingLevelManager*              CallFunc_GetStreamingLevelManager_ReturnValue;     // 0x23D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue;        // 0x23D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue1;       // 0x23D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue2;       // 0x23DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23DB[0x1];                                     // 0x23DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable7;                    // 0x23DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_ChainReaction_C*          CallFunc_Array_Get_Item8;                          // 0x23E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x23E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_InteractableCharacterStats* CallFunc_GetComponentByClass_ReturnValue4;         // 0x23F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_Component_ChainReaction_C*>  CallFunc_GetChainReactionActorsByGameplayTagQuery_Chain_Reaction_Actors4; // 0x23F8(0x0010)(ZeroConstructor, ReferenceParm)
	class UBFGActorStat_Bool*                     CallFunc_GetIsInteractedWithStat_ReturnValue;      // 0x2408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Component_ChainReaction_C*          CallFunc_Array_Get_Item9;                          // 0x2410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValue_ReturnValue;                     // 0x2418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2419[0x3];                                     // 0x2419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue9;                // 0x241C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x2420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2421[0x7];                                     // 0x2421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x2428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x2430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x2438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex;        // 0x2440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue;                 // 0x2444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal;                 // 0x2448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244C[0x4];                                     // 0x244C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext;           // 0x2450(0x0050)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable22;                            // 0x24A0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult22;               // 0x25D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D1[0x7];                                     // 0x25D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x25D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum22_CmpSuccess;                    // 0x25E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E1[0x7];                                     // 0x25E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x25E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x25F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_MusicSystem_valid2;                   // 0x25F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25F2[0x6];                                     // 0x25F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem2;             // 0x25F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_MentallyInteractable* CallFunc_GetComponentByClass_ReturnValue5;         // 0x2600(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable7;                   // 0x2608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x260C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_260D[0x3];                                     // 0x260D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x2610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace) == 0x000008, "Wrong alignment on MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace");
static_assert(sizeof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace) == 0x002618, "Wrong size on MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, EntryPoint) == 0x000000, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000008, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, Temp_struct_Variable) == 0x000050, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, CallFunc_PlayVoiceover__outResult) == 0x000180, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, Temp_struct_Variable1) == 0x000188, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, K2Node_SwitchEnum_CmpSuccess) == 0x0002B8, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, CallFunc_PlayVoiceover__outResult1) == 0x0002B9, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, Temp_struct_Variable2) == 0x0002C0, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, K2Node_SwitchEnum1_CmpSuccess) == 0x0003F0, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, CallFunc_PlayVoiceover__outResult2) == 0x0003F1, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::CallFunc_PlayVoiceover__outResult2' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, Temp_struct_Variable3) == 0x0003F8, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, K2Node_SwitchEnum2_CmpSuccess) == 0x000528, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, CallFunc_PlayVoiceover__outResult3) == 0x000529, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::CallFunc_PlayVoiceover__outResult3' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, Temp_struct_Variable4) == 0x000530, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, K2Node_SwitchEnum3_CmpSuccess) == 0x000660, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, CallFunc_PlayVoiceover__outResult4) == 0x000661, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::CallFunc_PlayVoiceover__outResult4' has a wrong offset!");
static_assert(offsetof(MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace, Temp_struct_Variable5) == 0x000668, "Member 'MM13_TheMutantMenace_C_ExecuteUbergraph_MM13_TheMutantMenace::Temp_struct_Variable5' has a wrong offset!");
