#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM13_5_TheWrongStuff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM13_5_TheWrongStuff.MM13_5_TheWrongStuff_C
// 0x0200 (0x0438 - 0x0238)
class UMM13_5_TheWrongStuff_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_MusicSystem_C*                      MusicSystem;                                       // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGNPCCharacter>        Crane;                                             // 0x0248(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGNPCCharacterGameplay> Crane_soldier;                                     // 0x0270(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGNPCCharacterGameplay> Mine_soldier_A;                                    // 0x0298(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGNPCCharacterGameplay> Mine_soldier_B;                                    // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGNPCCharacterGameplay> BBQ_Soldier;                                       // 0x02E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Mine_Death_Location;                               // 0x0310(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Mine_Death_Location02;                             // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Crane_Death_Location01;                            // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Mine_Death_Point_Reaction_Location;                // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          CraneScanned_;                                     // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MineScanned_;                                      // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BBQScanned_;                                       // 0x03B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B3[0x5];                                      // 0x03B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGScriptedSequence_Transient*         Scripted_Seq_Transient_Minus_MineSoldier01;        // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGScriptedSequence_Transient*         Scripted_Seq_Transient_Minus_MineSoldier02;        // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGScriptedSequence_Transient*         Scripted_Seq_Transient_Minus_Cranesoldier;         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Str_IdentifierMinusMinesoldier01;                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Str_IdentifierMinusMinesoldier02;                  // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Str_IdentifierMinusCraneSoldier;                   // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGInteractAnimationSequence          MineLookReaction_Anim_Seq;                         // 0x03E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBFGInteractAnimationSequence          MinePointReaction_Anim_Seq;                        // 0x0400(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBFGInteractAnimationSequence          CranePhoneReaction_Anim_Seq;                       // 0x0418(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsSmokerLast_;                                     // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Officer_A_Scanned_;                                // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Officer_B_Scanned_;                                // 0x0432(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Officer_C_Scanned_;                                // 0x0433(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MM13_5_TheWrongStuff(int32 EntryPoint);
	void BndEvt__2DEF9C50Minus422AFF66Minus8D84F896Minus1E579EE7_BFGK2Node_BoundQuestEvent_230_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__3B6A187FMinus441568A9Minus4046A993MinusB4527630_BFGK2Node_BoundQuestEvent_236_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__3B6A187FMinus441568A9Minus4046A993MinusB4527630_BFGK2Node_BoundQuestEvent_239_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__3B6A187FMinus441568A9Minus4046A993MinusB4527630_BFGK2Node_BoundQuestEvent_241_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__EF52E740Minus47001C4DMinusDACADEBFMinusA8A56B61_BFGK2Node_BoundQuestEvent_64_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__0AE7D060Minus43780FCAMinus8F4F7D9AMinus399B3C85_BFGK2Node_BoundQuestEvent_60_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__D3F6C230Minus4EB1A5C0MinusC00AA5B7Minus060CA3C6_BFGK2Node_BoundQuestEvent_242_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__5CC3A9DDMinus49217400Minus8BBBD699MinusAF7293AE_BFGK2Node_BoundQuestEvent_56_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__B1E773A0Minus48B90C2DMinusFAF86F8DMinus2DF447AE_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D3F6C230Minus4EB1A5C0MinusC00AA5B7Minus060CA3C6_BFGK2Node_BoundQuestEvent_245_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__ECBB228EMinus49EA047DMinus86DE99B0Minus7A3C044B_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__D3F6C230Minus4EB1A5C0MinusC00AA5B7Minus060CA3C6_BFGK2Node_BoundQuestEvent_247_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__2DEF9C50Minus422AFF66Minus8D84F896Minus1E579EE7_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__DD04A72EMinus4F8D0466MinusCBAF22BDMinus8BBC150A_BFGK2Node_BoundQuestEvent_194_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__CC945B8EMinus43625D15MinusAAEE399FMinus357E0A33_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__1DFA51E6Minus4251338DMinus296118BFMinus762D698D_BFGK2Node_BoundQuestEvent_16_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7517CBFCMinus4E44F5F6Minus80FEBE8DMinusDD2DD298_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__D7BAC3B3Minus46B29892Minus0556EAB6MinusACCFF936_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__730E2AD2Minus443928D3Minus3AA33ABBMinus0D7DDD63_BFGK2Node_BoundQuestEvent_111_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__DCAB0D46Minus4F03DE15Minus6CA18CB7Minus547880E9_BFGK2Node_BoundQuestEvent_18_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__7517CBFCMinus4E44F5F6Minus80FEBE8DMinusDD2DD298_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__640FF1D2Minus48EFCB9DMinus86A7D0B2MinusC5C09D7B_BFGK2Node_BoundQuestEvent_73_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D2DB8A4DMinus4229792EMinus5CC40499Minus93EA27E2_BFGK2Node_BoundQuestEvent_65_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__A9165242Minus4FC92A36MinusB061C195MinusD87DA090_BFGK2Node_BoundQuestEvent_107_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__6AA91B59Minus401F1061Minus68337AB6MinusB6819327_BFGK2Node_BoundQuestEvent_35_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__50355DCCMinus4CBE067BMinus5E4E1681MinusE8BAB8E4_BFGK2Node_BoundQuestEvent_116_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__9D663A0CMinus4132C907Minus856C289DMinus67CFC4EC_BFGK2Node_BoundQuestEvent_64_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__A8C80065Minus4AB68C10Minus02C6829CMinus6DC33477_BFGK2Node_BoundQuestEvent_110_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__B548B33CMinus4B151CDFMinus4A39F99EMinus577C440D_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__D92FF2F3Minus4E0F55F0MinusEA16279DMinus0DCE942D_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__CC945B8EMinus43625D15MinusAAEE399FMinus357E0A33_BFGK2Node_BoundQuestEvent_25_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__1E6D4B38Minus413B8B48MinusCEC80095Minus9B52A924_BFGK2Node_BoundQuestEvent_17_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__6AD56136Minus4538E250MinusCB99CB99Minus38F381B8_BFGK2Node_BoundQuestEvent_46_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__7517CBFCMinus4E44F5F6Minus80FEBE8DMinusDD2DD298_BFGK2Node_BoundQuestEvent_14_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4C57B919Minus4D3DB6E6Minus5F8A2A8BMinus6E1A550F_BFGK2Node_BoundQuestEvent_28_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__4C57B919Minus4D3DB6E6Minus5F8A2A8BMinus6E1A550F_BFGK2Node_BoundQuestEvent_54_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7EDBBA92Minus4B4E1F26Minus3AF80CA1MinusDAE04347_BFGK2Node_BoundQuestEvent_48_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__33E0CC94Minus483DD0BBMinus92E0358EMinusDF1A71F4_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__33E0CC94Minus483DD0BBMinus92E0358EMinusDF1A71F4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E03ED226Minus40BBED1FMinus5326008DMinus21753A1B_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E03ED226Minus40BBED1FMinus5326008DMinus21753A1B_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4F6D150AMinus4FCFE8B9MinusC94D5391MinusE4417D3A_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4F6D150AMinus4FCFE8B9MinusC94D5391MinusE4417D3A_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__A9EC798FMinus40C31915MinusD0CDDDBFMinusE04709D0_BFGK2Node_BoundQuestEvent_63_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__1F76E377Minus4ACE530EMinusC102738BMinus6B3B86C0_BFGK2Node_BoundQuestEvent_51_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__7942FB3AMinus4958583DMinusE3C9388EMinusD0278E37_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__9D663A0CMinus4132C907Minus856C289DMinus67CFC4EC_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void Get_MusicSystem(bool* Valid, class ABP_MusicSystem_C** MusicSystem_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM13_5_TheWrongStuff_C">();
	}
	static class UMM13_5_TheWrongStuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMM13_5_TheWrongStuff_C>();
	}
};
static_assert(alignof(UMM13_5_TheWrongStuff_C) == 0x000008, "Wrong alignment on UMM13_5_TheWrongStuff_C");
static_assert(sizeof(UMM13_5_TheWrongStuff_C) == 0x000438, "Wrong size on UMM13_5_TheWrongStuff_C");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, UberGraphFrame) == 0x000238, "Member 'UMM13_5_TheWrongStuff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, MusicSystem) == 0x000240, "Member 'UMM13_5_TheWrongStuff_C::MusicSystem' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Crane) == 0x000248, "Member 'UMM13_5_TheWrongStuff_C::Crane' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Crane_soldier) == 0x000270, "Member 'UMM13_5_TheWrongStuff_C::Crane_soldier' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Mine_soldier_A) == 0x000298, "Member 'UMM13_5_TheWrongStuff_C::Mine_soldier_A' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Mine_soldier_B) == 0x0002C0, "Member 'UMM13_5_TheWrongStuff_C::Mine_soldier_B' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, BBQ_Soldier) == 0x0002E8, "Member 'UMM13_5_TheWrongStuff_C::BBQ_Soldier' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Mine_Death_Location) == 0x000310, "Member 'UMM13_5_TheWrongStuff_C::Mine_Death_Location' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Mine_Death_Location02) == 0x000338, "Member 'UMM13_5_TheWrongStuff_C::Mine_Death_Location02' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Crane_Death_Location01) == 0x000360, "Member 'UMM13_5_TheWrongStuff_C::Crane_Death_Location01' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Mine_Death_Point_Reaction_Location) == 0x000388, "Member 'UMM13_5_TheWrongStuff_C::Mine_Death_Point_Reaction_Location' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, CraneScanned_) == 0x0003B0, "Member 'UMM13_5_TheWrongStuff_C::CraneScanned_' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, MineScanned_) == 0x0003B1, "Member 'UMM13_5_TheWrongStuff_C::MineScanned_' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, BBQScanned_) == 0x0003B2, "Member 'UMM13_5_TheWrongStuff_C::BBQScanned_' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Scripted_Seq_Transient_Minus_MineSoldier01) == 0x0003B8, "Member 'UMM13_5_TheWrongStuff_C::Scripted_Seq_Transient_Minus_MineSoldier01' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Scripted_Seq_Transient_Minus_MineSoldier02) == 0x0003C0, "Member 'UMM13_5_TheWrongStuff_C::Scripted_Seq_Transient_Minus_MineSoldier02' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Scripted_Seq_Transient_Minus_Cranesoldier) == 0x0003C8, "Member 'UMM13_5_TheWrongStuff_C::Scripted_Seq_Transient_Minus_Cranesoldier' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Str_IdentifierMinusMinesoldier01) == 0x0003D0, "Member 'UMM13_5_TheWrongStuff_C::Str_IdentifierMinusMinesoldier01' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Str_IdentifierMinusMinesoldier02) == 0x0003D8, "Member 'UMM13_5_TheWrongStuff_C::Str_IdentifierMinusMinesoldier02' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Str_IdentifierMinusCraneSoldier) == 0x0003E0, "Member 'UMM13_5_TheWrongStuff_C::Str_IdentifierMinusCraneSoldier' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, MineLookReaction_Anim_Seq) == 0x0003E8, "Member 'UMM13_5_TheWrongStuff_C::MineLookReaction_Anim_Seq' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, MinePointReaction_Anim_Seq) == 0x000400, "Member 'UMM13_5_TheWrongStuff_C::MinePointReaction_Anim_Seq' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, CranePhoneReaction_Anim_Seq) == 0x000418, "Member 'UMM13_5_TheWrongStuff_C::CranePhoneReaction_Anim_Seq' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, IsSmokerLast_) == 0x000430, "Member 'UMM13_5_TheWrongStuff_C::IsSmokerLast_' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Officer_A_Scanned_) == 0x000431, "Member 'UMM13_5_TheWrongStuff_C::Officer_A_Scanned_' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Officer_B_Scanned_) == 0x000432, "Member 'UMM13_5_TheWrongStuff_C::Officer_B_Scanned_' has a wrong offset!");
static_assert(offsetof(UMM13_5_TheWrongStuff_C, Officer_C_Scanned_) == 0x000433, "Member 'UMM13_5_TheWrongStuff_C::Officer_C_Scanned_' has a wrong offset!");

}

