#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM14_DuckAndCover

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM14_DuckAndCover.MM14_DuckAndCover_C
// 0x0148 (0x0380 - 0x0238)
class UMM14_DuckAndCover_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_MusicSystem_C*                      MusicSystem;                                       // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class APawn>                   BombTruck;                                         // 0x0248(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGMissionSpawnManager> MissionSpawnerEscort;                              // 0x0270(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Keypad_01;                                         // 0x0298(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Keypad_02;                                         // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGNPCCharacter_Interactable> Gate_01;                                           // 0x02E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGNPCCharacter_Interactable> Gate_02;                                           // 0x0310(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          PlayDefuseWarning;                                 // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABFGMissionSpawnManager> SpawnManagerScientists;                            // 0x0340(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ABFGNPCCharacterGameplay>> Soldiers;                                          // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          DefendNukeCPReached;                               // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MM14_DuckAndCover(int32 EntryPoint);
	void BndEvt__F00B0C17Minus4AF8E355Minus220C5485MinusAD3DA89D_BFGK2Node_BoundQuestEvent_19_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F00B0C17Minus4AF8E355Minus220C5485MinusAD3DA89D_BFGK2Node_BoundQuestEvent_17_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F00B0C17Minus4AF8E355Minus220C5485MinusAD3DA89D_BFGK2Node_BoundQuestEvent_14_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F00B0C17Minus4AF8E355Minus220C5485MinusAD3DA89D_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__3BC694ADMinus4884D5C2Minus7508679AMinusED32DE24_BFGK2Node_BoundQuestEvent_52_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__95859893Minus43C61FC2MinusEC74B48FMinusD7B72259_BFGK2Node_BoundQuestEvent_14_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__9B8E2992Minus41BD5A97MinusD7569A9CMinusC836862C_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F562DBABMinus41567B47Minus40C425BFMinus2A8413FF_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F82E0D99Minus46F82F42MinusA9B305ACMinus47D5F4EA_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature(class UBFGQuest_ElementWaitTime* _Element, int32 _Index, const struct FTimespan& _TimeLimit);
	void BndEvt__6E6A7D3EMinus42549F43Minus5D409C94Minus30C3EBBF_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature(class UBFGQuest_ElementWaitTime* _Element, int32 _Index, const struct FTimespan& _TimeLimit);
	void BndEvt__FC5E4558Minus41420139Minus5E5059A5Minus4D73B253_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__F562DBABMinus41567B47Minus40C425BFMinus2A8413FF_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__2529AC21Minus484A22BCMinusE73D36B8MinusA8D33165_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__41F7074BMinus4FA37FE0Minus0BF0ED81Minus840F5324_BFGK2Node_BoundQuestEvent_47_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__41F7074BMinus4FA37FE0Minus0BF0ED81Minus840F5324_BFGK2Node_BoundQuestEvent_45_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__8A89E100Minus4A73A2D4Minus8A772D93Minus5FCA02CB_BFGK2Node_BoundQuestEvent_105_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__8A89E100Minus4A73A2D4Minus8A772D93Minus5FCA02CB_BFGK2Node_BoundQuestEvent_93_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__66ABC07AMinus44EF36B4MinusE210D2B8Minus759B3470_BFGK2Node_BoundQuestEvent_81_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4B9C5D6DMinus403D7CDEMinusAB6BC0BCMinus1DF6EEEA_BFGK2Node_BoundQuestEvent_78_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__A03B03CDMinus4A0B7D99Minus545D6BA9Minus4FC7DC33_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event_WaveCounter__DelegateSignature(class UBFGQuest_Element* _Element, int32 _Wave);
	void BndEvt__8D299852Minus4DDF4D10Minus64E808BAMinus3468C899_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event_WaveCounter__DelegateSignature(class UBFGQuest_Element* _Element, int32 _Wave);
	void BndEvt__CB45343DMinus4B0591F8Minus9083BEAAMinus2DFD4C2C_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event_WaveCounter__DelegateSignature(class UBFGQuest_Element* _Element, int32 _Wave);
	void BndEvt__6E6A7D3EMinus42549F43Minus5D409C94Minus30C3EBBF_BFGK2Node_BoundQuestEvent_228_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__EF0826B9Minus40E3CDA0Minus92DC5BAAMinus1BCDA99F_BFGK2Node_BoundQuestEvent_32_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__C6686FF7Minus453C209DMinusE5F37AA0MinusBBE90E47_BFGK2Node_BoundQuestEvent_19_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__DCB5AF47Minus4D35636FMinus18C4D9AFMinusAD092B54_BFGK2Node_BoundQuestEvent_40_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__5A332798Minus46C0CD36MinusE3CBDDA5MinusF4C10E46_BFGK2Node_BoundQuestEvent_36_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D772B458Minus4134A7D7Minus1E25908CMinus83C3B977_BFGK2Node_BoundQuestEvent_34_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__528CFDCDMinus48C622CEMinusA64CBD8CMinusB9A43146_BFGK2Node_BoundQuestEvent_32_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D3049074Minus4D16CC03Minus6DB43DADMinus2F0401EC_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__61A9CA54Minus4647CD3BMinus8F3881B9MinusD2E746FA_BFGK2Node_BoundQuestEvent_26_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__10216DECMinus496F4240MinusDBE17287Minus3A9A8C02_BFGK2Node_BoundQuestEvent_24_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__8D299852Minus4DDF4D10Minus64E808BAMinus3468C899_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__38BE86D4Minus4F32801DMinus43F9E59BMinusB2615BF9_BFGK2Node_BoundQuestEvent_14_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__38BE86D4Minus4F32801DMinus43F9E59BMinusB2615BF9_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__36058475Minus404668C4MinusE22E70ACMinus9854E76A_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__36058475Minus404668C4MinusE22E70ACMinus9854E76A_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E70F9FA3Minus4272FE5FMinus1C466CB2MinusBB0DCFD7_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E70F9FA3Minus4272FE5FMinus1C466CB2MinusBB0DCFD7_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__9F0682FAMinus4FF22D94MinusE4DB7CB9Minus158BA560_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__9F0682FAMinus4FF22D94MinusE4DB7CB9Minus158BA560_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__65028280Minus413FFC11Minus56BC5F9BMinusAEC0BC5B_BFGK2Node_BoundQuestEvent_35_BFGQuestElement_Event_MentalAbility__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, EMentalAbility_EventState _state);
	void BndEvt__08D609EBMinus481508A7MinusBC95FBBDMinus2BF2D4F0_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__BBCEEEDEMinus49E76F68Minus7A24CC83MinusAEE7D92C_BFGK2Node_BoundQuestEvent_26_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__66ABC07AMinus44EF36B4MinusE210D2B8Minus759B3470_BFGK2Node_BoundQuestEvent_24_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4B9C5D6DMinus403D7CDEMinusAB6BC0BCMinus1DF6EEEA_BFGK2Node_BoundQuestEvent_21_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__DCB5AF47Minus4D35636FMinus18C4D9AFMinusAD092B54_BFGK2Node_BoundQuestEvent_19_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__5A332798Minus46C0CD36MinusE3CBDDA5MinusF4C10E46_BFGK2Node_BoundQuestEvent_16_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D772B458Minus4134A7D7Minus1E25908CMinus83C3B977_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__528CFDCDMinus48C622CEMinusA64CBD8CMinusB9A43146_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D3049074Minus4D16CC03Minus6DB43DADMinus2F0401EC_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__61A9CA54Minus4647CD3BMinus8F3881B9MinusD2E746FA_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__10216DECMinus496F4240MinusDBE17287Minus3A9A8C02_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__48AD2ED0Minus43E20F4DMinusA93B9792Minus606848A5_BFGK2Node_BoundQuestEvent_47_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__48AD2ED0Minus43E20F4DMinusA93B9792Minus606848A5_BFGK2Node_BoundQuestEvent_49_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__48AD2ED0Minus43E20F4DMinusA93B9792Minus606848A5_BFGK2Node_BoundQuestEvent_51_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__CD3C099AMinus4E75FBACMinus0BE1EB93MinusC593CFCE_BFGK2Node_BoundQuestEvent_59_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__CD3C099AMinus4E75FBACMinus0BE1EB93MinusC593CFCE_BFGK2Node_BoundQuestEvent_61_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__CD3C099AMinus4E75FBACMinus0BE1EB93MinusC593CFCE_BFGK2Node_BoundQuestEvent_63_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__FDA7697AMinus404881EBMinus72FEEC9BMinus054535C0_BFGK2Node_BoundQuestEvent_80_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__FDA7697AMinus404881EBMinus72FEEC9BMinus054535C0_BFGK2Node_BoundQuestEvent_82_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__FDA7697AMinus404881EBMinus72FEEC9BMinus054535C0_BFGK2Node_BoundQuestEvent_84_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__99332AD3Minus452D121DMinus19D1B980Minus008819CD_BFGK2Node_BoundQuestEvent_86_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__99332AD3Minus452D121DMinus19D1B980Minus008819CD_BFGK2Node_BoundQuestEvent_88_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__8D299852Minus4DDF4D10Minus64E808BAMinus3468C899_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_Defend__DelegateSignature(class UBFGQuest_ElementDefend* _Element, class AActor* _Defendee, float _CurrentHealth, float _LastHealth, float _MaxHealth);
	void BndEvt__99332AD3Minus452D121DMinus19D1B980Minus008819CD_BFGK2Node_BoundQuestEvent_90_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__0CF5E1EFMinus45F80728MinusB14404BBMinus43191A54_BFGK2Node_BoundQuestEvent_78_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__9B8E2992Minus41BD5A97MinusD7569A9CMinusC836862C_BFGK2Node_BoundQuestEvent_19_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__9B8E2992Minus41BD5A97MinusD7569A9CMinusC836862C_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F82E0D99Minus46F82F42MinusA9B305ACMinus47D5F4EA_BFGK2Node_BoundQuestEvent_93_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__96C72756Minus4B0A56C1Minus494F5E96Minus37691D60_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__95859893Minus43C61FC2MinusEC74B48FMinusD7B72259_BFGK2Node_BoundQuestEvent_20_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__B5E05D88Minus45153EF6MinusFEA9B480Minus347D74C8_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__B5E05D88Minus45153EF6MinusFEA9B480Minus347D74C8_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__B5E05D88Minus45153EF6MinusFEA9B480Minus347D74C8_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__C70711CEMinus4EE2A911Minus525529BBMinus1484A0A8_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7C12DBB5Minus4EC628C0Minus38822DA7Minus330A033F_BFGK2Node_BoundQuestEvent_50_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7C12DBB5Minus4EC628C0Minus38822DA7Minus330A033F_BFGK2Node_BoundQuestEvent_48_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7C12DBB5Minus4EC628C0Minus38822DA7Minus330A033F_BFGK2Node_BoundQuestEvent_45_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__7C12DBB5Minus4EC628C0Minus38822DA7Minus330A033F_BFGK2Node_BoundQuestEvent_41_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__17A7E537Minus470732EDMinus521528ADMinus947D7860_BFGK2Node_BoundQuestEvent_40_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__17A7E537Minus470732EDMinus521528ADMinus947D7860_BFGK2Node_BoundQuestEvent_38_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__17A7E537Minus470732EDMinus521528ADMinus947D7860_BFGK2Node_BoundQuestEvent_35_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__17A7E537Minus470732EDMinus521528ADMinus947D7860_BFGK2Node_BoundQuestEvent_27_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__84BDDB4BMinus42BC7ADFMinusE419EAB9Minus551A5176_BFGK2Node_BoundQuestEvent_24_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__84BDDB4BMinus42BC7ADFMinusE419EAB9Minus551A5176_BFGK2Node_BoundQuestEvent_22_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__84BDDB4BMinus42BC7ADFMinusE419EAB9Minus551A5176_BFGK2Node_BoundQuestEvent_19_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__CD3C099AMinus4E75FBACMinus0BE1EB93MinusC593CFCE_BFGK2Node_BoundQuestEvent_16_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__B798B4DEMinus4DC38C0AMinus203CB699Minus8B7C28D0_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__B798B4DEMinus4DC38C0AMinus203CB699Minus8B7C28D0_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__B798B4DEMinus4DC38C0AMinus203CB699Minus8B7C28D0_BFGK2Node_BoundQuestEvent_11_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__B798B4DEMinus4DC38C0AMinus203CB699Minus8B7C28D0_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__84BDDB4BMinus42BC7ADFMinusE419EAB9Minus551A5176_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void Get_MusicSystem(bool* Valid, class ABP_MusicSystem_C** MusicSystem_0);
	void GetBombTruck(class APawn** Truck);
	void InitBombTruckRef();
	void TruckDefendSetup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM14_DuckAndCover_C">();
	}
	static class UMM14_DuckAndCover_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMM14_DuckAndCover_C>();
	}
};
static_assert(alignof(UMM14_DuckAndCover_C) == 0x000008, "Wrong alignment on UMM14_DuckAndCover_C");
static_assert(sizeof(UMM14_DuckAndCover_C) == 0x000380, "Wrong size on UMM14_DuckAndCover_C");
static_assert(offsetof(UMM14_DuckAndCover_C, UberGraphFrame) == 0x000238, "Member 'UMM14_DuckAndCover_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, MusicSystem) == 0x000240, "Member 'UMM14_DuckAndCover_C::MusicSystem' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, BombTruck) == 0x000248, "Member 'UMM14_DuckAndCover_C::BombTruck' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, MissionSpawnerEscort) == 0x000270, "Member 'UMM14_DuckAndCover_C::MissionSpawnerEscort' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, Keypad_01) == 0x000298, "Member 'UMM14_DuckAndCover_C::Keypad_01' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, Keypad_02) == 0x0002C0, "Member 'UMM14_DuckAndCover_C::Keypad_02' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, Gate_01) == 0x0002E8, "Member 'UMM14_DuckAndCover_C::Gate_01' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, Gate_02) == 0x000310, "Member 'UMM14_DuckAndCover_C::Gate_02' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, PlayDefuseWarning) == 0x000338, "Member 'UMM14_DuckAndCover_C::PlayDefuseWarning' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, SpawnManagerScientists) == 0x000340, "Member 'UMM14_DuckAndCover_C::SpawnManagerScientists' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, Soldiers) == 0x000368, "Member 'UMM14_DuckAndCover_C::Soldiers' has a wrong offset!");
static_assert(offsetof(UMM14_DuckAndCover_C, DefendNukeCPReached) == 0x000378, "Member 'UMM14_DuckAndCover_C::DefendNukeCPReached' has a wrong offset!");

}

