#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mouthy_Youth_03_PostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Mouthy_Youth_03_PostAnimBP.Mouthy_Youth_03_PostAnimBP_C
// 0x0188 (0x0420 - 0x0298)
class UMouthy_Youth_03_PostAnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_176EC2C748D2751B74515BBB7BDCD899; // 0x02A8(0x0020)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_239DDCB74DD1F54888666A8BA3071C79; // 0x02C8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_AC73D4494BF8D96F26100AABF06ED552; // 0x0310(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4CE079E84A884364BBBE0E970788D7E3; // 0x03D8(0x0048)()

public:
	void ExecuteUbergraph_Mouthy_Youth_03_PostAnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mouthy_Youth_03_PostAnimBP_C">();
	}
	static class UMouthy_Youth_03_PostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMouthy_Youth_03_PostAnimBP_C>();
	}
};
static_assert(alignof(UMouthy_Youth_03_PostAnimBP_C) == 0x000008, "Wrong alignment on UMouthy_Youth_03_PostAnimBP_C");
static_assert(sizeof(UMouthy_Youth_03_PostAnimBP_C) == 0x000420, "Wrong size on UMouthy_Youth_03_PostAnimBP_C");
static_assert(offsetof(UMouthy_Youth_03_PostAnimBP_C, UberGraphFrame) == 0x0002A0, "Member 'UMouthy_Youth_03_PostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMouthy_Youth_03_PostAnimBP_C, AnimGraphNode_Root_176EC2C748D2751B74515BBB7BDCD899) == 0x0002A8, "Member 'UMouthy_Youth_03_PostAnimBP_C::AnimGraphNode_Root_176EC2C748D2751B74515BBB7BDCD899' has a wrong offset!");
static_assert(offsetof(UMouthy_Youth_03_PostAnimBP_C, AnimGraphNode_SubInput_239DDCB74DD1F54888666A8BA3071C79) == 0x0002C8, "Member 'UMouthy_Youth_03_PostAnimBP_C::AnimGraphNode_SubInput_239DDCB74DD1F54888666A8BA3071C79' has a wrong offset!");
static_assert(offsetof(UMouthy_Youth_03_PostAnimBP_C, AnimGraphNode_ApplyAdditive_AC73D4494BF8D96F26100AABF06ED552) == 0x000310, "Member 'UMouthy_Youth_03_PostAnimBP_C::AnimGraphNode_ApplyAdditive_AC73D4494BF8D96F26100AABF06ED552' has a wrong offset!");
static_assert(offsetof(UMouthy_Youth_03_PostAnimBP_C, AnimGraphNode_SequenceEvaluator_4CE079E84A884364BBBE0E970788D7E3) == 0x0003D8, "Member 'UMouthy_Youth_03_PostAnimBP_C::AnimGraphNode_SequenceEvaluator_4CE079E84A884364BBBE0E970788D7E3' has a wrong offset!");

}

