#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mouthy_Youth_02_PostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Mouthy_Youth_02_PostAnimBP.Mouthy_Youth_02_PostAnimBP_C
// 0x0188 (0x0420 - 0x0298)
class UMouthy_Youth_02_PostAnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_441397CE454FD33C1BE6B6A6E61DC9AC; // 0x02A8(0x0020)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_5CCF3C59480BC88FA132CF98363F8C70; // 0x02C8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_CE7581C048CD5C49A0CDA6B654009D6D; // 0x0310(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8E7E53E9452D27DE9522BF89E3F67089; // 0x03D8(0x0048)()

public:
	void ExecuteUbergraph_Mouthy_Youth_02_PostAnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mouthy_Youth_02_PostAnimBP_C">();
	}
	static class UMouthy_Youth_02_PostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMouthy_Youth_02_PostAnimBP_C>();
	}
};
static_assert(alignof(UMouthy_Youth_02_PostAnimBP_C) == 0x000008, "Wrong alignment on UMouthy_Youth_02_PostAnimBP_C");
static_assert(sizeof(UMouthy_Youth_02_PostAnimBP_C) == 0x000420, "Wrong size on UMouthy_Youth_02_PostAnimBP_C");
static_assert(offsetof(UMouthy_Youth_02_PostAnimBP_C, UberGraphFrame) == 0x0002A0, "Member 'UMouthy_Youth_02_PostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMouthy_Youth_02_PostAnimBP_C, AnimGraphNode_Root_441397CE454FD33C1BE6B6A6E61DC9AC) == 0x0002A8, "Member 'UMouthy_Youth_02_PostAnimBP_C::AnimGraphNode_Root_441397CE454FD33C1BE6B6A6E61DC9AC' has a wrong offset!");
static_assert(offsetof(UMouthy_Youth_02_PostAnimBP_C, AnimGraphNode_SubInput_5CCF3C59480BC88FA132CF98363F8C70) == 0x0002C8, "Member 'UMouthy_Youth_02_PostAnimBP_C::AnimGraphNode_SubInput_5CCF3C59480BC88FA132CF98363F8C70' has a wrong offset!");
static_assert(offsetof(UMouthy_Youth_02_PostAnimBP_C, AnimGraphNode_ApplyAdditive_CE7581C048CD5C49A0CDA6B654009D6D) == 0x000310, "Member 'UMouthy_Youth_02_PostAnimBP_C::AnimGraphNode_ApplyAdditive_CE7581C048CD5C49A0CDA6B654009D6D' has a wrong offset!");
static_assert(offsetof(UMouthy_Youth_02_PostAnimBP_C, AnimGraphNode_SequenceEvaluator_8E7E53E9452D27DE9522BF89E3F67089) == 0x0003D8, "Member 'UMouthy_Youth_02_PostAnimBP_C::AnimGraphNode_SequenceEvaluator_8E7E53E9452D27DE9522BF89E3F67089' has a wrong offset!");

}

