#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_BuildingFluffEffects

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct struct_BuildingFluffEffects.struct_BuildingFluffEffects
// 0x0050 (0x0050 - 0x0000)
struct FStruct_BuildingFluffEffects final
{
public:
	struct FTransform                             SpawnTransform_8_CA4CCC0C4A86ACA281A18689A8D1E5E9; // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UParticleSystem*                        PFX_3_B689CC5D46EE97A7F2F8978664223F31;            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundWave*                             SFX_5_5C05426546410ED75EBCD88781F540B0;            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnRateMultiplier_11_492E337241AC6B8EDAACF68C66AC28CE; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FStruct_BuildingFluffEffects) == 0x000010, "Wrong alignment on FStruct_BuildingFluffEffects");
static_assert(sizeof(FStruct_BuildingFluffEffects) == 0x000050, "Wrong size on FStruct_BuildingFluffEffects");
static_assert(offsetof(FStruct_BuildingFluffEffects, SpawnTransform_8_CA4CCC0C4A86ACA281A18689A8D1E5E9) == 0x000000, "Member 'FStruct_BuildingFluffEffects::SpawnTransform_8_CA4CCC0C4A86ACA281A18689A8D1E5E9' has a wrong offset!");
static_assert(offsetof(FStruct_BuildingFluffEffects, PFX_3_B689CC5D46EE97A7F2F8978664223F31) == 0x000030, "Member 'FStruct_BuildingFluffEffects::PFX_3_B689CC5D46EE97A7F2F8978664223F31' has a wrong offset!");
static_assert(offsetof(FStruct_BuildingFluffEffects, SFX_5_5C05426546410ED75EBCD88781F540B0) == 0x000038, "Member 'FStruct_BuildingFluffEffects::SFX_5_5C05426546410ED75EBCD88781F540B0' has a wrong offset!");
static_assert(offsetof(FStruct_BuildingFluffEffects, SpawnRateMultiplier_11_492E337241AC6B8EDAACF68C66AC28CE) == 0x000040, "Member 'FStruct_BuildingFluffEffects::SpawnRateMultiplier_11_492E337241AC6B8EDAACF68C66AC28CE' has a wrong offset!");

}

