#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: V2_CircusTruck_essentials_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysXVehicles_structs.hpp"
#include "PhysXVehicles_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass V2_CircusTruck_essentials_Skeleton_AnimBlueprint.V2_CircusTruck_essentials_Skeleton_AnimBlueprint_C
// 0x0280 (0x0BE0 - 0x0960)
class UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C final : public UVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0960(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_B7484DB048A845A258C360A92899D38C; // 0x0968(0x0020)()
	struct FAnimNode_WheelHandler                 AnimGraphNode_WheelHandler_659F94BE4C9562220BEA949FA2048C6C; // 0x0988(0x00E0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_9F2DC9F240EB3DC3358141B7D6EB37E4; // 0x0A68(0x0138)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_A1DAACA747A3EEEACF13E2B5ADF0090B; // 0x0BA0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_73C58D1243222ED9F5894BAF8F9FE09A; // 0x0BC0(0x0020)()

public:
	void ExecuteUbergraph_V2_CircusTruck_essentials_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"V2_CircusTruck_essentials_Skeleton_AnimBlueprint_C">();
	}
	static class UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C) == 0x000008, "Wrong alignment on UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C) == 0x000BE0, "Wrong size on UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000960, "Member 'UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C, AnimGraphNode_Root_B7484DB048A845A258C360A92899D38C) == 0x000968, "Member 'UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C::AnimGraphNode_Root_B7484DB048A845A258C360A92899D38C' has a wrong offset!");
static_assert(offsetof(UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C, AnimGraphNode_WheelHandler_659F94BE4C9562220BEA949FA2048C6C) == 0x000988, "Member 'UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C::AnimGraphNode_WheelHandler_659F94BE4C9562220BEA949FA2048C6C' has a wrong offset!");
static_assert(offsetof(UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh_9F2DC9F240EB3DC3358141B7D6EB37E4) == 0x000A68, "Member 'UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh_9F2DC9F240EB3DC3358141B7D6EB37E4' has a wrong offset!");
static_assert(offsetof(UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_A1DAACA747A3EEEACF13E2B5ADF0090B) == 0x000BA0, "Member 'UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_A1DAACA747A3EEEACF13E2B5ADF0090B' has a wrong offset!");
static_assert(offsetof(UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_73C58D1243222ED9F5894BAF8F9FE09A) == 0x000BC0, "Member 'UV2_CircusTruck_essentials_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_73C58D1243222ED9F5894BAF8F9FE09A' has a wrong offset!");

}

