#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZapOMatic_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function ZapOMatic_AnimBP.ZapOMatic_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ZapOMatic_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZapOMatic_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ZapOMatic_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(ZapOMatic_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ZapOMatic_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(ZapOMatic_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ZapOMatic_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ZapOMatic_AnimBP.ZapOMatic_AnimBP_C.ExecuteUbergraph_ZapOMatic_AnimBP
// 0x0018 (0x0018 - 0x0000)
struct ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGAnimation_Variables_Crypto*         CallFunc_GetVariables_Crypto_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP) == 0x000008, "Wrong alignment on ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP");
static_assert(sizeof(ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP) == 0x000018, "Wrong size on ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP");
static_assert(offsetof(ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP, EntryPoint) == 0x000000, "Member 'ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP, CallFunc_GetVariables_Crypto_ReturnValue) == 0x000008, "Member 'ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP::CallFunc_GetVariables_Crypto_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'ZapOMatic_AnimBP_C_ExecuteUbergraph_ZapOMatic_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

