#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenuFigure

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MainMenuFigure.BP_MainMenuFigure_C
// 0x0030 (0x0360 - 0x0330)
class ABP_MainMenuFigure_C final : public ASkeletalMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableFloatBobbing;                               // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OriginalLocation;                                  // 0x0348(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MainMenuFigure(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MainMenuFigure_C">();
	}
	static class ABP_MainMenuFigure_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MainMenuFigure_C>();
	}
};
static_assert(alignof(ABP_MainMenuFigure_C) == 0x000008, "Wrong alignment on ABP_MainMenuFigure_C");
static_assert(sizeof(ABP_MainMenuFigure_C) == 0x000360, "Wrong size on ABP_MainMenuFigure_C");
static_assert(offsetof(ABP_MainMenuFigure_C, UberGraphFrame) == 0x000330, "Member 'ABP_MainMenuFigure_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuFigure_C, StaticMesh) == 0x000338, "Member 'ABP_MainMenuFigure_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuFigure_C, bEnableFloatBobbing) == 0x000340, "Member 'ABP_MainMenuFigure_C::bEnableFloatBobbing' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuFigure_C, OriginalLocation) == 0x000348, "Member 'ABP_MainMenuFigure_C::OriginalLocation' has a wrong offset!");

}

