#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spinny

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Spinny.BP_Spinny_C.ExecuteUbergraph_BP_Spinny
// 0x03B0 (0x03B0 - 0x0000)
struct BP_Spinny_C_ExecuteUbergraph_BP_Spinny final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FQuat                                  CallFunc_Conv_RotatorToQuaternion_ReturnValue;     // 0x0050(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0088(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FQuat                                  CallFunc_Conv_RotatorToQuaternion_ReturnValue_1;   // 0x0190(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  CallFunc_Quat_Inversed_ReturnValue;                // 0x01B0(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  CallFunc_Multiply_QuatQuat_ReturnValue;            // 0x01D0(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQuat_X;                              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQuat_Y;                              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQuat_Z;                              // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQuat_W;                              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_218[0x8];                                      // 0x0218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  CallFunc_MakeQuat_ReturnValue;                     // 0x0220(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0240(0x00F0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FQuat                                  CallFunc_Quat_Normalized_ReturnValue;              // 0x0330(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  CallFunc_Multiply_QuatQuat_ReturnValue_1;          // 0x0350(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_RotatorFloat_B_ImplicitCast;     // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeQuat_Z_ImplicitCast;                  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeQuat_Y_ImplicitCast;                  // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeQuat_X_ImplicitCast;                  // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny) == 0x000010, "Wrong alignment on BP_Spinny_C_ExecuteUbergraph_BP_Spinny");
static_assert(sizeof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny) == 0x0003B0, "Wrong size on BP_Spinny_C_ExecuteUbergraph_BP_Spinny");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, EntryPoint) == 0x000000, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x000010, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000038, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Conv_RotatorToQuaternion_ReturnValue) == 0x000050, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Conv_RotatorToQuaternion_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Quat_Rotator_ReturnValue) == 0x000070, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Quat_Rotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000088, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000178, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Conv_RotatorToQuaternion_ReturnValue_1) == 0x000190, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Conv_RotatorToQuaternion_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Quat_Inversed_ReturnValue) == 0x0001B0, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Quat_Inversed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_QuatQuat_ReturnValue) == 0x0001D0, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_QuatQuat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_BreakQuat_X) == 0x0001F0, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_BreakQuat_X' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_BreakQuat_Y) == 0x0001F4, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_BreakQuat_Y' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_BreakQuat_Z) == 0x0001F8, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_BreakQuat_Z' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_BreakQuat_W) == 0x0001FC, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_BreakQuat_W' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000200, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000208, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000210, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_MakeQuat_ReturnValue) == 0x000220, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_MakeQuat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000240, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Quat_Normalized_ReturnValue) == 0x000330, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Quat_Normalized_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_QuatQuat_ReturnValue_1) == 0x000350, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_QuatQuat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_RotatorFloat_B_ImplicitCast) == 0x000370, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_RotatorFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_FClamp_Value_ImplicitCast) == 0x000378, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000380, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000388, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000390, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_MakeQuat_Z_ImplicitCast) == 0x000398, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_MakeQuat_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_MakeQuat_Y_ImplicitCast) == 0x00039C, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_MakeQuat_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spinny_C_ExecuteUbergraph_BP_Spinny, CallFunc_MakeQuat_X_ImplicitCast) == 0x0003A0, "Member 'BP_Spinny_C_ExecuteUbergraph_BP_Spinny::CallFunc_MakeQuat_X_ImplicitCast' has a wrong offset!");

// Function BP_Spinny.BP_Spinny_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Spinny_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spinny_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Spinny_C_ReceiveTick");
static_assert(sizeof(BP_Spinny_C_ReceiveTick) == 0x000004, "Wrong size on BP_Spinny_C_ReceiveTick");
static_assert(offsetof(BP_Spinny_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Spinny_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

