#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_AvatarPresetHelper

#include "Basic.hpp"

#include "Brickadia_structs.hpp"


namespace SDK::Params
{

// Function BPFL_AvatarPresetHelper.BPFL_AvatarPresetHelper_C.Unpack Avatar Preset
// 0x0090 (0x0090 - 0x0000)
struct BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset final
{
public:
	class UBRPreset*                              TARGET;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                WorldContext;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBRPlayerAvatarCustomizationV3         Customization;                                     // 0x0020(0x0010)(Parm, OutParm)
	struct FBRPlayerAvatarCustomizationV2         LV_CustomizationV2;                                // 0x0030(0x0010)(Edit, BlueprintVisible)
	struct FBRPlayerAvatarCustomizationV3         CallFunc_LoadStruct_Struct;                        // 0x0040(0x0010)()
	bool                                          CallFunc_LoadStruct_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBRPlayerAvatarCustomizationV3         CallFunc_UpgradeCustomization_ReturnValue;         // 0x0058(0x0010)()
	int32                                         CallFunc_GetPresetVersion_PresetVersion;           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPresetVersion_ReturnValue;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBRPlayerAvatarCustomizationV2         CallFunc_LoadStruct_Struct_1;                      // 0x0070(0x0010)()
	bool                                          CallFunc_LoadStruct_ReturnValue_1;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPresetVersion_PresetVersion_1;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPresetVersion_ReturnValue_1;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset) == 0x000008, "Wrong alignment on BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset");
static_assert(sizeof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset) == 0x000090, "Wrong size on BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, TARGET) == 0x000000, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::TARGET' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, WorldContext) == 0x000008, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, __WorldContext) == 0x000010, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, bSuccess) == 0x000018, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, Customization) == 0x000020, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::Customization' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, LV_CustomizationV2) == 0x000030, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::LV_CustomizationV2' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_LoadStruct_Struct) == 0x000040, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_LoadStruct_Struct' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_LoadStruct_ReturnValue) == 0x000050, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_LoadStruct_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_UpgradeCustomization_ReturnValue) == 0x000058, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_UpgradeCustomization_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_GetPresetVersion_PresetVersion) == 0x000068, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_GetPresetVersion_PresetVersion' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_GetPresetVersion_ReturnValue) == 0x00006C, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_GetPresetVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_Less_IntInt_ReturnValue) == 0x00006D, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_LoadStruct_Struct_1) == 0x000070, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_LoadStruct_Struct_1' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_LoadStruct_ReturnValue_1) == 0x000080, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_LoadStruct_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_GetPresetVersion_PresetVersion_1) == 0x000084, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_GetPresetVersion_PresetVersion_1' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_GetPresetVersion_ReturnValue_1) == 0x000088, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_GetPresetVersion_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset, CallFunc_Less_IntInt_ReturnValue_1) == 0x000089, "Member 'BPFL_AvatarPresetHelper_C_Unpack_Avatar_Preset::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

}

