#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_DateAndTime

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct UDS_DateAndTime.UDS_DateAndTime
// 0x0018 (0x0018 - 0x0000)
struct FUDS_DateAndTime final
{
public:
	int32                                         Year_2_5936ACDB4E7F71C3EC90F69D7234DCB1;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Month_4_32A4CA754DFE7D22C3ECE9AF0E8329B4;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Day_6_004C80D94C5AA9D6C83EC884AE3346E4;            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeofDay_9_81503E2845CAEAE1C342BCAEA896B01D;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUDS_DateAndTime) == 0x000008, "Wrong alignment on FUDS_DateAndTime");
static_assert(sizeof(FUDS_DateAndTime) == 0x000018, "Wrong size on FUDS_DateAndTime");
static_assert(offsetof(FUDS_DateAndTime, Year_2_5936ACDB4E7F71C3EC90F69D7234DCB1) == 0x000000, "Member 'FUDS_DateAndTime::Year_2_5936ACDB4E7F71C3EC90F69D7234DCB1' has a wrong offset!");
static_assert(offsetof(FUDS_DateAndTime, Month_4_32A4CA754DFE7D22C3ECE9AF0E8329B4) == 0x000004, "Member 'FUDS_DateAndTime::Month_4_32A4CA754DFE7D22C3ECE9AF0E8329B4' has a wrong offset!");
static_assert(offsetof(FUDS_DateAndTime, Day_6_004C80D94C5AA9D6C83EC884AE3346E4) == 0x000008, "Member 'FUDS_DateAndTime::Day_6_004C80D94C5AA9D6C83EC884AE3346E4' has a wrong offset!");
static_assert(offsetof(FUDS_DateAndTime, TimeofDay_9_81503E2845CAEAE1C342BCAEA896B01D) == 0x000010, "Member 'FUDS_DateAndTime::TimeofDay_9_81503E2845CAEAE1C342BCAEA896B01D' has a wrong offset!");

}

