#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogBackdrop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DialogBackdrop.WBP_DialogBackdrop_C
// 0x0020 (0x02F0 - 0x02D0)
class UWBP_DialogBackdrop_C final : public UDialogBackdropBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeBackgroundBlur;                                // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ClickCatcher;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisableBackgroundBlur();
	void DisableClickCatcher();
	void EnableBackgroundBlur();
	void EnableClickCatcher();
	void ExecuteUbergraph_WBP_DialogBackdrop(int32 EntryPoint);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DialogBackdrop_C">();
	}
	static class UWBP_DialogBackdrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DialogBackdrop_C>();
	}
};
static_assert(alignof(UWBP_DialogBackdrop_C) == 0x000008, "Wrong alignment on UWBP_DialogBackdrop_C");
static_assert(sizeof(UWBP_DialogBackdrop_C) == 0x0002F0, "Wrong size on UWBP_DialogBackdrop_C");
static_assert(offsetof(UWBP_DialogBackdrop_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_DialogBackdrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBackdrop_C, FadeBackgroundBlur) == 0x0002D8, "Member 'UWBP_DialogBackdrop_C::FadeBackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBackdrop_C, BackgroundBlur) == 0x0002E0, "Member 'UWBP_DialogBackdrop_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_DialogBackdrop_C, ClickCatcher) == 0x0002E8, "Member 'UWBP_DialogBackdrop_C::ClickCatcher' has a wrong offset!");

}

