#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AvatarEditor

#include "Basic.hpp"

#include "Brickadia_structs.hpp"


namespace SDK::Params
{

// Function WBP_AvatarEditor.WBP_AvatarEditor_C.BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_0_OnLeftClickEntry__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_0_OnLeftClickEntry__DelegateSignature final
{
public:
	class UObject*                                EntryPayload;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_0_OnLeftClickEntry__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_0_OnLeftClickEntry__DelegateSignature");
static_assert(sizeof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_0_OnLeftClickEntry__DelegateSignature) == 0x000008, "Wrong size on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_0_OnLeftClickEntry__DelegateSignature");
static_assert(offsetof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_0_OnLeftClickEntry__DelegateSignature, EntryPayload) == 0x000000, "Member 'WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_0_OnLeftClickEntry__DelegateSignature::EntryPayload' has a wrong offset!");

// Function WBP_AvatarEditor.WBP_AvatarEditor_C.BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_1_OnEntryDragStarted__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_1_OnEntryDragStarted__DelegateSignature final
{
public:
	class UObject*                                EntryPayload;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_1_OnEntryDragStarted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_1_OnEntryDragStarted__DelegateSignature");
static_assert(sizeof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_1_OnEntryDragStarted__DelegateSignature) == 0x000008, "Wrong size on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_1_OnEntryDragStarted__DelegateSignature");
static_assert(offsetof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_1_OnEntryDragStarted__DelegateSignature, EntryPayload) == 0x000000, "Member 'WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_1_OnEntryDragStarted__DelegateSignature::EntryPayload' has a wrong offset!");

// Function WBP_AvatarEditor.WBP_AvatarEditor_C.BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_2_OnEntryDragEnded__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_2_OnEntryDragEnded__DelegateSignature final
{
public:
	class UObject*                                EntryPayload;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_2_OnEntryDragEnded__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_2_OnEntryDragEnded__DelegateSignature");
static_assert(sizeof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_2_OnEntryDragEnded__DelegateSignature) == 0x000008, "Wrong size on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_2_OnEntryDragEnded__DelegateSignature");
static_assert(offsetof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_2_OnEntryDragEnded__DelegateSignature, EntryPayload) == 0x000000, "Member 'WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_2_OnEntryDragEnded__DelegateSignature::EntryPayload' has a wrong offset!");

// Function WBP_AvatarEditor.WBP_AvatarEditor_C.BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_4_OnEntryHoverStarted__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_4_OnEntryHoverStarted__DelegateSignature final
{
public:
	class UObject*                                EntryPayload;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_4_OnEntryHoverStarted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_4_OnEntryHoverStarted__DelegateSignature");
static_assert(sizeof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_4_OnEntryHoverStarted__DelegateSignature) == 0x000008, "Wrong size on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_4_OnEntryHoverStarted__DelegateSignature");
static_assert(offsetof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_4_OnEntryHoverStarted__DelegateSignature, EntryPayload) == 0x000000, "Member 'WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_4_OnEntryHoverStarted__DelegateSignature::EntryPayload' has a wrong offset!");

// Function WBP_AvatarEditor.WBP_AvatarEditor_C.BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_5_OnEntryHoverEnded__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_5_OnEntryHoverEnded__DelegateSignature final
{
public:
	class UObject*                                EntryPayload;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_5_OnEntryHoverEnded__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_5_OnEntryHoverEnded__DelegateSignature");
static_assert(sizeof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_5_OnEntryHoverEnded__DelegateSignature) == 0x000008, "Wrong size on WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_5_OnEntryHoverEnded__DelegateSignature");
static_assert(offsetof(WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_5_OnEntryHoverEnded__DelegateSignature, EntryPayload) == 0x000000, "Member 'WBP_AvatarEditor_C_BndEvt__AvatarPartsPanel_K2Node_ComponentBoundEvent_5_OnEntryHoverEnded__DelegateSignature::EntryPayload' has a wrong offset!");

// Function WBP_AvatarEditor.WBP_AvatarEditor_C.BndEvt__AvatarPreviewPanel_K2Node_ComponentBoundEvent_12_OnPartClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AvatarEditor_C_BndEvt__AvatarPreviewPanel_K2Node_ComponentBoundEvent_12_OnPartClicked__DelegateSignature final
{
public:
	class UBRPlayerPartComponent*                 Part;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AvatarEditor_C_BndEvt__AvatarPreviewPanel_K2Node_ComponentBoundEvent_12_OnPartClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AvatarEditor_C_BndEvt__AvatarPreviewPanel_K2Node_ComponentBoundEvent_12_OnPartClicked__DelegateSignature");
static_assert(sizeof(WBP_AvatarEditor_C_BndEvt__AvatarPreviewPanel_K2Node_ComponentBoundEvent_12_OnPartClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_AvatarEditor_C_BndEvt__AvatarPreviewPanel_K2Node_ComponentBoundEvent_12_OnPartClicked__DelegateSignature");
static_assert(offsetof(WBP_AvatarEditor_C_BndEvt__AvatarPreviewPanel_K2Node_ComponentBoundEvent_12_OnPartClicked__DelegateSignature, Part) == 0x000000, "Member 'WBP_AvatarEditor_C_BndEvt__AvatarPreviewPanel_K2Node_ComponentBoundEvent_12_OnPartClicked__DelegateSignature::Part' has a wrong offset!");

// Function WBP_AvatarEditor.WBP_AvatarEditor_C.BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_3_OnLoadPreset__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_3_OnLoadPreset__DelegateSignature final
{
public:
	class UBRPreset*                              Preset;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_3_OnLoadPreset__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_3_OnLoadPreset__DelegateSignature");
static_assert(sizeof(WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_3_OnLoadPreset__DelegateSignature) == 0x000008, "Wrong size on WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_3_OnLoadPreset__DelegateSignature");
static_assert(offsetof(WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_3_OnLoadPreset__DelegateSignature, Preset) == 0x000000, "Member 'WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_3_OnLoadPreset__DelegateSignature::Preset' has a wrong offset!");

// Function WBP_AvatarEditor.WBP_AvatarEditor_C.BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_4_OnSavePreset__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_4_OnSavePreset__DelegateSignature final
{
public:
	class UBRPreset*                              Preset;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_4_OnSavePreset__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_4_OnSavePreset__DelegateSignature");
static_assert(sizeof(WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_4_OnSavePreset__DelegateSignature) == 0x000008, "Wrong size on WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_4_OnSavePreset__DelegateSignature");
static_assert(offsetof(WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_4_OnSavePreset__DelegateSignature, Preset) == 0x000000, "Member 'WBP_AvatarEditor_C_BndEvt__PresetDropdown_K2Node_ComponentBoundEvent_4_OnSavePreset__DelegateSignature::Preset' has a wrong offset!");

// Function WBP_AvatarEditor.WBP_AvatarEditor_C.ExecuteUbergraph_WBP_AvatarEditor
// 0x0200 (0x0200 - 0x0000)
struct WBP_AvatarEditor_C_ExecuteUbergraph_WBP_AvatarEditor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncActionOneButtonDialog*            CallFunc_QuickCreateOneButtonDialog_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncActionOneButtonDialog*            CallFunc_QuickCreateOneButtonDialog_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncActionOneButtonDialog*            CallFunc_QuickCreateOneButtonDialog_ReturnValue_2; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncActionTwoButtonsDialog*           CallFunc_QuickCreateTwoButtonsDialog_ReturnValue;  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncActionTwoButtonsDialog*           CallFunc_QuickCreateTwoButtonsDialog_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_EntryPayload_4;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_EntryPayload_3;         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_EntryPayload_2;         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABRPlayerController*                    CallFunc_GetBRPlayerController_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBRPlayerAvatarCustomizationV3         CallFunc_BuildAvatarCustomizationFromPlayerParts_ReturnValue; // 0x0110(0x0010)()
	bool                                          CallFunc_HasRequiredPartsAttached_ReturnValue;     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncActionThreeButtonsDialog*         CallFunc_QuickCreateThreeButtonsDialog_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_EntryPayload_1;         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_EntryPayload;           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRPreset*                              K2Node_ComponentBoundEvent_Preset_1;               // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRPreset*                              K2Node_ComponentBoundEvent_Preset;                 // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Unpack_Avatar_Preset_bSuccess;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBRPlayerAvatarCustomizationV3         CallFunc_Unpack_Avatar_Preset_Customization;       // 0x0170(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBRPlayerAvatarCustomizationV3         CallFunc_BuildAvatarCustomizationFromPlayerParts_ReturnValue_1; // 0x01B8(0x0010)()
	bool                                          CallFunc_HasRequiredPartsAttached_ReturnValue_1;   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadAvatar_bSuccess;                      // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBRPresetSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRPreset*                              CallFunc_CreatePreset_ReturnValue;                 // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRPlayerPartComponent*                 K2Node_ComponentBoundEvent_Part;                   // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncActionOneButtonDialog*            CallFunc_QuickCreateOneButtonDialog_ReturnValue_3; // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AvatarEditor_C_ExecuteUbergraph_WBP_AvatarEditor) == 0x000008, "Wrong alignment on WBP_AvatarEditor_C_ExecuteUbergraph_WBP_AvatarEditor");
static_assert(sizeof(WBP_AvatarEditor_C_ExecuteUbergraph_WBP_AvatarEditor) == 0x000200, "Wrong size on WBP_AvatarEditor_C_ExecuteUbergraph_WBP_AvatarEditor");
static_assert(offsetof(WBP_AvatarEditor_C_ExecuteUbergraph_WBP_AvatarEditor, EntryPoint) == 0x000000, "Member 'WBP_AvatarEditor_C_ExecuteUbergraph_WBP_AvatarEditor::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AvatarEditor_C_ExecuteUbergraph_WBP_AvatarEditor, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_AvatarEditor_C_ExecuteUbergraph_WBP_AvatarEditor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
