#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConnectingDialog

#include "Basic.hpp"

#include "Brickadia_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ConnectingDialog.WBP_ConnectingDialog_C.ExecuteUbergraph_WBP_ConnectingDialog
// 0x0140 (0x0140 - 0x0000)
struct WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBRAuthSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Sequence, bool bRequiresPassword)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBRDialogState                                CallFunc_GetDialogState_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FakeLoadingScreen_C*               CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0058(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0068(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0078(0x0010)()
	class UBRAuthSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MeasureText_ReturnValue;                  // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MeasureText_ReturnValue_1;                // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MeasureText_ReturnValue_2;                // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_2;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_3;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Sequence;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bRequiresPassword;              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog) == 0x000008, "Wrong alignment on WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog");
static_assert(sizeof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog) == 0x000140, "Wrong size on WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, EntryPoint) == 0x000000, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_GetDialogState_ReturnValue) == 0x000040, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_GetDialogState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_Create_ReturnValue) == 0x000048, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_MakeLiteralText_ReturnValue) == 0x000058, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000068, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000078, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000088, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_MeasureText_ReturnValue) == 0x000090, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_MeasureText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_MeasureText_ReturnValue_1) == 0x0000A0, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_MeasureText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_BreakVector2D_X) == 0x0000B0, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_BreakVector2D_Y) == 0x0000B8, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_BreakVector2D_X_1) == 0x0000C0, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_BreakVector2D_Y_1) == 0x0000C8, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_MeasureText_ReturnValue_2) == 0x0000D0, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_MeasureText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_BreakVector2D_X_2) == 0x0000E0, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_BreakVector2D_Y_2) == 0x0000E8, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_FMax_ReturnValue) == 0x0000F0, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_FMax_ReturnValue_1) == 0x0000F8, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_FMax_ReturnValue_2) == 0x000100, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_FMax_ReturnValue_3) == 0x000108, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_FMax_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, K2Node_CustomEvent_Sequence) == 0x000110, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::K2Node_CustomEvent_Sequence' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, K2Node_CustomEvent_bRequiresPassword) == 0x000114, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::K2Node_CustomEvent_bRequiresPassword' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000115, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, K2Node_CreateDelegate_OutputDelegate_3) == 0x000118, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, K2Node_CreateDelegate_OutputDelegate_4) == 0x000128, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast) == 0x000138, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_SetMinDesiredHeight_InMinDesiredHeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x00013C, "Member 'WBP_ConnectingDialog_C_ExecuteUbergraph_WBP_ConnectingDialog::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");

// Function WBP_ConnectingDialog.WBP_ConnectingDialog_C.OnServerRequestSucceeded_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConnectingDialog_C_OnServerRequestSucceeded_Event final
{
public:
	int32                                         Sequence;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequiresPassword;                                 // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConnectingDialog_C_OnServerRequestSucceeded_Event) == 0x000004, "Wrong alignment on WBP_ConnectingDialog_C_OnServerRequestSucceeded_Event");
static_assert(sizeof(WBP_ConnectingDialog_C_OnServerRequestSucceeded_Event) == 0x000008, "Wrong size on WBP_ConnectingDialog_C_OnServerRequestSucceeded_Event");
static_assert(offsetof(WBP_ConnectingDialog_C_OnServerRequestSucceeded_Event, Sequence) == 0x000000, "Member 'WBP_ConnectingDialog_C_OnServerRequestSucceeded_Event::Sequence' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingDialog_C_OnServerRequestSucceeded_Event, bRequiresPassword) == 0x000004, "Member 'WBP_ConnectingDialog_C_OnServerRequestSucceeded_Event::bRequiresPassword' has a wrong offset!");

}

