#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TypeTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TypeTooltip.WBP_TypeTooltip_C
// 0x0050 (0x0320 - 0x02D0)
class UWBP_TypeTooltip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBHResolvedTypeInfo                    TypeInfo;                                          // 0x02E8(0x0038)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TypeTooltip(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TypeTooltip_C">();
	}
	static class UWBP_TypeTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TypeTooltip_C>();
	}
};
static_assert(alignof(UWBP_TypeTooltip_C) == 0x000008, "Wrong alignment on UWBP_TypeTooltip_C");
static_assert(sizeof(UWBP_TypeTooltip_C) == 0x000320, "Wrong size on UWBP_TypeTooltip_C");
static_assert(offsetof(UWBP_TypeTooltip_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_TypeTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TypeTooltip_C, Icon) == 0x0002D8, "Member 'UWBP_TypeTooltip_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_TypeTooltip_C, Name_0) == 0x0002E0, "Member 'UWBP_TypeTooltip_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_TypeTooltip_C, TypeInfo) == 0x0002E8, "Member 'UWBP_TypeTooltip_C::TypeInfo' has a wrong offset!");

}

