#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerListEntry

#include "Basic.hpp"

#include "WBP_DraggableListEntryBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerListEntry.WBP_ServerListEntry_C
// 0x0050 (0x0590 - 0x0540)
class UWBP_ServerListEntry_C final : public UWBP_DraggableListEntryBase_C
{
public:
	class UWS_TextBlock_Default_C*                BrickCountText;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DedicatedIcon;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                HostNameText;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MapIcon;                                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                MapText;                                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PasswordIcon;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                PlayerCountText;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Emphasis_C*               ServerNameText;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                VisitorsText;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitializeForListItem(class UObject* ListItem, bool bIsFromListView);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerListEntry_C">();
	}
	static class UWBP_ServerListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerListEntry_C>();
	}
};
static_assert(alignof(UWBP_ServerListEntry_C) == 0x000010, "Wrong alignment on UWBP_ServerListEntry_C");
static_assert(sizeof(UWBP_ServerListEntry_C) == 0x000590, "Wrong size on UWBP_ServerListEntry_C");
static_assert(offsetof(UWBP_ServerListEntry_C, BrickCountText) == 0x000540, "Member 'UWBP_ServerListEntry_C::BrickCountText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntry_C, DedicatedIcon) == 0x000548, "Member 'UWBP_ServerListEntry_C::DedicatedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntry_C, HostNameText) == 0x000550, "Member 'UWBP_ServerListEntry_C::HostNameText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntry_C, MapIcon) == 0x000558, "Member 'UWBP_ServerListEntry_C::MapIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntry_C, MapText) == 0x000560, "Member 'UWBP_ServerListEntry_C::MapText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntry_C, PasswordIcon) == 0x000568, "Member 'UWBP_ServerListEntry_C::PasswordIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntry_C, PlayerCountText) == 0x000570, "Member 'UWBP_ServerListEntry_C::PlayerCountText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntry_C, ServerNameText) == 0x000578, "Member 'UWBP_ServerListEntry_C::ServerNameText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerListEntry_C, VisitorsText) == 0x000580, "Member 'UWBP_ServerListEntry_C::VisitorsText' has a wrong offset!");

}

