#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerListPlayersEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ServerListPlayersEntry.WBP_ServerListPlayersEntry_C.ExecuteUbergraph_WBP_ServerListPlayersEntry
// 0x0068 (0x0068 - 0x0000)
struct WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	class FText                                   CallFunc_FormatTimespanSimple_ReturnValue;         // 0x0050(0x0010)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry) == 0x000008, "Wrong alignment on WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry");
static_assert(sizeof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry) == 0x000068, "Wrong size on WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, EntryPoint) == 0x000000, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, Temp_struct_Variable) == 0x000008, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, Temp_bool_Variable_1) == 0x000028, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, Temp_byte_Variable) == 0x000029, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, Temp_byte_Variable_1) == 0x00002A, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, K2Node_Select_Default) == 0x00002C, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, CallFunc_FormatTimespanSimple_ReturnValue) == 0x000050, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::CallFunc_FormatTimespanSimple_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry, K2Node_Select_Default_1) == 0x000060, "Member 'WBP_ServerListPlayersEntry_C_ExecuteUbergraph_WBP_ServerListPlayersEntry::K2Node_Select_Default_1' has a wrong offset!");

}

