#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ColorPaletteEditorDetailsPanel

#include "Basic.hpp"

#include "Brickadia_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel
// 0x0070 (0x0070 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0008(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0020(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxGroupNameLength_ReturnValue;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0010)()
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel) == 0x000070, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, EntryPoint) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, K2Node_ComponentBoundEvent_Text_1) == 0x000008, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, K2Node_ComponentBoundEvent_CommitMethod) == 0x000018, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, K2Node_ComponentBoundEvent_Text) == 0x000020, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, CallFunc_GetMaxGroupNameLength_ReturnValue) == 0x000040, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::CallFunc_GetMaxGroupNameLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, CallFunc_Len_ReturnValue) == 0x000044, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, CallFunc_Left_ReturnValue) == 0x000048, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.GetDescription
// 0x0020 (0x0020 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_GetDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0010)()
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_GetDescription) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_GetDescription");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_GetDescription) == 0x000020, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_GetDescription");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_GetDescription, ReturnValue) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_GetDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_GetDescription, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_GetDescription::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.SetDescription
// 0x0010 (0x0010 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_SetDescription final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_SetDescription) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_SetDescription");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_SetDescription) == 0x000010, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_SetDescription");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetDescription, Text) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetDescription::Text' has a wrong offset!");

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.SetGroupColorCount
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBRColorSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_None;                            // 0x0018(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxRows_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_None_1;                          // 0x0070(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount) == 0x0000D8, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount, Count) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount::Count' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount, K2Node_MakeStruct_None) == 0x000018, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount::K2Node_MakeStruct_None' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount, CallFunc_GetMaxRows_ReturnValue) == 0x000060, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount::CallFunc_GetMaxRows_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000068, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount, K2Node_MakeStruct_None_1) == 0x000070, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount::K2Node_MakeStruct_None_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupColorCount::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.SetGroupInfo
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo final
{
public:
	struct FBRColorPaletteGroupInfo               Group;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Index_0;                                           // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_None;                            // 0x0030(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo) == 0x0000B0, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo, Group) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo::Group' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo, Index_0) == 0x000020, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo, K2Node_MakeStruct_None) == 0x000030, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo::K2Node_MakeStruct_None' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetGroupInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.SetPaletteGroupCount
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBRColorSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxGroups_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_None;                            // 0x0020(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_None_1;                          // 0x0070(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount) == 0x0000D8, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount, Count) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount::Count' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount, CallFunc_GetMaxGroups_ReturnValue) == 0x000018, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount::CallFunc_GetMaxGroups_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount, K2Node_MakeStruct_None) == 0x000020, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount::K2Node_MakeStruct_None' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000068, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount, K2Node_MakeStruct_None_1) == 0x000070, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount::K2Node_MakeStruct_None_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteGroupCount::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.SetPaletteTotalColorCount
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBRColorSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_None;                            // 0x0018(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxRows_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxGroups_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_None_1;                          // 0x0078(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0010)()
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount) == 0x0000E0, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, Count) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::Count' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, K2Node_MakeStruct_None) == 0x000018, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::K2Node_MakeStruct_None' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, CallFunc_GetMaxRows_ReturnValue) == 0x000060, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::CallFunc_GetMaxRows_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, CallFunc_GetMaxGroups_ReturnValue) == 0x000064, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::CallFunc_GetMaxGroups_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, CallFunc_Multiply_IntInt_ReturnValue) == 0x000068, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000070, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, K2Node_MakeStruct_None_1) == 0x000078, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::K2Node_MakeStruct_None_1' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_SetPaletteTotalColorCount::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C.UpdateGroupInfo
// 0x0028 (0x0028 - 0x0000)
struct WBP_ColorPaletteEditorDetailsPanel_C_UpdateGroupInfo final
{
public:
	struct FBRColorPaletteGroupInfo               Group;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Index_0;                                           // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ColorPaletteEditorDetailsPanel_C_UpdateGroupInfo) == 0x000008, "Wrong alignment on WBP_ColorPaletteEditorDetailsPanel_C_UpdateGroupInfo");
static_assert(sizeof(WBP_ColorPaletteEditorDetailsPanel_C_UpdateGroupInfo) == 0x000028, "Wrong size on WBP_ColorPaletteEditorDetailsPanel_C_UpdateGroupInfo");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_UpdateGroupInfo, Group) == 0x000000, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_UpdateGroupInfo::Group' has a wrong offset!");
static_assert(offsetof(WBP_ColorPaletteEditorDetailsPanel_C_UpdateGroupInfo, Index_0) == 0x000020, "Member 'WBP_ColorPaletteEditorDetailsPanel_C_UpdateGroupInfo::Index_0' has a wrong offset!");
