#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EditGameTab_AdvancedSettings

#include "Basic.hpp"

#include "Brickadia_structs.hpp"


namespace SDK::Params
{

// Function WBP_EditGameTab_AdvancedSettings.WBP_EditGameTab_AdvancedSettings_C.Apply
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_EditGameTab_AdvancedSettings_C_Apply final
{
public:
	bool                                          bAllowAnnounce;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInspectorPropertyChangelist           CallFunc_GetChangelist_ReturnValue;                // 0x0008(0x0010)()
	class ABRPlayerController*                    CallFunc_GetBRPlayerController_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInspectorPropertyChangelist           CallFunc_GetChangelist_ReturnValue_1;              // 0x0028(0x0010)()
	class UBRGameSettingsSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInspectorPropertyChangelist           CallFunc_GetChangelist_ReturnValue_2;              // 0x0040(0x0010)()
	class UBRServerSettingsBase_General*          CallFunc_GetSettingsInstance_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRGameSettingsSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRServerSettingsBase_AutoSave*         CallFunc_GetSettingsInstance_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInspectorViewTarget                   CallFunc_MakeViewTargetFromObject_ReturnValue;     // 0x0068(0x0030)(NoDestructor)
	struct FInspectorViewTarget                   CallFunc_MakeViewTargetFromObject_ReturnValue_1;   // 0x0098(0x0030)(NoDestructor)
	class ABRPlayerController*                    CallFunc_GetBRPlayerController_ReturnValue_1;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInspectorPropertyChangelist           CallFunc_GetChangelist_ReturnValue_3;              // 0x00D8(0x0010)()
};
static_assert(alignof(WBP_EditGameTab_AdvancedSettings_C_Apply) == 0x000008, "Wrong alignment on WBP_EditGameTab_AdvancedSettings_C_Apply");
static_assert(sizeof(WBP_EditGameTab_AdvancedSettings_C_Apply) == 0x0000E8, "Wrong size on WBP_EditGameTab_AdvancedSettings_C_Apply");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, bAllowAnnounce) == 0x000000, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::bAllowAnnounce' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetChangelist_ReturnValue) == 0x000008, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetChangelist_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetBRPlayerController_ReturnValue) == 0x000018, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetBRPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetChangelist_ReturnValue_1) == 0x000028, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetChangelist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetChangelist_ReturnValue_2) == 0x000040, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetChangelist_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetSettingsInstance_ReturnValue) == 0x000050, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetSettingsInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetSettingsInstance_ReturnValue_1) == 0x000060, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetSettingsInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_MakeViewTargetFromObject_ReturnValue) == 0x000068, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_MakeViewTargetFromObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_MakeViewTargetFromObject_ReturnValue_1) == 0x000098, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_MakeViewTargetFromObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetBRPlayerController_ReturnValue_1) == 0x0000C8, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetBRPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_Apply, CallFunc_GetChangelist_ReturnValue_3) == 0x0000D8, "Member 'WBP_EditGameTab_AdvancedSettings_C_Apply::CallFunc_GetChangelist_ReturnValue_3' has a wrong offset!");

// Function WBP_EditGameTab_AdvancedSettings.WBP_EditGameTab_AdvancedSettings_C.ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBRGameSettingsBase* SettingsObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBRGameSettingsBase* SettingsObject)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABRHUD*                                 CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRGameSettingsSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ColorPaletteEditorDialog_C*        CallFunc_OpenDialogByClass_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBRGameSettingsSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRGameSettingsSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRServerSettingsBase_AutoSave*         CallFunc_GetSettingsInstance_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRServerSettings_Color*                CallFunc_GetSettingsInstance_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInspectorViewTarget                   CallFunc_MakeViewTargetFromObject_ReturnValue;     // 0x0060(0x0030)(NoDestructor)
	class UBRColorPalette*                        CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRGameSettingsSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRGameSettingsSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRServerSettingsBase_General*          CallFunc_GetSettingsInstance_ReturnValue_2;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInspectorViewTarget                   CallFunc_MakeViewTargetFromObject_ReturnValue_1;   // 0x00B0(0x0030)(NoDestructor)
};
static_assert(alignof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings) == 0x000008, "Wrong alignment on WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings");
static_assert(sizeof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings) == 0x0000E0, "Wrong size on WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, EntryPoint) == 0x000000, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_Get_ReturnValue) == 0x000028, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_OpenDialogByClass_ReturnValue) == 0x000038, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_OpenDialogByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000040, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000048, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_GetSettingsInstance_ReturnValue) == 0x000050, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_GetSettingsInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_GetSettingsInstance_ReturnValue_1) == 0x000058, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_GetSettingsInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_MakeViewTargetFromObject_ReturnValue) == 0x000060, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_MakeViewTargetFromObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000098, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0000A0, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_GetSettingsInstance_ReturnValue_2) == 0x0000A8, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_GetSettingsInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings, CallFunc_MakeViewTargetFromObject_ReturnValue_1) == 0x0000B0, "Member 'WBP_EditGameTab_AdvancedSettings_C_ExecuteUbergraph_WBP_EditGameTab_AdvancedSettings::CallFunc_MakeViewTargetFromObject_ReturnValue_1' has a wrong offset!");

// Function WBP_EditGameTab_AdvancedSettings.WBP_EditGameTab_AdvancedSettings_C.OnSettingsUpdated_AutoSave
// 0x0058 (0x0058 - 0x0000)
struct WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave final
{
public:
	class UBRGameSettingsBase*                    SettingsObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInspectorPropertyChangelist           Changelist;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FInspectorViewTarget                   CallFunc_MakeViewTargetFromObject_ReturnValue;     // 0x0018(0x0030)(NoDestructor)
	struct FInspectorPropertyChangelist           CallFunc_GetChangelist_ReturnValue;                // 0x0048(0x0010)()
};
static_assert(alignof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave) == 0x000008, "Wrong alignment on WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave");
static_assert(sizeof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave) == 0x000058, "Wrong size on WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave, SettingsObject) == 0x000000, "Member 'WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave::SettingsObject' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave, Changelist) == 0x000008, "Member 'WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave::Changelist' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave, CallFunc_MakeViewTargetFromObject_ReturnValue) == 0x000018, "Member 'WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave::CallFunc_MakeViewTargetFromObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave, CallFunc_GetChangelist_ReturnValue) == 0x000048, "Member 'WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_AutoSave::CallFunc_GetChangelist_ReturnValue' has a wrong offset!");

// Function WBP_EditGameTab_AdvancedSettings.WBP_EditGameTab_AdvancedSettings_C.OnSettingsUpdated_General
// 0x0058 (0x0058 - 0x0000)
struct WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General final
{
public:
	class UBRGameSettingsBase*                    SettingsObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInspectorPropertyChangelist           Changelist;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FInspectorViewTarget                   CallFunc_MakeViewTargetFromObject_ReturnValue;     // 0x0018(0x0030)(NoDestructor)
	struct FInspectorPropertyChangelist           CallFunc_GetChangelist_ReturnValue;                // 0x0048(0x0010)()
};
static_assert(alignof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General) == 0x000008, "Wrong alignment on WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General");
static_assert(sizeof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General) == 0x000058, "Wrong size on WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General, SettingsObject) == 0x000000, "Member 'WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General::SettingsObject' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General, Changelist) == 0x000008, "Member 'WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General::Changelist' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General, CallFunc_MakeViewTargetFromObject_ReturnValue) == 0x000018, "Member 'WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General::CallFunc_MakeViewTargetFromObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General, CallFunc_GetChangelist_ReturnValue) == 0x000048, "Member 'WBP_EditGameTab_AdvancedSettings_C_OnSettingsUpdated_General::CallFunc_GetChangelist_ReturnValue' has a wrong offset!");

}

