#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BlockEditor_ArgSlot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_BlockEditor_ArgSlot.WBP_BlockEditor_ArgSlot_C.ExecuteUbergraph_WBP_BlockEditor_ArgSlot
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_None;                            // 0x0010(0x00B0)()
	struct FLinearColor                           K2Node_Event_Color;                                // 0x00C0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot) == 0x000010, "Wrong alignment on WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot");
static_assert(sizeof(WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot) == 0x0000D0, "Wrong size on WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot");
static_assert(offsetof(WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot, EntryPoint) == 0x000000, "Member 'WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot, K2Node_MakeStruct_None) == 0x000010, "Member 'WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot::K2Node_MakeStruct_None' has a wrong offset!");
static_assert(offsetof(WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot, K2Node_Event_Color) == 0x0000C0, "Member 'WBP_BlockEditor_ArgSlot_C_ExecuteUbergraph_WBP_BlockEditor_ArgSlot::K2Node_Event_Color' has a wrong offset!");

// Function WBP_BlockEditor_ArgSlot.WBP_BlockEditor_ArgSlot_C.HandleTypeColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_BlockEditor_ArgSlot_C_HandleTypeColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BlockEditor_ArgSlot_C_HandleTypeColor) == 0x000004, "Wrong alignment on WBP_BlockEditor_ArgSlot_C_HandleTypeColor");
static_assert(sizeof(WBP_BlockEditor_ArgSlot_C_HandleTypeColor) == 0x000010, "Wrong size on WBP_BlockEditor_ArgSlot_C_HandleTypeColor");
static_assert(offsetof(WBP_BlockEditor_ArgSlot_C_HandleTypeColor, Color) == 0x000000, "Member 'WBP_BlockEditor_ArgSlot_C_HandleTypeColor::Color' has a wrong offset!");

}

