#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EditGameDialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_structs.hpp"
#include "Brickadia_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EditGameDialog.WBP_EditGameDialog_C
// 0x0078 (0x0358 - 0x02E0)
class UWBP_EditGameDialog_C final : public UBRDialogBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_EditGameTab_AdvancedSettings_C*    AdvancedSettings;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EditGameDetailsPanel_C*            DetailsPanel;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DialogFrame_Big_C*                 DialogFrame;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_C*                          EnvironmentButton;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EditGameTab_Permissions_C*         Permissions;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabSet_C*                          TabSet;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EditGameUserManagement_C*          Users;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsInGame;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StagedWorldPath;                                   // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 StagedEnvironmentName;                             // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bStagedWorld;                                      // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStagedWorldWriteable;                             // 0x0351(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__DetailsPanel_K2Node_ComponentBoundEvent_3_OnFlow__DelegateSignature();
	void BndEvt__DialogFrame_K2Node_ComponentBoundEvent_0_OnCloseButtonClicked__DelegateSignature();
	void BndEvt__EnvironmentButton_K2Node_ComponentBoundEvent_4_ButtonDelegate__DelegateSignature();
	void BndEvt__TabSet_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature(int32 Index_0);
	void ExecuteUbergraph_WBP_EditGameDialog(int32 EntryPoint);
	void OnButtonClicked_8B853DA64347047C5BD8D7A1694356EB();
	void OnHideDialog();
	void OnOpenDialog();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EditGameDialog_C">();
	}
	static class UWBP_EditGameDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EditGameDialog_C>();
	}
};
static_assert(alignof(UWBP_EditGameDialog_C) == 0x000008, "Wrong alignment on UWBP_EditGameDialog_C");
static_assert(sizeof(UWBP_EditGameDialog_C) == 0x000358, "Wrong size on UWBP_EditGameDialog_C");
static_assert(offsetof(UWBP_EditGameDialog_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_EditGameDialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, AdvancedSettings) == 0x0002E8, "Member 'UWBP_EditGameDialog_C::AdvancedSettings' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, DetailsPanel) == 0x0002F0, "Member 'UWBP_EditGameDialog_C::DetailsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, DialogFrame) == 0x0002F8, "Member 'UWBP_EditGameDialog_C::DialogFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, EnvironmentButton) == 0x000300, "Member 'UWBP_EditGameDialog_C::EnvironmentButton' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, Permissions) == 0x000308, "Member 'UWBP_EditGameDialog_C::Permissions' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, Switcher) == 0x000310, "Member 'UWBP_EditGameDialog_C::Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, TabSet) == 0x000318, "Member 'UWBP_EditGameDialog_C::TabSet' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, Users) == 0x000320, "Member 'UWBP_EditGameDialog_C::Users' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, bIsInGame) == 0x000328, "Member 'UWBP_EditGameDialog_C::bIsInGame' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, StagedWorldPath) == 0x000330, "Member 'UWBP_EditGameDialog_C::StagedWorldPath' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, StagedEnvironmentName) == 0x000340, "Member 'UWBP_EditGameDialog_C::StagedEnvironmentName' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, bStagedWorld) == 0x000350, "Member 'UWBP_EditGameDialog_C::bStagedWorld' has a wrong offset!");
static_assert(offsetof(UWBP_EditGameDialog_C, bStagedWorldWriteable) == 0x000351, "Member 'UWBP_EditGameDialog_C::bStagedWorldWriteable' has a wrong offset!");

}

