#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FolderPath

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FolderPath.WBP_FolderPath_C
// 0x00A0 (0x0370 - 0x02D0)
class UWBP_FolderPath_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         AdditionalEntries;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FolderPathEntry_End_C*             EndEntry;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FolderPathEntry_Start_C*           StartEntry;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   StartPathSegmentText;                              // 0x02F0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         NumSegmentsBeforeSeparator;                        // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayedPath;                                     // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         DisplayedPathSegments;                             // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(const class FString& Path)> OnPathSelected;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnNewFolder;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UDragDropOperation* Operation, const class FString& Path)> OnDropped;                                         // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bAllowAsDropTarget;                                // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RequiredDragDropTag;                               // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__EndEntry_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature(class UWBP_FolderPathEntryBase_C* EntryWidget, int32 SegmentIndex);
	void BndEvt__StartEntry_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature(class UWBP_FolderPathEntryBase_C* EntryWidget, int32 SegmentIndex);
	void BndEvt__StartEntry_K2Node_ComponentBoundEvent_2_OnDropped__DelegateSignature(class UWBP_FolderPathEntryBase_C* EntryWidget, class UDragDropOperation* Operation, int32 SegmentIndex);
	void BuildPathWidget(bool bAllowAsDropTarget_0, int32 PathSegmentIndex, const class FText& PathSegmentText, bool bDisableButton, class UWBP_FolderPathEntry_Middle_C** Widget, class UHorizontalBoxSlot** Slot_0);
	void BuildPathWidgets();
	void ExecuteUbergraph_WBP_FolderPath(int32 EntryPoint);
	void GetPathUpToSegmentIndex(int32 SegmentIndex, class FString* Path);
	void HandlePathSegmentButtonClicked(class UWBP_FolderPathEntryBase_C* EntryWidget, int32 SegmentIndex);
	void HandlePathSegmentDropped(class UWBP_FolderPathEntryBase_C* EntryWidget, class UDragDropOperation* Operation, int32 SegmentIndex);
	void PreConstruct(bool IsDesignTime);
	void SetDisplayedPath(const class FString& Path);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FolderPath_C">();
	}
	static class UWBP_FolderPath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FolderPath_C>();
	}
};
static_assert(alignof(UWBP_FolderPath_C) == 0x000008, "Wrong alignment on UWBP_FolderPath_C");
static_assert(sizeof(UWBP_FolderPath_C) == 0x000370, "Wrong size on UWBP_FolderPath_C");
static_assert(offsetof(UWBP_FolderPath_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_FolderPath_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, AdditionalEntries) == 0x0002D8, "Member 'UWBP_FolderPath_C::AdditionalEntries' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, EndEntry) == 0x0002E0, "Member 'UWBP_FolderPath_C::EndEntry' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, StartEntry) == 0x0002E8, "Member 'UWBP_FolderPath_C::StartEntry' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, StartPathSegmentText) == 0x0002F0, "Member 'UWBP_FolderPath_C::StartPathSegmentText' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, NumSegmentsBeforeSeparator) == 0x000300, "Member 'UWBP_FolderPath_C::NumSegmentsBeforeSeparator' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, DisplayedPath) == 0x000308, "Member 'UWBP_FolderPath_C::DisplayedPath' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, DisplayedPathSegments) == 0x000318, "Member 'UWBP_FolderPath_C::DisplayedPathSegments' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, OnPathSelected) == 0x000328, "Member 'UWBP_FolderPath_C::OnPathSelected' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, OnNewFolder) == 0x000338, "Member 'UWBP_FolderPath_C::OnNewFolder' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, OnDropped) == 0x000348, "Member 'UWBP_FolderPath_C::OnDropped' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, bAllowAsDropTarget) == 0x000358, "Member 'UWBP_FolderPath_C::bAllowAsDropTarget' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPath_C, RequiredDragDropTag) == 0x000360, "Member 'UWBP_FolderPath_C::RequiredDragDropTag' has a wrong offset!");

}

