#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BlockEditor_DestVar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_BlockEditor_DestVar.WBP_BlockEditor_DestVar_C.ExecuteUbergraph_WBP_BlockEditor_DestVar
// 0x0014 (0x0014 - 0x0000)
struct WBP_BlockEditor_DestVar_C_ExecuteUbergraph_WBP_BlockEditor_DestVar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_Color;                                // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BlockEditor_DestVar_C_ExecuteUbergraph_WBP_BlockEditor_DestVar) == 0x000004, "Wrong alignment on WBP_BlockEditor_DestVar_C_ExecuteUbergraph_WBP_BlockEditor_DestVar");
static_assert(sizeof(WBP_BlockEditor_DestVar_C_ExecuteUbergraph_WBP_BlockEditor_DestVar) == 0x000014, "Wrong size on WBP_BlockEditor_DestVar_C_ExecuteUbergraph_WBP_BlockEditor_DestVar");
static_assert(offsetof(WBP_BlockEditor_DestVar_C_ExecuteUbergraph_WBP_BlockEditor_DestVar, EntryPoint) == 0x000000, "Member 'WBP_BlockEditor_DestVar_C_ExecuteUbergraph_WBP_BlockEditor_DestVar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BlockEditor_DestVar_C_ExecuteUbergraph_WBP_BlockEditor_DestVar, K2Node_Event_Color) == 0x000004, "Member 'WBP_BlockEditor_DestVar_C_ExecuteUbergraph_WBP_BlockEditor_DestVar::K2Node_Event_Color' has a wrong offset!");

// Function WBP_BlockEditor_DestVar.WBP_BlockEditor_DestVar_C.HandleTypeColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_BlockEditor_DestVar_C_HandleTypeColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BlockEditor_DestVar_C_HandleTypeColor) == 0x000004, "Wrong alignment on WBP_BlockEditor_DestVar_C_HandleTypeColor");
static_assert(sizeof(WBP_BlockEditor_DestVar_C_HandleTypeColor) == 0x000010, "Wrong size on WBP_BlockEditor_DestVar_C_HandleTypeColor");
static_assert(offsetof(WBP_BlockEditor_DestVar_C_HandleTypeColor, Color) == 0x000000, "Member 'WBP_BlockEditor_DestVar_C_HandleTypeColor::Color' has a wrong offset!");

}

