#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Property_Rotator3f

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Property_Rotator3f.WBP_Property_Rotator3f_C
// 0x0028 (0x03A8 - 0x0380)
class UWBP_Property_Rotator3f_C final : public UInspectorPropertyWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWS_Spinbox_Vector_C*                   PitchInputBox;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_Spinbox_Vector_C*                   RollInputBox;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_Spinbox_Vector_C*                   YawInputBox;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bAllowExternalUpdate;                              // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__XInputBox_K2Node_ComponentBoundEvent_0_OnSpinBoxBeginSliderMovement__DelegateSignature();
	void BndEvt__XInputBox_K2Node_ComponentBoundEvent_10_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__XInputBox_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__XInputBox_K2Node_ComponentBoundEvent_7_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void BndEvt__YInputBox_K2Node_ComponentBoundEvent_11_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__YInputBox_K2Node_ComponentBoundEvent_2_OnSpinBoxBeginSliderMovement__DelegateSignature();
	void BndEvt__YInputBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__YInputBox_K2Node_ComponentBoundEvent_8_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void BndEvt__ZInputBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__ZInputBox_K2Node_ComponentBoundEvent_4_OnSpinBoxBeginSliderMovement__DelegateSignature();
	void BndEvt__ZInputBox_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__ZInputBox_K2Node_ComponentBoundEvent_9_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void Construct();
	void ExecuteUbergraph_WBP_Property_Rotator3f(int32 EntryPoint);
	struct FRotator3f GetSliderValues();
	void OnAvailabilityChange(bool Enabled);
	void OnValueChangedExternally(const struct FInspectorPropertyValue& ValueIn);
	void SetEnabled(bool bEnabled);
	void SetSliderValues(const struct FRotator3f& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Property_Rotator3f_C">();
	}
	static class UWBP_Property_Rotator3f_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Property_Rotator3f_C>();
	}
};
static_assert(alignof(UWBP_Property_Rotator3f_C) == 0x000008, "Wrong alignment on UWBP_Property_Rotator3f_C");
static_assert(sizeof(UWBP_Property_Rotator3f_C) == 0x0003A8, "Wrong size on UWBP_Property_Rotator3f_C");
static_assert(offsetof(UWBP_Property_Rotator3f_C, UberGraphFrame) == 0x000380, "Member 'UWBP_Property_Rotator3f_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Rotator3f_C, PitchInputBox) == 0x000388, "Member 'UWBP_Property_Rotator3f_C::PitchInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Rotator3f_C, RollInputBox) == 0x000390, "Member 'UWBP_Property_Rotator3f_C::RollInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Rotator3f_C, YawInputBox) == 0x000398, "Member 'UWBP_Property_Rotator3f_C::YawInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Rotator3f_C, bAllowExternalUpdate) == 0x0003A0, "Member 'UWBP_Property_Rotator3f_C::bAllowExternalUpdate' has a wrong offset!");

}

