#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Property_Bool

#include "Basic.hpp"

#include "Brickadia_structs.hpp"


namespace SDK::Params
{

// Function WBP_Property_Bool.WBP_Property_Bool_C.BndEvt__ValueCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Property_Bool_C_BndEvt__ValueCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Property_Bool_C_BndEvt__ValueCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Property_Bool_C_BndEvt__ValueCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Property_Bool_C_BndEvt__ValueCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_Property_Bool_C_BndEvt__ValueCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Property_Bool_C_BndEvt__ValueCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_Property_Bool_C_BndEvt__ValueCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_Property_Bool.WBP_Property_Bool_C.ExecuteUbergraph_WBP_Property_Bool
// 0x0048 (0x0048 - 0x0000)
struct WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInspectorPropertyValue                K2Node_Event_ValueIn;                              // 0x0008(0x0018)(ConstParm, ZeroConstructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnboxPropertyValue_Boolean_bIsValid;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnboxPropertyValue_Boolean_Unboxed;       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInspectorPropertyValue                CallFunc_BoxPropertyValue_Boolean_ReturnValue;     // 0x0028(0x0018)(ZeroConstructor)
	bool                                          K2Node_Event_Enabled;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool) == 0x000008, "Wrong alignment on WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool");
static_assert(sizeof(WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool) == 0x000048, "Wrong size on WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool");
static_assert(offsetof(WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool, EntryPoint) == 0x000000, "Member 'WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool, K2Node_Event_ValueIn) == 0x000008, "Member 'WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool::K2Node_Event_ValueIn' has a wrong offset!");
static_assert(offsetof(WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool, K2Node_ComponentBoundEvent_bIsChecked) == 0x000020, "Member 'WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool, CallFunc_UnboxPropertyValue_Boolean_bIsValid) == 0x000021, "Member 'WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool::CallFunc_UnboxPropertyValue_Boolean_bIsValid' has a wrong offset!");
static_assert(offsetof(WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool, CallFunc_UnboxPropertyValue_Boolean_Unboxed) == 0x000022, "Member 'WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool::CallFunc_UnboxPropertyValue_Boolean_Unboxed' has a wrong offset!");
static_assert(offsetof(WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool, CallFunc_BoxPropertyValue_Boolean_ReturnValue) == 0x000028, "Member 'WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool::CallFunc_BoxPropertyValue_Boolean_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool, K2Node_Event_Enabled) == 0x000040, "Member 'WBP_Property_Bool_C_ExecuteUbergraph_WBP_Property_Bool::K2Node_Event_Enabled' has a wrong offset!");

// Function WBP_Property_Bool.WBP_Property_Bool_C.OnAvailabilityChange
// 0x0001 (0x0001 - 0x0000)
struct WBP_Property_Bool_C_OnAvailabilityChange final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Property_Bool_C_OnAvailabilityChange) == 0x000001, "Wrong alignment on WBP_Property_Bool_C_OnAvailabilityChange");
static_assert(sizeof(WBP_Property_Bool_C_OnAvailabilityChange) == 0x000001, "Wrong size on WBP_Property_Bool_C_OnAvailabilityChange");
static_assert(offsetof(WBP_Property_Bool_C_OnAvailabilityChange, Enabled) == 0x000000, "Member 'WBP_Property_Bool_C_OnAvailabilityChange::Enabled' has a wrong offset!");

// Function WBP_Property_Bool.WBP_Property_Bool_C.OnValueChangedExternally
// 0x0018 (0x0018 - 0x0000)
struct WBP_Property_Bool_C_OnValueChangedExternally final
{
public:
	struct FInspectorPropertyValue                ValueIn;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(WBP_Property_Bool_C_OnValueChangedExternally) == 0x000008, "Wrong alignment on WBP_Property_Bool_C_OnValueChangedExternally");
static_assert(sizeof(WBP_Property_Bool_C_OnValueChangedExternally) == 0x000018, "Wrong size on WBP_Property_Bool_C_OnValueChangedExternally");
static_assert(offsetof(WBP_Property_Bool_C_OnValueChangedExternally, ValueIn) == 0x000000, "Member 'WBP_Property_Bool_C_OnValueChangedExternally::ValueIn' has a wrong offset!");

}

