#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConnectingPasswordDialog

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ConnectingPasswordDialog.WBP_ConnectingPasswordDialog_C.BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_ConnectingPasswordDialog.WBP_ConnectingPasswordDialog_C.BndEvt__PasswordBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_ConnectingPasswordDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ConnectingPasswordDialog.WBP_ConnectingPasswordDialog_C.ExecuteUbergraph_WBP_ConnectingPasswordDialog
// 0x0180 (0x0180 - 0x0000)
struct WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_EscapeNetOption_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            K2Node_MakeMap_Map;                                // 0x0038(0x0050)(ConstParm)
	bool                                          CallFunc_BeginConnectingToServer_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0090(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABRHUD*                                 CallFunc_Get_ReturnValue;                          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ConnectingDialog_C*                CallFunc_OpenDialogByClass_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00D8(0x0010)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_None;                            // 0x0100(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0010)()
	class UAsyncActionOneButtonDialog*            CallFunc_QuickCreateOneButtonDialog_ReturnValue;   // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog) == 0x000008, "Wrong alignment on WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog");
static_assert(sizeof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog) == 0x000180, "Wrong size on WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, EntryPoint) == 0x000000, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_EscapeNetOption_ReturnValue) == 0x000028, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_EscapeNetOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, K2Node_MakeMap_Map) == 0x000038, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_BeginConnectingToServer_ReturnValue) == 0x000088, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_BeginConnectingToServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, K2Node_ComponentBoundEvent_Text_1) == 0x000090, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, K2Node_ComponentBoundEvent_CommitMethod) == 0x0000A0, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A1, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_TextIsEmpty_ReturnValue) == 0x0000A2, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_Get_ReturnValue) == 0x0000A8, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_OpenDialogByClass_ReturnValue) == 0x0000B8, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_OpenDialogByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_BooleanAND_ReturnValue) == 0x0000C0, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, K2Node_ComponentBoundEvent_Text) == 0x0000D8, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E8, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0000F8, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, K2Node_MakeStruct_None) == 0x000100, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::K2Node_MakeStruct_None' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_Not_PreBool_ReturnValue_1) == 0x000148, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, K2Node_MakeArray_Array) == 0x000150, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_Format_ReturnValue) == 0x000160, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_QuickCreateOneButtonDialog_ReturnValue) == 0x000170, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_QuickCreateOneButtonDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'WBP_ConnectingPasswordDialog_C_ExecuteUbergraph_WBP_ConnectingPasswordDialog::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

