#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AuthProgressDialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_structs.hpp"
#include "Brickadia_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AuthProgressDialog.WBP_AuthProgressDialog_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_AuthProgressDialog_C final : public UBRDialogBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DialogFrame_SmallHeader_C*         DialogFrame;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                DialogMessageText;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_AuthProgressDialog(int32 EntryPoint);
	void HandleAuthState(EBRAuthState NewState, EBRAuthState PreviousState, const class FString& ErrorCode, const class FString& ErrorMessage);
	void OnEscapeDialog();
	void OnOpenDialog();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AuthProgressDialog_C">();
	}
	static class UWBP_AuthProgressDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AuthProgressDialog_C>();
	}
};
static_assert(alignof(UWBP_AuthProgressDialog_C) == 0x000008, "Wrong alignment on UWBP_AuthProgressDialog_C");
static_assert(sizeof(UWBP_AuthProgressDialog_C) == 0x0002F8, "Wrong size on UWBP_AuthProgressDialog_C");
static_assert(offsetof(UWBP_AuthProgressDialog_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_AuthProgressDialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AuthProgressDialog_C, DialogFrame) == 0x0002E8, "Member 'UWBP_AuthProgressDialog_C::DialogFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AuthProgressDialog_C, DialogMessageText) == 0x0002F0, "Member 'UWBP_AuthProgressDialog_C::DialogMessageText' has a wrong offset!");

}

