#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FolderPathEntryBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FolderPathEntryBase.WBP_FolderPathEntryBase_C
// 0x0078 (0x0348 - 0x02D0)
class UWBP_FolderPathEntryBase_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DragHoverOutline;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowAsDropTarget;                                // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RequiredDragDropTag;                               // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PathSegmentIndex;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PathSegmentText;                                   // 0x0310(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class UWBP_FolderPathEntryBase_C* EntryWidget, int32 SegmentIndex)> OnButtonClicked;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_FolderPathEntryBase_C* EntryWidget, class UDragDropOperation* Operation, int32 SegmentIndex)> OnDropped;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bDisableButton;                                    // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_FolderPathEntryBase(int32 EntryPoint);
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void PreConstruct(bool IsDesignTime);
	void SetPathSegmentInfo(int32 PathSegmentIndex_0, const class FText& PathSegmentText_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FolderPathEntryBase_C">();
	}
	static class UWBP_FolderPathEntryBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FolderPathEntryBase_C>();
	}
};
static_assert(alignof(UWBP_FolderPathEntryBase_C) == 0x000008, "Wrong alignment on UWBP_FolderPathEntryBase_C");
static_assert(sizeof(UWBP_FolderPathEntryBase_C) == 0x000348, "Wrong size on UWBP_FolderPathEntryBase_C");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_FolderPathEntryBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, Button) == 0x0002D8, "Member 'UWBP_FolderPathEntryBase_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, Text) == 0x0002E0, "Member 'UWBP_FolderPathEntryBase_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, DragHoverOutline) == 0x0002E8, "Member 'UWBP_FolderPathEntryBase_C::DragHoverOutline' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, bAllowAsDropTarget) == 0x0002F0, "Member 'UWBP_FolderPathEntryBase_C::bAllowAsDropTarget' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, RequiredDragDropTag) == 0x0002F8, "Member 'UWBP_FolderPathEntryBase_C::RequiredDragDropTag' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, PathSegmentIndex) == 0x000308, "Member 'UWBP_FolderPathEntryBase_C::PathSegmentIndex' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, PathSegmentText) == 0x000310, "Member 'UWBP_FolderPathEntryBase_C::PathSegmentText' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, OnButtonClicked) == 0x000320, "Member 'UWBP_FolderPathEntryBase_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, OnDropped) == 0x000330, "Member 'UWBP_FolderPathEntryBase_C::OnDropped' has a wrong offset!");
static_assert(offsetof(UWBP_FolderPathEntryBase_C, bDisableButton) == 0x000340, "Member 'UWBP_FolderPathEntryBase_C::bDisableButton' has a wrong offset!");

}

