#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogFrame_Big

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_DialogFrame_Big.WBP_DialogFrame_Big_C.ExecuteUbergraph_WBP_DialogFrame_Big
// 0x0018 (0x0018 - 0x0000)
struct WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_DialogTitle;                          // 0x0008(0x0010)(ConstParm)
};
static_assert(alignof(WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big) == 0x000008, "Wrong alignment on WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big");
static_assert(sizeof(WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big) == 0x000018, "Wrong size on WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big");
static_assert(offsetof(WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big, EntryPoint) == 0x000000, "Member 'WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big, K2Node_Event_DialogTitle) == 0x000008, "Member 'WBP_DialogFrame_Big_C_ExecuteUbergraph_WBP_DialogFrame_Big::K2Node_Event_DialogTitle' has a wrong offset!");

// Function WBP_DialogFrame_Big.WBP_DialogFrame_Big_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DialogFrame_Big_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogFrame_Big_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DialogFrame_Big_C_PreConstruct");
static_assert(sizeof(WBP_DialogFrame_Big_C_PreConstruct) == 0x000001, "Wrong size on WBP_DialogFrame_Big_C_PreConstruct");
static_assert(offsetof(WBP_DialogFrame_Big_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DialogFrame_Big_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DialogFrame_Big.WBP_DialogFrame_Big_C.SetDialogTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_DialogFrame_Big_C_SetDialogTitle final
{
public:
	class FText                                   DialogTitle_0;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_DialogFrame_Big_C_SetDialogTitle) == 0x000008, "Wrong alignment on WBP_DialogFrame_Big_C_SetDialogTitle");
static_assert(sizeof(WBP_DialogFrame_Big_C_SetDialogTitle) == 0x000010, "Wrong size on WBP_DialogFrame_Big_C_SetDialogTitle");
static_assert(offsetof(WBP_DialogFrame_Big_C_SetDialogTitle, DialogTitle_0) == 0x000000, "Member 'WBP_DialogFrame_Big_C_SetDialogTitle::DialogTitle_0' has a wrong offset!");

}

