#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Property_ActionBinding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Property_ActionBinding.WBP_Property_ActionBinding_C
// 0x0018 (0x0398 - 0x0380)
class UWBP_Property_ActionBinding_C final : public UInspectorPropertyWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ActionBinding_Single_C*            ActionDetails_Gamepad;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ActionBinding_Single_C*            ActionDetails_Keyboard;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__ActionDetails_Gamepad_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature();
	void BndEvt__ActionDetails_Keyboard_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Property_ActionBinding(int32 EntryPoint);
	void OnAvailabilityChange(bool Enabled);
	void OnValueChangedExternally(const struct FInspectorPropertyValue& ValueIn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Property_ActionBinding_C">();
	}
	static class UWBP_Property_ActionBinding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Property_ActionBinding_C>();
	}
};
static_assert(alignof(UWBP_Property_ActionBinding_C) == 0x000008, "Wrong alignment on UWBP_Property_ActionBinding_C");
static_assert(sizeof(UWBP_Property_ActionBinding_C) == 0x000398, "Wrong size on UWBP_Property_ActionBinding_C");
static_assert(offsetof(UWBP_Property_ActionBinding_C, UberGraphFrame) == 0x000380, "Member 'UWBP_Property_ActionBinding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Property_ActionBinding_C, ActionDetails_Gamepad) == 0x000388, "Member 'UWBP_Property_ActionBinding_C::ActionDetails_Gamepad' has a wrong offset!");
static_assert(offsetof(UWBP_Property_ActionBinding_C, ActionDetails_Keyboard) == 0x000390, "Member 'UWBP_Property_ActionBinding_C::ActionDetails_Keyboard' has a wrong offset!");

}

