#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FakeLoadingScreenExit

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_FakeLoadingScreenExit.WBP_FakeLoadingScreenExit_C.ExecuteUbergraph_WBP_FakeLoadingScreenExit
// 0x0018 (0x0018 - 0x0000)
struct WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit) == 0x000008, "Wrong alignment on WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit");
static_assert(sizeof(WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit) == 0x000018, "Wrong size on WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit");
static_assert(offsetof(WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit, EntryPoint) == 0x000000, "Member 'WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_FakeLoadingScreenExit_C_ExecuteUbergraph_WBP_FakeLoadingScreenExit::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

