#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PresetList_Panel

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PresetList_Panel.WBP_PresetList_Panel_C.ExecuteUbergraph_WBP_PresetList_Panel
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBRPresetSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBRPreset*>                      CallFunc_GetPresetsByType_OutPresets;              // 0x0018(0x0010)(ReferenceParm)
	class UBRPreset*                              CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPresetName_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBRPreset*                              K2Node_CustomEvent_Preset_2;                       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRPreset*                              K2Node_CustomEvent_Preset_1;                       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PresetList_NewEntry_C*             CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBRPreset* Preset)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBRPreset* Preset)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRPreset*                              K2Node_CustomEvent_Preset;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PresetList_Entry_C*                CallFunc_Create_ReturnValue_1;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBRPreset* Preset)>      K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel) == 0x000008, "Wrong alignment on WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel");
static_assert(sizeof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel) == 0x0000D8, "Wrong size on WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, EntryPoint) == 0x000000, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, Temp_byte_Variable) == 0x000008, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_GetPresetsByType_OutPresets) == 0x000018, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_GetPresetsByType_OutPresets' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_GetPresetName_ReturnValue) == 0x000038, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_GetPresetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, Temp_byte_Variable_1) == 0x000048, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_Set_Contains_ReturnValue) == 0x000049, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, Temp_bool_Variable) == 0x00004A, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, K2Node_CustomEvent_Preset_2) == 0x000050, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::K2Node_CustomEvent_Preset_2' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, K2Node_CustomEvent_Preset_1) == 0x000068, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::K2Node_CustomEvent_Preset_1' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_Create_ReturnValue) == 0x000070, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000078, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, K2Node_CustomEvent_Preset) == 0x0000A0, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::K2Node_CustomEvent_Preset' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_Create_ReturnValue_1) == 0x0000A8, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x0000B0, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B8, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel, CallFunc_Add_IntInt_ReturnValue) == 0x0000D4, "Member 'WBP_PresetList_Panel_C_ExecuteUbergraph_WBP_PresetList_Panel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_PresetList_Panel.WBP_PresetList_Panel_C.OnCreateNewPreset_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_PresetList_Panel_C_OnCreateNewPreset_Event final
{
public:
	class UBRPreset*                              Preset;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PresetList_Panel_C_OnCreateNewPreset_Event) == 0x000008, "Wrong alignment on WBP_PresetList_Panel_C_OnCreateNewPreset_Event");
static_assert(sizeof(WBP_PresetList_Panel_C_OnCreateNewPreset_Event) == 0x000008, "Wrong size on WBP_PresetList_Panel_C_OnCreateNewPreset_Event");
static_assert(offsetof(WBP_PresetList_Panel_C_OnCreateNewPreset_Event, Preset) == 0x000000, "Member 'WBP_PresetList_Panel_C_OnCreateNewPreset_Event::Preset' has a wrong offset!");

// Function WBP_PresetList_Panel.WBP_PresetList_Panel_C.OnLoadPreset_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_PresetList_Panel_C_OnLoadPreset_Event final
{
public:
	class UBRPreset*                              Preset;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PresetList_Panel_C_OnLoadPreset_Event) == 0x000008, "Wrong alignment on WBP_PresetList_Panel_C_OnLoadPreset_Event");
static_assert(sizeof(WBP_PresetList_Panel_C_OnLoadPreset_Event) == 0x000008, "Wrong size on WBP_PresetList_Panel_C_OnLoadPreset_Event");
static_assert(offsetof(WBP_PresetList_Panel_C_OnLoadPreset_Event, Preset) == 0x000000, "Member 'WBP_PresetList_Panel_C_OnLoadPreset_Event::Preset' has a wrong offset!");

// Function WBP_PresetList_Panel.WBP_PresetList_Panel_C.OnOverwritePreset_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_PresetList_Panel_C_OnOverwritePreset_Event final
{
public:
	class UBRPreset*                              Preset;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PresetList_Panel_C_OnOverwritePreset_Event) == 0x000008, "Wrong alignment on WBP_PresetList_Panel_C_OnOverwritePreset_Event");
static_assert(sizeof(WBP_PresetList_Panel_C_OnOverwritePreset_Event) == 0x000008, "Wrong size on WBP_PresetList_Panel_C_OnOverwritePreset_Event");
static_assert(offsetof(WBP_PresetList_Panel_C_OnOverwritePreset_Event, Preset) == 0x000000, "Member 'WBP_PresetList_Panel_C_OnOverwritePreset_Event::Preset' has a wrong offset!");

}

