#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TwoButtonsDialog_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_structs.hpp"
#include "Brickadia_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TwoButtonsDialog_New.WBP_TwoButtonsDialog_New_C
// 0x0018 (0x0368 - 0x0350)
class UWBP_TwoButtonsDialog_New_C final : public UBRTwoButtonsDialogBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DialogFrame_SmallHeaderFooter_C*   DialogFrame;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                DialogMessageText;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TwoButtonsDialog_New(int32 EntryPoint);
	void OnEscapeDialog();
	void OnHideDialogFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TwoButtonsDialog_New_C">();
	}
	static class UWBP_TwoButtonsDialog_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TwoButtonsDialog_New_C>();
	}
};
static_assert(alignof(UWBP_TwoButtonsDialog_New_C) == 0x000008, "Wrong alignment on UWBP_TwoButtonsDialog_New_C");
static_assert(sizeof(UWBP_TwoButtonsDialog_New_C) == 0x000368, "Wrong size on UWBP_TwoButtonsDialog_New_C");
static_assert(offsetof(UWBP_TwoButtonsDialog_New_C, UberGraphFrame) == 0x000350, "Member 'UWBP_TwoButtonsDialog_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TwoButtonsDialog_New_C, DialogFrame) == 0x000358, "Member 'UWBP_TwoButtonsDialog_New_C::DialogFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TwoButtonsDialog_New_C, DialogMessageText) == 0x000360, "Member 'UWBP_TwoButtonsDialog_New_C::DialogMessageText' has a wrong offset!");

}

