#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ColorPaletteEditorDetailsPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ColorPaletteEditorDetailsPanel.WBP_ColorPaletteEditorDetailsPanel_C
// 0x00A0 (0x0370 - 0x02D0)
class UWBP_ColorPaletteEditorDetailsPanel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWS_MultiLineTextBox_LessEmphasis_C*    DescriptionBox;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DialogFrame_SmallHeaderFooter_C*   DialogFrame;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_C*                          FlowButton;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                GroupColorsUsedText;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                GroupEditText;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GroupEditVerticalBox;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Emphasis_C*               GroupInfoText;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBox_LessEmphasis_C*             GroupNameTextBox;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainContainer;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                TotalColorsText;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBlock_Default_C*                TotalGroupsText;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFlow;                                            // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnReturn;                                          // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(int32 GroupIndex, class FText Name)> OnChangeGroupName;                                 // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         GroupIndex;                                        // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ColorPaletteEditorDetailsPanel_C*  TARGET;                                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__FlowButton_K2Node_ComponentBoundEvent_2_ButtonDelegate__DelegateSignature();
	void BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__GroupNameTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void ClearGroupInfo();
	void ExecuteUbergraph_WBP_ColorPaletteEditorDetailsPanel(int32 EntryPoint);
	class FText GetDescription();
	void SetDescription(const class FText& Text);
	void SetGroupColorCount(int32 Count);
	void SetGroupInfo(const struct FBRColorPaletteGroupInfo& Group, int32 Index_0);
	void SetPaletteGroupCount(int32 Count);
	void SetPaletteTotalColorCount(int32 Count);
	void UpdateGroupInfo(const struct FBRColorPaletteGroupInfo& Group, int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ColorPaletteEditorDetailsPanel_C">();
	}
	static class UWBP_ColorPaletteEditorDetailsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ColorPaletteEditorDetailsPanel_C>();
	}
};
static_assert(alignof(UWBP_ColorPaletteEditorDetailsPanel_C) == 0x000008, "Wrong alignment on UWBP_ColorPaletteEditorDetailsPanel_C");
static_assert(sizeof(UWBP_ColorPaletteEditorDetailsPanel_C) == 0x000370, "Wrong size on UWBP_ColorPaletteEditorDetailsPanel_C");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, DescriptionBox) == 0x0002D8, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::DescriptionBox' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, DialogFrame) == 0x0002E0, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::DialogFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, FlowButton) == 0x0002E8, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::FlowButton' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, GroupColorsUsedText) == 0x0002F0, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::GroupColorsUsedText' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, GroupEditText) == 0x0002F8, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::GroupEditText' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, GroupEditVerticalBox) == 0x000300, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::GroupEditVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, GroupInfoText) == 0x000308, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::GroupInfoText' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, GroupNameTextBox) == 0x000310, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::GroupNameTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, MainContainer) == 0x000318, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::MainContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, TotalColorsText) == 0x000320, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::TotalColorsText' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, TotalGroupsText) == 0x000328, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::TotalGroupsText' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, OnFlow) == 0x000330, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::OnFlow' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, OnReturn) == 0x000340, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::OnReturn' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, OnChangeGroupName) == 0x000350, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::OnChangeGroupName' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, GroupIndex) == 0x000360, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::GroupIndex' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEditorDetailsPanel_C, TARGET) == 0x000368, "Member 'UWBP_ColorPaletteEditorDetailsPanel_C::TARGET' has a wrong offset!");

}

