#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GenericCatalogTabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GenericCatalogTabButton.WBP_GenericCatalogTabButton_C
// 0x0018 (0x0318 - 0x0300)
class UWBP_GenericCatalogTabButton_C final : public UBRGenericCatalogTabButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWS_Image_PanelHeaderStandaloneBackground_C* Border;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_Border_Element_Background_C*        BorderSelected;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GenericCatalogTabButton(int32 EntryPoint);
	void SetShowSelected(bool Selected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GenericCatalogTabButton_C">();
	}
	static class UWBP_GenericCatalogTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GenericCatalogTabButton_C>();
	}
};
static_assert(alignof(UWBP_GenericCatalogTabButton_C) == 0x000008, "Wrong alignment on UWBP_GenericCatalogTabButton_C");
static_assert(sizeof(UWBP_GenericCatalogTabButton_C) == 0x000318, "Wrong size on UWBP_GenericCatalogTabButton_C");
static_assert(offsetof(UWBP_GenericCatalogTabButton_C, UberGraphFrame) == 0x000300, "Member 'UWBP_GenericCatalogTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GenericCatalogTabButton_C, Border) == 0x000308, "Member 'UWBP_GenericCatalogTabButton_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_GenericCatalogTabButton_C, BorderSelected) == 0x000310, "Member 'UWBP_GenericCatalogTabButton_C::BorderSelected' has a wrong offset!");

}

