#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EditGameDialog

#include "Basic.hpp"

#include "Brickadia_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_EditGameDialog.WBP_EditGameDialog_C.BndEvt__TabSet_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_EditGameDialog_C_BndEvt__TabSet_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EditGameDialog_C_BndEvt__TabSet_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature) == 0x000004, "Wrong alignment on WBP_EditGameDialog_C_BndEvt__TabSet_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature");
static_assert(sizeof(WBP_EditGameDialog_C_BndEvt__TabSet_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature) == 0x000004, "Wrong size on WBP_EditGameDialog_C_BndEvt__TabSet_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature");
static_assert(offsetof(WBP_EditGameDialog_C_BndEvt__TabSet_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature, Index_0) == 0x000000, "Member 'WBP_EditGameDialog_C_BndEvt__TabSet_K2Node_ComponentBoundEvent_2_OnTabSelected__DelegateSignature::Index_0' has a wrong offset!");

// Function WBP_EditGameDialog.WBP_EditGameDialog_C.ExecuteUbergraph_WBP_EditGameDialog
// 0x0100 (0x0100 - 0x0000)
struct WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBRGameInstance*                        CallFunc_GetBRGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRAuthSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_FakeLoadingScreen_C*               CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EBRAuthState                                  CallFunc_GetAuthState_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBRBundleManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBRBundleManager*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Apply_bDidAnnouncement;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncActionOneButtonDialog*            CallFunc_QuickCreateOneButtonDialog_ReturnValue;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABRGameStateBase*                       CallFunc_GetBRGameState_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABRHUD*                                 CallFunc_Get_ReturnValue;                          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_EnvironmentDialog_C*               CallFunc_OpenDialogByClass_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABRPlayerController*                    CallFunc_GetBRPlayerController_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABRPlayerState*                         CallFunc_GetBRPlayerState_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPermission_ReturnValue;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPermission_ReturnValue_1;              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPermission_ReturnValue_2;              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00A8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00B8(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedIndex_ReturnValue_1;           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0010)(ConstParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBRMapInfo*                             CallFunc_GetMapInfoForCurrentMap_ReturnValue;      // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestTravelToWorld_ReturnValue;         // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog) == 0x000008, "Wrong alignment on WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog");
static_assert(sizeof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog) == 0x000100, "Wrong size on WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, EntryPoint) == 0x000000, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetBRGameInstance_ReturnValue) == 0x000008, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetBRGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetAuthState_ReturnValue) == 0x000020, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetAuthState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000028, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000030, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, Temp_bool_IsClosed_Variable) == 0x000038, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, K2Node_ComponentBoundEvent_Index) == 0x00003C, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, Temp_bool_Has_Been_Initd_Variable) == 0x000040, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_Apply_bDidAnnouncement) == 0x000041, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_Apply_bDidAnnouncement' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_QuickCreateOneButtonDialog_ReturnValue) == 0x000048, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_QuickCreateOneButtonDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetSelectedIndex_ReturnValue) == 0x000054, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000058, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetBRGameState_ReturnValue) == 0x000060, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetBRGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_Get_ReturnValue) == 0x000070, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_OpenDialogByClass_ReturnValue) == 0x000078, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_OpenDialogByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetBRPlayerController_ReturnValue) == 0x000080, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetBRPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetBRPlayerState_ReturnValue) == 0x000088, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetBRPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_HasPermission_ReturnValue) == 0x000090, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_HasPermission_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_HasPermission_ReturnValue_1) == 0x000091, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_HasPermission_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_HasPermission_ReturnValue_2) == 0x000092, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_HasPermission_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, Temp_bool_Variable) == 0x000093, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_MakeLiteralText_ReturnValue) == 0x0000A8, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000B8, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, Temp_bool_Variable_1) == 0x0000C8, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetSelectedIndex_ReturnValue_1) == 0x0000CC, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetSelectedIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, K2Node_Select_Default) == 0x0000D8, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_BooleanOR_ReturnValue) == 0x0000E8, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_BooleanOR_ReturnValue_1) == 0x0000E9, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_GetMapInfoForCurrentMap_ReturnValue) == 0x0000F0, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_GetMapInfoForCurrentMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, Temp_byte_Variable) == 0x0000F8, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, CallFunc_RequestTravelToWorld_ReturnValue) == 0x0000F9, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::CallFunc_RequestTravelToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, Temp_byte_Variable_1) == 0x0000FA, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog, K2Node_Select_Default_1) == 0x0000FB, "Member 'WBP_EditGameDialog_C_ExecuteUbergraph_WBP_EditGameDialog::K2Node_Select_Default_1' has a wrong offset!");

}

