#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BlogListing

#include "Basic.hpp"

#include "Brickadia_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_BlogListing.WBP_BlogListing_C.ExecuteUbergraph_WBP_BlogListing
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBRListBlogPostsAsyncAction*            CallFunc_AsyncListBlogPosts_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Sequence)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_None;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BlogListing_Entry_Large_C*         CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJsonResponse_BlogListing              Temp_struct_Variable;                              // 0x0050(0x0010)()
	struct FJsonResponse_BlogListing_Post         CallFunc_Array_Get_Item;                           // 0x0060(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Sequence;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FJsonResponse_BlogListing              K2Node_CustomEvent_Result;                         // 0x00B0(0x0010)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Sequence, const struct FJsonResponse_BlogListing& Result)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Sequence_1;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing) == 0x000008, "Wrong alignment on WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing");
static_assert(sizeof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing) == 0x0000E0, "Wrong size on WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, EntryPoint) == 0x000000, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, Temp_int_Variable) == 0x000004, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_AsyncListBlogPosts_ReturnValue) == 0x000008, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_AsyncListBlogPosts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, K2Node_MakeStruct_None) == 0x000024, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::K2Node_MakeStruct_None' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, Temp_int_Variable_1) == 0x00004C, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, Temp_struct_Variable) == 0x000050, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A5, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, K2Node_CustomEvent_Sequence) == 0x0000AC, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::K2Node_CustomEvent_Sequence' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, K2Node_CustomEvent_Result) == 0x0000B0, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000C0, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, K2Node_CustomEvent_Sequence_1) == 0x0000D4, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::K2Node_CustomEvent_Sequence_1' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000D8, "Member 'WBP_BlogListing_C_ExecuteUbergraph_WBP_BlogListing::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_BlogListing.WBP_BlogListing_C.OnError_DC1D399941CFDB42C9D34589AF4229CA
// 0x0004 (0x0004 - 0x0000)
struct WBP_BlogListing_C_OnError_DC1D399941CFDB42C9D34589AF4229CA final
{
public:
	int32                                         Sequence;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BlogListing_C_OnError_DC1D399941CFDB42C9D34589AF4229CA) == 0x000004, "Wrong alignment on WBP_BlogListing_C_OnError_DC1D399941CFDB42C9D34589AF4229CA");
static_assert(sizeof(WBP_BlogListing_C_OnError_DC1D399941CFDB42C9D34589AF4229CA) == 0x000004, "Wrong size on WBP_BlogListing_C_OnError_DC1D399941CFDB42C9D34589AF4229CA");
static_assert(offsetof(WBP_BlogListing_C_OnError_DC1D399941CFDB42C9D34589AF4229CA, Sequence) == 0x000000, "Member 'WBP_BlogListing_C_OnError_DC1D399941CFDB42C9D34589AF4229CA::Sequence' has a wrong offset!");

// Function WBP_BlogListing.WBP_BlogListing_C.OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA
// 0x0018 (0x0018 - 0x0000)
struct WBP_BlogListing_C_OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA final
{
public:
	int32                                         Sequence;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJsonResponse_BlogListing              Result;                                            // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_BlogListing_C_OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA) == 0x000008, "Wrong alignment on WBP_BlogListing_C_OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA");
static_assert(sizeof(WBP_BlogListing_C_OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA) == 0x000018, "Wrong size on WBP_BlogListing_C_OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA");
static_assert(offsetof(WBP_BlogListing_C_OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA, Sequence) == 0x000000, "Member 'WBP_BlogListing_C_OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA::Sequence' has a wrong offset!");
static_assert(offsetof(WBP_BlogListing_C_OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA, Result) == 0x000008, "Member 'WBP_BlogListing_C_OnWorkComplete_DC1D399941CFDB42C9D34589AF4229CA::Result' has a wrong offset!");

}

