#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoginDialog

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoginDialog.WBP_LoginDialog_C.BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_LoginDialog.WBP_LoginDialog_C.BndEvt__PasswordBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_LoginDialog_C_BndEvt__PasswordBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_LoginDialog.WBP_LoginDialog_C.BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_LoginDialog.WBP_LoginDialog_C.BndEvt__UserBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_LoginDialog_C_BndEvt__UserBox_K2Node_ComponentBoundEvent_6_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_LoginDialog.WBP_LoginDialog_C.ExecuteUbergraph_WBP_LoginDialog
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x0008(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_1;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FakeLoadingScreenExit_C*           CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x0028(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0040(0x0010)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0050(0x0010)(ConstParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0060(0x0010)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0070(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog) == 0x000008, "Wrong alignment on WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog");
static_assert(sizeof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog) == 0x0000B0, "Wrong size on WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, EntryPoint) == 0x000000, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, K2Node_ComponentBoundEvent_Text_3) == 0x000008, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::K2Node_ComponentBoundEvent_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, K2Node_ComponentBoundEvent_CommitMethod_1) == 0x000018, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::K2Node_ComponentBoundEvent_CommitMethod_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, K2Node_ComponentBoundEvent_Text_2) == 0x000028, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::K2Node_ComponentBoundEvent_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, K2Node_ComponentBoundEvent_CommitMethod) == 0x000038, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000039, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, K2Node_ComponentBoundEvent_Text_1) == 0x000040, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, K2Node_ComponentBoundEvent_Text) == 0x000050, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_GetText_ReturnValue) == 0x000060, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_GetText_ReturnValue_1) == 0x000070, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000090, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_Len_ReturnValue) == 0x0000A0, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_Len_ReturnValue_1) == 0x0000A4, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000A8, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x0000A9, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog, CallFunc_BooleanAND_ReturnValue) == 0x0000AA, "Member 'WBP_LoginDialog_C_ExecuteUbergraph_WBP_LoginDialog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_LoginDialog.WBP_LoginDialog_C.SubmitIfValid
// 0x0058 (0x0058 - 0x0000)
struct WBP_LoginDialog_C_SubmitIfValid final
{
public:
	class UBRAuthSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0018(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginDialog_C_SubmitIfValid) == 0x000008, "Wrong alignment on WBP_LoginDialog_C_SubmitIfValid");
static_assert(sizeof(WBP_LoginDialog_C_SubmitIfValid) == 0x000058, "Wrong size on WBP_LoginDialog_C_SubmitIfValid");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_GetText_ReturnValue_1) == 0x000018, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000038, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_Len_ReturnValue) == 0x000048, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_Conv_IntToBool_ReturnValue) == 0x00004C, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_Len_ReturnValue_1) == 0x000050, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000054, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginDialog_C_SubmitIfValid, CallFunc_BooleanAND_ReturnValue) == 0x000055, "Member 'WBP_LoginDialog_C_SubmitIfValid::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

