#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ManualJoinDialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ManualJoinDialog.WBP_ManualJoinDialog_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_ManualJoinDialog_C final : public UBRDialogBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWS_TextBox_LessEmphasis_C*             AddressBox;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_C*                          CancelButton;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DialogFrame_SmallHeaderFooter_C*   DialogFrame;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_C*                          JoinButton;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_TextBox_LessEmphasis_C*             PasswordBox;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__AddressBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__AddressBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_136_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__JoinButton_K2Node_ComponentBoundEvent_168_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PasswordBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void ExecuteUbergraph_WBP_ManualJoinDialog(int32 EntryPoint);
	void OnButtonClicked_4DC4790747B18680EF4C5C82ED0F894C();
	void OnOpenDialog();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ManualJoinDialog_C">();
	}
	static class UWBP_ManualJoinDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ManualJoinDialog_C>();
	}
};
static_assert(alignof(UWBP_ManualJoinDialog_C) == 0x000008, "Wrong alignment on UWBP_ManualJoinDialog_C");
static_assert(sizeof(UWBP_ManualJoinDialog_C) == 0x000310, "Wrong size on UWBP_ManualJoinDialog_C");
static_assert(offsetof(UWBP_ManualJoinDialog_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ManualJoinDialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ManualJoinDialog_C, AddressBox) == 0x0002E8, "Member 'UWBP_ManualJoinDialog_C::AddressBox' has a wrong offset!");
static_assert(offsetof(UWBP_ManualJoinDialog_C, CancelButton) == 0x0002F0, "Member 'UWBP_ManualJoinDialog_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UWBP_ManualJoinDialog_C, DialogFrame) == 0x0002F8, "Member 'UWBP_ManualJoinDialog_C::DialogFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ManualJoinDialog_C, JoinButton) == 0x000300, "Member 'UWBP_ManualJoinDialog_C::JoinButton' has a wrong offset!");
static_assert(offsetof(UWBP_ManualJoinDialog_C, PasswordBox) == 0x000308, "Member 'UWBP_ManualJoinDialog_C::PasswordBox' has a wrong offset!");

}

