#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Property_Vector3f

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Brickadia_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Property_Vector3f.WBP_Property_Vector3f_C
// 0x0040 (0x03C0 - 0x0380)
class UWBP_Property_Vector3f_C final : public UInspectorPropertyWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 XImage;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_Spinbox_Vector_C*                   XInputBox;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YImage;                                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_Spinbox_Vector_C*                   YInputBox;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ZImage;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWS_Spinbox_Vector_C*                   ZInputBox;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bAllowExternalUpdate;                              // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__XInputBox_K2Node_ComponentBoundEvent_0_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void BndEvt__XInputBox_K2Node_ComponentBoundEvent_12_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__XInputBox_K2Node_ComponentBoundEvent_6_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__XInputBox_K2Node_ComponentBoundEvent_9_OnSpinBoxBeginSliderMovement__DelegateSignature();
	void BndEvt__YInputBox_K2Node_ComponentBoundEvent_10_OnSpinBoxBeginSliderMovement__DelegateSignature();
	void BndEvt__YInputBox_K2Node_ComponentBoundEvent_13_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__YInputBox_K2Node_ComponentBoundEvent_2_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void BndEvt__YInputBox_K2Node_ComponentBoundEvent_7_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__ZInputBox_K2Node_ComponentBoundEvent_11_OnSpinBoxBeginSliderMovement__DelegateSignature();
	void BndEvt__ZInputBox_K2Node_ComponentBoundEvent_14_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__ZInputBox_K2Node_ComponentBoundEvent_3_OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, ETextCommit CommitMethod);
	void BndEvt__ZInputBox_K2Node_ComponentBoundEvent_8_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void ExecuteUbergraph_WBP_Property_Vector3f(int32 EntryPoint);
	void GetSliderValues(struct FVector3f* Return_Value);
	void OnAvailabilityChange(bool Enabled);
	void OnInit(class UInspectorPropertyDescriptor* NewDescriptor, const struct FInspectorViewTarget& NewViewTarget);
	void OnValueChangedExternally(const struct FInspectorPropertyValue& ValueIn);
	void SetEnabled(bool Yes);
	void SetSliderValues(const struct FVector3f& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Property_Vector3f_C">();
	}
	static class UWBP_Property_Vector3f_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Property_Vector3f_C>();
	}
};
static_assert(alignof(UWBP_Property_Vector3f_C) == 0x000008, "Wrong alignment on UWBP_Property_Vector3f_C");
static_assert(sizeof(UWBP_Property_Vector3f_C) == 0x0003C0, "Wrong size on UWBP_Property_Vector3f_C");
static_assert(offsetof(UWBP_Property_Vector3f_C, UberGraphFrame) == 0x000380, "Member 'UWBP_Property_Vector3f_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Vector3f_C, XImage) == 0x000388, "Member 'UWBP_Property_Vector3f_C::XImage' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Vector3f_C, XInputBox) == 0x000390, "Member 'UWBP_Property_Vector3f_C::XInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Vector3f_C, YImage) == 0x000398, "Member 'UWBP_Property_Vector3f_C::YImage' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Vector3f_C, YInputBox) == 0x0003A0, "Member 'UWBP_Property_Vector3f_C::YInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Vector3f_C, ZImage) == 0x0003A8, "Member 'UWBP_Property_Vector3f_C::ZImage' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Vector3f_C, ZInputBox) == 0x0003B0, "Member 'UWBP_Property_Vector3f_C::ZInputBox' has a wrong offset!");
static_assert(offsetof(UWBP_Property_Vector3f_C, bAllowExternalUpdate) == 0x0003B8, "Member 'UWBP_Property_Vector3f_C::bAllowExternalUpdate' has a wrong offset!");

}

