#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsIndirectDialog

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_OptionsIndirectDialog.WBP_OptionsIndirectDialog_C.ExecuteUbergraph_WBP_OptionsIndirectDialog
// 0x0088 (0x0088 - 0x0000)
struct WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABRHUD*                                 CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_OptionsDialog_Audio_C*             CallFunc_OpenDialogByClass_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABRHUD*                                 CallFunc_Get_ReturnValue_1;                        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_OptionsDialog_General_C*           CallFunc_OpenDialogByClass_ReturnValue_1;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABRHUD*                                 CallFunc_Get_ReturnValue_2;                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_OptionsDialog_Graphics_C*          CallFunc_OpenDialogByClass_ReturnValue_2;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABRHUD*                                 CallFunc_Get_ReturnValue_3;                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_OptionsDialog_Controls_C*          CallFunc_OpenDialogByClass_ReturnValue_3;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABRHUD*                                 CallFunc_Get_ReturnValue_4;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBR_Dialog_Base;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBRDialogBase*                          CallFunc_OpenDialogByClass_ReturnValue_4;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog) == 0x000008, "Wrong alignment on WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog");
static_assert(sizeof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog) == 0x000088, "Wrong size on WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, EntryPoint) == 0x000000, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_OpenDialogByClass_ReturnValue) == 0x000010, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_OpenDialogByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_Get_ReturnValue_1) == 0x000018, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_OpenDialogByClass_ReturnValue_1) == 0x000020, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_OpenDialogByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_Get_ReturnValue_2) == 0x000028, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_OpenDialogByClass_ReturnValue_2) == 0x000030, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_OpenDialogByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_Get_ReturnValue_3) == 0x000038, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_OpenDialogByClass_ReturnValue_3) == 0x000040, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_OpenDialogByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_Get_ReturnValue_4) == 0x000048, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000050, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000060, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000068, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, K2Node_ClassDynamicCast_AsBR_Dialog_Base) == 0x000070, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::K2Node_ClassDynamicCast_AsBR_Dialog_Base' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, K2Node_ClassDynamicCast_bSuccess) == 0x000078, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog, CallFunc_OpenDialogByClass_ReturnValue_4) == 0x000080, "Member 'WBP_OptionsIndirectDialog_C_ExecuteUbergraph_WBP_OptionsIndirectDialog::CallFunc_OpenDialogByClass_ReturnValue_4' has a wrong offset!");

}

