#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ColorPaletteEntryVisual

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ColorPaletteEntryVisual.WBP_ColorPaletteEntryVisual_C
// 0x0028 (0x02F8 - 0x02D0)
class UWBP_ColorPaletteEntryVisual_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ColorBackground;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColor                                 Color;                                             // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FLinearColor& Color, int32 Index)> OnColorChange;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ColorPaletteEntryVisual(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ColorPaletteEntryVisual_C">();
	}
	static class UWBP_ColorPaletteEntryVisual_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ColorPaletteEntryVisual_C>();
	}
};
static_assert(alignof(UWBP_ColorPaletteEntryVisual_C) == 0x000008, "Wrong alignment on UWBP_ColorPaletteEntryVisual_C");
static_assert(sizeof(UWBP_ColorPaletteEntryVisual_C) == 0x0002F8, "Wrong size on UWBP_ColorPaletteEntryVisual_C");
static_assert(offsetof(UWBP_ColorPaletteEntryVisual_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_ColorPaletteEntryVisual_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEntryVisual_C, ColorBackground) == 0x0002D8, "Member 'UWBP_ColorPaletteEntryVisual_C::ColorBackground' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEntryVisual_C, Color) == 0x0002E0, "Member 'UWBP_ColorPaletteEntryVisual_C::Color' has a wrong offset!");
static_assert(offsetof(UWBP_ColorPaletteEntryVisual_C, OnColorChange) == 0x0002E8, "Member 'UWBP_ColorPaletteEntryVisual_C::OnColorChange' has a wrong offset!");

}

