#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UniqueRideWeapon_GeroBeam

#include "Basic.hpp"

#include "Pal_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UniqueRideWeapon_GeroBeam.BP_UniqueRideWeapon_GeroBeam_C
// 0x00E0 (0x0678 - 0x0598)
class ABP_UniqueRideWeapon_GeroBeam_C final : public APalUniqueRideWeaponBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_PrismTower_AT;                                  // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_PrismTower_B;                                   // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShootingProgress;                                // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ConstBeamMaxRange;                                 // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        BeamLength;                                        // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UPalHitFilter*                          HitFilter;                                         // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class ABP_GeroBeamAttackCollision_C*          AttackCollisionActor;                              // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBeamEmitting;                                    // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	EDrawDebugTrace                               Debug;                                             // 0x05E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_5E2[0x6];                                      // 0x05E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Niagara_Charge;                                    // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Niagara_DamageHit;                                 // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Niagara_GroundHit;                                 // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BeamDirection;                                     // 0x0600(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        ConstBeamTime;                                     // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Component_GroundHit;                            // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, class UNiagaraComponent*> HitActorMap;                                       // 0x0628(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)

public:
	void ShootingExit();
	void ShootingEnter();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnPullTrigger();
	void OnHit_Damage(class UPrimitiveComponent* MyHitComponent, class AActor* OtherHitActor, class UPrimitiveComponent* OtherHitComponent, const TArray<int32>& FoliageIndex, const struct FVector& HitLocation, int32 HitCount);
	void OnEndHit(class UPrimitiveComponent* MyHitComponent, class AActor* OtherHitActor, class UPrimitiveComponent* OtherHitComponent);
	void OnCancellShooting();
	void Hit(class UPrimitiveComponent* MyHitComponent, class AActor* OtherHitActor, class UPrimitiveComponent* OtherHitComponent, const TArray<int32>& FoliageIndex, const struct FVector& HitLocation, int32 HitCount);
	struct FRotator GetMuzzleRotation();
	struct FVector GetMuzzleLocation();
	void ExecuteUbergraph_BP_UniqueRideWeapon_GeroBeam(int32 EntryPoint);
	void DeleteAllEffect();
	void CharacterHitEffectPos(class AActor* TargetActor, struct FVector* EffectPos);
	void BeamControl();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UniqueRideWeapon_GeroBeam_C">();
	}
	static class ABP_UniqueRideWeapon_GeroBeam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UniqueRideWeapon_GeroBeam_C>();
	}
};
static_assert(alignof(ABP_UniqueRideWeapon_GeroBeam_C) == 0x000008, "Wrong alignment on ABP_UniqueRideWeapon_GeroBeam_C");
static_assert(sizeof(ABP_UniqueRideWeapon_GeroBeam_C) == 0x000678, "Wrong size on ABP_UniqueRideWeapon_GeroBeam_C");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, UberGraphFrame) == 0x000598, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, SM_PrismTower_AT) == 0x0005A0, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::SM_PrismTower_AT' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, SM_PrismTower_B) == 0x0005A8, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::SM_PrismTower_B' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, DefaultSceneRoot) == 0x0005B0, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, IsShootingProgress) == 0x0005B8, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::IsShootingProgress' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, ConstBeamMaxRange) == 0x0005C0, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::ConstBeamMaxRange' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, BeamLength) == 0x0005C8, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::BeamLength' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, HitFilter) == 0x0005D0, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::HitFilter' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, AttackCollisionActor) == 0x0005D8, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::AttackCollisionActor' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, IsBeamEmitting) == 0x0005E0, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::IsBeamEmitting' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, Debug) == 0x0005E1, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::Debug' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, Niagara_Charge) == 0x0005E8, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::Niagara_Charge' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, Niagara_DamageHit) == 0x0005F0, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::Niagara_DamageHit' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, Niagara_GroundHit) == 0x0005F8, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::Niagara_GroundHit' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, BeamDirection) == 0x000600, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::BeamDirection' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, ConstBeamTime) == 0x000618, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::ConstBeamTime' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, NS_Component_GroundHit) == 0x000620, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::NS_Component_GroundHit' has a wrong offset!");
static_assert(offsetof(ABP_UniqueRideWeapon_GeroBeam_C, HitActorMap) == 0x000628, "Member 'ABP_UniqueRideWeapon_GeroBeam_C::HitActorMap' has a wrong offset!");

}

