#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM01_DestinationEarth

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function MM01_DestinationEarth.MM01_DestinationEarth_C.ExecuteUbergraph_MM01_DestinationEarth
// 0x32A0 (0x32A0 - 0x0000)
struct MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0008(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0140(0x0048)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0188(0x0130)(ConstParm)
	TArray<class ABFGNPCCharacterAnimal*>         CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors; // 0x02B8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x02D0(0x0048)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x0318(0x0130)(ConstParm)
	TArray<class ABFGNPCCharacterAnimal*>         CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors1; // 0x0448(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x0460(0x0130)(ConstParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue2;        // 0x0590(0x0048)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x05D8(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x0708(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x0838(0x0130)(ConstParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue3;        // 0x0968(0x0048)()
	TArray<class ABFGMissionBoundaries*>          CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors2; // 0x09B0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue4;        // 0x09C0(0x0048)()
	class ABFGMissionBoundaries*                  CallFunc_Array_Get_Item;                           // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABFGMissionBoundaries*>          CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors3; // 0x0A10(0x0010)(ZeroConstructor, ReferenceParm)
	class ABFGMissionBoundaries*                  CallFunc_Array_Get_Item1;                          // 0x0A20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0A28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0A2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2D[0x3];                                      // 0x0A2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0A30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue1;             // 0x0A34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A35[0x3];                                      // 0x0A35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue5;        // 0x0A38(0x0048)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x0A80(0x0130)(ConstParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0BB0(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush1;                     // 0x0C38(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush2;                     // 0x0CC0(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush3;                     // 0x0D48(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush4;                     // 0x0DD0(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush5;                     // 0x0E58(0x0088)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement50;             // 0x0EE0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement49;             // 0x0EE8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement48;             // 0x0EF0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement47;             // 0x0EF8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement46;             // 0x0F00(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement45;             // 0x0F08(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement44;             // 0x0F10(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement43;             // 0x0F18(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement42;             // 0x0F20(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement41;             // 0x0F28(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement40;             // 0x0F30(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement39;             // 0x0F38(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x0F40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F41[0x3];                                      // 0x0F41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x0F44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x0F48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F49[0x3];                                      // 0x0F49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x0F4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement38;             // 0x0F50(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement37;             // 0x0F58(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement36;             // 0x0F60(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement35;             // 0x0F68(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__Element;                // 0x0F70(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__Wave;                   // 0x0F78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F7C[0x4];                                      // 0x0F7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement34;             // 0x0F80(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0F88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F89[0x7];                                      // 0x0F89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor1;                  // 0x0F90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage1;                        // 0x0F98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9C[0x4];                                      // 0x0F9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_CustomEvent_DamageType1;                    // 0x0FA0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_InstigatedBy1;                  // 0x0FA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser1;                  // 0x0FB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0FB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0FC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC4[0x4];                                      // 0x0FC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_CustomEvent_DamageType;                     // 0x0FC8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0FD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0FD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement33;             // 0x0FE0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate;              // 0x0FE8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPrimaryPlayerController_ReturnValue;   // 0x0FF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue;        // 0x1000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1001[0x7];                                     // 0x1001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x1008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue1;       // 0x1010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x1011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue2;       // 0x1012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue3;       // 0x1013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1014[0x4];                                     // 0x1014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement32;             // 0x1018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement31;             // 0x1020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement30;             // 0x1028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement29;             // 0x1030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x1038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103C[0x4];                                     // 0x103C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement28;             // 0x1040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x1048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1049[0x3];                                     // 0x1049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x104C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement27;             // 0x1050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex5;       // 0x1058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue5;                // 0x105C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal5;                // 0x1060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1064[0x4];                                     // 0x1064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext5;          // 0x1068(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement26;             // 0x10B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x10C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C1[0x7];                                     // 0x10C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement25;             // 0x10C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement24;             // 0x10D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex4;       // 0x10D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue4;                // 0x10DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal4;                // 0x10E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E4[0x4];                                     // 0x10E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext4;          // 0x10E8(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement23;             // 0x1138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x1140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1141[0x7];                                     // 0x1141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement22;             // 0x1148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement21;             // 0x1150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement20;             // 0x1158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement19;             // 0x1160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex3;       // 0x1168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue3;                // 0x116C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal3;                // 0x1170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1174[0x4];                                     // 0x1174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext3;          // 0x1178(0x0050)(ConstParm)
	class APlayerController*                      CallFunc_GetPrimaryPlayerController_ReturnValue1;  // 0x11C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x11D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D1[0x7];                                     // 0x11D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue1;                  // 0x11D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement18;             // 0x11E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_JetpackPilot*        CallFunc_GetComponentByClass_ReturnValue;          // 0x11E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTags_ReturnValue;       // 0x11F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x11F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11F2[0x6];                                     // 0x11F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement17;             // 0x11F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable8;                             // 0x1200(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement16;             // 0x1330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement15;             // 0x1338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement14;             // 0x1340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex2;       // 0x1348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue2;                // 0x134C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal2;                // 0x1350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1354[0x4];                                     // 0x1354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext2;          // 0x1358(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement13;             // 0x13A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x13B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B1[0x7];                                     // 0x13B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement12;             // 0x13B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement11;             // 0x13C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid;                    // 0x13C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C9[0x7];                                     // 0x13C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem;              // 0x13D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable9;                             // 0x13D8(0x0130)(ConstParm)
	bool                                          CallFunc_Get_MusicSystem_valid1;                   // 0x1508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1509[0x7];                                     // 0x1509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem1;             // 0x1510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable10;                            // 0x1518(0x0130)(ConstParm)
	bool                                          CallFunc_Get_MusicSystem_valid2;                   // 0x1648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1649[0x7];                                     // 0x1649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem2;             // 0x1650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable11;                            // 0x1658(0x0130)(ConstParm)
	bool                                          CallFunc_Get_MusicSystem_valid3;                   // 0x1788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1789[0x7];                                     // 0x1789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem3;             // 0x1790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue6;        // 0x1798(0x0048)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x17E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E4[0x4];                                     // 0x17E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABFGNPCCharacterAnimal*                 CallFunc_Array_Get_Item2;                          // 0x17E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_JetpackPilot*        K2Node_CustomEvent__pJetpackComponent;             // 0x17F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBFGActorComponent_JetpackPilot* _pJetpackComponent)> K2Node_CreateDelegate_OutputDelegate1;             // 0x17F8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPrimaryPlayerController_ReturnValue2;  // 0x1808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable12;                            // 0x1810(0x0130)(ConstParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue2;                  // 0x1940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_JetpackPilot*        CallFunc_GetComponentByClass_ReturnValue1;         // 0x1948(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBFGActorComponent_JetpackPilot* _pJetpackComponent)> K2Node_CreateDelegate_OutputDelegate2;             // 0x1950(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x1960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1961[0x7];                                     // 0x1961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent__pSourceActor;                  // 0x1968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* _pSourceActor)>  K2Node_CreateDelegate_OutputDelegate3;             // 0x1970(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x1980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1981[0x3];                                     // 0x1981(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* _pSourceActor)>  K2Node_CreateDelegate_OutputDelegate4;             // 0x1984(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1994[0x4];                                     // 0x1994(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue7;        // 0x1998(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue8;        // 0x19E0(0x0048)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable13;                            // 0x1A28(0x0130)(ConstParm)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue4;       // 0x1B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue5;       // 0x1B59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue6;       // 0x1B5A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue7;       // 0x1B5B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue8;       // 0x1B5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue9;       // 0x1B5D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x1B5E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue10;      // 0x1B5F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue11;      // 0x1B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue12;      // 0x1B61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x1B62(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B63[0x5];                                     // 0x1B63(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x1B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_GetWorldFromContextObjectSafe_ReturnValue; // 0x1B70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGGameState*                          K2Node_DynamicCast_AsBFGGame_State;                // 0x1B78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x1B80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B81[0x7];                                     // 0x1B81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable14;                            // 0x1B88(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement10;             // 0x1CB8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement9;              // 0x1CC0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement8;              // 0x1CC8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable15;                            // 0x1CD0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x1E00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E01[0x7];                                     // 0x1E01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable16;                            // 0x1E08(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x1F38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F39[0x7];                                     // 0x1F39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement7;              // 0x1F40(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x1F48(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x1F50(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex1;       // 0x1F58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue1;                // 0x1F5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal1;                // 0x1F60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F64[0x4];                                     // 0x1F64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext1;          // 0x1F68(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x1FB8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger5_CmpSuccess;                  // 0x1FC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FC1[0x7];                                     // 0x1FC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x1FC8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x1FD0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x1FD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x1FE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE4[0x4];                                     // 0x1FE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGGameInstance*                       K2Node_DynamicCast_AsBFGGame_Instance;             // 0x1FE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x1FF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF1[0x7];                                     // 0x1FF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABFGNPCCharacterAnimal*                 CallFunc_Array_Get_Item3;                          // 0x1FF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGGameSession*                        CallFunc_GetGameSession_ReturnValue;               // 0x2000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x2008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable17;                            // 0x2010(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable18;                            // 0x2140(0x0130)(ConstParm)
	bool                                          CallFunc_PlayerState_UnlockTags_ReturnValue1;      // 0x2270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue13;      // 0x2271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2272[0x2];                                     // 0x2272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x2274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable19;                            // 0x2278(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x23A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x23A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x23AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23AB[0x1];                                     // 0x23AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x23AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGPlayerUFO*                          CallFunc_GetPrimaryPlayerUFO_ReturnValue;          // 0x23B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorStat_Float*                    CallFunc_GetShieldStat_ReturnValue;                // 0x23B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x23C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex;        // 0x23C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue;                 // 0x23CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal;                 // 0x23D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D4[0x4];                                     // 0x23D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext;           // 0x23D8(0x0050)(ConstParm)
	float                                         CallFunc_GetRatio_ReturnValue;                     // 0x2428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x242C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242D[0x3];                                     // 0x242D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable20;                            // 0x2430(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable21;                            // 0x2560(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable22;                            // 0x2690(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable23;                            // 0x27C0(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable24;                            // 0x28F0(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable25;                            // 0x2A20(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable26;                            // 0x2B50(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x2C80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid4;                   // 0x2C81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C82[0x6];                                     // 0x2C82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem4;             // 0x2C88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x2C90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C91[0x7];                                     // 0x2C91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable27;                            // 0x2C98(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable28;                            // 0x2DC8(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable29;                            // 0x2EF8(0x0130)(ConstParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x3028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x3029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x302A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302B[0x5];                                     // 0x302B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable30;                            // 0x3030(0x0130)(ConstParm)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x3160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult5;                // 0x3161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x3162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3163[0x5];                                     // 0x3163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable31;                            // 0x3168(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult6;                // 0x3298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x3299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth) == 0x000008, "Wrong alignment on MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth");
static_assert(sizeof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth) == 0x0032A0, "Wrong size on MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, EntryPoint) == 0x000000, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, Temp_struct_Variable) == 0x000008, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_PlayVoiceover__outResult) == 0x000138, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, K2Node_SwitchEnum_CmpSuccess) == 0x000139, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000140, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, Temp_struct_Variable1) == 0x000188, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors) == 0x0002B8, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_Array_Length_ReturnValue) == 0x0002C8, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_MakeGameplayTagQuery_ReturnValue1) == 0x0002D0, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_MakeGameplayTagQuery_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, Temp_struct_Variable2) == 0x000318, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors1) == 0x000448, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors1' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_Array_Length_ReturnValue1) == 0x000458, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, Temp_struct_Variable3) == 0x000460, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_MakeGameplayTagQuery_ReturnValue2) == 0x000590, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_MakeGameplayTagQuery_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, Temp_struct_Variable4) == 0x0005D8, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, Temp_struct_Variable5) == 0x000708, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, Temp_struct_Variable6) == 0x000838, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_MakeGameplayTagQuery_ReturnValue3) == 0x000968, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_MakeGameplayTagQuery_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors2) == 0x0009B0, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors2' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_MakeGameplayTagQuery_ReturnValue4) == 0x0009C0, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_MakeGameplayTagQuery_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_Array_Get_Item) == 0x000A08, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors3) == 0x000A10, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors3' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_Array_Get_Item1) == 0x000A20, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_Array_Length_ReturnValue2) == 0x000A28, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000A2C, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_Array_Length_ReturnValue3) == 0x000A30, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_NotEqual_IntInt_ReturnValue1) == 0x000A34, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_NotEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, CallFunc_MakeGameplayTagQuery_ReturnValue5) == 0x000A38, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::CallFunc_MakeGameplayTagQuery_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, Temp_struct_Variable7) == 0x000A80, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, K2Node_MakeStruct_SlateBrush) == 0x000BB0, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, K2Node_MakeStruct_SlateBrush1) == 0x000C38, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::K2Node_MakeStruct_SlateBrush1' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, K2Node_MakeStruct_SlateBrush2) == 0x000CC0, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::K2Node_MakeStruct_SlateBrush2' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, K2Node_MakeStruct_SlateBrush3) == 0x000D48, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::K2Node_MakeStruct_SlateBrush3' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, K2Node_MakeStruct_SlateBrush4) == 0x000DD0, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::K2Node_MakeStruct_SlateBrush4' has a wrong offset!");
static_assert(offsetof(MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth, K2Node_MakeStruct_SlateBrush5) == 0x000E58, "Member 'MM01_DestinationEarth_C_ExecuteUbergraph_MM01_DestinationEarth::K2Node_MakeStruct_SlateBrush5' has a wrong offset!");
