#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM02_EarthWomenAreDelicious

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MM02_EarthWomenAreDelicious.MM02_EarthWomenAreDelicious_C.ExecuteUbergraph_MM02_EarthWomenAreDelicious
// 0x19E8 (0x19E8 - 0x0000)
struct MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0008(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0140(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush1;                     // 0x01C8(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush2;                     // 0x0250(0x0088)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement41;             // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex8;       // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue5;                // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal5;                // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext5;          // 0x02F0(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement40;             // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement39;             // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_CustomEvent_DamageType;                     // 0x0360(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush3;                     // 0x0378(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush4;                     // 0x0400(0x0088)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement38;             // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement37;             // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement36;             // 0x0498(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement35;             // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement34;             // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex7;       // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue4;                // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal4;                // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext4;          // 0x04C0(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement33;             // 0x0510(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement32;             // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement31;             // 0x0520(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement30;             // 0x0528(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement29;             // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement28;             // 0x0538(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex6;       // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue3;                // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal3;                // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext3;          // 0x0550(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement27;             // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement26;             // 0x05A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement25;             // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement24;             // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement23;             // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement22;             // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement21;             // 0x05D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x05D8(0x0018)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement20;             // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue;        // 0x05FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_MusicSystem_valid;                    // 0x05FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FE[0x2];                                      // 0x05FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem;              // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid1;                   // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem1;             // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement19;             // 0x0618(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement18;             // 0x0620(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid2;                   // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem2;             // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid3;                   // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem3;             // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid4;                   // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem4;             // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid5;                   // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem5;             // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid6;                   // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem6;             // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid7;                   // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem7;             // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid8;                   // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem8;             // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement17;             // 0x06A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement16;             // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement15;             // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement14;             // 0x06C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue1;       // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x06D0(0x0048)()
	TArray<class ABFGNPCCharacterGameplay*>       CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors; // 0x0718(0x0010)(ZeroConstructor, ReferenceParm)
	class ABFGNPCCharacterGameplay*               CallFunc_Array_Get_Item1;                          // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue2;       // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0731(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_732[0x6];                                      // 0x0732(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement13;             // 0x0738(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement12;             // 0x0748(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement11;             // 0x0750(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement10;             // 0x0758(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0760(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement9;              // 0x0890(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex5;       // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue2;                // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal2;                // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A4[0x4];                                      // 0x08A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext2;          // 0x08A8(0x0050)(ConstParm)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F9[0x7];                                      // 0x08F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_909[0x7];                                      // 0x0909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x0920(0x0130)(ConstParm)
	struct FGameplayTagContainer                  CallFunc_GetGameplayTagsFrom_ReturnValue;          // 0x0A50(0x0020)()
	struct FGameplayTagQuery                      CallFunc_CreateMatchAllTagsQuery_ReturnValue;      // 0x0A70(0x0048)()
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue3;       // 0x0ABC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ABD[0x3];                                      // 0x0ABD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue4;       // 0x0AC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC5[0x3];                                      // 0x0AC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0AC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACC[0x4];                                      // 0x0ACC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0AD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x0AD8(0x0048)()
	class UWorld*                                 CallFunc_GetWorldFromContextObjectSafe_ReturnValue; // 0x0B20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGGameState*                          K2Node_DynamicCast_AsBFGGame_State;                // 0x0B28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B31[0x7];                                      // 0x0B31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue2;        // 0x0B38(0x0048)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement8;              // 0x0B80(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement7;              // 0x0B88(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex4;       // 0x0B90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMentalAbility_EventState                     BFGK2Node_BoundQuestEvent__state2;                 // 0x0B94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0B95(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B96[0x2];                                      // 0x0B96(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_ElementProximity*             BFGK2Node_BoundQuestEvent__Element;                // 0x0B98(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__SubgoalLimitID;         // 0x0BA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0BA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0BA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA9[0x7];                                      // 0x0BA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABFGNPCCharacterGameplay> CallFunc_Array_Get_Item2;                          // 0x0BB0(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue1; // 0x0BD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay;     // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE9[0x3];                                      // 0x0BE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0BEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0BF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF1[0x3];                                      // 0x0BF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0BF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGNPCCharacterGameplay> CallFunc_Array_Get_Item3;                          // 0x0BF8(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0C20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C24[0x4];                                      // 0x0C24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue2; // 0x0C28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0C30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C31[0x7];                                      // 0x0C31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay1;    // 0x0C38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0C40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0C41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0C42(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C43[0x1];                                      // 0x0C43(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0C44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue3;        // 0x0C48(0x0048)()
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0C90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C91[0x7];                                      // 0x0C91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x0C98(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex3;       // 0x0CA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue1;                // 0x0CA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal1;                // 0x0CA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAC[0x4];                                      // 0x0CAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext1;          // 0x0CB0(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x0D00(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex2;       // 0x0D08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue;                 // 0x0D0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal;                 // 0x0D10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D14[0x4];                                      // 0x0D14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext;           // 0x0D18(0x0050)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x0D68(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue4;        // 0x0D70(0x0048)()
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue3; // 0x0DB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay2;    // 0x0DC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0DC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0DC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DCA[0x6];                                      // 0x0DCA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue4; // 0x0DD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay3;    // 0x0DD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0DE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE1[0x7];                                      // 0x0DE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGActorComponent_Effect*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0DE8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGActorComponent_Effect*              CallFunc_GetComponentByClass_ReturnValue1;         // 0x0DF0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBFGEffectContainer*>            CallFunc_ActivateEffectAttachToActor_ReturnValue;  // 0x0DF8(0x0010)(ZeroConstructor, ReferenceParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x0E08(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex1;       // 0x0E10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMentalAbility_EventState                     BFGK2Node_BoundQuestEvent__state1;                 // 0x0E14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E15[0x3];                                      // 0x0E15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x0E18(0x0130)(ConstParm)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue5; // 0x0F48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x0F50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F51[0x7];                                      // 0x0F51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay4;    // 0x0F58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0F60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0F61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F62[0x6];                                      // 0x0F62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x0F68(0x0130)(ConstParm)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x1098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x10A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A1[0x7];                                     // 0x10A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x10A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x10B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B1[0x7];                                     // 0x10B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x10B8(0x0130)(ConstParm)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue6; // 0x11E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x11F0(0x0130)(ConstParm)
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay5;    // 0x1320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x1328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1329[0x7];                                     // 0x1329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue7; // 0x1330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay6;    // 0x1338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x1340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1341[0x7];                                     // 0x1341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABFGNPCCharacterGameplay> CallFunc_Array_Get_Item4;                          // 0x1348(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue8; // 0x1370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay7;    // 0x1378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x1380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1381[0x3];                                     // 0x1381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x1384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x1388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1389[0x7];                                     // 0x1389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x1390(0x0130)(ConstParm)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue9; // 0x14C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable8;                             // 0x14C8(0x0130)(ConstParm)
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay8;    // 0x15F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x1600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1601[0x7];                                     // 0x1601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable9;                             // 0x1608(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x1738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x1739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1; // 0x173A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_MusicSystem_valid9;                   // 0x173B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173C[0x4];                                     // 0x173C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem9;             // 0x1740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x1748(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex;        // 0x1750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMentalAbility_EventState                     BFGK2Node_BoundQuestEvent__state;                  // 0x1754(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x1755(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1756[0x2];                                     // 0x1756(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable10;                            // 0x1758(0x0130)(ConstParm)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue10; // 0x1888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x1890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1891[0x7];                                     // 0x1891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABFGNPCCharacterGameplay*               K2Node_DynamicCast_AsBFGNPCCharacter_Gameplay9;    // 0x1898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x18A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x18A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A2[0x6];                                     // 0x18A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue5;        // 0x18A8(0x0048)()
	TArray<class ABFGNPCCharacterGameplay*>       CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors1; // 0x18F0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue6;        // 0x1900(0x0048)()
	class ABFGNPCCharacterGameplay*               CallFunc_Array_Get_Item5;                          // 0x1948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABFGNPCCharacterGameplay*>       CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors2; // 0x1950(0x0010)(ZeroConstructor, ReferenceParm)
	class ABFGNPCCharacterGameplay*               CallFunc_Array_Get_Item6;                          // 0x1960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x1968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1969[0x3];                                     // 0x1969(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate;              // 0x196C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_197C[0x4];                                     // 0x197C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue7;        // 0x1980(0x0048)()
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x19C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19C9[0x7];                                     // 0x19C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABFGNPCCharacterGameplay*>       CallFunc_GetAllActorsOfClassMatchingTagQuery_OutActors3; // 0x19D0(0x0010)(ZeroConstructor, ReferenceParm)
	class ABFGNPCCharacterGameplay*               CallFunc_Array_Get_Item7;                          // 0x19E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious) == 0x000008, "Wrong alignment on MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious");
static_assert(sizeof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious) == 0x0019E8, "Wrong size on MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, EntryPoint) == 0x000000, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, Temp_struct_Variable) == 0x000008, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, CallFunc_PlayVoiceover__outResult) == 0x000138, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_SwitchEnum_CmpSuccess) == 0x000139, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_MakeStruct_SlateBrush) == 0x000140, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_MakeStruct_SlateBrush1) == 0x0001C8, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_MakeStruct_SlateBrush1' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_MakeStruct_SlateBrush2) == 0x000250, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_MakeStruct_SlateBrush2' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement41) == 0x0002D8, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement41' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__iObjectiveIndex8) == 0x0002E0, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__iObjectiveIndex8' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__iValue5) == 0x0002E4, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__iValue5' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__iTotal5) == 0x0002E8, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__iTotal5' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__eventContext5) == 0x0002F0, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__eventContext5' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement40) == 0x000340, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement40' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement39) == 0x000348, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement39' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_CustomEvent_DamagedActor) == 0x000350, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_CustomEvent_Damage) == 0x000358, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_CustomEvent_DamageType) == 0x000360, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_CustomEvent_InstigatedBy) == 0x000368, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_CustomEvent_DamageCauser) == 0x000370, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_MakeStruct_SlateBrush3) == 0x000378, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_MakeStruct_SlateBrush3' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, K2Node_MakeStruct_SlateBrush4) == 0x000400, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::K2Node_MakeStruct_SlateBrush4' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement38) == 0x000488, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement38' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement37) == 0x000490, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement37' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement36) == 0x000498, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement36' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement35) == 0x0004A0, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement35' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement34) == 0x0004A8, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement34' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__iObjectiveIndex7) == 0x0004B0, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__iObjectiveIndex7' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__iValue4) == 0x0004B4, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__iValue4' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__iTotal4) == 0x0004B8, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__iTotal4' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__eventContext4) == 0x0004C0, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__eventContext4' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement33) == 0x000510, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement33' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement32) == 0x000518, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement32' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement31) == 0x000520, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement31' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement30) == 0x000528, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement30' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement29) == 0x000530, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement29' has a wrong offset!");
static_assert(offsetof(MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious, BFGK2Node_BoundQuestEvent__pElement28) == 0x000538, "Member 'MM02_EarthWomenAreDelicious_C_ExecuteUbergraph_MM02_EarthWomenAreDelicious::BFGK2Node_BoundQuestEvent__pElement28' has a wrong offset!");
