#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM10_ForeignCorrespondent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM10_ForeignCorrespondent.MM10_ForeignCorrespondent_C
// 0x0158 (0x0390 - 0x0238)
class UMM10_ForeignCorrespondent_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FText>                           CrackpotLines;                                     // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class ABP_MusicSystem_C*                      MusicSystem;                                       // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  CrackpotLocation_Secret;                           // 0x0258(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FBFGInteractAnimationSequence          CrackPot_Anim_Secret;                              // 0x0280(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class AActor>                  CrackpotLocation_ComeWithMe;                       // 0x0298(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FBFGInteractAnimationSequence          CrackPot_Anim_ComeWithMe;                          // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class AActor>                  CookLocation_Reveal;                               // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FBFGInteractAnimationSequence          Cook_Anim_Smoke;                                   // 0x0300(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Cp_step04_activated;                               // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABFGNPCCharacterCivilian> CrackPotAnimScanMeLocation;                        // 0x0320(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABFGNPCCharacterGameplay> VIP_Chef_Ref;                                      // 0x0348(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsCookCommandImplanted;                            // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class ABFGNPCCharacterGameplay>> ForceFieldSoldier_Ref;                             // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          Is_3DDIAG_Success;                                 // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MM10_ForeignCorrespondent(int32 EntryPoint);
	void BndEvt__FD561960Minus43975393Minus3B626A9BMinusDAB895BC_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__01B71356Minus41D3F175MinusF3E6C399MinusB963B109_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__7E96C43AMinus404CCEE9Minus6D0F0C95Minus502FF1FE_BFGK2Node_BoundQuestEvent_105_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__0B725953Minus451DE770MinusD019DD90MinusA2E99F76_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__04DF1C52Minus47F7BFCBMinusB3F52C9BMinus692FCC98_BFGK2Node_BoundQuestEvent_108_BFGQuestElement_Event_MentalAbility__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, EMentalAbility_EventState _state);
	void BndEvt__C8A7D641Minus412382B3Minus54B102A7MinusC32C8CA4_BFGK2Node_BoundQuestEvent_71_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__28056FF9Minus4E8E9FFFMinusB8D8D583Minus023B82E9_BFGK2Node_BoundQuestEvent_267_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__DC66A9BEMinus43936346Minus35BE24BBMinusE9296519_BFGK2Node_BoundQuestEvent_248_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__3023416BMinus4097473EMinus5421A384MinusA9F229A4_BFGK2Node_BoundQuestEvent_246_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__57C88009Minus44627D55Minus6AF37293MinusDCE051C5_BFGK2Node_BoundQuestEvent_58_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__1A5B6D03Minus4FBAF2C2Minus5FCEDC80Minus6EE50AEE_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__82D0B2B9Minus4AC2DB44Minus87D563B2Minus24F751F9_BFGK2Node_BoundQuestEvent_202_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__6F754046Minus4FAE37A1MinusA452959EMinusDA3AC6B4_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__6F754046Minus4FAE37A1MinusA452959EMinusDA3AC6B4_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__37AD65D7Minus4234DB73MinusFF17C5A6Minus3BFE35A4_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__37AD65D7Minus4234DB73MinusFF17C5A6Minus3BFE35A4_BFGK2Node_BoundQuestEvent_11_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7FBDD344Minus40D699C8Minus08D73BB1Minus91B2FC74_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7FBDD344Minus40D699C8Minus08D73BB1Minus91B2FC74_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__82D0B2B9Minus4AC2DB44Minus87D563B2Minus24F751F9_BFGK2Node_BoundQuestEvent_199_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E32CE238Minus40CEB489Minus01F1909CMinus383A0BBB_BFGK2Node_BoundQuestEvent_19_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7FBDD344Minus40D699C8Minus08D73BB1Minus91B2FC74_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event_Narrative__DelegateSignature(class UBFGQuest_ElementNarrativeSequence* _pElement, int32 _iNumStrikes, const struct FBFGNarrativeSequence_AssessmentArg& _aAssessments);
	void BndEvt__78C89A5AMinus400D5F39MinusA47929BEMinus4995BCE2_BFGK2Node_BoundQuestEvent_59_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__6D2B73FDMinus4FFF4C1BMinus53EB5783Minus0FE17D5B_BFGK2Node_BoundQuestEvent_49_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__7E96C43AMinus404CCEE9Minus6D0F0C95Minus502FF1FE_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__689C731DMinus4C714FCDMinus305F1F8BMinusFE31DFC5_BFGK2Node_BoundQuestEvent_144_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__0293A808Minus44BDFF89Minus66BF68B0Minus8B9FAA83_BFGK2Node_BoundQuestEvent_82_BFGQuestElement_Event_ProximityGoalReached__DelegateSignature(class UBFGQuest_ElementProximity* _Element, int32 _SubgoalLimitID);
	void BndEvt__96B9C28DMinus40F42FB5Minus070B27B0Minus21D9CACD_BFGK2Node_BoundQuestEvent_41_BFGQuestElement_Event_ProximityGoalReached__DelegateSignature(class UBFGQuest_ElementProximity* _Element, int32 _SubgoalLimitID);
	void BndEvt__C56DD3EEMinus4CC21D59MinusB3A88EA5MinusD2776FF7_BFGK2Node_BoundQuestEvent_295_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__9356F0C4Minus4652179CMinus2CDEE296Minus922F37BA_BFGK2Node_BoundQuestEvent_273_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__0B725953Minus451DE770MinusD019DD90MinusA2E99F76_BFGK2Node_BoundQuestEvent_120_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__DC4863C0Minus4E1ED497Minus2993799AMinus00F37C30_BFGK2Node_BoundQuestEvent_17_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__DC4863C0Minus4E1ED497Minus2993799AMinus00F37C30_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__B8B34202Minus42198B63MinusF938DE8AMinusD048BEEA_BFGK2Node_BoundQuestEvent_14_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__B8B34202Minus42198B63MinusF938DE8AMinusD048BEEA_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__49F5C285Minus4CEE142BMinus1FBBF2B2Minus98ADA9C0_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__49F5C285Minus4CEE142BMinus1FBBF2B2Minus98ADA9C0_BFGK2Node_BoundQuestEvent_8_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__8E686BF0Minus44F14E69Minus34E35E9FMinus010A6962_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__8E686BF0Minus44F14E69Minus34E35E9FMinus010A6962_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__9574B4C8Minus4F220321Minus41FDD6A1Minus10E5E443_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__9574B4C8Minus4F220321Minus41FDD6A1Minus10E5E443_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__70E94610Minus43FC494DMinus920A40A4Minus00339026_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__F00B0C17Minus4AF8E355Minus220C5485MinusAD3DA89D_BFGK2Node_BoundQuestEvent_441_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__C8A7D641Minus412382B3Minus54B102A7MinusC32C8CA4_BFGK2Node_BoundQuestEvent_396_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__BB16C15BMinus4110D550MinusD4695CBAMinus8D193FAB_BFGK2Node_BoundQuestEvent_232_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__01B71356Minus41D3F175MinusF3E6C399MinusB963B109_BFGK2Node_BoundQuestEvent_57_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__906EF276Minus4E9DDD2AMinusC0D37797Minus5145ACCF_BFGK2Node_BoundQuestEvent_365_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__906EF276Minus4E9DDD2AMinusC0D37797Minus5145ACCF_BFGK2Node_BoundQuestEvent_362_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__CE9DADEAMinus49C0108BMinus3155499BMinusD9AE2332_BFGK2Node_BoundQuestEvent_32_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void ReminderVO();
	void Get_MusicSystem(bool* Valid, class ABP_MusicSystem_C** MusicSystem_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM10_ForeignCorrespondent_C">();
	}
	static class UMM10_ForeignCorrespondent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMM10_ForeignCorrespondent_C>();
	}
};
static_assert(alignof(UMM10_ForeignCorrespondent_C) == 0x000008, "Wrong alignment on UMM10_ForeignCorrespondent_C");
static_assert(sizeof(UMM10_ForeignCorrespondent_C) == 0x000390, "Wrong size on UMM10_ForeignCorrespondent_C");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, UberGraphFrame) == 0x000238, "Member 'UMM10_ForeignCorrespondent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, CrackpotLines) == 0x000240, "Member 'UMM10_ForeignCorrespondent_C::CrackpotLines' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, MusicSystem) == 0x000250, "Member 'UMM10_ForeignCorrespondent_C::MusicSystem' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, CrackpotLocation_Secret) == 0x000258, "Member 'UMM10_ForeignCorrespondent_C::CrackpotLocation_Secret' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, CrackPot_Anim_Secret) == 0x000280, "Member 'UMM10_ForeignCorrespondent_C::CrackPot_Anim_Secret' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, CrackpotLocation_ComeWithMe) == 0x000298, "Member 'UMM10_ForeignCorrespondent_C::CrackpotLocation_ComeWithMe' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, CrackPot_Anim_ComeWithMe) == 0x0002C0, "Member 'UMM10_ForeignCorrespondent_C::CrackPot_Anim_ComeWithMe' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, CookLocation_Reveal) == 0x0002D8, "Member 'UMM10_ForeignCorrespondent_C::CookLocation_Reveal' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, Cook_Anim_Smoke) == 0x000300, "Member 'UMM10_ForeignCorrespondent_C::Cook_Anim_Smoke' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, Cp_step04_activated) == 0x000318, "Member 'UMM10_ForeignCorrespondent_C::Cp_step04_activated' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, CrackPotAnimScanMeLocation) == 0x000320, "Member 'UMM10_ForeignCorrespondent_C::CrackPotAnimScanMeLocation' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, VIP_Chef_Ref) == 0x000348, "Member 'UMM10_ForeignCorrespondent_C::VIP_Chef_Ref' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, IsCookCommandImplanted) == 0x000370, "Member 'UMM10_ForeignCorrespondent_C::IsCookCommandImplanted' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, ForceFieldSoldier_Ref) == 0x000378, "Member 'UMM10_ForeignCorrespondent_C::ForceFieldSoldier_Ref' has a wrong offset!");
static_assert(offsetof(UMM10_ForeignCorrespondent_C, Is_3DDIAG_Success) == 0x000388, "Member 'UMM10_ForeignCorrespondent_C::Is_3DDIAG_Success' has a wrong offset!");

}

