#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM11_SuburbOfTheDamned

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM11_SuburbOfTheDamned.MM11_SuburbOfTheDamned_C
// 0x0040 (0x0278 - 0x0238)
class UMM11_SuburbOfTheDamned_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ABFGNPCCharacterGameplay*>       TransmissionTowerBoxes;                            // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class ABP_MusicSystem_C*                      MusicSystem;                                       // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Defendee;                                          // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthPercentage;                                  // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         TransmissionBoxesImmunities;                       // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MM11_SuburbOfTheDamned(int32 EntryPoint);
	void BndEvt__F30E5544Minus48B5B550Minus5E05DE90MinusE02A3D68_BFGK2Node_BoundQuestEvent_69_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__A082210FMinus4AE02827Minus9ED6AD81MinusB05C1A0B_BFGK2Node_BoundQuestEvent_66_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7B2229C8Minus4644906FMinusDFCAAEB1MinusABBCD800_BFGK2Node_BoundQuestEvent_64_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4B0B6507Minus45803BA3MinusF3ABCDB9Minus53073EB3_BFGK2Node_BoundQuestEvent_61_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__BB011995Minus41EF3783MinusD805F2B6Minus14B85EDB_BFGK2Node_BoundQuestEvent_59_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__A4CC59EBMinus429FD7D9Minus4820C88BMinusC550A6C1_BFGK2Node_BoundQuestEvent_56_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void OnStartForWorld(class ABFGGameState* _pGameState, class UBFGQuest_Manager* _pQuestManager);
	void BndEvt__D3A059A9Minus421BBA72Minus912D30B2MinusE7C0F2A2_BFGK2Node_BoundQuestEvent_7_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__35C3EDC2Minus4ED970C2Minus7FE8B783Minus94F267B0_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__36362131Minus4667383FMinusFCB496AAMinusFCD2CC91_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__0C15D77FMinus48BFBE2EMinusD424CA9BMinus1F7CB1F6_BFGK2Node_BoundQuestEvent_5_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__17DFC801Minus4ED1E498MinusD2FF79B3Minus82ACF8E0_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__F35DEFA7Minus4AD44339Minus3714DC82Minus45CADAB3_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event_Defend__DelegateSignature(class UBFGQuest_ElementDefend* _Element, class AActor* _Defendee, float _CurrentHealth, float _LastHealth, float _MaxHealth);
	void BndEvt__D3A059A9Minus421BBA72Minus912D30B2MinusE7C0F2A2_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_Defend__DelegateSignature(class UBFGQuest_ElementDefend* _Element, class AActor* _Defendee, float _CurrentHealth, float _LastHealth, float _MaxHealth);
	void BndEvt__35C3EDC2Minus4ED970C2Minus7FE8B783Minus94F267B0_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_Defend__DelegateSignature(class UBFGQuest_ElementDefend* _Element, class AActor* _Defendee, float _CurrentHealth, float _LastHealth, float _MaxHealth);
	void BndEvt__F35DEFA7Minus4AD44339Minus3714DC82Minus45CADAB3_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D3A059A9Minus421BBA72Minus912D30B2MinusE7C0F2A2_BFGK2Node_BoundQuestEvent_24_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__35C3EDC2Minus4ED970C2Minus7FE8B783Minus94F267B0_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__301271A4Minus4B7CBBEDMinus2DF687A6Minus931A748E_BFGK2Node_BoundQuestEvent_109_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__301271A4Minus4B7CBBEDMinus2DF687A6Minus931A748E_BFGK2Node_BoundQuestEvent_107_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F00B0C17Minus4AF8E355Minus220C5485MinusAD3DA89D_BFGK2Node_BoundQuestEvent_95_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F1DD8B78Minus4FA4E234Minus473CF2BDMinus8967ED35_BFGK2Node_BoundQuestEvent_88_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__F1DD8B78Minus4FA4E234Minus473CF2BDMinus8967ED35_BFGK2Node_BoundQuestEvent_86_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7608877EMinus4A7D5441MinusA11EC6A5Minus683E18EE_BFGK2Node_BoundQuestEvent_73_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__7608877EMinus4A7D5441MinusA11EC6A5Minus683E18EE_BFGK2Node_BoundQuestEvent_71_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__53546C04Minus49140A66MinusB74B8898Minus6757F194_BFGK2Node_BoundQuestEvent_55_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__53546C04Minus49140A66MinusB74B8898Minus6757F194_BFGK2Node_BoundQuestEvent_53_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4FF551B2Minus407D4F33Minus2FAFE58BMinus0E6C00AC_BFGK2Node_BoundQuestEvent_37_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__4FF551B2Minus407D4F33Minus2FAFE58BMinus0E6C00AC_BFGK2Node_BoundQuestEvent_35_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__FE51960BMinus44452887Minus42ADACB2Minus73D864E6_BFGK2Node_BoundQuestEvent_22_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__FE51960BMinus44452887Minus42ADACB2Minus73D864E6_BFGK2Node_BoundQuestEvent_20_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__1AF0E3F9Minus4B22E22EMinusBCD51CA5Minus0DFB60A5_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void Get_MusicSystem(bool* Valid, class ABP_MusicSystem_C** MusicSystem_0);
	void MarkAttackers();
	void TransmissionBoxes(bool DressingVersion);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM11_SuburbOfTheDamned_C">();
	}
	static class UMM11_SuburbOfTheDamned_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMM11_SuburbOfTheDamned_C>();
	}
};
static_assert(alignof(UMM11_SuburbOfTheDamned_C) == 0x000008, "Wrong alignment on UMM11_SuburbOfTheDamned_C");
static_assert(sizeof(UMM11_SuburbOfTheDamned_C) == 0x000278, "Wrong size on UMM11_SuburbOfTheDamned_C");
static_assert(offsetof(UMM11_SuburbOfTheDamned_C, UberGraphFrame) == 0x000238, "Member 'UMM11_SuburbOfTheDamned_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMM11_SuburbOfTheDamned_C, TransmissionTowerBoxes) == 0x000240, "Member 'UMM11_SuburbOfTheDamned_C::TransmissionTowerBoxes' has a wrong offset!");
static_assert(offsetof(UMM11_SuburbOfTheDamned_C, MusicSystem) == 0x000250, "Member 'UMM11_SuburbOfTheDamned_C::MusicSystem' has a wrong offset!");
static_assert(offsetof(UMM11_SuburbOfTheDamned_C, Defendee) == 0x000258, "Member 'UMM11_SuburbOfTheDamned_C::Defendee' has a wrong offset!");
static_assert(offsetof(UMM11_SuburbOfTheDamned_C, HealthPercentage) == 0x000260, "Member 'UMM11_SuburbOfTheDamned_C::HealthPercentage' has a wrong offset!");
static_assert(offsetof(UMM11_SuburbOfTheDamned_C, TransmissionBoxesImmunities) == 0x000268, "Member 'UMM11_SuburbOfTheDamned_C::TransmissionBoxesImmunities' has a wrong offset!");

}

