#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM19_TheLoneGunman

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BFGCore_structs.hpp"
#include "BFGCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM19_TheLoneGunman.MM19_TheLoneGunman_C
// 0x0130 (0x0368 - 0x0238)
class UMM19_TheLoneGunman_C final : public UBFGQuest
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class AActor>                  Motorcade_Reach_Location_1;                        // 0x0240(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Motorcade_Reach_Location_2;                        // 0x0268(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Motorcade_Reach_Location_3;                        // 0x0290(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  President_Reach_Location;                          // 0x02B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_MusicSystem_C*                      MusicSystem;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Motorcade_Car_1;                                   // 0x02E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Motorcade_Car_2;                                   // 0x0310(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Motorcade_Car_3;                                   // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HasKilledPresident;                                // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MM19_TheLoneGunman(int32 EntryPoint);
	void BndEvt__72B966B4Minus485DFA0DMinus332CDA98Minus6EBC40DF_BFGK2Node_BoundQuestEvent_28_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__21A8F11BMinus4C0A5FF2MinusFB9321BEMinus9C4E8273_BFGK2Node_BoundQuestEvent_163_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__33B77E01Minus44F77119Minus754509A5Minus2573CB7A_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__33B77E01Minus44F77119Minus754509A5Minus2573CB7A_BFGK2Node_BoundQuestEvent_179_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__2CE1BC0FMinus4E2577E7Minus2ED0CF89Minus38C70583_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event_TimerSubgoalReached__DelegateSignature(class UBFGQuest_ElementWaitTime* _Element, int32 _Index, const struct FTimespan& _TimeLimit);
	void BndEvt__2CE1BC0FMinus4E2577E7Minus2ED0CF89Minus38C70583_BFGK2Node_BoundQuestEvent_109_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__0877BF5EMinus47A8C54EMinus009B9EA9Minus59CDAFF4_BFGK2Node_BoundQuestEvent_70_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__6673D23DMinus4729F016Minus3C553694Minus7DF33FB1_BFGK2Node_BoundQuestEvent_64_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__33B77E01Minus44F77119Minus754509A5Minus2573CB7A_BFGK2Node_BoundQuestEvent_181_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__1A736CD0Minus49749A4EMinus572628AEMinus47C21F39_BFGK2Node_BoundQuestEvent_54_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E942FFC5Minus44B34EB4MinusC93252A9MinusA6DDDC7B_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E942FFC5Minus44B34EB4MinusC93252A9MinusA6DDDC7B_BFGK2Node_BoundQuestEvent_1_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__72B966B4Minus485DFA0DMinus332CDA98Minus6EBC40DF_BFGK2Node_BoundQuestEvent_15_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__E942FFC5Minus44B34EB4MinusC93252A9MinusA6DDDC7B_BFGK2Node_BoundQuestEvent_198_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__61F2EE02Minus497C6FB3Minus5D909FBBMinusBBDCAA9B_BFGK2Node_BoundQuestEvent_3_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__11616D9FMinus434C865AMinus7ABE1E86Minus74E74392_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__CBCA037CMinus4D54C780Minus8ED06BAFMinusEFB2F00F_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__E38B3702Minus4BF7FCDDMinus0F74598DMinusD7EF81AD_BFGK2Node_BoundQuestEvent_35_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void BndEvt__0EF66793Minus469A9680Minus780EB0A8MinusFC56F79B_BFGK2Node_BoundQuestEvent_94_BFGQuestElement_Event_ProximityGoalReached__DelegateSignature(class UBFGQuest_ElementProximity* _Element, int32 _SubgoalLimitID);
	void BndEvt__2458154AMinus40B8E9A4Minus7488678BMinusFD854DD5_BFGK2Node_BoundQuestEvent_2_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__2458154AMinus40B8E9A4Minus7488678BMinusFD854DD5_BFGK2Node_BoundQuestEvent_0_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__C54F95B1Minus4226A6B7MinusA4A139A8Minus73D96841_BFGK2Node_BoundQuestEvent_88_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__6920D64BMinus4C0BC838Minus5173A198Minus182382BD_BFGK2Node_BoundQuestEvent_43_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__DA510F77Minus4FBF49A0MinusE3B39BAFMinusB6FF3928_BFGK2Node_BoundQuestEvent_40_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__A4465A90Minus4FF6828BMinus3F49DD89Minus98F7B98B_BFGK2Node_BoundQuestEvent_24_BFGQuestElement_Event_ScriptedSequence__DelegateSignature(class UBFGQuest_ElementScriptedSequence* _pElement, const struct FBFGQuest_ElementScriptedSequence_Objective& _pObjective, int32 _iObjectiveIndex, class UBFGScriptedSequence* _pSequenceToBuild);
	void BndEvt__F00B0C17Minus4AF8E355Minus220C5485MinusAD3DA89D_BFGK2Node_BoundQuestEvent_4_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__D3AE30CBMinus40FE5B59Minus00353BB9MinusC3E75FF8_BFGK2Node_BoundQuestEvent_78_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__8435A2BDMinus40311E29MinusDD609BB5MinusC591BF83_BFGK2Node_BoundQuestEvent_82_BFGQuestElement_Event__DelegateSignature(class UBFGQuest_Element* _pElement);
	void BndEvt__FDBC85DFMinus41C06333Minus5AC51B87Minus73F15FD5_BFGK2Node_BoundQuestEvent_119_BFGQuestElement_Event_VarCounter__DelegateSignature(class UBFGQuest_Element* _pElement, int32 _iObjectiveIndex, int32 _iValue, int32 _iTotal, const struct FBFGEventContext& _eventContext);
	void Get_MusicSystem(bool* Valid, class ABP_MusicSystem_C** MusicSystem_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM19_TheLoneGunman_C">();
	}
	static class UMM19_TheLoneGunman_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMM19_TheLoneGunman_C>();
	}
};
static_assert(alignof(UMM19_TheLoneGunman_C) == 0x000008, "Wrong alignment on UMM19_TheLoneGunman_C");
static_assert(sizeof(UMM19_TheLoneGunman_C) == 0x000368, "Wrong size on UMM19_TheLoneGunman_C");
static_assert(offsetof(UMM19_TheLoneGunman_C, UberGraphFrame) == 0x000238, "Member 'UMM19_TheLoneGunman_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMM19_TheLoneGunman_C, Motorcade_Reach_Location_1) == 0x000240, "Member 'UMM19_TheLoneGunman_C::Motorcade_Reach_Location_1' has a wrong offset!");
static_assert(offsetof(UMM19_TheLoneGunman_C, Motorcade_Reach_Location_2) == 0x000268, "Member 'UMM19_TheLoneGunman_C::Motorcade_Reach_Location_2' has a wrong offset!");
static_assert(offsetof(UMM19_TheLoneGunman_C, Motorcade_Reach_Location_3) == 0x000290, "Member 'UMM19_TheLoneGunman_C::Motorcade_Reach_Location_3' has a wrong offset!");
static_assert(offsetof(UMM19_TheLoneGunman_C, President_Reach_Location) == 0x0002B8, "Member 'UMM19_TheLoneGunman_C::President_Reach_Location' has a wrong offset!");
static_assert(offsetof(UMM19_TheLoneGunman_C, MusicSystem) == 0x0002E0, "Member 'UMM19_TheLoneGunman_C::MusicSystem' has a wrong offset!");
static_assert(offsetof(UMM19_TheLoneGunman_C, Motorcade_Car_1) == 0x0002E8, "Member 'UMM19_TheLoneGunman_C::Motorcade_Car_1' has a wrong offset!");
static_assert(offsetof(UMM19_TheLoneGunman_C, Motorcade_Car_2) == 0x000310, "Member 'UMM19_TheLoneGunman_C::Motorcade_Car_2' has a wrong offset!");
static_assert(offsetof(UMM19_TheLoneGunman_C, Motorcade_Car_3) == 0x000338, "Member 'UMM19_TheLoneGunman_C::Motorcade_Car_3' has a wrong offset!");
static_assert(offsetof(UMM19_TheLoneGunman_C, HasKilledPresident) == 0x000360, "Member 'UMM19_TheLoneGunman_C::HasKilledPresident' has a wrong offset!");

}

