#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM22_AttackOfThe50MinusFtPresident

#include "Basic.hpp"

#include "BFGCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.ExecuteUbergraph_MM22_AttackOfThe50-FtPresident
// 0x0CF0 (0x0CF0 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable;                              // 0x0008(0x0130)(ConstParm)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable1;                             // 0x0138(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult1;                // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue;         // 0x0270(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue1;        // 0x02B8(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue2;        // 0x0300(0x0048)()
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable2;                             // 0x0348(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult2;                // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable3;                             // 0x0480(0x0130)(ConstParm)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult3;                // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B2[0x6];                                      // 0x05B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue3;        // 0x05B8(0x0048)()
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue4;        // 0x0608(0x0048)()
	struct FGameplayTagQuery                      CallFunc_MakeGameplayTagQuery_ReturnValue5;        // 0x0650(0x0048)()
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement16;             // 0x0698(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement15;             // 0x06A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement14;             // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_MusicSystem_valid;                    // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem;              // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable4;                             // 0x06C0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult4;                // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x07F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_MusicSystem_valid1;                   // 0x07F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F3[0x5];                                      // 0x07F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem1;             // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement13;             // 0x0800(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement12;             // 0x0808(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement11;             // 0x0810(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement10;             // 0x0818(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement9;              // 0x0820(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement8;              // 0x0828(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement7;              // 0x0830(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement6;              // 0x0838(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement5;              // 0x0840(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue;        // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayerState_UnlockTag_ReturnValue1;       // 0x0849(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84A[0x6];                                      // 0x084A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGGameInstance*                       K2Node_DynamicCast_AsBFGGame_Instance;             // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement4;              // 0x0868(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iObjectiveIndex;        // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iValue;                 // 0x0874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BFGK2Node_BoundQuestEvent__iTotal;                 // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       BFGK2Node_BoundQuestEvent__eventContext;           // 0x0880(0x0050)(ConstParm)
	class UBFGGameSession*                        CallFunc_GetGameSession_ReturnValue;               // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D9[0x7];                                      // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement3;              // 0x08E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable5;                             // 0x08E8(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult5;                // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x0A19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1A[0x6];                                      // 0x0A1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement2;              // 0x0A20(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement1;              // 0x0A28(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGGameState*                          CallFunc_GetGameState_ReturnValue;                 // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABFGGameState*                          K2Node_Event__pGameState;                          // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Manager*                      K2Node_Event__pQuestManager;                       // 0x0A40(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGStreamingLevelManager*              CallFunc_GetStreamingLevelManager_ReturnValue;     // 0x0A48(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestInProgress_ReturnValue;            // 0x0A50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A51[0x7];                                      // 0x0A51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGStreamingLevelHandle*               CallFunc_RegisterLevel_ReturnValue;                // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestToBeStarted_ReturnValue;           // 0x0A60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0A61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0A62(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestState_ReturnValue;                 // 0x0A63(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_MusicSystem_valid2;                   // 0x0A64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A65[0x3];                                      // 0x0A65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem2;             // 0x0A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable6;                             // 0x0A70(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult6;                // 0x0BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x0BA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_MusicSystem_valid3;                   // 0x0BA2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA3[0x5];                                      // 0x0BA3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicSystem_C*                      CallFunc_Get_MusicSystem_MusicSystem3;             // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBFGVoiceoverPlaybackRequest           Temp_struct_Variable7;                             // 0x0BB0(0x0130)(ConstParm)
	EBFGVoiceoverResultType                       CallFunc_PlayVoiceover__outResult7;                // 0x0CE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x0CE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE2[0x6];                                      // 0x0CE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBFGQuest_Element*                      BFGK2Node_BoundQuestEvent__pElement;               // 0x0CE8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident");
static_assert(sizeof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident) == 0x000CF0, "Wrong size on MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, EntryPoint) == 0x000000, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, Temp_struct_Variable) == 0x000008, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, Temp_struct_Variable1) == 0x000138, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayVoiceover__outResult) == 0x000268, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayVoiceover__outResult' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayVoiceover__outResult1) == 0x000269, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayVoiceover__outResult1' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_SwitchEnum_CmpSuccess) == 0x00026A, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_SwitchEnum1_CmpSuccess) == 0x00026B, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_MakeGameplayTagQuery_ReturnValue) == 0x000270, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_MakeGameplayTagQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_MakeGameplayTagQuery_ReturnValue1) == 0x0002B8, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_MakeGameplayTagQuery_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_MakeGameplayTagQuery_ReturnValue2) == 0x000300, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_MakeGameplayTagQuery_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, Temp_struct_Variable2) == 0x000348, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayVoiceover__outResult2) == 0x000478, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayVoiceover__outResult2' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, Temp_struct_Variable3) == 0x000480, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_SwitchEnum2_CmpSuccess) == 0x0005B0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayVoiceover__outResult3) == 0x0005B1, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayVoiceover__outResult3' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_MakeGameplayTagQuery_ReturnValue3) == 0x0005B8, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_MakeGameplayTagQuery_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_SwitchEnum3_CmpSuccess) == 0x000600, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_MakeGameplayTagQuery_ReturnValue4) == 0x000608, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_MakeGameplayTagQuery_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_MakeGameplayTagQuery_ReturnValue5) == 0x000650, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_MakeGameplayTagQuery_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement16) == 0x000698, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement16' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement15) == 0x0006A0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement15' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement14) == 0x0006A8, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement14' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_Get_MusicSystem_valid) == 0x0006B0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_Get_MusicSystem_valid' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_Get_MusicSystem_MusicSystem) == 0x0006B8, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_Get_MusicSystem_MusicSystem' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, Temp_struct_Variable4) == 0x0006C0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayVoiceover__outResult4) == 0x0007F0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayVoiceover__outResult4' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_SwitchEnum4_CmpSuccess) == 0x0007F1, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_Get_MusicSystem_valid1) == 0x0007F2, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_Get_MusicSystem_valid1' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_Get_MusicSystem_MusicSystem1) == 0x0007F8, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_Get_MusicSystem_MusicSystem1' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement13) == 0x000800, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement13' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement12) == 0x000808, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement12' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement11) == 0x000810, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement11' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement10) == 0x000818, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement10' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement9) == 0x000820, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement9' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement8) == 0x000828, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement8' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement7) == 0x000830, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement7' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement6) == 0x000838, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement6' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement5) == 0x000840, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement5' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayerState_UnlockTag_ReturnValue) == 0x000848, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayerState_UnlockTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayerState_UnlockTag_ReturnValue1) == 0x000849, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayerState_UnlockTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_GetGameInstance_ReturnValue) == 0x000850, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_DynamicCast_AsBFGGame_Instance) == 0x000858, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_DynamicCast_AsBFGGame_Instance' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_DynamicCast_bSuccess) == 0x000860, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement4) == 0x000868, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement4' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__iObjectiveIndex) == 0x000870, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__iValue) == 0x000874, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__iValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__iTotal) == 0x000878, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__iTotal' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__eventContext) == 0x000880, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__eventContext' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_GetGameSession_ReturnValue) == 0x0008D0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_GetGameSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_SwitchInteger_CmpSuccess) == 0x0008D8, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement3) == 0x0008E0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement3' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, Temp_struct_Variable5) == 0x0008E8, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayVoiceover__outResult5) == 0x000A18, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayVoiceover__outResult5' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_SwitchEnum5_CmpSuccess) == 0x000A19, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement2) == 0x000A20, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement2' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement1) == 0x000A28, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement1' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_GetGameState_ReturnValue) == 0x000A30, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_Event__pGameState) == 0x000A38, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_Event__pGameState' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_Event__pQuestManager) == 0x000A40, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_Event__pQuestManager' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_GetStreamingLevelManager_ReturnValue) == 0x000A48, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_GetStreamingLevelManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_IsQuestInProgress_ReturnValue) == 0x000A50, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_IsQuestInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_RegisterLevel_ReturnValue) == 0x000A58, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_RegisterLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_IsQuestToBeStarted_ReturnValue) == 0x000A60, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_IsQuestToBeStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_BooleanOR_ReturnValue) == 0x000A61, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_Not_PreBool_ReturnValue) == 0x000A62, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_RequestState_ReturnValue) == 0x000A63, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_RequestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_Get_MusicSystem_valid2) == 0x000A64, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_Get_MusicSystem_valid2' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_Get_MusicSystem_MusicSystem2) == 0x000A68, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_Get_MusicSystem_MusicSystem2' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, Temp_struct_Variable6) == 0x000A70, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayVoiceover__outResult6) == 0x000BA0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayVoiceover__outResult6' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_SwitchEnum6_CmpSuccess) == 0x000BA1, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_Get_MusicSystem_valid3) == 0x000BA2, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_Get_MusicSystem_valid3' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_Get_MusicSystem_MusicSystem3) == 0x000BA8, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_Get_MusicSystem_MusicSystem3' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, Temp_struct_Variable7) == 0x000BB0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, CallFunc_PlayVoiceover__outResult7) == 0x000CE0, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::CallFunc_PlayVoiceover__outResult7' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, K2Node_SwitchEnum7_CmpSuccess) == 0x000CE1, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::K2Node_SwitchEnum7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident, BFGK2Node_BoundQuestEvent__pElement) == 0x000CE8, "Member 'MM22_AttackOfThe50MinusFtPresident_C_ExecuteUbergraph_MM22_AttackOfThe50MinusFtPresident::BFGK2Node_BoundQuestEvent__pElement' has a wrong offset!");

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.BndEvt__20087C8B-4B536411-8A029692-72856DE3_BFGK2Node_BoundQuestEvent_794_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_BndEvt__20087C8BMinus4B536411Minus8A029692Minus72856DE3_BFGK2Node_BoundQuestEvent_794_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__20087C8BMinus4B536411Minus8A029692Minus72856DE3_BFGK2Node_BoundQuestEvent_794_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__20087C8BMinus4B536411Minus8A029692Minus72856DE3_BFGK2Node_BoundQuestEvent_794_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__20087C8BMinus4B536411Minus8A029692Minus72856DE3_BFGK2Node_BoundQuestEvent_794_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__20087C8BMinus4B536411Minus8A029692Minus72856DE3_BFGK2Node_BoundQuestEvent_794_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__20087C8BMinus4B536411Minus8A029692Minus72856DE3_BFGK2Node_BoundQuestEvent_794_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__20087C8BMinus4B536411Minus8A029692Minus72856DE3_BFGK2Node_BoundQuestEvent_794_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.OnStartForWorld
// 0x0010 (0x0010 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_OnStartForWorld final
{
public:
	class ABFGGameState*                          _pGameState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBFGQuest_Manager*                      _pQuestManager;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_OnStartForWorld) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_OnStartForWorld");
static_assert(sizeof(MM22_AttackOfThe50MinusFtPresident_C_OnStartForWorld) == 0x000010, "Wrong size on MM22_AttackOfThe50MinusFtPresident_C_OnStartForWorld");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_OnStartForWorld, _pGameState) == 0x000000, "Member 'MM22_AttackOfThe50MinusFtPresident_C_OnStartForWorld::_pGameState' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_OnStartForWorld, _pQuestManager) == 0x000008, "Member 'MM22_AttackOfThe50MinusFtPresident_C_OnStartForWorld::_pQuestManager' has a wrong offset!");

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.BndEvt__A360D4A0-480BFF2C-21D5ABA5-92ECAD61_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_BndEvt__A360D4A0Minus480BFF2CMinus21D5ABA5Minus92ECAD61_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__A360D4A0Minus480BFF2CMinus21D5ABA5Minus92ECAD61_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__A360D4A0Minus480BFF2CMinus21D5ABA5Minus92ECAD61_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__A360D4A0Minus480BFF2CMinus21D5ABA5Minus92ECAD61_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__A360D4A0Minus480BFF2CMinus21D5ABA5Minus92ECAD61_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__A360D4A0Minus480BFF2CMinus21D5ABA5Minus92ECAD61_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__A360D4A0Minus480BFF2CMinus21D5ABA5Minus92ECAD61_BFGK2Node_BoundQuestEvent_29_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.BndEvt__97E2BD13-466A7090-8D7E5289-603F2B19_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_BndEvt__97E2BD13Minus466A7090Minus8D7E5289Minus603F2B19_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__97E2BD13Minus466A7090Minus8D7E5289Minus603F2B19_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__97E2BD13Minus466A7090Minus8D7E5289Minus603F2B19_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__97E2BD13Minus466A7090Minus8D7E5289Minus603F2B19_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__97E2BD13Minus466A7090Minus8D7E5289Minus603F2B19_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__97E2BD13Minus466A7090Minus8D7E5289Minus603F2B19_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__97E2BD13Minus466A7090Minus8D7E5289Minus603F2B19_BFGK2Node_BoundQuestEvent_13_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.BndEvt__D739626F-428BBAFE-E8F60381-215DD852_BFGK2Node_BoundQuestEvent_806_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_BndEvt__D739626FMinus428BBAFEMinusE8F60381Minus215DD852_BFGK2Node_BoundQuestEvent_806_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__D739626FMinus428BBAFEMinusE8F60381Minus215DD852_BFGK2Node_BoundQuestEvent_806_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__D739626FMinus428BBAFEMinusE8F60381Minus215DD852_BFGK2Node_BoundQuestEvent_806_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__D739626FMinus428BBAFEMinusE8F60381Minus215DD852_BFGK2Node_BoundQuestEvent_806_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__D739626FMinus428BBAFEMinusE8F60381Minus215DD852_BFGK2Node_BoundQuestEvent_806_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__D739626FMinus428BBAFEMinusE8F60381Minus215DD852_BFGK2Node_BoundQuestEvent_806_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__D739626FMinus428BBAFEMinusE8F60381Minus215DD852_BFGK2Node_BoundQuestEvent_806_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.BndEvt__18B60DC5-4C35A536-67D8ADA1-D0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature
// 0x0068 (0x0068 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iObjectiveIndex;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iValue;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _iTotal;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBFGEventContext                       _eventContext;                                     // 0x0018(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature");
static_assert(sizeof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature) == 0x000068, "Wrong size on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature, _pElement) == 0x000000, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature::_pElement' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature, _iObjectiveIndex) == 0x000008, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature::_iObjectiveIndex' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature, _iValue) == 0x00000C, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature::_iValue' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature, _iTotal) == 0x000010, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature::_iTotal' has a wrong offset!");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature, _eventContext) == 0x000018, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__18B60DC5Minus4C35A536Minus67D8ADA1MinusD0D18CB4_BFGK2Node_BoundQuestEvent_6_BFGQuestElement_Event_VarCounter__DelegateSignature::_eventContext' has a wrong offset!");

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.BndEvt__38A12F60-421486A8-C4E9449C-6B0CDC28_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_12_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.BndEvt__38A12F60-421486A8-C4E9449C-6B0CDC28_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature");
static_assert(sizeof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong size on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature");
static_assert(offsetof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature, _pElement) == 0x000000, "Member 'MM22_AttackOfThe50MinusFtPresident_C_BndEvt__38A12F60Minus421486A8MinusC4E9449CMinus6B0CDC28_BFGK2Node_BoundQuestEvent_10_BFGQuestElement_Event__DelegateSignature::_pElement' has a wrong offset!");

// Function MM22_AttackOfThe50-FtPresident.MM22_AttackOfThe50-FtPresident_C.BndEvt__01FA958C-40B01A72-C2379199-0EC7C282_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MM22_AttackOfThe50MinusFtPresident_C_BndEvt__01FA958CMinus40B01A72MinusC2379199Minus0EC7C282_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature final
{
public:
	class UBFGQuest_Element*                      _pElement;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM22_AttackOfThe50MinusFtPresident_C_BndEvt__01FA958CMinus40B01A72MinusC2379199Minus0EC7C282_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature) == 0x000008, "Wrong alignment on MM22_AttackOfThe50MinusFtPresident_C_BndEvt__01FA958CMinus40B01A72MinusC2379199Minus0EC7C282_BFGK2Node_BoundQuestEvent_9_BFGQuestElement_Event__DelegateSignature");
