#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_RIdingCharacter

#include "Basic.hpp"


namespace SDK::Params
{

// Function AB_RIdingCharacter.AB_RIdingCharacter_C.ExecuteUbergraph_AB_RIdingCharacter
// 0x0050 (0x0050 - 0x0000)
struct AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue10;             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue11;             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue12;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue13;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue14;             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue15;             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue16;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue17;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue18;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue19;             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue20;             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue21;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue22;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue23;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue24;             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue25;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue26;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue27;             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue28;             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue29;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue30;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue31;             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue32;             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue33;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue34;             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue35;             // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue36;             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue37;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue38;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue39;             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue40;             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWalk_ReturnValue;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFall_ReturnValue;                       // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsJump_ReturnValue;                       // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue41;             // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsJumpAnt_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRun_ReturnValue;                        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue42;             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue43;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue44;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue45;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue46;             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue47;             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue48;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue49;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue50;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue51;             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue52;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue53;             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue54;             // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAdditiveHair_ReturnValue;               // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetHairAdditiveAlpha_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue55;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue56;             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter) == 0x000004, "Wrong alignment on AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter");
static_assert(sizeof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter) == 0x000050, "Wrong size on AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, EntryPoint) == 0x000000, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue) == 0x000004, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000005, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue2) == 0x000006, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue3) == 0x000007, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue4) == 0x000008, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue5) == 0x000009, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue6) == 0x00000A, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue7) == 0x00000B, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue8) == 0x00000C, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue9) == 0x00000D, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue10) == 0x00000E, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue10' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue11) == 0x00000F, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue11' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue12) == 0x000010, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue12' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue13) == 0x000011, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue13' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue14) == 0x000012, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue14' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue15) == 0x000013, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue15' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue16) == 0x000014, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue16' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue17) == 0x000015, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue17' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000018, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue18) == 0x00001D, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue18' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue19) == 0x00001E, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue19' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue20) == 0x00001F, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue20' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue21) == 0x000020, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue21' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue22) == 0x000021, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue22' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue23) == 0x000022, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue23' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue24) == 0x000023, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue24' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue25) == 0x000024, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue25' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue26) == 0x000025, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue26' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue27) == 0x000026, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue27' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue28) == 0x000027, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue28' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue29) == 0x000028, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue29' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue30) == 0x000029, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue30' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue31) == 0x00002A, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue31' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue32) == 0x00002B, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue32' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue33) == 0x00002C, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue33' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue34) == 0x00002D, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue34' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue35) == 0x00002E, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue35' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue36) == 0x00002F, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue36' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue37) == 0x000030, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue37' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue38) == 0x000031, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue38' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue39) == 0x000032, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue39' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue40) == 0x000033, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue40' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_IsWalk_ReturnValue) == 0x000034, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_IsWalk_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_IsFall_ReturnValue) == 0x000035, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_IsFall_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_IsJump_ReturnValue) == 0x000036, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_IsJump_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue41) == 0x000037, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue41' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_IsJumpAnt_ReturnValue) == 0x000038, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_IsJumpAnt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_IsRun_ReturnValue) == 0x000039, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_IsRun_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue42) == 0x00003A, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue42' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue43) == 0x00003B, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue43' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue44) == 0x00003C, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue44' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue45) == 0x00003D, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue45' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue46) == 0x00003E, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue46' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue47) == 0x00003F, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue47' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue48) == 0x000040, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue48' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue49) == 0x000041, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue49' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue50) == 0x000042, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue50' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue51) == 0x000043, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue51' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue52) == 0x000044, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue52' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue53) == 0x000045, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue53' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue54) == 0x000046, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue54' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_IsAdditiveHair_ReturnValue) == 0x000047, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_IsAdditiveHair_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_GetHairAdditiveAlpha_ReturnValue) == 0x000048, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_GetHairAdditiveAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue55) == 0x00004C, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue55' has a wrong offset!");
static_assert(offsetof(AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter, CallFunc_Conv_IntToBool_ReturnValue56) == 0x00004D, "Member 'AB_RIdingCharacter_C_ExecuteUbergraph_AB_RIdingCharacter::CallFunc_Conv_IntToBool_ReturnValue56' has a wrong offset!");

}

