#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AT_Character_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AT_Character_BP.AT_Character_BP_C
// 0x0040 (0x1150 - 0x1110)
class AAT_Character_BP_C final : public AAT_Character
{
public:
	class UATCharacterDamageCollision*            ATCharacterDamageCollision;                        // 0x1110(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               TerrainDamageEffect;                               // 0x1118(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 WaterPostProcess;                                  // 0x1120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EntrySPawnInfoOn;                                  // 0x1128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1129[0x3];                                     // 0x1129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TEffectTimer;                                      // 0x112C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TDLastPosition;                                    // 0x1130(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChaseFlg;                                          // 0x113C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113D[0x3];                                     // 0x113D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                TerrainDMng;                                       // 0x1140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PoundingDamageType;                                // 0x1148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AT_Character_BP_C">();
	}
	static class AAT_Character_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAT_Character_BP_C>();
	}
};
static_assert(alignof(AAT_Character_BP_C) == 0x000010, "Wrong alignment on AAT_Character_BP_C");
static_assert(sizeof(AAT_Character_BP_C) == 0x001150, "Wrong size on AAT_Character_BP_C");
static_assert(offsetof(AAT_Character_BP_C, ATCharacterDamageCollision) == 0x001110, "Member 'AAT_Character_BP_C::ATCharacterDamageCollision' has a wrong offset!");
static_assert(offsetof(AAT_Character_BP_C, TerrainDamageEffect) == 0x001118, "Member 'AAT_Character_BP_C::TerrainDamageEffect' has a wrong offset!");
static_assert(offsetof(AAT_Character_BP_C, WaterPostProcess) == 0x001120, "Member 'AAT_Character_BP_C::WaterPostProcess' has a wrong offset!");
static_assert(offsetof(AAT_Character_BP_C, EntrySPawnInfoOn) == 0x001128, "Member 'AAT_Character_BP_C::EntrySPawnInfoOn' has a wrong offset!");
static_assert(offsetof(AAT_Character_BP_C, TEffectTimer) == 0x00112C, "Member 'AAT_Character_BP_C::TEffectTimer' has a wrong offset!");
static_assert(offsetof(AAT_Character_BP_C, TDLastPosition) == 0x001130, "Member 'AAT_Character_BP_C::TDLastPosition' has a wrong offset!");
static_assert(offsetof(AAT_Character_BP_C, ChaseFlg) == 0x00113C, "Member 'AAT_Character_BP_C::ChaseFlg' has a wrong offset!");
static_assert(offsetof(AAT_Character_BP_C, TerrainDMng) == 0x001140, "Member 'AAT_Character_BP_C::TerrainDMng' has a wrong offset!");
static_assert(offsetof(AAT_Character_BP_C, PoundingDamageType) == 0x001148, "Member 'AAT_Character_BP_C::PoundingDamageType' has a wrong offset!");

}

