#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtrociousEnemyNamedEvent_Area06

#include "Basic.hpp"


namespace SDK::Params
{

// Function AtrociousEnemyNamedEvent_Area06.AtrociousEnemyNamedEvent_Area06_C.ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06
// 0x000C (0x000C - 0x0000)
struct AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue3;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PhaseTimingCheck_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PhaseTimingCheck_ReturnValue1;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PhaseTimingCheck_ReturnValue2;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PhaseTimingCheck_ReturnValue3;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06) == 0x000004, "Wrong alignment on AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06");
static_assert(sizeof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06) == 0x00000C, "Wrong size on AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06");
static_assert(offsetof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06, EntryPoint) == 0x000000, "Member 'AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06::EntryPoint' has a wrong offset!");
static_assert(offsetof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06, CallFunc_MakeLiteralByte_ReturnValue1) == 0x000005, "Member 'AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06::CallFunc_MakeLiteralByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06, CallFunc_MakeLiteralByte_ReturnValue2) == 0x000006, "Member 'AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06::CallFunc_MakeLiteralByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06, CallFunc_MakeLiteralByte_ReturnValue3) == 0x000007, "Member 'AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06::CallFunc_MakeLiteralByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06, CallFunc_PhaseTimingCheck_ReturnValue) == 0x000008, "Member 'AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06::CallFunc_PhaseTimingCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06, CallFunc_PhaseTimingCheck_ReturnValue1) == 0x000009, "Member 'AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06::CallFunc_PhaseTimingCheck_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06, CallFunc_PhaseTimingCheck_ReturnValue2) == 0x00000A, "Member 'AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06::CallFunc_PhaseTimingCheck_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06, CallFunc_PhaseTimingCheck_ReturnValue3) == 0x00000B, "Member 'AtrociousEnemyNamedEvent_Area06_C_ExecuteUbergraph_AtrociousEnemyNamedEvent_Area06::CallFunc_PhaseTimingCheck_ReturnValue3' has a wrong offset!");

}

