#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battle_Msg_Break

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Battle_Msg_Break.Battle_Msg_Break_C
// 0x0180 (0x0568 - 0x03E8)
class Battle_Msg_Break::UBattle_Msg_Break_C final : public UAT_UIBattleMsgBreak_Lang
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Start;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff00;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff01;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff01_01;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff02;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff02_01;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff03;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff03_01;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff03_02;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff04;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff05;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff06;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff06_01;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff06_02;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff06_03;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff06_04;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff06_05;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff07;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff07_01;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff08;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff09;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff10;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff10_01;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff11;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff11_01;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff11_02;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff12;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff12_01;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff12_02;                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff13;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff13_01;                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff14;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff14_01;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff14_03;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff15_01;                                // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff15_02;                                // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff15_03;                                // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff15_04;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Break_Eff16;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Cutin_Eff06_00;                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Cutin_Eff06_01;                                // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Cutin_Eff06_02;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Long_Btn_Eff00;                                // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Long_Btn_Eff01;                                // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lang_Break;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lang_Break_Eff;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lang_Break_Eff2;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Battle_Msg_Break(int32 EntryPoint);
	void ConstructFirstOnly();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass Battle_Msg_Break.Battle_Msg_Break_C", true, "Battle_Msg_Break_C">();
	}
	static class Battle_Msg_Break::UBattle_Msg_Break_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Battle_Msg_Break::UBattle_Msg_Break_C>();
	}
};
static_assert(alignof(Battle_Msg_Break::UBattle_Msg_Break_C) == 0x000008, "Wrong alignment on Battle_Msg_Break::UBattle_Msg_Break_C");
static_assert(sizeof(Battle_Msg_Break::UBattle_Msg_Break_C) == 0x000568, "Wrong size on Battle_Msg_Break::UBattle_Msg_Break_C");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, UberGraphFrame) == 0x0003E8, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Start) == 0x0003F0, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Start' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff00) == 0x0003F8, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff00' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff01) == 0x000400, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff01_01) == 0x000408, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff01_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff02) == 0x000410, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff02' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff02_01) == 0x000418, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff02_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff03) == 0x000420, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff03' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff03_01) == 0x000428, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff03_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff03_02) == 0x000430, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff03_02' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff04) == 0x000438, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff04' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff05) == 0x000440, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff05' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff06) == 0x000448, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff06' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff06_01) == 0x000450, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff06_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff06_02) == 0x000458, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff06_02' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff06_03) == 0x000460, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff06_03' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff06_04) == 0x000468, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff06_04' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff06_05) == 0x000470, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff06_05' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff07) == 0x000478, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff07' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff07_01) == 0x000480, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff07_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff08) == 0x000488, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff08' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff09) == 0x000490, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff09' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff10) == 0x000498, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff10' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff10_01) == 0x0004A0, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff10_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff11) == 0x0004A8, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff11' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff11_01) == 0x0004B0, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff11_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff11_02) == 0x0004B8, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff11_02' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff12) == 0x0004C0, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff12' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff12_01) == 0x0004C8, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff12_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff12_02) == 0x0004D0, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff12_02' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff13) == 0x0004D8, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff13' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff13_01) == 0x0004E0, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff13_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff14) == 0x0004E8, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff14' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff14_01) == 0x0004F0, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff14_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff14_03) == 0x0004F8, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff14_03' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff15_01) == 0x000500, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff15_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff15_02) == 0x000508, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff15_02' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff15_03) == 0x000510, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff15_03' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff15_04) == 0x000518, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff15_04' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Img_Break_Eff16) == 0x000520, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Img_Break_Eff16' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Ins_Cutin_Eff06_00) == 0x000528, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Ins_Cutin_Eff06_00' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Ins_Cutin_Eff06_01) == 0x000530, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Ins_Cutin_Eff06_01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Ins_Cutin_Eff06_02) == 0x000538, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Ins_Cutin_Eff06_02' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Ins_Long_Btn_Eff00) == 0x000540, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Ins_Long_Btn_Eff00' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Ins_Long_Btn_Eff01) == 0x000548, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Ins_Long_Btn_Eff01' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Lang_Break) == 0x000550, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Lang_Break' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Lang_Break_Eff) == 0x000558, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Lang_Break_Eff' has a wrong offset!");
static_assert(offsetof(Battle_Msg_Break::UBattle_Msg_Break_C, Lang_Break_Eff2) == 0x000560, "Member 'Battle_Msg_Break::UBattle_Msg_Break_C::Lang_Break_Eff2' has a wrong offset!");

}

