#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battle_Info_Challenge

#include "Basic.hpp"

#include "AT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Battle_Info_Challenge.Battle_Info_Challenge_C
// 0x0030 (0x0490 - 0x0460)
class UBattle_Info_Challenge_C final : public UAT_UIBattleInfoChallenge
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Eff00;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Eff01;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Ins_Line;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Pnl_Detale;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battle_Info_Challenge_C">();
	}
	static class UBattle_Info_Challenge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattle_Info_Challenge_C>();
	}
};
static_assert(alignof(UBattle_Info_Challenge_C) == 0x000008, "Wrong alignment on UBattle_Info_Challenge_C");
static_assert(sizeof(UBattle_Info_Challenge_C) == 0x000490, "Wrong size on UBattle_Info_Challenge_C");
static_assert(offsetof(UBattle_Info_Challenge_C, Out) == 0x000460, "Member 'UBattle_Info_Challenge_C::Out' has a wrong offset!");
static_assert(offsetof(UBattle_Info_Challenge_C, In) == 0x000468, "Member 'UBattle_Info_Challenge_C::In' has a wrong offset!");
static_assert(offsetof(UBattle_Info_Challenge_C, Img_Eff00) == 0x000470, "Member 'UBattle_Info_Challenge_C::Img_Eff00' has a wrong offset!");
static_assert(offsetof(UBattle_Info_Challenge_C, Img_Eff01) == 0x000478, "Member 'UBattle_Info_Challenge_C::Img_Eff01' has a wrong offset!");
static_assert(offsetof(UBattle_Info_Challenge_C, Img_Ins_Line) == 0x000480, "Member 'UBattle_Info_Challenge_C::Img_Ins_Line' has a wrong offset!");
static_assert(offsetof(UBattle_Info_Challenge_C, Pnl_Detale) == 0x000488, "Member 'UBattle_Info_Challenge_C::Pnl_Detale' has a wrong offset!");

}

