#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battle_Lock_Tps00

#include "Basic.hpp"

#include "AT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Battle_Lock_Tps00.Battle_Lock_Tps00_C
// 0x0038 (0x0428 - 0x03F0)
class UBattle_Lock_Tps00_C final : public UAT_UITPSSkillCursor
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts00;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts01;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts02;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Curs_Eff00;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Curs_Eff01;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battle_Lock_Tps00_C">();
	}
	static class UBattle_Lock_Tps00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattle_Lock_Tps00_C>();
	}
};
static_assert(alignof(UBattle_Lock_Tps00_C) == 0x000008, "Wrong alignment on UBattle_Lock_Tps00_C");
static_assert(sizeof(UBattle_Lock_Tps00_C) == 0x000428, "Wrong size on UBattle_Lock_Tps00_C");
static_assert(offsetof(UBattle_Lock_Tps00_C, Out) == 0x0003F0, "Member 'UBattle_Lock_Tps00_C::Out' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps00_C, In) == 0x0003F8, "Member 'UBattle_Lock_Tps00_C::In' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps00_C, Img_Curs_Parts00) == 0x000400, "Member 'UBattle_Lock_Tps00_C::Img_Curs_Parts00' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps00_C, Img_Curs_Parts01) == 0x000408, "Member 'UBattle_Lock_Tps00_C::Img_Curs_Parts01' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps00_C, Img_Curs_Parts02) == 0x000410, "Member 'UBattle_Lock_Tps00_C::Img_Curs_Parts02' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps00_C, Ins_Curs_Eff00) == 0x000418, "Member 'UBattle_Lock_Tps00_C::Ins_Curs_Eff00' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps00_C, Ins_Curs_Eff01) == 0x000420, "Member 'UBattle_Lock_Tps00_C::Ins_Curs_Eff01' has a wrong offset!");

}

