#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battle_Crowd_Zcmb_Eff

#include "Basic.hpp"

#include "CFramework_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Battle_Crowd_Zcmb_Eff.Battle_Crowd_Zcmb_Eff_C
// 0x0080 (0x0418 - 0x0398)
class UBattle_Crowd_Zcmb_Eff_C final : public UCFUIUserWidget
{
public:
	class UWidgetAnimation*                       Start02;                                           // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Start01;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Start00;                                           // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Eff_Flare00;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Eff_Spike00;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Eff_Spike01;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Eff_Spike02;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Eff_Spike03;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Circle;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Flare00_00;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Flare00_01;                                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Flare01_00;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Flare01_01;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Xef_Fad01;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Xef_Sprk01_00;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Xef_Sprk01_01;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battle_Crowd_Zcmb_Eff_C">();
	}
	static class UBattle_Crowd_Zcmb_Eff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattle_Crowd_Zcmb_Eff_C>();
	}
};
static_assert(alignof(UBattle_Crowd_Zcmb_Eff_C) == 0x000008, "Wrong alignment on UBattle_Crowd_Zcmb_Eff_C");
static_assert(sizeof(UBattle_Crowd_Zcmb_Eff_C) == 0x000418, "Wrong size on UBattle_Crowd_Zcmb_Eff_C");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Start02) == 0x000398, "Member 'UBattle_Crowd_Zcmb_Eff_C::Start02' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Start01) == 0x0003A0, "Member 'UBattle_Crowd_Zcmb_Eff_C::Start01' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Start00) == 0x0003A8, "Member 'UBattle_Crowd_Zcmb_Eff_C::Start00' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Img_Eff_Flare00) == 0x0003B0, "Member 'UBattle_Crowd_Zcmb_Eff_C::Img_Eff_Flare00' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Img_Eff_Spike00) == 0x0003B8, "Member 'UBattle_Crowd_Zcmb_Eff_C::Img_Eff_Spike00' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Img_Eff_Spike01) == 0x0003C0, "Member 'UBattle_Crowd_Zcmb_Eff_C::Img_Eff_Spike01' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Img_Eff_Spike02) == 0x0003C8, "Member 'UBattle_Crowd_Zcmb_Eff_C::Img_Eff_Spike02' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Img_Eff_Spike03) == 0x0003D0, "Member 'UBattle_Crowd_Zcmb_Eff_C::Img_Eff_Spike03' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Ins_Eff_Circle) == 0x0003D8, "Member 'UBattle_Crowd_Zcmb_Eff_C::Ins_Eff_Circle' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Ins_Eff_Flare00_00) == 0x0003E0, "Member 'UBattle_Crowd_Zcmb_Eff_C::Ins_Eff_Flare00_00' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Ins_Eff_Flare00_01) == 0x0003E8, "Member 'UBattle_Crowd_Zcmb_Eff_C::Ins_Eff_Flare00_01' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Ins_Eff_Flare01_00) == 0x0003F0, "Member 'UBattle_Crowd_Zcmb_Eff_C::Ins_Eff_Flare01_00' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Ins_Eff_Flare01_01) == 0x0003F8, "Member 'UBattle_Crowd_Zcmb_Eff_C::Ins_Eff_Flare01_01' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Ins_Xef_Fad01) == 0x000400, "Member 'UBattle_Crowd_Zcmb_Eff_C::Ins_Xef_Fad01' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Ins_Xef_Sprk01_00) == 0x000408, "Member 'UBattle_Crowd_Zcmb_Eff_C::Ins_Xef_Sprk01_00' has a wrong offset!");
static_assert(offsetof(UBattle_Crowd_Zcmb_Eff_C, Ins_Xef_Sprk01_01) == 0x000410, "Member 'UBattle_Crowd_Zcmb_Eff_C::Ins_Xef_Sprk01_01' has a wrong offset!");

}

