#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battle_Tips_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Battle_Tips_List.Battle_Tips_List_C
// 0x0018 (0x03C0 - 0x03A8)
class UBattle_Tips_List_C final : public UAT_UIBattleTipsList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       All_Nut_InvalidationBox;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           All_Tips_Tutorial;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Battle_Tips_List(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battle_Tips_List_C">();
	}
	static class UBattle_Tips_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattle_Tips_List_C>();
	}
};
static_assert(alignof(UBattle_Tips_List_C) == 0x000008, "Wrong alignment on UBattle_Tips_List_C");
static_assert(sizeof(UBattle_Tips_List_C) == 0x0003C0, "Wrong size on UBattle_Tips_List_C");
static_assert(offsetof(UBattle_Tips_List_C, UberGraphFrame) == 0x0003A8, "Member 'UBattle_Tips_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattle_Tips_List_C, All_Nut_InvalidationBox) == 0x0003B0, "Member 'UBattle_Tips_List_C::All_Nut_InvalidationBox' has a wrong offset!");
static_assert(offsetof(UBattle_Tips_List_C, All_Tips_Tutorial) == 0x0003B8, "Member 'UBattle_Tips_List_C::All_Tips_Tutorial' has a wrong offset!");

}

