#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battle_Lock_Tps01

#include "Basic.hpp"

#include "AT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Battle_Lock_Tps01.Battle_Lock_Tps01_C
// 0x0058 (0x04C0 - 0x0468)
class UBattle_Lock_Tps01_C final : public UAT_UITPSSkillCursorTypeA
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts00;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts01;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts03_00;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts03_01;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts03_02;                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts03_03;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts03_04;                               // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Curs_Parts03_05;                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Curs_Eff00;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battle_Lock_Tps01_C">();
	}
	static class UBattle_Lock_Tps01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattle_Lock_Tps01_C>();
	}
};
static_assert(alignof(UBattle_Lock_Tps01_C) == 0x000008, "Wrong alignment on UBattle_Lock_Tps01_C");
static_assert(sizeof(UBattle_Lock_Tps01_C) == 0x0004C0, "Wrong size on UBattle_Lock_Tps01_C");
static_assert(offsetof(UBattle_Lock_Tps01_C, Out) == 0x000468, "Member 'UBattle_Lock_Tps01_C::Out' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, In) == 0x000470, "Member 'UBattle_Lock_Tps01_C::In' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, Img_Curs_Parts00) == 0x000478, "Member 'UBattle_Lock_Tps01_C::Img_Curs_Parts00' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, Img_Curs_Parts01) == 0x000480, "Member 'UBattle_Lock_Tps01_C::Img_Curs_Parts01' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, Img_Curs_Parts03_00) == 0x000488, "Member 'UBattle_Lock_Tps01_C::Img_Curs_Parts03_00' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, Img_Curs_Parts03_01) == 0x000490, "Member 'UBattle_Lock_Tps01_C::Img_Curs_Parts03_01' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, Img_Curs_Parts03_02) == 0x000498, "Member 'UBattle_Lock_Tps01_C::Img_Curs_Parts03_02' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, Img_Curs_Parts03_03) == 0x0004A0, "Member 'UBattle_Lock_Tps01_C::Img_Curs_Parts03_03' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, Img_Curs_Parts03_04) == 0x0004A8, "Member 'UBattle_Lock_Tps01_C::Img_Curs_Parts03_04' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, Img_Curs_Parts03_05) == 0x0004B0, "Member 'UBattle_Lock_Tps01_C::Img_Curs_Parts03_05' has a wrong offset!");
static_assert(offsetof(UBattle_Lock_Tps01_C, Ins_Curs_Eff00) == 0x0004B8, "Member 'UBattle_Lock_Tps01_C::Ins_Curs_Eff00' has a wrong offset!");

}

