#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battle_Dmg

#include "Basic.hpp"

#include "AT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Battle_Dmg.Battle_Dmg_C
// 0x00B8 (0x05D0 - 0x0518)
class UBattle_Dmg_C final : public UAT_UIDamagePop
{
public:
	class UWidgetAnimation*                       Normal_Text;                                       // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Critical_Text;                                     // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Base_Critical;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Lang_Critical;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_00;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_01;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_02;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_03;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_04;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_05;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_06;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_07;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_08;                                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_Eff00;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_Eff01;                                   // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_Eff02;                                   // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_Eff03;                                   // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_Eff04;                                   // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_Eff05;                                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_Eff06;                                   // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_Eff07;                                   // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Dmg00_Eff08;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Lang_Critical;                                 // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battle_Dmg_C">();
	}
	static class UBattle_Dmg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattle_Dmg_C>();
	}
};
static_assert(alignof(UBattle_Dmg_C) == 0x000008, "Wrong alignment on UBattle_Dmg_C");
static_assert(sizeof(UBattle_Dmg_C) == 0x0005D0, "Wrong size on UBattle_Dmg_C");
static_assert(offsetof(UBattle_Dmg_C, Normal_Text) == 0x000518, "Member 'UBattle_Dmg_C::Normal_Text' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Critical_Text) == 0x000520, "Member 'UBattle_Dmg_C::Critical_Text' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Img_Base_Critical) == 0x000528, "Member 'UBattle_Dmg_C::Img_Base_Critical' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Img_Lang_Critical) == 0x000530, "Member 'UBattle_Dmg_C::Img_Lang_Critical' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_00) == 0x000538, "Member 'UBattle_Dmg_C::Ins_Dmg00_00' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_01) == 0x000540, "Member 'UBattle_Dmg_C::Ins_Dmg00_01' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_02) == 0x000548, "Member 'UBattle_Dmg_C::Ins_Dmg00_02' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_03) == 0x000550, "Member 'UBattle_Dmg_C::Ins_Dmg00_03' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_04) == 0x000558, "Member 'UBattle_Dmg_C::Ins_Dmg00_04' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_05) == 0x000560, "Member 'UBattle_Dmg_C::Ins_Dmg00_05' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_06) == 0x000568, "Member 'UBattle_Dmg_C::Ins_Dmg00_06' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_07) == 0x000570, "Member 'UBattle_Dmg_C::Ins_Dmg00_07' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_08) == 0x000578, "Member 'UBattle_Dmg_C::Ins_Dmg00_08' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_Eff00) == 0x000580, "Member 'UBattle_Dmg_C::Ins_Dmg00_Eff00' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_Eff01) == 0x000588, "Member 'UBattle_Dmg_C::Ins_Dmg00_Eff01' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_Eff02) == 0x000590, "Member 'UBattle_Dmg_C::Ins_Dmg00_Eff02' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_Eff03) == 0x000598, "Member 'UBattle_Dmg_C::Ins_Dmg00_Eff03' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_Eff04) == 0x0005A0, "Member 'UBattle_Dmg_C::Ins_Dmg00_Eff04' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_Eff05) == 0x0005A8, "Member 'UBattle_Dmg_C::Ins_Dmg00_Eff05' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_Eff06) == 0x0005B0, "Member 'UBattle_Dmg_C::Ins_Dmg00_Eff06' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_Eff07) == 0x0005B8, "Member 'UBattle_Dmg_C::Ins_Dmg00_Eff07' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Dmg00_Eff08) == 0x0005C0, "Member 'UBattle_Dmg_C::Ins_Dmg00_Eff08' has a wrong offset!");
static_assert(offsetof(UBattle_Dmg_C, Ins_Lang_Critical) == 0x0005C8, "Member 'UBattle_Dmg_C::Ins_Lang_Critical' has a wrong offset!");

}

