#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battle_Hud_Simple

#include "Basic.hpp"

#include "AT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Battle_Hud_Simple.Battle_Hud_Simple_C
// 0x0040 (0x0520 - 0x04E0)
class UBattle_Hud_Simple_C final : public UAT_UIBattleHudEnemySimple
{
public:
	class UWidgetAnimation*                       Down;                                              // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Base_E_Simple;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Gauge_Hp_Simple00;                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Gauge_Hp_Simple01;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXcmn_MultiLineText_C*                  Txt_Lv;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXcmn_MultiLineText_C*                  Txt_Num_Gauge;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battle_Hud_Simple_C">();
	}
	static class UBattle_Hud_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattle_Hud_Simple_C>();
	}
};
static_assert(alignof(UBattle_Hud_Simple_C) == 0x000008, "Wrong alignment on UBattle_Hud_Simple_C");
static_assert(sizeof(UBattle_Hud_Simple_C) == 0x000520, "Wrong size on UBattle_Hud_Simple_C");
static_assert(offsetof(UBattle_Hud_Simple_C, Down) == 0x0004E0, "Member 'UBattle_Hud_Simple_C::Down' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_Simple_C, Out) == 0x0004E8, "Member 'UBattle_Hud_Simple_C::Out' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_Simple_C, In) == 0x0004F0, "Member 'UBattle_Hud_Simple_C::In' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_Simple_C, Img_Base_E_Simple) == 0x0004F8, "Member 'UBattle_Hud_Simple_C::Img_Base_E_Simple' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_Simple_C, Ins_Gauge_Hp_Simple00) == 0x000500, "Member 'UBattle_Hud_Simple_C::Ins_Gauge_Hp_Simple00' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_Simple_C, Ins_Gauge_Hp_Simple01) == 0x000508, "Member 'UBattle_Hud_Simple_C::Ins_Gauge_Hp_Simple01' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_Simple_C, Txt_Lv) == 0x000510, "Member 'UBattle_Hud_Simple_C::Txt_Lv' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_Simple_C, Txt_Num_Gauge) == 0x000518, "Member 'UBattle_Hud_Simple_C::Txt_Num_Gauge' has a wrong offset!");

}

