#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Battle_Hud_P_Zb

#include "Basic.hpp"

#include "AT_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Battle_Hud_P_Zb.Battle_Hud_P_Zb_C
// 0x00A8 (0x04F0 - 0x0448)
class UBattle_Hud_P_Zb_C final : public UAT_UIBattle_Hud_ZOverthrow
{
public:
	class UWidgetAnimation*                       In_Lv;                                             // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Full_Skill;                                        // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Up_Lv;                                             // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInvalidationBox*                       All_Nut_InvalidationBox;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Zb_Gauge_Base;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Zb_Gauge_C;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Bind00_00;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Bind00_01;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Bind01_00;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Bind01_01;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Bind02;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Eff_Bind03;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Xef_Fad10;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Zb_Eff01;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Zb_Gauge1;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Zb_Gauge2;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ins_Zb_Gauge3;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXcmn_MultiLineText_C*                  Txt_Lv;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXcmn_MultiLineText_C*                  Txt_Lv_Eff00;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXcmn_MultiLineText_C*                  Txt_Lv_Eff01;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             FaceTex;                                           // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battle_Hud_P_Zb_C">();
	}
	static class UBattle_Hud_P_Zb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattle_Hud_P_Zb_C>();
	}
};
static_assert(alignof(UBattle_Hud_P_Zb_C) == 0x000008, "Wrong alignment on UBattle_Hud_P_Zb_C");
static_assert(sizeof(UBattle_Hud_P_Zb_C) == 0x0004F0, "Wrong size on UBattle_Hud_P_Zb_C");
static_assert(offsetof(UBattle_Hud_P_Zb_C, In_Lv) == 0x000448, "Member 'UBattle_Hud_P_Zb_C::In_Lv' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Full_Skill) == 0x000450, "Member 'UBattle_Hud_P_Zb_C::Full_Skill' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Up_Lv) == 0x000458, "Member 'UBattle_Hud_P_Zb_C::Up_Lv' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, All_Nut_InvalidationBox) == 0x000460, "Member 'UBattle_Hud_P_Zb_C::All_Nut_InvalidationBox' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Img_Zb_Gauge_Base) == 0x000468, "Member 'UBattle_Hud_P_Zb_C::Img_Zb_Gauge_Base' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Img_Zb_Gauge_C) == 0x000470, "Member 'UBattle_Hud_P_Zb_C::Img_Zb_Gauge_C' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Eff_Bind00_00) == 0x000478, "Member 'UBattle_Hud_P_Zb_C::Ins_Eff_Bind00_00' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Eff_Bind00_01) == 0x000480, "Member 'UBattle_Hud_P_Zb_C::Ins_Eff_Bind00_01' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Eff_Bind01_00) == 0x000488, "Member 'UBattle_Hud_P_Zb_C::Ins_Eff_Bind01_00' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Eff_Bind01_01) == 0x000490, "Member 'UBattle_Hud_P_Zb_C::Ins_Eff_Bind01_01' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Eff_Bind02) == 0x000498, "Member 'UBattle_Hud_P_Zb_C::Ins_Eff_Bind02' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Eff_Bind03) == 0x0004A0, "Member 'UBattle_Hud_P_Zb_C::Ins_Eff_Bind03' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Xef_Fad10) == 0x0004A8, "Member 'UBattle_Hud_P_Zb_C::Ins_Xef_Fad10' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Zb_Eff01) == 0x0004B0, "Member 'UBattle_Hud_P_Zb_C::Ins_Zb_Eff01' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Zb_Gauge1) == 0x0004B8, "Member 'UBattle_Hud_P_Zb_C::Ins_Zb_Gauge1' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Zb_Gauge2) == 0x0004C0, "Member 'UBattle_Hud_P_Zb_C::Ins_Zb_Gauge2' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Ins_Zb_Gauge3) == 0x0004C8, "Member 'UBattle_Hud_P_Zb_C::Ins_Zb_Gauge3' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Txt_Lv) == 0x0004D0, "Member 'UBattle_Hud_P_Zb_C::Txt_Lv' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Txt_Lv_Eff00) == 0x0004D8, "Member 'UBattle_Hud_P_Zb_C::Txt_Lv_Eff00' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, Txt_Lv_Eff01) == 0x0004E0, "Member 'UBattle_Hud_P_Zb_C::Txt_Lv_Eff01' has a wrong offset!");
static_assert(offsetof(UBattle_Hud_P_Zb_C, FaceTex) == 0x0004E8, "Member 'UBattle_Hud_P_Zb_C::FaceTex' has a wrong offset!");

}

