#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Area07_Ocean

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Area07_Ocean.BP_Area07_Ocean_C.ExecuteUbergraph_BP_Area07_Ocean
// 0x0100 (0x0100 - 0x0000)
struct BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterialInstance_NewParam;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue1;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue1;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterialInstance_NewParam1;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean) == 0x000008, "Wrong alignment on BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean");
static_assert(sizeof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean) == 0x000100, "Wrong size on BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, EntryPoint) == 0x000000, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_GetDynamicMaterialInstance_NewParam) == 0x000008, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_GetDynamicMaterialInstance_NewParam' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000018, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000A0, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_GetPlayerCameraManager_ReturnValue1) == 0x0000A8, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_GetPlayerCameraManager_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_GetCameraLocation_ReturnValue) == 0x0000B0, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_BreakVector_X) == 0x0000BC, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_BreakVector_Z) == 0x0000C4, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_IsValid_ReturnValue1) == 0x0000C8, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0000CC, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_MakeLiteralFloat_ReturnValue1) == 0x0000D0, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_MakeLiteralFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000D4, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_BreakVector_X1) == 0x0000E4, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_BreakVector_Y1) == 0x0000E8, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_BreakVector_Z1) == 0x0000EC, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_GetDynamicMaterialInstance_NewParam1) == 0x0000F0, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_GetDynamicMaterialInstance_NewParam1' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean, CallFunc_IsValid_ReturnValue2) == 0x0000F8, "Member 'BP_Area07_Ocean_C_ExecuteUbergraph_BP_Area07_Ocean::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function BP_Area07_Ocean.BP_Area07_Ocean_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Area07_Ocean_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Area07_Ocean_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Area07_Ocean_C_ReceiveTick");
static_assert(sizeof(BP_Area07_Ocean_C_ReceiveTick) == 0x000004, "Wrong size on BP_Area07_Ocean_C_ReceiveTick");
static_assert(offsetof(BP_Area07_Ocean_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Area07_Ocean_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Area07_Ocean.BP_Area07_Ocean_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_Area07_Ocean_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Area07_Ocean_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Area07_Ocean_C_UserConstructionScript");
static_assert(sizeof(BP_Area07_Ocean_C_UserConstructionScript) == 0x000028, "Wrong size on BP_Area07_Ocean_C_UserConstructionScript");
static_assert(offsetof(BP_Area07_Ocean_C_UserConstructionScript, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'BP_Area07_Ocean_C_UserConstructionScript::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_Area07_Ocean_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_UserConstructionScript, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000010, "Member 'BP_Area07_Ocean_C_UserConstructionScript::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00001C, "Member 'BP_Area07_Ocean_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function BP_Area07_Ocean.BP_Area07_Ocean_C.Make Transform
// 0x0090 (0x0090 - 0x0000)
struct BP_Area07_Ocean_C_Make_Transform final
{
public:
	float                                         XAxisCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YAxisCount;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Diameter;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Area07_Ocean_C_Make_Transform) == 0x000010, "Wrong alignment on BP_Area07_Ocean_C_Make_Transform");
static_assert(sizeof(BP_Area07_Ocean_C_Make_Transform) == 0x000090, "Wrong size on BP_Area07_Ocean_C_Make_Transform");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, XAxisCount) == 0x000000, "Member 'BP_Area07_Ocean_C_Make_Transform::XAxisCount' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, YAxisCount) == 0x000004, "Member 'BP_Area07_Ocean_C_Make_Transform::YAxisCount' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, Diameter) == 0x000008, "Member 'BP_Area07_Ocean_C_Make_Transform::Diameter' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, Radius) == 0x00000C, "Member 'BP_Area07_Ocean_C_Make_Transform::Radius' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, Transform) == 0x000010, "Member 'BP_Area07_Ocean_C_Make_Transform::Transform' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_Area07_Ocean_C_Make_Transform::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000044, "Member 'BP_Area07_Ocean_C_Make_Transform::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_Area07_Ocean_C_Make_Transform::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, CallFunc_Add_FloatFloat_ReturnValue1) == 0x00004C, "Member 'BP_Area07_Ocean_C_Make_Transform::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BP_Area07_Ocean_C_Make_Transform::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Area07_Ocean_C_Make_Transform, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'BP_Area07_Ocean_C_Make_Transform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

}

