#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimalBase_CH

#include "Basic.hpp"

#include "Snowfall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AnimalBase_CH.AnimalBase_CH_C
// 0x0020 (0x1320 - 0x1300)
class AAnimalBase_CH_C final : public ASnfNpcAnimal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USnfFootstepEffectComponent*            SnfFootstepEffect;                                 // 0x1308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ObstacleCheckTimer;                                // 0x1310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AnimalBase_CH(int32 EntryPoint);
	void SetupCompleted();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void FrontObstacleCheck(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimalBase_CH_C">();
	}
	static class AAnimalBase_CH_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAnimalBase_CH_C>();
	}
};
static_assert(alignof(AAnimalBase_CH_C) == 0x000010, "Wrong alignment on AAnimalBase_CH_C");
static_assert(sizeof(AAnimalBase_CH_C) == 0x001320, "Wrong size on AAnimalBase_CH_C");
static_assert(offsetof(AAnimalBase_CH_C, UberGraphFrame) == 0x001300, "Member 'AAnimalBase_CH_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAnimalBase_CH_C, SnfFootstepEffect) == 0x001308, "Member 'AAnimalBase_CH_C::SnfFootstepEffect' has a wrong offset!");
static_assert(offsetof(AAnimalBase_CH_C, ObstacleCheckTimer) == 0x001310, "Member 'AAnimalBase_CH_C::ObstacleCheckTimer' has a wrong offset!");

}

