#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CmnRichControllButton_UI

#include "Basic.hpp"

#include "Snowfall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CmnRichControllButton_UI.CmnRichControllButton_UI_C
// 0x0038 (0x0418 - 0x03E0)
class UCmnRichControllButton_UI_C final : public USnfButtonDescriptionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Blink5;                                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Blink4;                                            // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Blink3;                                            // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Blink2;                                            // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Blink1;                                            // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTngRichTextBlock*                      TngRichDescriptionMainText;                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CmnRichControllButton_UI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void StartBlinkAnim();
	void ResetBlinkAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CmnRichControllButton_UI_C">();
	}
	static class UCmnRichControllButton_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCmnRichControllButton_UI_C>();
	}
};
static_assert(alignof(UCmnRichControllButton_UI_C) == 0x000008, "Wrong alignment on UCmnRichControllButton_UI_C");
static_assert(sizeof(UCmnRichControllButton_UI_C) == 0x000418, "Wrong size on UCmnRichControllButton_UI_C");
static_assert(offsetof(UCmnRichControllButton_UI_C, UberGraphFrame) == 0x0003E0, "Member 'UCmnRichControllButton_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCmnRichControllButton_UI_C, Blink5) == 0x0003E8, "Member 'UCmnRichControllButton_UI_C::Blink5' has a wrong offset!");
static_assert(offsetof(UCmnRichControllButton_UI_C, Blink4) == 0x0003F0, "Member 'UCmnRichControllButton_UI_C::Blink4' has a wrong offset!");
static_assert(offsetof(UCmnRichControllButton_UI_C, Blink3) == 0x0003F8, "Member 'UCmnRichControllButton_UI_C::Blink3' has a wrong offset!");
static_assert(offsetof(UCmnRichControllButton_UI_C, Blink2) == 0x000400, "Member 'UCmnRichControllButton_UI_C::Blink2' has a wrong offset!");
static_assert(offsetof(UCmnRichControllButton_UI_C, Blink1) == 0x000408, "Member 'UCmnRichControllButton_UI_C::Blink1' has a wrong offset!");
static_assert(offsetof(UCmnRichControllButton_UI_C, TngRichDescriptionMainText) == 0x000410, "Member 'UCmnRichControllButton_UI_C::TngRichDescriptionMainText' has a wrong offset!");

}

