#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlList_UI

#include "Basic.hpp"

#include "Snowfall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ControlList_UI.ControlList_UI_C
// 0x0018 (0x0398 - 0x0380)
class UControlList_UI_C final : public USnfControlListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             PanelSlot;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         FirstSelectIndex;                                  // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ControlList_UI(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ControlList_UI_C">();
	}
	static class UControlList_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlList_UI_C>();
	}
};
static_assert(alignof(UControlList_UI_C) == 0x000008, "Wrong alignment on UControlList_UI_C");
static_assert(sizeof(UControlList_UI_C) == 0x000398, "Wrong size on UControlList_UI_C");
static_assert(offsetof(UControlList_UI_C, UberGraphFrame) == 0x000380, "Member 'UControlList_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UControlList_UI_C, PanelSlot) == 0x000388, "Member 'UControlList_UI_C::PanelSlot' has a wrong offset!");
static_assert(offsetof(UControlList_UI_C, FirstSelectIndex) == 0x000390, "Member 'UControlList_UI_C::FirstSelectIndex' has a wrong offset!");

}

