#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DrawOption_UI

#include "Basic.hpp"


namespace SDK::Params
{

// Function DrawOption_UI.DrawOption_UI_C.ExecuteUbergraph_DrawOption_UI
// 0x0004 (0x0004 - 0x0000)
struct DrawOption_UI_C_ExecuteUbergraph_DrawOption_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrawOption_UI_C_ExecuteUbergraph_DrawOption_UI) == 0x000004, "Wrong alignment on DrawOption_UI_C_ExecuteUbergraph_DrawOption_UI");
static_assert(sizeof(DrawOption_UI_C_ExecuteUbergraph_DrawOption_UI) == 0x000004, "Wrong size on DrawOption_UI_C_ExecuteUbergraph_DrawOption_UI");
static_assert(offsetof(DrawOption_UI_C_ExecuteUbergraph_DrawOption_UI, EntryPoint) == 0x000000, "Member 'DrawOption_UI_C_ExecuteUbergraph_DrawOption_UI::EntryPoint' has a wrong offset!");

// Function DrawOption_UI.DrawOption_UI_C.Blueprint_GetFocusTabIndex
// 0x000C (0x000C - 0x0000)
struct DrawOption_UI_C_Blueprint_GetFocusTabIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFocusIndex_IsFind;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFocusIndex_Index;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrawOption_UI_C_Blueprint_GetFocusTabIndex) == 0x000004, "Wrong alignment on DrawOption_UI_C_Blueprint_GetFocusTabIndex");
static_assert(sizeof(DrawOption_UI_C_Blueprint_GetFocusTabIndex) == 0x00000C, "Wrong size on DrawOption_UI_C_Blueprint_GetFocusTabIndex");
static_assert(offsetof(DrawOption_UI_C_Blueprint_GetFocusTabIndex, Index_0) == 0x000000, "Member 'DrawOption_UI_C_Blueprint_GetFocusTabIndex::Index_0' has a wrong offset!");
static_assert(offsetof(DrawOption_UI_C_Blueprint_GetFocusTabIndex, ReturnValue) == 0x000004, "Member 'DrawOption_UI_C_Blueprint_GetFocusTabIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawOption_UI_C_Blueprint_GetFocusTabIndex, CallFunc_GetFocusIndex_IsFind) == 0x000005, "Member 'DrawOption_UI_C_Blueprint_GetFocusTabIndex::CallFunc_GetFocusIndex_IsFind' has a wrong offset!");
static_assert(offsetof(DrawOption_UI_C_Blueprint_GetFocusTabIndex, CallFunc_GetFocusIndex_Index) == 0x000008, "Member 'DrawOption_UI_C_Blueprint_GetFocusTabIndex::CallFunc_GetFocusIndex_Index' has a wrong offset!");

}

