#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DrawSaveLoad_UI

#include "Basic.hpp"

#include "Snowfall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DrawSaveLoad_UI.DrawSaveLoad_UI_C
// 0x0098 (0x04A8 - 0x0410)
class UDrawSaveLoad_UI_C final : public USnfMenuSaveLoadWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OpenAnim;                                          // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CursorLengthAnim;                                  // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectAnim;                                        // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScrollDown;                                        // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScrollUp;                                          // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AnimBorder;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCmnMenuHeipButtonList_UI_C*            CmnMenuHeipButtonList_UI;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlListInCursor_UI_C*              ControlListInCursor_UI;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCreateSlot_UI_C*                       CreateSlot_UI;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CursorImage;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CursorOverlay;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DescriptionText;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NoSaveData;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SaveLoadImage;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SaveSlotVerticalBox;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBarImage;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ScrollOverlayBase;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DrawSaveLoad_UI(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void StartDescriptionAnim();
	void StartSlotAnim();
	void SequenceEvent__ENTRYPOINTDrawSaveLoad_UI_0();
	void SequenceEvent__ENTRYPOINTDrawSaveLoad_UI_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DrawSaveLoad_UI_C">();
	}
	static class UDrawSaveLoad_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawSaveLoad_UI_C>();
	}
};
static_assert(alignof(UDrawSaveLoad_UI_C) == 0x000008, "Wrong alignment on UDrawSaveLoad_UI_C");
static_assert(sizeof(UDrawSaveLoad_UI_C) == 0x0004A8, "Wrong size on UDrawSaveLoad_UI_C");
static_assert(offsetof(UDrawSaveLoad_UI_C, UberGraphFrame) == 0x000410, "Member 'UDrawSaveLoad_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, OpenAnim) == 0x000418, "Member 'UDrawSaveLoad_UI_C::OpenAnim' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, CursorLengthAnim) == 0x000420, "Member 'UDrawSaveLoad_UI_C::CursorLengthAnim' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, SelectAnim) == 0x000428, "Member 'UDrawSaveLoad_UI_C::SelectAnim' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, ScrollDown) == 0x000430, "Member 'UDrawSaveLoad_UI_C::ScrollDown' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, ScrollUp) == 0x000438, "Member 'UDrawSaveLoad_UI_C::ScrollUp' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, AnimBorder) == 0x000440, "Member 'UDrawSaveLoad_UI_C::AnimBorder' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, CmnMenuHeipButtonList_UI) == 0x000448, "Member 'UDrawSaveLoad_UI_C::CmnMenuHeipButtonList_UI' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, ControlListInCursor_UI) == 0x000450, "Member 'UDrawSaveLoad_UI_C::ControlListInCursor_UI' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, CreateSlot_UI) == 0x000458, "Member 'UDrawSaveLoad_UI_C::CreateSlot_UI' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, CursorImage) == 0x000460, "Member 'UDrawSaveLoad_UI_C::CursorImage' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, CursorOverlay) == 0x000468, "Member 'UDrawSaveLoad_UI_C::CursorOverlay' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, DescriptionText) == 0x000470, "Member 'UDrawSaveLoad_UI_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, NoSaveData) == 0x000478, "Member 'UDrawSaveLoad_UI_C::NoSaveData' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, SaveLoadImage) == 0x000480, "Member 'UDrawSaveLoad_UI_C::SaveLoadImage' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, SaveSlotVerticalBox) == 0x000488, "Member 'UDrawSaveLoad_UI_C::SaveSlotVerticalBox' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, ScrollBarImage) == 0x000490, "Member 'UDrawSaveLoad_UI_C::ScrollBarImage' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, ScrollOverlayBase) == 0x000498, "Member 'UDrawSaveLoad_UI_C::ScrollOverlayBase' has a wrong offset!");
static_assert(offsetof(UDrawSaveLoad_UI_C, Title) == 0x0004A0, "Member 'UDrawSaveLoad_UI_C::Title' has a wrong offset!");

}

