#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DrawSaveLoad_UI

#include "Basic.hpp"


namespace SDK::Params
{

// Function DrawSaveLoad_UI.DrawSaveLoad_UI_C.ExecuteUbergraph_DrawSaveLoad_UI
// 0x0050 (0x0050 - 0x0000)
struct DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAutoSaveSlot_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlot_UI_C*                         K2Node_DynamicCast_AsSave_Slot_UI;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreateSlot_UI_C*                       K2Node_DynamicCast_AsCreate_Slot_UI;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSaveMode_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI) == 0x000008, "Wrong alignment on DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI");
static_assert(sizeof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI) == 0x000050, "Wrong size on DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, EntryPoint) == 0x000000, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, Temp_int_Variable) == 0x00000C, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_IsAutoSaveSlot_ReturnValue) == 0x000010, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_IsAutoSaveSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_Less_IntInt_ReturnValue) == 0x000011, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, K2Node_DynamicCast_AsSave_Slot_UI) == 0x000020, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::K2Node_DynamicCast_AsSave_Slot_UI' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, K2Node_DynamicCast_AsCreate_Slot_UI) == 0x000030, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::K2Node_DynamicCast_AsCreate_Slot_UI' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000039, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_IsSaveMode_ReturnValue) == 0x000040, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_IsSaveMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, K2Node_Event_IsDesignTime) == 0x000041, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, CallFunc_SelectInt_ReturnValue) == 0x000044, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'DrawSaveLoad_UI_C_ExecuteUbergraph_DrawSaveLoad_UI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function DrawSaveLoad_UI.DrawSaveLoad_UI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct DrawSaveLoad_UI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DrawSaveLoad_UI_C_PreConstruct) == 0x000001, "Wrong alignment on DrawSaveLoad_UI_C_PreConstruct");
static_assert(sizeof(DrawSaveLoad_UI_C_PreConstruct) == 0x000001, "Wrong size on DrawSaveLoad_UI_C_PreConstruct");
static_assert(offsetof(DrawSaveLoad_UI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'DrawSaveLoad_UI_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

