#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndlessTitleSaveGameDetailEmpty_UI

#include "Basic.hpp"

#include "Snowfall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EndlessTitleSaveGameDetailEmpty_UI.EndlessTitleSaveGameDetailEmpty_UI_C
// 0x0018 (0x0360 - 0x0348)
class UEndlessTitleSaveGameDetailEmpty_UI_C final : public USnfEndlessTitleSaveGameDetailPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BaseBG;                                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayTimeTextBlock_1;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EndlessTitleSaveGameDetailEmpty_UI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EndlessTitleSaveGameDetailEmpty_UI_C">();
	}
	static class UEndlessTitleSaveGameDetailEmpty_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndlessTitleSaveGameDetailEmpty_UI_C>();
	}
};
static_assert(alignof(UEndlessTitleSaveGameDetailEmpty_UI_C) == 0x000008, "Wrong alignment on UEndlessTitleSaveGameDetailEmpty_UI_C");
static_assert(sizeof(UEndlessTitleSaveGameDetailEmpty_UI_C) == 0x000360, "Wrong size on UEndlessTitleSaveGameDetailEmpty_UI_C");
static_assert(offsetof(UEndlessTitleSaveGameDetailEmpty_UI_C, UberGraphFrame) == 0x000348, "Member 'UEndlessTitleSaveGameDetailEmpty_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEndlessTitleSaveGameDetailEmpty_UI_C, BaseBG) == 0x000350, "Member 'UEndlessTitleSaveGameDetailEmpty_UI_C::BaseBG' has a wrong offset!");
static_assert(offsetof(UEndlessTitleSaveGameDetailEmpty_UI_C, PlayTimeTextBlock_1) == 0x000358, "Member 'UEndlessTitleSaveGameDetailEmpty_UI_C::PlayTimeTextBlock_1' has a wrong offset!");

}

