#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemSkillBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemSkillBase.ItemSkillBase_C.Blueprint_OnUse
// 0x0018 (0x0018 - 0x0000)
struct ItemSkillBase_C_Blueprint_OnUse final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPlayerSkillNoWorld_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemSkillBase_C_Blueprint_OnUse) == 0x000008, "Wrong alignment on ItemSkillBase_C_Blueprint_OnUse");
static_assert(sizeof(ItemSkillBase_C_Blueprint_OnUse) == 0x000018, "Wrong size on ItemSkillBase_C_Blueprint_OnUse");
static_assert(offsetof(ItemSkillBase_C_Blueprint_OnUse, Receiver) == 0x000000, "Member 'ItemSkillBase_C_Blueprint_OnUse::Receiver' has a wrong offset!");
static_assert(offsetof(ItemSkillBase_C_Blueprint_OnUse, Count) == 0x000008, "Member 'ItemSkillBase_C_Blueprint_OnUse::Count' has a wrong offset!");
static_assert(offsetof(ItemSkillBase_C_Blueprint_OnUse, ReturnValue) == 0x00000C, "Member 'ItemSkillBase_C_Blueprint_OnUse::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSkillBase_C_Blueprint_OnUse, CallFunc_SetPlayerSkillNoWorld_ReturnValue) == 0x000010, "Member 'ItemSkillBase_C_Blueprint_OnUse::CallFunc_SetPlayerSkillNoWorld_ReturnValue' has a wrong offset!");

}

