#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuTabItem_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MenuTabBase_UI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MenuTabItem_UI.MenuTabItem_UI_C
// 0x0038 (0x0338 - 0x0300)
class UMenuTabItem_UI_C final : public UMenuTabBase_UI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line1;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line2;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LineHorizontalBox;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TabTextBlock;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelectTab;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MenuTabItem_UI(int32 EntryPoint);
	void OnSelect();
	void UnSelect();
	void Blueprint_OnTngEndOver();
	void Blueprint_OnTngBeginOver();
	void Blueprint_EndSelect(bool IsSetPanel);
	void Blueprint_BeginSelect(bool IsSetPanel);
	void PreConstruct(bool IsDesignTime);
	void Blueprint_SetControlPanel(class USnfControlListWidget* ListData);
	void Blueprint_OutScroll(bool IsUp, bool IsLoop);
	void Blueprint_InScroll(bool IsUp, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuTabItem_UI_C">();
	}
	static class UMenuTabItem_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuTabItem_UI_C>();
	}
};
static_assert(alignof(UMenuTabItem_UI_C) == 0x000008, "Wrong alignment on UMenuTabItem_UI_C");
static_assert(sizeof(UMenuTabItem_UI_C) == 0x000338, "Wrong size on UMenuTabItem_UI_C");
static_assert(offsetof(UMenuTabItem_UI_C, UberGraphFrame) == 0x000300, "Member 'UMenuTabItem_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMenuTabItem_UI_C, Background) == 0x000308, "Member 'UMenuTabItem_UI_C::Background' has a wrong offset!");
static_assert(offsetof(UMenuTabItem_UI_C, Line1) == 0x000310, "Member 'UMenuTabItem_UI_C::Line1' has a wrong offset!");
static_assert(offsetof(UMenuTabItem_UI_C, Line2) == 0x000318, "Member 'UMenuTabItem_UI_C::Line2' has a wrong offset!");
static_assert(offsetof(UMenuTabItem_UI_C, LineHorizontalBox) == 0x000320, "Member 'UMenuTabItem_UI_C::LineHorizontalBox' has a wrong offset!");
static_assert(offsetof(UMenuTabItem_UI_C, TabTextBlock) == 0x000328, "Member 'UMenuTabItem_UI_C::TabTextBlock' has a wrong offset!");
static_assert(offsetof(UMenuTabItem_UI_C, IsSelectTab) == 0x000330, "Member 'UMenuTabItem_UI_C::IsSelectTab' has a wrong offset!");

}

