#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuTab_UI

#include "Basic.hpp"

#include "Snowfall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MenuTab_UI.MenuTab_UI_C
// 0x0030 (0x0318 - 0x02E8)
class UMenuTab_UI_C final : public USnfUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         BaseHorizontalBox;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlList_UI_C*                      TabControlList_UI;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           TabText;                                           // 0x0300(0x0010)(Edit, BlueprintVisible)
	float                                         TabInterval;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MenuTab_UI(int32 EntryPoint);
	void BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_1_SnfListWidgetOnWidget__DelegateSignature(class UWidget* Widget);
	void BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_0_SnfListWidgetOnWidget__DelegateSignature(class UWidget* Widget);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void GetWidgetList(TArray<class UWidget*>* WidgetList);
	void GetFocusIndex(bool* IsFind, int32* Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuTab_UI_C">();
	}
	static class UMenuTab_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuTab_UI_C>();
	}
};
static_assert(alignof(UMenuTab_UI_C) == 0x000008, "Wrong alignment on UMenuTab_UI_C");
static_assert(sizeof(UMenuTab_UI_C) == 0x000318, "Wrong size on UMenuTab_UI_C");
static_assert(offsetof(UMenuTab_UI_C, UberGraphFrame) == 0x0002E8, "Member 'UMenuTab_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMenuTab_UI_C, BaseHorizontalBox) == 0x0002F0, "Member 'UMenuTab_UI_C::BaseHorizontalBox' has a wrong offset!");
static_assert(offsetof(UMenuTab_UI_C, TabControlList_UI) == 0x0002F8, "Member 'UMenuTab_UI_C::TabControlList_UI' has a wrong offset!");
static_assert(offsetof(UMenuTab_UI_C, TabText) == 0x000300, "Member 'UMenuTab_UI_C::TabText' has a wrong offset!");
static_assert(offsetof(UMenuTab_UI_C, TabInterval) == 0x000310, "Member 'UMenuTab_UI_C::TabInterval' has a wrong offset!");

}

