#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuTab_UI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MenuTab_UI.MenuTab_UI_C.ExecuteUbergraph_MenuTab_UI
// 0x00B8 (0x00B8 - 0x0000)
struct MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0004(0x0008)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTabItem_UI_C*                      CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget_1;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTabItem_UI_C*                      K2Node_DynamicCast_AsMenu_Tab_Item_UI;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTabItem_UI_C*                      K2Node_DynamicCast_AsMenu_Tab_Item_UI_1;           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI) == 0x000008, "Wrong alignment on MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI");
static_assert(sizeof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI) == 0x0000B8, "Wrong size on MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, EntryPoint) == 0x000000, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_MakeStruct_SlateChildSize) == 0x000004, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, Temp_float_Variable) == 0x00001C, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_Event_IsDesignTime) == 0x000020, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_Create_ReturnValue) == 0x000030, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000038, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_Array_Get_Item) == 0x000040, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000065, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, Temp_bool_Variable) == 0x000066, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, Temp_float_Variable_1) == 0x000068, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, Temp_bool_Variable_1) == 0x00006C, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_Select_Default) == 0x000070, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_Select_Default_1) == 0x000074, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_MakeStruct_Margin) == 0x000078, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_ComponentBoundEvent_Widget_1) == 0x000088, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_ComponentBoundEvent_Widget) == 0x000090, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_DynamicCast_AsMenu_Tab_Item_UI) == 0x000098, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_DynamicCast_AsMenu_Tab_Item_UI' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_DynamicCast_AsMenu_Tab_Item_UI_1) == 0x0000A8, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_DynamicCast_AsMenu_Tab_Item_UI_1' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'MenuTab_UI_C_ExecuteUbergraph_MenuTab_UI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function MenuTab_UI.MenuTab_UI_C.BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_1_SnfListWidgetOnWidget__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_1_SnfListWidgetOnWidget__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_1_SnfListWidgetOnWidget__DelegateSignature) == 0x000008, "Wrong alignment on MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_1_SnfListWidgetOnWidget__DelegateSignature");
static_assert(sizeof(MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_1_SnfListWidgetOnWidget__DelegateSignature) == 0x000008, "Wrong size on MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_1_SnfListWidgetOnWidget__DelegateSignature");
static_assert(offsetof(MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_1_SnfListWidgetOnWidget__DelegateSignature, Widget) == 0x000000, "Member 'MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_1_SnfListWidgetOnWidget__DelegateSignature::Widget' has a wrong offset!");

// Function MenuTab_UI.MenuTab_UI_C.BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_0_SnfListWidgetOnWidget__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_0_SnfListWidgetOnWidget__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_0_SnfListWidgetOnWidget__DelegateSignature) == 0x000008, "Wrong alignment on MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_0_SnfListWidgetOnWidget__DelegateSignature");
static_assert(sizeof(MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_0_SnfListWidgetOnWidget__DelegateSignature) == 0x000008, "Wrong size on MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_0_SnfListWidgetOnWidget__DelegateSignature");
static_assert(offsetof(MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_0_SnfListWidgetOnWidget__DelegateSignature, Widget) == 0x000000, "Member 'MenuTab_UI_C_BndEvt__TabControlList_UI_K2Node_ComponentBoundEvent_0_SnfListWidgetOnWidget__DelegateSignature::Widget' has a wrong offset!");

// Function MenuTab_UI.MenuTab_UI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MenuTab_UI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuTab_UI_C_PreConstruct) == 0x000001, "Wrong alignment on MenuTab_UI_C_PreConstruct");
static_assert(sizeof(MenuTab_UI_C_PreConstruct) == 0x000001, "Wrong size on MenuTab_UI_C_PreConstruct");
static_assert(offsetof(MenuTab_UI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MenuTab_UI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MenuTab_UI.MenuTab_UI_C.GetWidgetList
// 0x0040 (0x0040 - 0x0000)
struct MenuTab_UI_C_GetWidgetList final
{
public:
	TArray<class UWidget*>                        WidgetList;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWidget*>                        TempList;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuTab_UI_C_GetWidgetList) == 0x000008, "Wrong alignment on MenuTab_UI_C_GetWidgetList");
static_assert(sizeof(MenuTab_UI_C_GetWidgetList) == 0x000040, "Wrong size on MenuTab_UI_C_GetWidgetList");
static_assert(offsetof(MenuTab_UI_C_GetWidgetList, WidgetList) == 0x000000, "Member 'MenuTab_UI_C_GetWidgetList::WidgetList' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetWidgetList, TempList) == 0x000010, "Member 'MenuTab_UI_C_GetWidgetList::TempList' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetWidgetList, Temp_int_Variable) == 0x000020, "Member 'MenuTab_UI_C_GetWidgetList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetWidgetList, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'MenuTab_UI_C_GetWidgetList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetWidgetList, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'MenuTab_UI_C_GetWidgetList::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetWidgetList, CallFunc_GetChildrenCount_ReturnValue) == 0x000030, "Member 'MenuTab_UI_C_GetWidgetList::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetWidgetList, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'MenuTab_UI_C_GetWidgetList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetWidgetList, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'MenuTab_UI_C_GetWidgetList::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetWidgetList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'MenuTab_UI_C_GetWidgetList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function MenuTab_UI.MenuTab_UI_C.GetFocusIndex
// 0x0030 (0x0030 - 0x0000)
struct MenuTab_UI_C_GetFocusIndex final
{
public:
	bool                                          IsFind;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuTab_UI_C_GetFocusIndex) == 0x000008, "Wrong alignment on MenuTab_UI_C_GetFocusIndex");
static_assert(sizeof(MenuTab_UI_C_GetFocusIndex) == 0x000030, "Wrong size on MenuTab_UI_C_GetFocusIndex");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, IsFind) == 0x000000, "Member 'MenuTab_UI_C_GetFocusIndex::IsFind' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, Index_0) == 0x000004, "Member 'MenuTab_UI_C_GetFocusIndex::Index_0' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, Temp_int_Variable) == 0x000008, "Member 'MenuTab_UI_C_GetFocusIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'MenuTab_UI_C_GetFocusIndex::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'MenuTab_UI_C_GetFocusIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, CallFunc_GetChildrenCount_ReturnValue) == 0x00001C, "Member 'MenuTab_UI_C_GetFocusIndex::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'MenuTab_UI_C_GetFocusIndex::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'MenuTab_UI_C_GetFocusIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, CallFunc_HasUserFocus_ReturnValue) == 0x00002C, "Member 'MenuTab_UI_C_GetFocusIndex::CallFunc_HasUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuTab_UI_C_GetFocusIndex, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002D, "Member 'MenuTab_UI_C_GetFocusIndex::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

