#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NormalArrow_AC

#include "Basic.hpp"

#include "Snowfall_structs.hpp"
#include "Snowfall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NormalArrow_AC.NormalArrow_AC_C
// 0x0030 (0x0A40 - 0x0A10)
class ANormalArrow_AC_C final : public ASnfWeaponArrow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USnfInteractComponent*                  SnfInteract;                                       // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Interact;                                          // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ArrowMesh;                                         // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision;                                         // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bChargeStart;                                      // 0x0A38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCanShot;                                          // 0x0A39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_NormalArrow_AC(int32 EntryPoint);
	void RangeOver(const struct FVector& EndLocation, const struct FVector& EndDirection);
	void OnAttachEndEvent();
	void OnHitEvent(const struct FHitResult& HitResult);
	void InitializeAmmo(class AActor* OwnerActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NormalArrow_AC_C">();
	}
	static class ANormalArrow_AC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANormalArrow_AC_C>();
	}
};
static_assert(alignof(ANormalArrow_AC_C) == 0x000010, "Wrong alignment on ANormalArrow_AC_C");
static_assert(sizeof(ANormalArrow_AC_C) == 0x000A40, "Wrong size on ANormalArrow_AC_C");
static_assert(offsetof(ANormalArrow_AC_C, UberGraphFrame) == 0x000A10, "Member 'ANormalArrow_AC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANormalArrow_AC_C, SnfInteract) == 0x000A18, "Member 'ANormalArrow_AC_C::SnfInteract' has a wrong offset!");
static_assert(offsetof(ANormalArrow_AC_C, Interact) == 0x000A20, "Member 'ANormalArrow_AC_C::Interact' has a wrong offset!");
static_assert(offsetof(ANormalArrow_AC_C, ArrowMesh) == 0x000A28, "Member 'ANormalArrow_AC_C::ArrowMesh' has a wrong offset!");
static_assert(offsetof(ANormalArrow_AC_C, Collision) == 0x000A30, "Member 'ANormalArrow_AC_C::Collision' has a wrong offset!");
static_assert(offsetof(ANormalArrow_AC_C, bChargeStart) == 0x000A38, "Member 'ANormalArrow_AC_C::bChargeStart' has a wrong offset!");
static_assert(offsetof(ANormalArrow_AC_C, bCanShot) == 0x000A39, "Member 'ANormalArrow_AC_C::bCanShot' has a wrong offset!");

}

