#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionKeyAssignmentItem_UI

#include "Basic.hpp"

#include "Snowfall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionKeyAssignmentItem_UI.OptionKeyAssignmentItem_UI_C
// 0x0018 (0x03F8 - 0x03E0)
class UOptionKeyAssignmentItem_UI_C final : public USnfOptionKeyAssignmentItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SelectAnim;                                        // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TitleTextBlock;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_OptionKeyAssignmentItem_UI(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionKeyAssignmentItem_UI_C">();
	}
	static class UOptionKeyAssignmentItem_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionKeyAssignmentItem_UI_C>();
	}
};
static_assert(alignof(UOptionKeyAssignmentItem_UI_C) == 0x000008, "Wrong alignment on UOptionKeyAssignmentItem_UI_C");
static_assert(sizeof(UOptionKeyAssignmentItem_UI_C) == 0x0003F8, "Wrong size on UOptionKeyAssignmentItem_UI_C");
static_assert(offsetof(UOptionKeyAssignmentItem_UI_C, UberGraphFrame) == 0x0003E0, "Member 'UOptionKeyAssignmentItem_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionKeyAssignmentItem_UI_C, SelectAnim) == 0x0003E8, "Member 'UOptionKeyAssignmentItem_UI_C::SelectAnim' has a wrong offset!");
static_assert(offsetof(UOptionKeyAssignmentItem_UI_C, TitleTextBlock) == 0x0003F0, "Member 'UOptionKeyAssignmentItem_UI_C::TitleTextBlock' has a wrong offset!");

}

