#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: People_Job_BTT

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Snowfall_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function People_Job_BTT.People_Job_BTT_C.ExecuteUbergraph_People_Job_BTT
// 0x00E0 (0x00E0 - 0x0000)
struct People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTngAnimInstance*                       CallFunc_GetTngAnimInstanceFromActor_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USnfPeopleAnimInstance*                 K2Node_DynamicCast_AsSnf_People_Anim_Instance;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USnfJobComponent*                       CallFunc_GetJobInActor_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASnfNpcHumanoidCharacter*               K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASnfAIController_BP_C*                  K2Node_DynamicCast_AsSnf_AIController_BP;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdatePoint_CanNext;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdatePath_CanNext;                       // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardValueAsBool_ReturnValue;     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBlackboardValueAsInt_ReturnValue;      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             CallFunc_GetCollisionAndGravity_IsEnableCollision; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCollisionAndGravity_IsEnableGravity;   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCollisionAndGravity_ReturnValue;       // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT) == 0x000010, "Wrong alignment on People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT");
static_assert(sizeof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT) == 0x0000E0, "Wrong size on People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, EntryPoint) == 0x000000, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::EntryPoint' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_Event_OwnerController_2) == 0x000008, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_Event_ControlledPawn_2) == 0x000010, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_GetTngAnimInstanceFromActor_ReturnValue) == 0x000018, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_GetTngAnimInstanceFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000020, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_DynamicCast_AsSnf_People_Anim_Instance) == 0x000028, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_DynamicCast_AsSnf_People_Anim_Instance' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_GetJobInActor_ReturnValue) == 0x000070, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_GetJobInActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character) == 0x000078, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_Event_OwnerController_1) == 0x000088, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_Event_ControlledPawn_1) == 0x000090, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_DynamicCast_AsSnf_AIController_BP) == 0x0000A0, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_DynamicCast_AsSnf_AIController_BP' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_UpdatePoint_CanNext) == 0x0000A9, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_UpdatePoint_CanNext' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_UpdatePath_CanNext) == 0x0000AA, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_UpdatePath_CanNext' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, Temp_int_Variable) == 0x0000AC, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_Event_OwnerController) == 0x0000B0, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_Event_ControlledPawn) == 0x0000B8, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_GetBlackboardValueAsBool_ReturnValue) == 0x0000C0, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_GetBlackboardValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_GetBlackboardValueAsInt_ReturnValue) == 0x0000C4, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_GetBlackboardValueAsInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, Temp_bool_Variable) == 0x0000C8, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, K2Node_Select_Default) == 0x0000CC, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_GetCollisionAndGravity_IsEnableCollision) == 0x0000D0, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_GetCollisionAndGravity_IsEnableCollision' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_GetCollisionAndGravity_IsEnableGravity) == 0x0000D1, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_GetCollisionAndGravity_IsEnableGravity' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT, CallFunc_GetCollisionAndGravity_ReturnValue) == 0x0000D2, "Member 'People_Job_BTT_C_ExecuteUbergraph_People_Job_BTT::CallFunc_GetCollisionAndGravity_ReturnValue' has a wrong offset!");

// Function People_Job_BTT.People_Job_BTT_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct People_Job_BTT_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(People_Job_BTT_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on People_Job_BTT_C_ReceiveAbortAI");
static_assert(sizeof(People_Job_BTT_C_ReceiveAbortAI) == 0x000010, "Wrong size on People_Job_BTT_C_ReceiveAbortAI");
static_assert(offsetof(People_Job_BTT_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'People_Job_BTT_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'People_Job_BTT_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

// Function People_Job_BTT.People_Job_BTT_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct People_Job_BTT_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(People_Job_BTT_C_ReceiveTickAI) == 0x000008, "Wrong alignment on People_Job_BTT_C_ReceiveTickAI");
static_assert(sizeof(People_Job_BTT_C_ReceiveTickAI) == 0x000018, "Wrong size on People_Job_BTT_C_ReceiveTickAI");
static_assert(offsetof(People_Job_BTT_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'People_Job_BTT_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'People_Job_BTT_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'People_Job_BTT_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function People_Job_BTT.People_Job_BTT_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct People_Job_BTT_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(People_Job_BTT_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on People_Job_BTT_C_ReceiveExecuteAI");
static_assert(sizeof(People_Job_BTT_C_ReceiveExecuteAI) == 0x000010, "Wrong size on People_Job_BTT_C_ReceiveExecuteAI");
static_assert(offsetof(People_Job_BTT_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'People_Job_BTT_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'People_Job_BTT_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function People_Job_BTT.People_Job_BTT_C.UpdatePath
// 0x00A0 (0x00A0 - 0x0000)
struct People_Job_BTT_C_UpdatePath final
{
public:
	class ASnfAIController_BP_C*                  OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USnfJobType*                            JobType;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanNext;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewLocalVar_2;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USnfJobType_Path*                       K2Node_DynamicCast_AsPath;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSnfJobTypeList                        CallFunc_GetLatestJobPathActions_OutLatestJobPathAction; // 0x0038(0x0018)(ContainsInstancedReference)
	bool                                          CallFunc_GetLatestJobPathActions_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetPathTransform_ReturnValue;             // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Update_Actions_CanNext;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(People_Job_BTT_C_UpdatePath) == 0x000010, "Wrong alignment on People_Job_BTT_C_UpdatePath");
static_assert(sizeof(People_Job_BTT_C_UpdatePath) == 0x0000A0, "Wrong size on People_Job_BTT_C_UpdatePath");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, OwnerController) == 0x000000, "Member 'People_Job_BTT_C_UpdatePath::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, ControlledPawn) == 0x000008, "Member 'People_Job_BTT_C_UpdatePath::ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, DeltaSeconds) == 0x000010, "Member 'People_Job_BTT_C_UpdatePath::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, JobType) == 0x000018, "Member 'People_Job_BTT_C_UpdatePath::JobType' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, CanNext) == 0x000020, "Member 'People_Job_BTT_C_UpdatePath::CanNext' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, NewLocalVar_2) == 0x000024, "Member 'People_Job_BTT_C_UpdatePath::NewLocalVar_2' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, K2Node_DynamicCast_AsPath) == 0x000028, "Member 'People_Job_BTT_C_UpdatePath::K2Node_DynamicCast_AsPath' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'People_Job_BTT_C_UpdatePath::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, CallFunc_GetLatestJobPathActions_OutLatestJobPathAction) == 0x000038, "Member 'People_Job_BTT_C_UpdatePath::CallFunc_GetLatestJobPathActions_OutLatestJobPathAction' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, CallFunc_GetLatestJobPathActions_ReturnValue) == 0x000050, "Member 'People_Job_BTT_C_UpdatePath::CallFunc_GetLatestJobPathActions_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, CallFunc_GetPathTransform_ReturnValue) == 0x000060, "Member 'People_Job_BTT_C_UpdatePath::CallFunc_GetPathTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_UpdatePath, CallFunc_Update_Actions_CanNext) == 0x000090, "Member 'People_Job_BTT_C_UpdatePath::CallFunc_Update_Actions_CanNext' has a wrong offset!");

// Function People_Job_BTT.People_Job_BTT_C.ActAnim
// 0x0100 (0x0100 - 0x0000)
struct People_Job_BTT_C_ActAnim final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USnfJobAction_Anim*                     JobActionAnim;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActionTransform;                                   // 0x0020(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          CanNext;                                           // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USnfGeneralMotionAsset*                 K2Node_DynamicCast_AsSnf_General_Motion_Asset;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USnfJobAction_KappaAnim*                K2Node_DynamicCast_AsKappa_Anim;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequenceBase>       CallFunc_Array_Get_Item;                           // 0x0088(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base_1;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesStopAnimPlying_ReturnValue;           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLoadCompleted_ReturnValue;              // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayActionAnim_ReturnValue;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CueActionAnimJumpToSection_ReturnValue;   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(People_Job_BTT_C_ActAnim) == 0x000010, "Wrong alignment on People_Job_BTT_C_ActAnim");
static_assert(sizeof(People_Job_BTT_C_ActAnim) == 0x000100, "Wrong size on People_Job_BTT_C_ActAnim");
static_assert(offsetof(People_Job_BTT_C_ActAnim, ControlledPawn) == 0x000000, "Member 'People_Job_BTT_C_ActAnim::ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, DeltaSeconds) == 0x000008, "Member 'People_Job_BTT_C_ActAnim::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, JobActionAnim) == 0x000010, "Member 'People_Job_BTT_C_ActAnim::JobActionAnim' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, ActionTransform) == 0x000020, "Member 'People_Job_BTT_C_ActAnim::ActionTransform' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CanNext) == 0x000050, "Member 'People_Job_BTT_C_ActAnim::CanNext' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'People_Job_BTT_C_ActAnim::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'People_Job_BTT_C_ActAnim::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, K2Node_DynamicCast_AsSnf_General_Motion_Asset) == 0x000068, "Member 'People_Job_BTT_C_ActAnim::K2Node_DynamicCast_AsSnf_General_Motion_Asset' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'People_Job_BTT_C_ActAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'People_Job_BTT_C_ActAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, K2Node_DynamicCast_AsKappa_Anim) == 0x000078, "Member 'People_Job_BTT_C_ActAnim::K2Node_DynamicCast_AsKappa_Anim' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'People_Job_BTT_C_ActAnim::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_Array_Get_Item) == 0x000088, "Member 'People_Job_BTT_C_ActAnim::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000B0, "Member 'People_Job_BTT_C_ActAnim::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, K2Node_DynamicCast_AsAnim_Sequence_Base) == 0x0000B8, "Member 'People_Job_BTT_C_ActAnim::K2Node_DynamicCast_AsAnim_Sequence_Base' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'People_Job_BTT_C_ActAnim::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x0000C8, "Member 'People_Job_BTT_C_ActAnim::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'People_Job_BTT_C_ActAnim::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, K2Node_DynamicCast_AsAnim_Sequence_Base_1) == 0x0000D8, "Member 'People_Job_BTT_C_ActAnim::K2Node_DynamicCast_AsAnim_Sequence_Base_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, K2Node_DynamicCast_bSuccess_3) == 0x0000E0, "Member 'People_Job_BTT_C_ActAnim::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_DoesStopAnimPlying_ReturnValue) == 0x0000E1, "Member 'People_Job_BTT_C_ActAnim::CallFunc_DoesStopAnimPlying_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_IsLoadCompleted_ReturnValue) == 0x0000E2, "Member 'People_Job_BTT_C_ActAnim::CallFunc_IsLoadCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E3, "Member 'People_Job_BTT_C_ActAnim::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, Temp_int_Variable) == 0x0000E4, "Member 'People_Job_BTT_C_ActAnim::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_IsPlayActionAnim_ReturnValue) == 0x0000E8, "Member 'People_Job_BTT_C_ActAnim::CallFunc_IsPlayActionAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_CueActionAnimJumpToSection_ReturnValue) == 0x0000E9, "Member 'People_Job_BTT_C_ActAnim::CallFunc_CueActionAnimJumpToSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_IsValid_ReturnValue_2) == 0x0000EA, "Member 'People_Job_BTT_C_ActAnim::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'People_Job_BTT_C_ActAnim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActAnim, K2Node_SwitchInteger_CmpSuccess) == 0x0000F0, "Member 'People_Job_BTT_C_ActAnim::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function People_Job_BTT.People_Job_BTT_C.SubPhaseTurn
// 0x00C0 (0x00C0 - 0x0000)
struct People_Job_BTT_C_SubPhaseTurn final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActionTransform;                                   // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         PlayRate;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanNext;                                           // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayActionAnim_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_RotatorRotator_ReturnValue;      // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayActionAnim_ReturnValue_1;           // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(People_Job_BTT_C_SubPhaseTurn) == 0x000010, "Wrong alignment on People_Job_BTT_C_SubPhaseTurn");
static_assert(sizeof(People_Job_BTT_C_SubPhaseTurn) == 0x0000C0, "Wrong size on People_Job_BTT_C_SubPhaseTurn");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, ControlledPawn) == 0x000000, "Member 'People_Job_BTT_C_SubPhaseTurn::ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, DeltaSeconds) == 0x000008, "Member 'People_Job_BTT_C_SubPhaseTurn::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, ActionTransform) == 0x000010, "Member 'People_Job_BTT_C_SubPhaseTurn::ActionTransform' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, PlayRate) == 0x000040, "Member 'People_Job_BTT_C_SubPhaseTurn::PlayRate' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CanNext) == 0x000044, "Member 'People_Job_BTT_C_SubPhaseTurn::CanNext' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_BreakTransform_Location) == 0x000048, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_BreakTransform_Rotation) == 0x000054, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_BreakTransform_Scale) == 0x000060, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00006C, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_RInterpTo_ReturnValue) == 0x000078, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_IsPlayActionAnim_ReturnValue) == 0x000084, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_IsPlayActionAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000085, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_NotEqual_RotatorRotator_ReturnValue) == 0x000086, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_NotEqual_RotatorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000088, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_BreakRotator_Roll) == 0x000094, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_BreakRotator_Pitch) == 0x000098, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_BreakRotator_Yaw) == 0x00009C, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_Abs_ReturnValue) == 0x0000B0, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000B4, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, CallFunc_IsPlayActionAnim_ReturnValue_1) == 0x0000B5, "Member 'People_Job_BTT_C_SubPhaseTurn::CallFunc_IsPlayActionAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, Temp_int_Variable) == 0x0000B8, "Member 'People_Job_BTT_C_SubPhaseTurn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseTurn, K2Node_SwitchInteger_CmpSuccess) == 0x0000BC, "Member 'People_Job_BTT_C_SubPhaseTurn::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function People_Job_BTT.People_Job_BTT_C.SubPhaseWait
// 0x0078 (0x0078 - 0x0000)
struct People_Job_BTT_C_SubPhaseWait final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanNext;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATngCharacter*                          K2Node_DynamicCast_AsTng_Character;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITngCharacterMovementInterface> CallFunc_SetDriveInputMaxSpeed_self_CastInput;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITngCharacterMovementInterface> CallFunc_GetDriveInputMaxSpeed_self_CastInput;     // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetDriveInputMaxSpeed_ReturnValue;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITngCharacterMovementInterface> CallFunc_SetDriveInputMaxSpeed_self_CastInput_1;   // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(People_Job_BTT_C_SubPhaseWait) == 0x000008, "Wrong alignment on People_Job_BTT_C_SubPhaseWait");
static_assert(sizeof(People_Job_BTT_C_SubPhaseWait) == 0x000078, "Wrong size on People_Job_BTT_C_SubPhaseWait");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, ControlledPawn) == 0x000000, "Member 'People_Job_BTT_C_SubPhaseWait::ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, DeltaSeconds) == 0x000008, "Member 'People_Job_BTT_C_SubPhaseWait::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, Duration) == 0x00000C, "Member 'People_Job_BTT_C_SubPhaseWait::Duration' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, CanNext) == 0x000010, "Member 'People_Job_BTT_C_SubPhaseWait::CanNext' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, K2Node_DynamicCast_AsTng_Character) == 0x000018, "Member 'People_Job_BTT_C_SubPhaseWait::K2Node_DynamicCast_AsTng_Character' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'People_Job_BTT_C_SubPhaseWait::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, CallFunc_SetDriveInputMaxSpeed_self_CastInput) == 0x000028, "Member 'People_Job_BTT_C_SubPhaseWait::CallFunc_SetDriveInputMaxSpeed_self_CastInput' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, CallFunc_GetDriveInputMaxSpeed_self_CastInput) == 0x000038, "Member 'People_Job_BTT_C_SubPhaseWait::CallFunc_GetDriveInputMaxSpeed_self_CastInput' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, CallFunc_GetDriveInputMaxSpeed_ReturnValue) == 0x000048, "Member 'People_Job_BTT_C_SubPhaseWait::CallFunc_GetDriveInputMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, CallFunc_SetDriveInputMaxSpeed_self_CastInput_1) == 0x000050, "Member 'People_Job_BTT_C_SubPhaseWait::CallFunc_SetDriveInputMaxSpeed_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, Temp_int_Variable) == 0x000060, "Member 'People_Job_BTT_C_SubPhaseWait::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, CallFunc_Add_FloatFloat_ReturnValue) == 0x000064, "Member 'People_Job_BTT_C_SubPhaseWait::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, CallFunc_Less_FloatFloat_ReturnValue) == 0x000068, "Member 'People_Job_BTT_C_SubPhaseWait::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'People_Job_BTT_C_SubPhaseWait::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_SubPhaseWait, K2Node_SwitchInteger_CmpSuccess) == 0x000070, "Member 'People_Job_BTT_C_SubPhaseWait::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function People_Job_BTT.People_Job_BTT_C.ActWait
// 0x0070 (0x0070 - 0x0000)
struct People_Job_BTT_C_ActWait final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USnfJobAction_Wait*                     JobActionWait;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActionTransform;                                   // 0x0020(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          CanNext;                                           // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewLocalVar_0;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_IsBreak_ElapsedTimeCount;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBreak_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(People_Job_BTT_C_ActWait) == 0x000010, "Wrong alignment on People_Job_BTT_C_ActWait");
static_assert(sizeof(People_Job_BTT_C_ActWait) == 0x000070, "Wrong size on People_Job_BTT_C_ActWait");
static_assert(offsetof(People_Job_BTT_C_ActWait, ControlledPawn) == 0x000000, "Member 'People_Job_BTT_C_ActWait::ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, DeltaSeconds) == 0x000008, "Member 'People_Job_BTT_C_ActWait::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, JobActionWait) == 0x000010, "Member 'People_Job_BTT_C_ActWait::JobActionWait' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, ActionTransform) == 0x000020, "Member 'People_Job_BTT_C_ActWait::ActionTransform' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, CanNext) == 0x000050, "Member 'People_Job_BTT_C_ActWait::CanNext' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, NewLocalVar_0) == 0x000054, "Member 'People_Job_BTT_C_ActWait::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, CallFunc_IsBreak_ElapsedTimeCount) == 0x000058, "Member 'People_Job_BTT_C_ActWait::CallFunc_IsBreak_ElapsedTimeCount' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, CallFunc_IsBreak_ReturnValue) == 0x00005C, "Member 'People_Job_BTT_C_ActWait::CallFunc_IsBreak_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, Temp_int_Variable) == 0x000060, "Member 'People_Job_BTT_C_ActWait::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'People_Job_BTT_C_ActWait::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Job_BTT_C_ActWait, K2Node_SwitchInteger_CmpSuccess) == 0x000068, "Member 'People_Job_BTT_C_ActWait::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function People_Job_BTT.People_Job_BTT_C.ActTurn
// 0x0060 (0x0060 - 0x0000)
struct People_Job_BTT_C_ActTurn final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USnfJobAction_Turn*                     JobActionTurn;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActionTransform;                                   // 0x0020(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          CanNext;                                           // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SubPhaseTurn_CanNext;                     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SubPhaseWait_CanNext;                     // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
