#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: People_Patrol_BTS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function People_Patrol_BTS.People_Patrol_BTS_C.ExecuteUbergraph_People_Patrol_BTS
// 0x0100 (0x0100 - 0x0000)
struct People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USnfJobComponent*                       CallFunc_GetCurrentJob_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue_1;  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USnfJobComponent*                       CallFunc_GetCurrentJob_ReturnValue_1;              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue_2;  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS) == 0x000010, "Wrong alignment on People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS");
static_assert(sizeof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS) == 0x000100, "Wrong size on People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, EntryPoint) == 0x000000, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::EntryPoint' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, K2Node_Event_OwnerController_2) == 0x000008, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, K2Node_Event_ControlledPawn_2) == 0x000010, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, K2Node_Event_OwnerController_1) == 0x000018, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, K2Node_Event_ControlledPawn_1) == 0x000020, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_BreakTransform_Location) == 0x000060, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, K2Node_Event_OwnerController) == 0x000088, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, K2Node_Event_ControlledPawn) == 0x000090, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x0000A0, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_GetCurrentJob_ReturnValue) == 0x0000B0, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_GetCurrentJob_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_GetBlackboardValueAsActor_ReturnValue_1) == 0x0000C0, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_GetBlackboardValueAsActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_IsValid_ReturnValue_3) == 0x0000C8, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_GetCurrentJob_ReturnValue_1) == 0x0000D0, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_GetCurrentJob_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_IsValid_ReturnValue_4) == 0x0000D8, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_GetOwner_ReturnValue) == 0x0000E0, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_GetOwner_ReturnValue_1) == 0x0000E8, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_GetBlackboardValueAsActor_ReturnValue_2) == 0x0000F0, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_GetBlackboardValueAsActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_IsValid_ReturnValue_5) == 0x0000F8, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000F9, "Member 'People_Patrol_BTS_C_ExecuteUbergraph_People_Patrol_BTS::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function People_Patrol_BTS.People_Patrol_BTS_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct People_Patrol_BTS_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(People_Patrol_BTS_C_ReceiveTickAI) == 0x000008, "Wrong alignment on People_Patrol_BTS_C_ReceiveTickAI");
static_assert(sizeof(People_Patrol_BTS_C_ReceiveTickAI) == 0x000018, "Wrong size on People_Patrol_BTS_C_ReceiveTickAI");
static_assert(offsetof(People_Patrol_BTS_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'People_Patrol_BTS_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'People_Patrol_BTS_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'People_Patrol_BTS_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function People_Patrol_BTS.People_Patrol_BTS_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct People_Patrol_BTS_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(People_Patrol_BTS_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on People_Patrol_BTS_C_ReceiveDeactivationAI");
static_assert(sizeof(People_Patrol_BTS_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on People_Patrol_BTS_C_ReceiveDeactivationAI");
static_assert(offsetof(People_Patrol_BTS_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'People_Patrol_BTS_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'People_Patrol_BTS_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

// Function People_Patrol_BTS.People_Patrol_BTS_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct People_Patrol_BTS_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(People_Patrol_BTS_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on People_Patrol_BTS_C_ReceiveActivationAI");
static_assert(sizeof(People_Patrol_BTS_C_ReceiveActivationAI) == 0x000010, "Wrong size on People_Patrol_BTS_C_ReceiveActivationAI");
static_assert(offsetof(People_Patrol_BTS_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'People_Patrol_BTS_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Patrol_BTS_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'People_Patrol_BTS_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

}

