#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: People_Panic_BTS

#include "Basic.hpp"


namespace SDK::Params
{

// Function People_Panic_BTS.People_Panic_BTS_C.ExecuteUbergraph_People_Panic_BTS
// 0x0078 (0x0078 - 0x0000)
struct People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardValueAsBool_ReturnValue;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASnfNpcHumanoidCharacter*               K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASnfNpcHumanoidCharacter*               K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASnfNpcHumanoidCharacter*               K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character_2; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS) == 0x000008, "Wrong alignment on People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS");
static_assert(sizeof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS) == 0x000078, "Wrong size on People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, EntryPoint) == 0x000000, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::EntryPoint' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_Event_OwnerController_1) == 0x000008, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_Event_ControlledPawn_1) == 0x000010, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, CallFunc_GetBlackboardValueAsBool_ReturnValue) == 0x000018, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::CallFunc_GetBlackboardValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character) == 0x000020, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_Event_OwnerController_2) == 0x000030, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_Event_ControlledPawn_2) == 0x000038, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character_1) == 0x000040, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character_1' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_Event_OwnerController) == 0x000050, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_Event_ControlledPawn) == 0x000058, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character_2) == 0x000068, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_DynamicCast_AsSnf_Npc_Humanoid_Character_2' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'People_Panic_BTS_C_ExecuteUbergraph_People_Panic_BTS::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function People_Panic_BTS.People_Panic_BTS_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct People_Panic_BTS_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(People_Panic_BTS_C_ReceiveTickAI) == 0x000008, "Wrong alignment on People_Panic_BTS_C_ReceiveTickAI");
static_assert(sizeof(People_Panic_BTS_C_ReceiveTickAI) == 0x000018, "Wrong size on People_Panic_BTS_C_ReceiveTickAI");
static_assert(offsetof(People_Panic_BTS_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'People_Panic_BTS_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'People_Panic_BTS_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'People_Panic_BTS_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function People_Panic_BTS.People_Panic_BTS_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct People_Panic_BTS_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(People_Panic_BTS_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on People_Panic_BTS_C_ReceiveDeactivationAI");
static_assert(sizeof(People_Panic_BTS_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on People_Panic_BTS_C_ReceiveDeactivationAI");
static_assert(offsetof(People_Panic_BTS_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'People_Panic_BTS_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'People_Panic_BTS_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

// Function People_Panic_BTS.People_Panic_BTS_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct People_Panic_BTS_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(People_Panic_BTS_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on People_Panic_BTS_C_ReceiveActivationAI");
static_assert(sizeof(People_Panic_BTS_C_ReceiveActivationAI) == 0x000010, "Wrong size on People_Panic_BTS_C_ReceiveActivationAI");
static_assert(offsetof(People_Panic_BTS_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'People_Panic_BTS_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(People_Panic_BTS_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'People_Panic_BTS_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

}

