#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: People_Patrol_BTS

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass People_Patrol_BTS.People_Patrol_BTS_C
// 0x00D0 (0x0168 - 0x0098)
class UPeople_Patrol_BTS_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 SelfActorBK;                                       // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 JobActorBK;                                        // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 NextJobActorBK;                                    // 0x00F0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 PatrolLocationBK;                                  // 0x0118(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 PatrolRotaionBK;                                   // 0x0140(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_People_Patrol_BTS(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"People_Patrol_BTS_C">();
	}
	static class UPeople_Patrol_BTS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPeople_Patrol_BTS_C>();
	}
};
static_assert(alignof(UPeople_Patrol_BTS_C) == 0x000008, "Wrong alignment on UPeople_Patrol_BTS_C");
static_assert(sizeof(UPeople_Patrol_BTS_C) == 0x000168, "Wrong size on UPeople_Patrol_BTS_C");
static_assert(offsetof(UPeople_Patrol_BTS_C, UberGraphFrame) == 0x000098, "Member 'UPeople_Patrol_BTS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPeople_Patrol_BTS_C, SelfActorBK) == 0x0000A0, "Member 'UPeople_Patrol_BTS_C::SelfActorBK' has a wrong offset!");
static_assert(offsetof(UPeople_Patrol_BTS_C, JobActorBK) == 0x0000C8, "Member 'UPeople_Patrol_BTS_C::JobActorBK' has a wrong offset!");
static_assert(offsetof(UPeople_Patrol_BTS_C, NextJobActorBK) == 0x0000F0, "Member 'UPeople_Patrol_BTS_C::NextJobActorBK' has a wrong offset!");
static_assert(offsetof(UPeople_Patrol_BTS_C, PatrolLocationBK) == 0x000118, "Member 'UPeople_Patrol_BTS_C::PatrolLocationBK' has a wrong offset!");
static_assert(offsetof(UPeople_Patrol_BTS_C, PatrolRotaionBK) == 0x000140, "Member 'UPeople_Patrol_BTS_C::PatrolRotaionBK' has a wrong offset!");

}

