#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScreenMovieDescription_UI

#include "Basic.hpp"

#include "Snowfall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScreenMovieDescription_UI.ScreenMovieDescription_UI_C
// 0x0020 (0x0348 - 0x0328)
class UScreenMovieDescription_UI_C final : public USnfScreenMovieDescriptionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SkipBorderAnim;                                    // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Gage;                                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SkipBorder;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ScreenMovieDescription_UI(int32 EntryPoint);
	void BndEvt__CmnRichControllButton_UI_K2Node_ComponentBoundEvent_0_SnfButtonDescriptionRateDelegate__DelegateSignature(float Rate);
	void Destruct();
	void Construct();
	void StopAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScreenMovieDescription_UI_C">();
	}
	static class UScreenMovieDescription_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScreenMovieDescription_UI_C>();
	}
};
static_assert(alignof(UScreenMovieDescription_UI_C) == 0x000008, "Wrong alignment on UScreenMovieDescription_UI_C");
static_assert(sizeof(UScreenMovieDescription_UI_C) == 0x000348, "Wrong size on UScreenMovieDescription_UI_C");
static_assert(offsetof(UScreenMovieDescription_UI_C, UberGraphFrame) == 0x000328, "Member 'UScreenMovieDescription_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScreenMovieDescription_UI_C, SkipBorderAnim) == 0x000330, "Member 'UScreenMovieDescription_UI_C::SkipBorderAnim' has a wrong offset!");
static_assert(offsetof(UScreenMovieDescription_UI_C, Gage) == 0x000338, "Member 'UScreenMovieDescription_UI_C::Gage' has a wrong offset!");
static_assert(offsetof(UScreenMovieDescription_UI_C, SkipBorder) == 0x000340, "Member 'UScreenMovieDescription_UI_C::SkipBorder' has a wrong offset!");

}

