#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScreenMovieDescription_UI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ScreenMovieDescription_UI.ScreenMovieDescription_UI_C.ExecuteUbergraph_ScreenMovieDescription_UI
// 0x0018 (0x0018 - 0x0000)
struct ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Rate;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI) == 0x000008, "Wrong alignment on ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI");
static_assert(sizeof(ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI) == 0x000018, "Wrong size on ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI");
static_assert(offsetof(ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI, EntryPoint) == 0x000000, "Member 'ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI, K2Node_ComponentBoundEvent_Rate) == 0x000008, "Member 'ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI::K2Node_ComponentBoundEvent_Rate' has a wrong offset!");
static_assert(offsetof(ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI, Temp_bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'ScreenMovieDescription_UI_C_ExecuteUbergraph_ScreenMovieDescription_UI::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function ScreenMovieDescription_UI.ScreenMovieDescription_UI_C.BndEvt__CmnRichControllButton_UI_K2Node_ComponentBoundEvent_0_SnfButtonDescriptionRateDelegate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct ScreenMovieDescription_UI_C_BndEvt__CmnRichControllButton_UI_K2Node_ComponentBoundEvent_0_SnfButtonDescriptionRateDelegate__DelegateSignature final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScreenMovieDescription_UI_C_BndEvt__CmnRichControllButton_UI_K2Node_ComponentBoundEvent_0_SnfButtonDescriptionRateDelegate__DelegateSignature) == 0x000004, "Wrong alignment on ScreenMovieDescription_UI_C_BndEvt__CmnRichControllButton_UI_K2Node_ComponentBoundEvent_0_SnfButtonDescriptionRateDelegate__DelegateSignature");
static_assert(sizeof(ScreenMovieDescription_UI_C_BndEvt__CmnRichControllButton_UI_K2Node_ComponentBoundEvent_0_SnfButtonDescriptionRateDelegate__DelegateSignature) == 0x000004, "Wrong size on ScreenMovieDescription_UI_C_BndEvt__CmnRichControllButton_UI_K2Node_ComponentBoundEvent_0_SnfButtonDescriptionRateDelegate__DelegateSignature");
static_assert(offsetof(ScreenMovieDescription_UI_C_BndEvt__CmnRichControllButton_UI_K2Node_ComponentBoundEvent_0_SnfButtonDescriptionRateDelegate__DelegateSignature, Rate) == 0x000000, "Member 'ScreenMovieDescription_UI_C_BndEvt__CmnRichControllButton_UI_K2Node_ComponentBoundEvent_0_SnfButtonDescriptionRateDelegate__DelegateSignature::Rate' has a wrong offset!");

// Function ScreenMovieDescription_UI.ScreenMovieDescription_UI_C.StopAnim
// 0x0014 (0x0014 - 0x0000)
struct ScreenMovieDescription_UI_C_StopAnim final
{
public:
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScreenMovieDescription_UI_C_StopAnim) == 0x000004, "Wrong alignment on ScreenMovieDescription_UI_C_StopAnim");
static_assert(sizeof(ScreenMovieDescription_UI_C_StopAnim) == 0x000014, "Wrong size on ScreenMovieDescription_UI_C_StopAnim");
static_assert(offsetof(ScreenMovieDescription_UI_C_StopAnim, K2Node_MakeStruct_LinearColor) == 0x000000, "Member 'ScreenMovieDescription_UI_C_StopAnim::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(ScreenMovieDescription_UI_C_StopAnim, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'ScreenMovieDescription_UI_C_StopAnim::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScreenMovieDescription_UI_C_StopAnim, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'ScreenMovieDescription_UI_C_StopAnim::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

