#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: T_Blindfold_AC

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function T_Blindfold_AC.T_Blindfold_AC_C.ExecuteUbergraph_T_Blindfold_AC
// 0x00F0 (0x00F0 - 0x0000)
struct T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTalisman_AN_C*                         K2Node_DynamicCast_AsTalisman_AN;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTalisman_AN_C*                         K2Node_DynamicCast_AsTalisman_AN_1;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTalisman_AN_C*                         K2Node_DynamicCast_AsTalisman_AN_2;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_InHitResult;                          // 0x004C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTalisman_AN_C*                         K2Node_DynamicCast_AsTalisman_AN_3;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableStartStance_ReturnValue;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableEndStance_ReturnValue;            // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC) == 0x000008, "Wrong alignment on T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC");
static_assert(sizeof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC) == 0x0000F0, "Wrong size on T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, EntryPoint) == 0x000000, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::EntryPoint' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, K2Node_DynamicCast_AsTalisman_AN) == 0x000010, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::K2Node_DynamicCast_AsTalisman_AN' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000020, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, K2Node_DynamicCast_AsTalisman_AN_1) == 0x000028, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::K2Node_DynamicCast_AsTalisman_AN_1' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000038, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, K2Node_DynamicCast_AsTalisman_AN_2) == 0x000040, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::K2Node_DynamicCast_AsTalisman_AN_2' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, K2Node_Event_InHitResult) == 0x00004C, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::K2Node_Event_InHitResult' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, CallFunc_GetAnimInstance_ReturnValue_3) == 0x0000D8, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, K2Node_DynamicCast_AsTalisman_AN_3) == 0x0000E0, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::K2Node_DynamicCast_AsTalisman_AN_3' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, K2Node_DynamicCast_bSuccess_3) == 0x0000E8, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, CallFunc_IsEnableStartStance_ReturnValue) == 0x0000E9, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::CallFunc_IsEnableStartStance_ReturnValue' has a wrong offset!");
static_assert(offsetof(T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC, CallFunc_IsEnableEndStance_ReturnValue) == 0x0000EA, "Member 'T_Blindfold_AC_C_ExecuteUbergraph_T_Blindfold_AC::CallFunc_IsEnableEndStance_ReturnValue' has a wrong offset!");

// Function T_Blindfold_AC.T_Blindfold_AC_C.OnHit
// 0x0088 (0x0088 - 0x0000)
struct T_Blindfold_AC_C_OnHit final
{
public:
	struct FHitResult                             InHitResult;                                       // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(T_Blindfold_AC_C_OnHit) == 0x000004, "Wrong alignment on T_Blindfold_AC_C_OnHit");
static_assert(sizeof(T_Blindfold_AC_C_OnHit) == 0x000088, "Wrong size on T_Blindfold_AC_C_OnHit");
static_assert(offsetof(T_Blindfold_AC_C_OnHit, InHitResult) == 0x000000, "Member 'T_Blindfold_AC_C_OnHit::InHitResult' has a wrong offset!");

}

