#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Talisman_AN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ETalismanAnimType_structs.hpp"


namespace SDK::Params
{

// Function Talisman_AN.Talisman_AN_C.ExecuteUbergraph_Talisman_AN
// 0x0008 (0x0008 - 0x0000)
struct Talisman_AN_C_ExecuteUbergraph_Talisman_AN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Talisman_AN_C_ExecuteUbergraph_Talisman_AN) == 0x000004, "Wrong alignment on Talisman_AN_C_ExecuteUbergraph_Talisman_AN");
static_assert(sizeof(Talisman_AN_C_ExecuteUbergraph_Talisman_AN) == 0x000008, "Wrong size on Talisman_AN_C_ExecuteUbergraph_Talisman_AN");
static_assert(offsetof(Talisman_AN_C_ExecuteUbergraph_Talisman_AN, EntryPoint) == 0x000000, "Member 'Talisman_AN_C_ExecuteUbergraph_Talisman_AN::EntryPoint' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_ExecuteUbergraph_Talisman_AN, CallFunc_Montage_Play_ReturnValue) == 0x000004, "Member 'Talisman_AN_C_ExecuteUbergraph_Talisman_AN::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function Talisman_AN.Talisman_AN_C.PlayTalismanAnim
// 0x003C (0x003C - 0x0000)
struct Talisman_AN_C_PlayTalismanAnim final
{
public:
	ETalismanAnimType                             AnimType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETalismanAnimType                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Talisman_AN_C_PlayTalismanAnim) == 0x000004, "Wrong alignment on Talisman_AN_C_PlayTalismanAnim");
static_assert(sizeof(Talisman_AN_C_PlayTalismanAnim) == 0x00003C, "Wrong size on Talisman_AN_C_PlayTalismanAnim");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, AnimType) == 0x000000, "Member 'Talisman_AN_C_PlayTalismanAnim::AnimType' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, Temp_byte_Variable) == 0x000001, "Member 'Talisman_AN_C_PlayTalismanAnim::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, Temp_name_Variable) == 0x000004, "Member 'Talisman_AN_C_PlayTalismanAnim::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, Temp_name_Variable_1) == 0x00000C, "Member 'Talisman_AN_C_PlayTalismanAnim::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, Temp_name_Variable_2) == 0x000014, "Member 'Talisman_AN_C_PlayTalismanAnim::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, Temp_name_Variable_3) == 0x00001C, "Member 'Talisman_AN_C_PlayTalismanAnim::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, Temp_name_Variable_4) == 0x000024, "Member 'Talisman_AN_C_PlayTalismanAnim::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, K2Node_Select_Default) == 0x00002C, "Member 'Talisman_AN_C_PlayTalismanAnim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'Talisman_AN_C_PlayTalismanAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Talisman_AN_C_PlayTalismanAnim, CallFunc_Montage_Play_ReturnValue) == 0x000038, "Member 'Talisman_AN_C_PlayTalismanAnim::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");

// Function Talisman_AN.Talisman_AN_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Talisman_AN_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Talisman_AN_C_AnimGraph) == 0x000008, "Wrong alignment on Talisman_AN_C_AnimGraph");
static_assert(sizeof(Talisman_AN_C_AnimGraph) == 0x000010, "Wrong size on Talisman_AN_C_AnimGraph");
static_assert(offsetof(Talisman_AN_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Talisman_AN_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

