#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TangoLib

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "TangoLib_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TangoLib.TngAIControllerInterface.AddCombatTargets
// 0x0008 (0x0008 - 0x0000)
struct TngAIControllerInterface_AddCombatTargets final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngAIControllerInterface_AddCombatTargets) == 0x000008, "Wrong alignment on TngAIControllerInterface_AddCombatTargets");
static_assert(sizeof(TngAIControllerInterface_AddCombatTargets) == 0x000008, "Wrong size on TngAIControllerInterface_AddCombatTargets");
static_assert(offsetof(TngAIControllerInterface_AddCombatTargets, Actor) == 0x000000, "Member 'TngAIControllerInterface_AddCombatTargets::Actor' has a wrong offset!");

// Function TangoLib.TngAIControllerInterface.NotifySmartLinkReached
// 0x0018 (0x0018 - 0x0000)
struct TngAIControllerInterface_NotifySmartLinkReached final
{
public:
	class ATngNavLinkProxy*                       NavLink;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Destination;                                       // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngAIControllerInterface_NotifySmartLinkReached) == 0x000008, "Wrong alignment on TngAIControllerInterface_NotifySmartLinkReached");
static_assert(sizeof(TngAIControllerInterface_NotifySmartLinkReached) == 0x000018, "Wrong size on TngAIControllerInterface_NotifySmartLinkReached");
static_assert(offsetof(TngAIControllerInterface_NotifySmartLinkReached, NavLink) == 0x000000, "Member 'TngAIControllerInterface_NotifySmartLinkReached::NavLink' has a wrong offset!");
static_assert(offsetof(TngAIControllerInterface_NotifySmartLinkReached, Destination) == 0x000008, "Member 'TngAIControllerInterface_NotifySmartLinkReached::Destination' has a wrong offset!");

// Function TangoLib.TngAIControllerInterface.RemoteDriveToLocation
// 0x0010 (0x0010 - 0x0000)
struct TngAIControllerInterface_RemoteDriveToLocation final
{
public:
	struct FVector                                Destination;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeedRate;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngAIControllerInterface_RemoteDriveToLocation) == 0x000004, "Wrong alignment on TngAIControllerInterface_RemoteDriveToLocation");
static_assert(sizeof(TngAIControllerInterface_RemoteDriveToLocation) == 0x000010, "Wrong size on TngAIControllerInterface_RemoteDriveToLocation");
static_assert(offsetof(TngAIControllerInterface_RemoteDriveToLocation, Destination) == 0x000000, "Member 'TngAIControllerInterface_RemoteDriveToLocation::Destination' has a wrong offset!");
static_assert(offsetof(TngAIControllerInterface_RemoteDriveToLocation, MaxSpeedRate) == 0x00000C, "Member 'TngAIControllerInterface_RemoteDriveToLocation::MaxSpeedRate' has a wrong offset!");

// Function TangoLib.TngAIControllerInterface.RemoveCombatTargets
// 0x0008 (0x0008 - 0x0000)
struct TngAIControllerInterface_RemoveCombatTargets final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngAIControllerInterface_RemoveCombatTargets) == 0x000008, "Wrong alignment on TngAIControllerInterface_RemoveCombatTargets");
static_assert(sizeof(TngAIControllerInterface_RemoveCombatTargets) == 0x000008, "Wrong size on TngAIControllerInterface_RemoveCombatTargets");
static_assert(offsetof(TngAIControllerInterface_RemoveCombatTargets, Actor) == 0x000000, "Member 'TngAIControllerInterface_RemoveCombatTargets::Actor' has a wrong offset!");

// Function TangoLib.TngAIControllerInterface.SetPathFindFilter
// 0x0008 (0x0008 - 0x0000)
struct TngAIControllerInterface_SetPathFindFilter final
{
public:
	TSubclassOf<class UNavigationQueryFilter>     NewFilter;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngAIControllerInterface_SetPathFindFilter) == 0x000008, "Wrong alignment on TngAIControllerInterface_SetPathFindFilter");
static_assert(sizeof(TngAIControllerInterface_SetPathFindFilter) == 0x000008, "Wrong size on TngAIControllerInterface_SetPathFindFilter");
static_assert(offsetof(TngAIControllerInterface_SetPathFindFilter, NewFilter) == 0x000000, "Member 'TngAIControllerInterface_SetPathFindFilter::NewFilter' has a wrong offset!");

// Function TangoLib.TngAIControllerInterface.SetSlowDownAtGoal
// 0x0001 (0x0001 - 0x0000)
struct TngAIControllerInterface_SetSlowDownAtGoal final
{
public:
	bool                                          NewFlag;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngAIControllerInterface_SetSlowDownAtGoal) == 0x000001, "Wrong alignment on TngAIControllerInterface_SetSlowDownAtGoal");
static_assert(sizeof(TngAIControllerInterface_SetSlowDownAtGoal) == 0x000001, "Wrong size on TngAIControllerInterface_SetSlowDownAtGoal");
static_assert(offsetof(TngAIControllerInterface_SetSlowDownAtGoal, NewFlag) == 0x000000, "Member 'TngAIControllerInterface_SetSlowDownAtGoal::NewFlag' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.K2_AddItem
// 0x0020 (0x0020 - 0x0000)
struct TngInventoryComponent_K2_AddItem final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFake;                                            // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngInventoryComponent_K2_AddItem) == 0x000008, "Wrong alignment on TngInventoryComponent_K2_AddItem");
static_assert(sizeof(TngInventoryComponent_K2_AddItem) == 0x000020, "Wrong size on TngInventoryComponent_K2_AddItem");
static_assert(offsetof(TngInventoryComponent_K2_AddItem, Receiver) == 0x000000, "Member 'TngInventoryComponent_K2_AddItem::Receiver' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_AddItem, ItemClass) == 0x000008, "Member 'TngInventoryComponent_K2_AddItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_AddItem, Count) == 0x000010, "Member 'TngInventoryComponent_K2_AddItem::Count' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_AddItem, IsFake) == 0x000014, "Member 'TngInventoryComponent_K2_AddItem::IsFake' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_AddItem, ReturnValue) == 0x000018, "Member 'TngInventoryComponent_K2_AddItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.K2_AddItemList
// 0x0020 (0x0020 - 0x0000)
struct TngInventoryComponent_K2_AddItemList final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTngInventoryItem>              ItemList;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          IsRemove;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_K2_AddItemList) == 0x000008, "Wrong alignment on TngInventoryComponent_K2_AddItemList");
static_assert(sizeof(TngInventoryComponent_K2_AddItemList) == 0x000020, "Wrong size on TngInventoryComponent_K2_AddItemList");
static_assert(offsetof(TngInventoryComponent_K2_AddItemList, Receiver) == 0x000000, "Member 'TngInventoryComponent_K2_AddItemList::Receiver' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_AddItemList, ItemList) == 0x000008, "Member 'TngInventoryComponent_K2_AddItemList::ItemList' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_AddItemList, IsRemove) == 0x000018, "Member 'TngInventoryComponent_K2_AddItemList::IsRemove' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_AddItemList, ReturnValue) == 0x00001C, "Member 'TngInventoryComponent_K2_AddItemList::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.K2_GetInventoryCount
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_K2_GetInventoryCount final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngInventoryComponent_K2_GetInventoryCount) == 0x000008, "Wrong alignment on TngInventoryComponent_K2_GetInventoryCount");
static_assert(sizeof(TngInventoryComponent_K2_GetInventoryCount) == 0x000010, "Wrong size on TngInventoryComponent_K2_GetInventoryCount");
static_assert(offsetof(TngInventoryComponent_K2_GetInventoryCount, Receiver) == 0x000000, "Member 'TngInventoryComponent_K2_GetInventoryCount::Receiver' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_GetInventoryCount, ReturnValue) == 0x000008, "Member 'TngInventoryComponent_K2_GetInventoryCount::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.K2_GetInventoryCountFromTag
// 0x0018 (0x0018 - 0x0000)
struct TngInventoryComponent_K2_GetInventoryCountFromTag final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CheckTag;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngInventoryComponent_K2_GetInventoryCountFromTag) == 0x000008, "Wrong alignment on TngInventoryComponent_K2_GetInventoryCountFromTag");
static_assert(sizeof(TngInventoryComponent_K2_GetInventoryCountFromTag) == 0x000018, "Wrong size on TngInventoryComponent_K2_GetInventoryCountFromTag");
static_assert(offsetof(TngInventoryComponent_K2_GetInventoryCountFromTag, Receiver) == 0x000000, "Member 'TngInventoryComponent_K2_GetInventoryCountFromTag::Receiver' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_GetInventoryCountFromTag, CheckTag) == 0x000008, "Member 'TngInventoryComponent_K2_GetInventoryCountFromTag::CheckTag' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_GetInventoryCountFromTag, ReturnValue) == 0x000010, "Member 'TngInventoryComponent_K2_GetInventoryCountFromTag::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.K2_GetItemCountFromClass
// 0x0018 (0x0018 - 0x0000)
struct TngInventoryComponent_K2_GetItemCountFromClass final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckInherit;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_K2_GetItemCountFromClass) == 0x000008, "Wrong alignment on TngInventoryComponent_K2_GetItemCountFromClass");
static_assert(sizeof(TngInventoryComponent_K2_GetItemCountFromClass) == 0x000018, "Wrong size on TngInventoryComponent_K2_GetItemCountFromClass");
static_assert(offsetof(TngInventoryComponent_K2_GetItemCountFromClass, Receiver) == 0x000000, "Member 'TngInventoryComponent_K2_GetItemCountFromClass::Receiver' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_GetItemCountFromClass, ItemClass) == 0x000008, "Member 'TngInventoryComponent_K2_GetItemCountFromClass::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_GetItemCountFromClass, CheckInherit) == 0x000010, "Member 'TngInventoryComponent_K2_GetItemCountFromClass::CheckInherit' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_GetItemCountFromClass, ReturnValue) == 0x000014, "Member 'TngInventoryComponent_K2_GetItemCountFromClass::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.K2_GetItemCountFromTag
// 0x0018 (0x0018 - 0x0000)
struct TngInventoryComponent_K2_GetItemCountFromTag final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CheckTag;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngInventoryComponent_K2_GetItemCountFromTag) == 0x000008, "Wrong alignment on TngInventoryComponent_K2_GetItemCountFromTag");
static_assert(sizeof(TngInventoryComponent_K2_GetItemCountFromTag) == 0x000018, "Wrong size on TngInventoryComponent_K2_GetItemCountFromTag");
static_assert(offsetof(TngInventoryComponent_K2_GetItemCountFromTag, Receiver) == 0x000000, "Member 'TngInventoryComponent_K2_GetItemCountFromTag::Receiver' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_GetItemCountFromTag, CheckTag) == 0x000008, "Member 'TngInventoryComponent_K2_GetItemCountFromTag::CheckTag' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_GetItemCountFromTag, ReturnValue) == 0x000010, "Member 'TngInventoryComponent_K2_GetItemCountFromTag::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.K2_TransferInventory
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_K2_TransferInventory final
{
public:
	class AActor*                                 Sender;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Receiver;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_K2_TransferInventory) == 0x000008, "Wrong alignment on TngInventoryComponent_K2_TransferInventory");
static_assert(sizeof(TngInventoryComponent_K2_TransferInventory) == 0x000010, "Wrong size on TngInventoryComponent_K2_TransferInventory");
static_assert(offsetof(TngInventoryComponent_K2_TransferInventory, Sender) == 0x000000, "Member 'TngInventoryComponent_K2_TransferInventory::Sender' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_TransferInventory, Receiver) == 0x000008, "Member 'TngInventoryComponent_K2_TransferInventory::Receiver' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.K2_TransferItem
// 0x0020 (0x0020 - 0x0000)
struct TngInventoryComponent_K2_TransferItem final
{
public:
	class AActor*                                 Sender;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Receiver;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_K2_TransferItem) == 0x000008, "Wrong alignment on TngInventoryComponent_K2_TransferItem");
static_assert(sizeof(TngInventoryComponent_K2_TransferItem) == 0x000020, "Wrong size on TngInventoryComponent_K2_TransferItem");
static_assert(offsetof(TngInventoryComponent_K2_TransferItem, Sender) == 0x000000, "Member 'TngInventoryComponent_K2_TransferItem::Sender' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_TransferItem, Receiver) == 0x000008, "Member 'TngInventoryComponent_K2_TransferItem::Receiver' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_TransferItem, ItemClass) == 0x000010, "Member 'TngInventoryComponent_K2_TransferItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_TransferItem, Count) == 0x000018, "Member 'TngInventoryComponent_K2_TransferItem::Count' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_K2_TransferItem, ReturnValue) == 0x00001C, "Member 'TngInventoryComponent_K2_TransferItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.AddItem
// 0x0018 (0x0018 - 0x0000)
struct TngInventoryComponent_AddItem final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFake;                                            // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngInventoryComponent_AddItem) == 0x000008, "Wrong alignment on TngInventoryComponent_AddItem");
static_assert(sizeof(TngInventoryComponent_AddItem) == 0x000018, "Wrong size on TngInventoryComponent_AddItem");
static_assert(offsetof(TngInventoryComponent_AddItem, ItemClass) == 0x000000, "Member 'TngInventoryComponent_AddItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_AddItem, Count) == 0x000008, "Member 'TngInventoryComponent_AddItem::Count' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_AddItem, IsFake) == 0x00000C, "Member 'TngInventoryComponent_AddItem::IsFake' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_AddItem, ReturnValue) == 0x000010, "Member 'TngInventoryComponent_AddItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.AddItemList
// 0x0018 (0x0018 - 0x0000)
struct TngInventoryComponent_AddItemList final
{
public:
	TArray<struct FTngInventoryItem>              ItemList;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          IsRemove;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_AddItemList) == 0x000008, "Wrong alignment on TngInventoryComponent_AddItemList");
static_assert(sizeof(TngInventoryComponent_AddItemList) == 0x000018, "Wrong size on TngInventoryComponent_AddItemList");
static_assert(offsetof(TngInventoryComponent_AddItemList, ItemList) == 0x000000, "Member 'TngInventoryComponent_AddItemList::ItemList' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_AddItemList, IsRemove) == 0x000010, "Member 'TngInventoryComponent_AddItemList::IsRemove' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_AddItemList, ReturnValue) == 0x000014, "Member 'TngInventoryComponent_AddItemList::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.Blueprint_PostChangeItemCount
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_Blueprint_PostChangeItemCount final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldCount;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_Blueprint_PostChangeItemCount) == 0x000008, "Wrong alignment on TngInventoryComponent_Blueprint_PostChangeItemCount");
static_assert(sizeof(TngInventoryComponent_Blueprint_PostChangeItemCount) == 0x000010, "Wrong size on TngInventoryComponent_Blueprint_PostChangeItemCount");
static_assert(offsetof(TngInventoryComponent_Blueprint_PostChangeItemCount, ItemClass) == 0x000000, "Member 'TngInventoryComponent_Blueprint_PostChangeItemCount::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_Blueprint_PostChangeItemCount, NewCount) == 0x000008, "Member 'TngInventoryComponent_Blueprint_PostChangeItemCount::NewCount' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_Blueprint_PostChangeItemCount, OldCount) == 0x00000C, "Member 'TngInventoryComponent_Blueprint_PostChangeItemCount::OldCount' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetInventoryFromClass
// 0x0020 (0x0020 - 0x0000)
struct TngInventoryComponent_GetInventoryFromClass final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GetIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckInherit;                                      // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngInventoryItem                      ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetInventoryFromClass) == 0x000008, "Wrong alignment on TngInventoryComponent_GetInventoryFromClass");
static_assert(sizeof(TngInventoryComponent_GetInventoryFromClass) == 0x000020, "Wrong size on TngInventoryComponent_GetInventoryFromClass");
static_assert(offsetof(TngInventoryComponent_GetInventoryFromClass, ItemClass) == 0x000000, "Member 'TngInventoryComponent_GetInventoryFromClass::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryFromClass, GetIndex) == 0x000008, "Member 'TngInventoryComponent_GetInventoryFromClass::GetIndex' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryFromClass, CheckInherit) == 0x00000C, "Member 'TngInventoryComponent_GetInventoryFromClass::CheckInherit' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryFromClass, ReturnValue) == 0x000010, "Member 'TngInventoryComponent_GetInventoryFromClass::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetInventoryFromIndex
// 0x0018 (0x0018 - 0x0000)
struct TngInventoryComponent_GetInventoryFromIndex final
{
public:
	int32                                         GetIndex;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngInventoryItem                      ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetInventoryFromIndex) == 0x000008, "Wrong alignment on TngInventoryComponent_GetInventoryFromIndex");
static_assert(sizeof(TngInventoryComponent_GetInventoryFromIndex) == 0x000018, "Wrong size on TngInventoryComponent_GetInventoryFromIndex");
static_assert(offsetof(TngInventoryComponent_GetInventoryFromIndex, GetIndex) == 0x000000, "Member 'TngInventoryComponent_GetInventoryFromIndex::GetIndex' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryFromIndex, ReturnValue) == 0x000008, "Member 'TngInventoryComponent_GetInventoryFromIndex::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetInventoryFromTag
// 0x0020 (0x0020 - 0x0000)
struct TngInventoryComponent_GetInventoryFromTag final
{
public:
	class FName                                   CheckTag;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GetIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngInventoryItem                      ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetInventoryFromTag) == 0x000008, "Wrong alignment on TngInventoryComponent_GetInventoryFromTag");
static_assert(sizeof(TngInventoryComponent_GetInventoryFromTag) == 0x000020, "Wrong size on TngInventoryComponent_GetInventoryFromTag");
static_assert(offsetof(TngInventoryComponent_GetInventoryFromTag, CheckTag) == 0x000000, "Member 'TngInventoryComponent_GetInventoryFromTag::CheckTag' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryFromTag, GetIndex) == 0x000008, "Member 'TngInventoryComponent_GetInventoryFromTag::GetIndex' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryFromTag, ReturnValue) == 0x000010, "Member 'TngInventoryComponent_GetInventoryFromTag::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetInventoryListFromClass
// 0x0020 (0x0020 - 0x0000)
struct TngInventoryComponent_GetInventoryListFromClass final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckInherit;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTngInventoryItem>              ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetInventoryListFromClass) == 0x000008, "Wrong alignment on TngInventoryComponent_GetInventoryListFromClass");
static_assert(sizeof(TngInventoryComponent_GetInventoryListFromClass) == 0x000020, "Wrong size on TngInventoryComponent_GetInventoryListFromClass");
static_assert(offsetof(TngInventoryComponent_GetInventoryListFromClass, ItemClass) == 0x000000, "Member 'TngInventoryComponent_GetInventoryListFromClass::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryListFromClass, CheckInherit) == 0x000008, "Member 'TngInventoryComponent_GetInventoryListFromClass::CheckInherit' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryListFromClass, ReturnValue) == 0x000010, "Member 'TngInventoryComponent_GetInventoryListFromClass::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetInventoryListFromTag
// 0x0018 (0x0018 - 0x0000)
struct TngInventoryComponent_GetInventoryListFromTag final
{
public:
	class FName                                   CheckTag;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTngInventoryItem>              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetInventoryListFromTag) == 0x000008, "Wrong alignment on TngInventoryComponent_GetInventoryListFromTag");
static_assert(sizeof(TngInventoryComponent_GetInventoryListFromTag) == 0x000018, "Wrong size on TngInventoryComponent_GetInventoryListFromTag");
static_assert(offsetof(TngInventoryComponent_GetInventoryListFromTag, CheckTag) == 0x000000, "Member 'TngInventoryComponent_GetInventoryListFromTag::CheckTag' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryListFromTag, ReturnValue) == 0x000008, "Member 'TngInventoryComponent_GetInventoryListFromTag::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.RemoveAllItem
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_RemoveAllItem final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngInventoryComponent_RemoveAllItem) == 0x000008, "Wrong alignment on TngInventoryComponent_RemoveAllItem");
static_assert(sizeof(TngInventoryComponent_RemoveAllItem) == 0x000010, "Wrong size on TngInventoryComponent_RemoveAllItem");
static_assert(offsetof(TngInventoryComponent_RemoveAllItem, ItemClass) == 0x000000, "Member 'TngInventoryComponent_RemoveAllItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_RemoveAllItem, ReturnValue) == 0x000008, "Member 'TngInventoryComponent_RemoveAllItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.RemoveItem
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_RemoveItem final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_RemoveItem) == 0x000008, "Wrong alignment on TngInventoryComponent_RemoveItem");
static_assert(sizeof(TngInventoryComponent_RemoveItem) == 0x000010, "Wrong size on TngInventoryComponent_RemoveItem");
static_assert(offsetof(TngInventoryComponent_RemoveItem, ItemClass) == 0x000000, "Member 'TngInventoryComponent_RemoveItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_RemoveItem, Count) == 0x000008, "Member 'TngInventoryComponent_RemoveItem::Count' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_RemoveItem, ReturnValue) == 0x00000C, "Member 'TngInventoryComponent_RemoveItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.SetInventoryReturnFlag
// 0x0001 (0x0001 - 0x0000)
struct TngInventoryComponent_SetInventoryReturnFlag final
{
public:
	bool                                          ReturnBool;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_SetInventoryReturnFlag) == 0x000001, "Wrong alignment on TngInventoryComponent_SetInventoryReturnFlag");
static_assert(sizeof(TngInventoryComponent_SetInventoryReturnFlag) == 0x000001, "Wrong size on TngInventoryComponent_SetInventoryReturnFlag");
static_assert(offsetof(TngInventoryComponent_SetInventoryReturnFlag, ReturnBool) == 0x000000, "Member 'TngInventoryComponent_SetInventoryReturnFlag::ReturnBool' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.SetInventoryReturnNumber
// 0x0004 (0x0004 - 0x0000)
struct TngInventoryComponent_SetInventoryReturnNumber final
{
public:
	int32                                         ReturnInt;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_SetInventoryReturnNumber) == 0x000004, "Wrong alignment on TngInventoryComponent_SetInventoryReturnNumber");
static_assert(sizeof(TngInventoryComponent_SetInventoryReturnNumber) == 0x000004, "Wrong size on TngInventoryComponent_SetInventoryReturnNumber");
static_assert(offsetof(TngInventoryComponent_SetInventoryReturnNumber, ReturnInt) == 0x000000, "Member 'TngInventoryComponent_SetInventoryReturnNumber::ReturnInt' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.SetItem
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_SetItem final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_SetItem) == 0x000008, "Wrong alignment on TngInventoryComponent_SetItem");
static_assert(sizeof(TngInventoryComponent_SetItem) == 0x000010, "Wrong size on TngInventoryComponent_SetItem");
static_assert(offsetof(TngInventoryComponent_SetItem, ItemClass) == 0x000000, "Member 'TngInventoryComponent_SetItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_SetItem, Count) == 0x000008, "Member 'TngInventoryComponent_SetItem::Count' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_SetItem, ReturnValue) == 0x00000C, "Member 'TngInventoryComponent_SetItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.TransferAllItem
// 0x0018 (0x0018 - 0x0000)
struct TngInventoryComponent_TransferAllItem final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngInventoryComponent_TransferAllItem) == 0x000008, "Wrong alignment on TngInventoryComponent_TransferAllItem");
static_assert(sizeof(TngInventoryComponent_TransferAllItem) == 0x000018, "Wrong size on TngInventoryComponent_TransferAllItem");
static_assert(offsetof(TngInventoryComponent_TransferAllItem, Receiver) == 0x000000, "Member 'TngInventoryComponent_TransferAllItem::Receiver' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_TransferAllItem, ItemClass) == 0x000008, "Member 'TngInventoryComponent_TransferAllItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_TransferAllItem, ReturnValue) == 0x000010, "Member 'TngInventoryComponent_TransferAllItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.TransferInventory
// 0x0008 (0x0008 - 0x0000)
struct TngInventoryComponent_TransferInventory final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_TransferInventory) == 0x000008, "Wrong alignment on TngInventoryComponent_TransferInventory");
static_assert(sizeof(TngInventoryComponent_TransferInventory) == 0x000008, "Wrong size on TngInventoryComponent_TransferInventory");
static_assert(offsetof(TngInventoryComponent_TransferInventory, Receiver) == 0x000000, "Member 'TngInventoryComponent_TransferInventory::Receiver' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.TransferItem
// 0x0018 (0x0018 - 0x0000)
struct TngInventoryComponent_TransferItem final
{
public:
	class AActor*                                 Receiver;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_TransferItem) == 0x000008, "Wrong alignment on TngInventoryComponent_TransferItem");
static_assert(sizeof(TngInventoryComponent_TransferItem) == 0x000018, "Wrong size on TngInventoryComponent_TransferItem");
static_assert(offsetof(TngInventoryComponent_TransferItem, Receiver) == 0x000000, "Member 'TngInventoryComponent_TransferItem::Receiver' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_TransferItem, ItemClass) == 0x000008, "Member 'TngInventoryComponent_TransferItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_TransferItem, Count) == 0x000010, "Member 'TngInventoryComponent_TransferItem::Count' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_TransferItem, ReturnValue) == 0x000014, "Member 'TngInventoryComponent_TransferItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.Blueprint_ShouldAddItemCount
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_Blueprint_ShouldAddItemCount final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_Blueprint_ShouldAddItemCount) == 0x000008, "Wrong alignment on TngInventoryComponent_Blueprint_ShouldAddItemCount");
static_assert(sizeof(TngInventoryComponent_Blueprint_ShouldAddItemCount) == 0x000010, "Wrong size on TngInventoryComponent_Blueprint_ShouldAddItemCount");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldAddItemCount, ItemClass) == 0x000000, "Member 'TngInventoryComponent_Blueprint_ShouldAddItemCount::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldAddItemCount, Count) == 0x000008, "Member 'TngInventoryComponent_Blueprint_ShouldAddItemCount::Count' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldAddItemCount, ReturnValue) == 0x00000C, "Member 'TngInventoryComponent_Blueprint_ShouldAddItemCount::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.Blueprint_ShouldDeleteItem
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_Blueprint_ShouldDeleteItem final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngInventoryComponent_Blueprint_ShouldDeleteItem) == 0x000008, "Wrong alignment on TngInventoryComponent_Blueprint_ShouldDeleteItem");
static_assert(sizeof(TngInventoryComponent_Blueprint_ShouldDeleteItem) == 0x000010, "Wrong size on TngInventoryComponent_Blueprint_ShouldDeleteItem");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldDeleteItem, ItemClass) == 0x000000, "Member 'TngInventoryComponent_Blueprint_ShouldDeleteItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldDeleteItem, ReturnValue) == 0x000008, "Member 'TngInventoryComponent_Blueprint_ShouldDeleteItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.Blueprint_ShouldNewItem
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_Blueprint_ShouldNewItem final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TngInventoryComponent_Blueprint_ShouldNewItem) == 0x000008, "Wrong alignment on TngInventoryComponent_Blueprint_ShouldNewItem");
static_assert(sizeof(TngInventoryComponent_Blueprint_ShouldNewItem) == 0x000010, "Wrong size on TngInventoryComponent_Blueprint_ShouldNewItem");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldNewItem, ItemClass) == 0x000000, "Member 'TngInventoryComponent_Blueprint_ShouldNewItem::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldNewItem, ReturnValue) == 0x000008, "Member 'TngInventoryComponent_Blueprint_ShouldNewItem::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.Blueprint_ShouldRemoveItemCount
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_Blueprint_ShouldRemoveItemCount final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_Blueprint_ShouldRemoveItemCount) == 0x000008, "Wrong alignment on TngInventoryComponent_Blueprint_ShouldRemoveItemCount");
static_assert(sizeof(TngInventoryComponent_Blueprint_ShouldRemoveItemCount) == 0x000010, "Wrong size on TngInventoryComponent_Blueprint_ShouldRemoveItemCount");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldRemoveItemCount, ItemClass) == 0x000000, "Member 'TngInventoryComponent_Blueprint_ShouldRemoveItemCount::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldRemoveItemCount, Count) == 0x000008, "Member 'TngInventoryComponent_Blueprint_ShouldRemoveItemCount::Count' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_Blueprint_ShouldRemoveItemCount, ReturnValue) == 0x00000C, "Member 'TngInventoryComponent_Blueprint_ShouldRemoveItemCount::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetInventoryCount
// 0x0004 (0x0004 - 0x0000)
struct TngInventoryComponent_GetInventoryCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetInventoryCount) == 0x000004, "Wrong alignment on TngInventoryComponent_GetInventoryCount");
static_assert(sizeof(TngInventoryComponent_GetInventoryCount) == 0x000004, "Wrong size on TngInventoryComponent_GetInventoryCount");
static_assert(offsetof(TngInventoryComponent_GetInventoryCount, ReturnValue) == 0x000000, "Member 'TngInventoryComponent_GetInventoryCount::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetInventoryCountFromTag
// 0x000C (0x000C - 0x0000)
struct TngInventoryComponent_GetInventoryCountFromTag final
{
public:
	class FName                                   CheckTag;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetInventoryCountFromTag) == 0x000004, "Wrong alignment on TngInventoryComponent_GetInventoryCountFromTag");
static_assert(sizeof(TngInventoryComponent_GetInventoryCountFromTag) == 0x00000C, "Wrong size on TngInventoryComponent_GetInventoryCountFromTag");
static_assert(offsetof(TngInventoryComponent_GetInventoryCountFromTag, CheckTag) == 0x000000, "Member 'TngInventoryComponent_GetInventoryCountFromTag::CheckTag' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetInventoryCountFromTag, ReturnValue) == 0x000008, "Member 'TngInventoryComponent_GetInventoryCountFromTag::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetInventoryListAll
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_GetInventoryListAll final
{
public:
	TArray<struct FTngInventoryItem>              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetInventoryListAll) == 0x000008, "Wrong alignment on TngInventoryComponent_GetInventoryListAll");
static_assert(sizeof(TngInventoryComponent_GetInventoryListAll) == 0x000010, "Wrong size on TngInventoryComponent_GetInventoryListAll");
static_assert(offsetof(TngInventoryComponent_GetInventoryListAll, ReturnValue) == 0x000000, "Member 'TngInventoryComponent_GetInventoryListAll::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetItemCount
// 0x0004 (0x0004 - 0x0000)
struct TngInventoryComponent_GetItemCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetItemCount) == 0x000004, "Wrong alignment on TngInventoryComponent_GetItemCount");
static_assert(sizeof(TngInventoryComponent_GetItemCount) == 0x000004, "Wrong size on TngInventoryComponent_GetItemCount");
static_assert(offsetof(TngInventoryComponent_GetItemCount, ReturnValue) == 0x000000, "Member 'TngInventoryComponent_GetItemCount::ReturnValue' has a wrong offset!");

// Function TangoLib.TngInventoryComponent.GetItemCountFromClass
// 0x0010 (0x0010 - 0x0000)
struct TngInventoryComponent_GetItemCountFromClass final
{
public:
	TSubclassOf<class UTngItemObject>             ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckInherit;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TngInventoryComponent_GetItemCountFromClass) == 0x000008, "Wrong alignment on TngInventoryComponent_GetItemCountFromClass");
static_assert(sizeof(TngInventoryComponent_GetItemCountFromClass) == 0x000010, "Wrong size on TngInventoryComponent_GetItemCountFromClass");
static_assert(offsetof(TngInventoryComponent_GetItemCountFromClass, ItemClass) == 0x000000, "Member 'TngInventoryComponent_GetItemCountFromClass::ItemClass' has a wrong offset!");
static_assert(offsetof(TngInventoryComponent_GetItemCountFromClass, CheckInherit) == 0x000008, "Member 'TngInventoryComponent_GetItemCountFromClass::CheckInherit' has a wrong offset!");
