#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TangoLib

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "TangoLib_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class TangoLib.TngAIControllerInterface
// 0x0000 (0x0028 - 0x0028)
class ITngAIControllerInterface final : public IInterface
{
public:
	void AddCombatTargets(class AActor* Actor);
	void ClearPathFindFilter();
	void NotifySmartLinkReached(class ATngNavLinkProxy* NavLink, const struct FVector& Destination);
	void RemoteDriveToLocation(const struct FVector& Destination, float MaxSpeedRate);
	void RemoveCombatTargets(class AActor* Actor);
	void SetPathFindFilter(TSubclassOf<class UNavigationQueryFilter> NewFilter);
	void SetSlowDownAtGoal(bool NewFlag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAIControllerInterface">();
	}
	static class ITngAIControllerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITngAIControllerInterface>();
	}
};
static_assert(alignof(ITngAIControllerInterface) == 0x000008, "Wrong alignment on ITngAIControllerInterface");
static_assert(sizeof(ITngAIControllerInterface) == 0x000028, "Wrong size on ITngAIControllerInterface");

// Class TangoLib.TngInventoryComponent
// 0x0068 (0x0118 - 0x00B0)
class UTngInventoryComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_             OnShouldNewItem;                                   // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnShouldDeleteItem;                                // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnShouldAddItemCount;                              // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnShouldRemoveItemCount;                           // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnPostChangeItemCount;                             // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FTngInventoryItem>              InventoryList;                                     // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static int32 K2_AddItem(class AActor* Receiver, TSubclassOf<class UTngItemObject> ItemClass, int32 Count, bool IsFake);
	static int32 K2_AddItemList(class AActor* Receiver, TArray<struct FTngInventoryItem>& ItemList, bool IsRemove);
	static int32 K2_GetInventoryCount(class AActor* Receiver);
	static int32 K2_GetInventoryCountFromTag(class AActor* Receiver, class FName CheckTag);
	static int32 K2_GetItemCountFromClass(class AActor* Receiver, TSubclassOf<class UTngItemObject> ItemClass, bool CheckInherit);
	static int32 K2_GetItemCountFromTag(class AActor* Receiver, class FName CheckTag);
	static void K2_TransferInventory(class AActor* Sender, class AActor* Receiver);
	static int32 K2_TransferItem(class AActor* Sender, class AActor* Receiver, TSubclassOf<class UTngItemObject> ItemClass, int32 Count);

	int32 AddItem(TSubclassOf<class UTngItemObject> ItemClass, int32 Count, bool IsFake);
	int32 AddItemList(TArray<struct FTngInventoryItem>& ItemList, bool IsRemove);
	void Blueprint_PostChangeItemCount(TSubclassOf<class UTngItemObject> ItemClass, int32 NewCount, int32 OldCount);
	struct FTngInventoryItem GetInventoryFromClass(TSubclassOf<class UTngItemObject> ItemClass, int32 GetIndex, bool CheckInherit);
	struct FTngInventoryItem GetInventoryFromIndex(int32 GetIndex);
	struct FTngInventoryItem GetInventoryFromTag(class FName CheckTag, int32 GetIndex);
	TArray<struct FTngInventoryItem> GetInventoryListFromClass(TSubclassOf<class UTngItemObject> ItemClass, bool CheckInherit);
	TArray<struct FTngInventoryItem> GetInventoryListFromTag(class FName CheckTag);
	int32 RemoveAllItem(TSubclassOf<class UTngItemObject> ItemClass);
	int32 RemoveItem(TSubclassOf<class UTngItemObject> ItemClass, int32 Count);
	void SetInventoryReturnFlag(bool ReturnBool);
	void SetInventoryReturnNumber(int32 ReturnInt);
	int32 SetItem(TSubclassOf<class UTngItemObject> ItemClass, int32 Count);
	int32 TransferAllItem(class AActor* Receiver, TSubclassOf<class UTngItemObject> ItemClass);
	void TransferInventory(class AActor* Receiver);
	int32 TransferItem(class AActor* Receiver, TSubclassOf<class UTngItemObject> ItemClass, int32 Count);

	int32 Blueprint_ShouldAddItemCount(TSubclassOf<class UTngItemObject> ItemClass, int32 Count) const;
	bool Blueprint_ShouldDeleteItem(TSubclassOf<class UTngItemObject> ItemClass) const;
	bool Blueprint_ShouldNewItem(TSubclassOf<class UTngItemObject> ItemClass) const;
	int32 Blueprint_ShouldRemoveItemCount(TSubclassOf<class UTngItemObject> ItemClass, int32 Count) const;
	int32 GetInventoryCount() const;
	int32 GetInventoryCountFromTag(class FName CheckTag) const;
	const TArray<struct FTngInventoryItem> GetInventoryListAll() const;
	int32 GetItemCount() const;
	int32 GetItemCountFromClass(TSubclassOf<class UTngItemObject> ItemClass, bool CheckInherit) const;
	int32 GetItemCountFromTag(class FName CheckTag) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngInventoryComponent">();
	}
	static class UTngInventoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngInventoryComponent>();
	}
};
static_assert(alignof(UTngInventoryComponent) == 0x000008, "Wrong alignment on UTngInventoryComponent");
static_assert(sizeof(UTngInventoryComponent) == 0x000118, "Wrong size on UTngInventoryComponent");
static_assert(offsetof(UTngInventoryComponent, OnShouldNewItem) == 0x0000B0, "Member 'UTngInventoryComponent::OnShouldNewItem' has a wrong offset!");
static_assert(offsetof(UTngInventoryComponent, OnShouldDeleteItem) == 0x0000C0, "Member 'UTngInventoryComponent::OnShouldDeleteItem' has a wrong offset!");
static_assert(offsetof(UTngInventoryComponent, OnShouldAddItemCount) == 0x0000D0, "Member 'UTngInventoryComponent::OnShouldAddItemCount' has a wrong offset!");
static_assert(offsetof(UTngInventoryComponent, OnShouldRemoveItemCount) == 0x0000E0, "Member 'UTngInventoryComponent::OnShouldRemoveItemCount' has a wrong offset!");
static_assert(offsetof(UTngInventoryComponent, OnPostChangeItemCount) == 0x0000F0, "Member 'UTngInventoryComponent::OnPostChangeItemCount' has a wrong offset!");
static_assert(offsetof(UTngInventoryComponent, InventoryList) == 0x000100, "Member 'UTngInventoryComponent::InventoryList' has a wrong offset!");

// Class TangoLib.TngEquipAdvanceParamBase
// 0x0000 (0x0028 - 0x0028)
class UTngEquipAdvanceParamBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngEquipAdvanceParamBase">();
	}
	static class UTngEquipAdvanceParamBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngEquipAdvanceParamBase>();
	}
};
static_assert(alignof(UTngEquipAdvanceParamBase) == 0x000008, "Wrong alignment on UTngEquipAdvanceParamBase");
static_assert(sizeof(UTngEquipAdvanceParamBase) == 0x000028, "Wrong size on UTngEquipAdvanceParamBase");

// Class TangoLib.TngDynamicBlackboardComponent
// 0x0020 (0x00D0 - 0x00B0)
class UTngDynamicBlackboardComponent final : public UActorComponent
{
public:
	TArray<TSubclassOf<class UTngBlackboardData>> DefaultList;                                       // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UTngBlackboardData*>             DataList;                                          // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void SetValueAsBool(const class FName& KeyName, bool SetValue);
	void SetValueAsClass(const class FName& KeyName, class UClass* SetValue);
	void SetValueAsEnum(const class FName& KeyName, uint8 SetValue);
	void SetValueAsFloat(const class FName& KeyName, float SetValue);
	void SetValueAsInt(const class FName& KeyName, int32 SetValue);
	void SetValueAsName(const class FName& KeyName, class FName SetValue);
	void SetValueAsObject(const class FName& KeyName, class UObject* SetValue);
	void SetValueAsRotator(const class FName& KeyName, const struct FRotator& SetValue);
	void SetValueAsString(const class FName& KeyName, const class FString& SetValue);
	void SetValueAsVector(const class FName& KeyName, const struct FVector& SetValue);

	bool CheckValueAsBool(const class FName& KeyName) const;
	bool CheckValueAsClass(const class FName& KeyName) const;
	bool CheckValueAsEnum(const class FName& KeyName) const;
	bool CheckValueAsFloat(const class FName& KeyName) const;
	bool CheckValueAsInt(const class FName& KeyName) const;
	bool CheckValueAsName(const class FName& KeyName) const;
	bool CheckValueAsObject(const class FName& KeyName) const;
	bool CheckValueAsRotator(const class FName& KeyName) const;
	bool CheckValueAsString(const class FName& KeyName) const;
	bool CheckValueAsVector(const class FName& KeyName) const;
	bool GetValueAsBool(const class FName& KeyName) const;
	class UClass* GetValueAsClass(const class FName& KeyName) const;
	uint8 GetValueAsEnum(const class FName& KeyName) const;
	float GetValueAsFloat(const class FName& KeyName) const;
	int32 GetValueAsInt(const class FName& KeyName) const;
	class FName GetValueAsName(const class FName& KeyName) const;
	class UObject* GetValueAsObject(const class FName& KeyName) const;
	struct FRotator GetValueAsRotator(const class FName& KeyName) const;
	class FString GetValueAsString(const class FName& KeyName) const;
	struct FVector GetValueAsVector(const class FName& KeyName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngDynamicBlackboardComponent">();
	}
	static class UTngDynamicBlackboardComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngDynamicBlackboardComponent>();
	}
};
static_assert(alignof(UTngDynamicBlackboardComponent) == 0x000008, "Wrong alignment on UTngDynamicBlackboardComponent");
static_assert(sizeof(UTngDynamicBlackboardComponent) == 0x0000D0, "Wrong size on UTngDynamicBlackboardComponent");
static_assert(offsetof(UTngDynamicBlackboardComponent, DefaultList) == 0x0000B0, "Member 'UTngDynamicBlackboardComponent::DefaultList' has a wrong offset!");
static_assert(offsetof(UTngDynamicBlackboardComponent, DataList) == 0x0000C0, "Member 'UTngDynamicBlackboardComponent::DataList' has a wrong offset!");

// Class TangoLib.TngAbilityFunction
// 0x0000 (0x0028 - 0x0028)
class UTngAbilityFunction final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAbilityFunction">();
	}
	static class UTngAbilityFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAbilityFunction>();
	}
};
static_assert(alignof(UTngAbilityFunction) == 0x000008, "Wrong alignment on UTngAbilityFunction");
static_assert(sizeof(UTngAbilityFunction) == 0x000028, "Wrong size on UTngAbilityFunction");

// Class TangoLib.TngDynamicDelegateComponent
// 0x0050 (0x0100 - 0x00B0)
class UTngDynamicDelegateComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x50];                                      // 0x00B0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void BindActorDelegateFromItem(class AActor* TargetActor, const class FName DelegateName, const TDelegate<void(class AActor* DelegateActor, class FName DelegateName, class UObject* AdvancedData)>& FunctionItem);
	static bool CallActorDelegate(class AActor* TargetActor, const class FName DelegateName, class UObject* AdvancedData);
	static void UnbindActorDelegateFromItem(class AActor* TargetActor, const class FName DelegateName, const TDelegate<void(class AActor* DelegateActor, class FName DelegateName, class UObject* AdvancedData)>& FunctionItem);

	void BindDelegateFromItem(const class FName DelegateName, const TDelegate<void(class AActor* DelegateActor, class FName DelegateName, class UObject* AdvancedData)>& FunctionItem);
	bool CallDelegate(const class FName DelegateName, class UObject* AdvancedData);
	void UnbindDelegateFromItem(const class FName DelegateName, const TDelegate<void(class AActor* DelegateActor, class FName DelegateName, class UObject* AdvancedData)>& FunctionItem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngDynamicDelegateComponent">();
	}
	static class UTngDynamicDelegateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngDynamicDelegateComponent>();
	}
};
static_assert(alignof(UTngDynamicDelegateComponent) == 0x000008, "Wrong alignment on UTngDynamicDelegateComponent");
static_assert(sizeof(UTngDynamicDelegateComponent) == 0x000100, "Wrong size on UTngDynamicDelegateComponent");

// Class TangoLib.TngAbilityInterface
// 0x0000 (0x0028 - 0x0028)
class ITngAbilityInterface final : public IInterface
{
public:
	struct FGameplayTagContainer Blueprint_GetAbilityListForReceive(class UObject* Sender);
	bool Blueprint_InvokeAbility(class UObject* Sender, class UObject* Receiver, const struct FGameplayTag& InvokeTag, class UObject* AdvanceParam);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAbilityInterface">();
	}
	static class ITngAbilityInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITngAbilityInterface>();
	}
};
static_assert(alignof(ITngAbilityInterface) == 0x000008, "Wrong alignment on ITngAbilityInterface");
static_assert(sizeof(ITngAbilityInterface) == 0x000028, "Wrong size on ITngAbilityInterface");

// Class TangoLib.TngEquipRelevantInterface
// 0x0000 (0x0028 - 0x0028)
class ITngEquipRelevantInterface final : public IInterface
{
public:
	bool BlueprintNative_BeginAttack();
	bool BlueprintNative_ChangeAttackMode(int32 AttackModeNo);
	bool BlueprintNative_ChargeAttack();
	bool BlueprintNative_Drop();
	bool BlueprintNative_EndAttack();
	bool BlueprintNative_Equip(class AActor* ToActor, class FName SocketName);
	void BlueprintNative_GetActionTags(class AActor* SendActor, struct FGameplayTagContainer* GetTags);
	void BlueprintNative_GetConditionTags(class AActor* SendActor, struct FGameplayTagContainer* GetTags);
	bool BlueprintNative_ReloadAttack();
	bool BlueprintNative_SendActionTag(class AActor* SendActor, const struct FGameplayTag& SendTag);
	bool BlueprintNative_SetAmmoInfinite(bool NewInfinite);
	bool BlueprintNative_SetPrecisionLevel(float NewPrecisionLevel);
	bool BlueprintNative_SetVisible(bool NewVisible);
	bool BlueprintNative_Unequip();

	bool BlueprintNative_GetCondition(int32 AttackModeNo, struct FTngEquipCondition* Condition) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngEquipRelevantInterface">();
	}
	static class ITngEquipRelevantInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITngEquipRelevantInterface>();
	}
};
static_assert(alignof(ITngEquipRelevantInterface) == 0x000008, "Wrong alignment on ITngEquipRelevantInterface");
static_assert(sizeof(ITngEquipRelevantInterface) == 0x000028, "Wrong size on ITngEquipRelevantInterface");

// Class TangoLib.TngStateItem
// 0x0028 (0x0050 - 0x0028)
class UTngStateItem : public UObject
{
public:
	class FName                                   StateName;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Priority;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCheckSamePriority;                                // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35[0x1B];                                      // 0x0035(0x001B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Blueprint_BeginState(class FName PrevState);
	bool Blueprint_CheckIntercept(class FName State);
	void Blueprint_EndState(class FName NextState);
	void Blueprint_InitState();
	void Blueprint_UpdateState(float DeltaTime);
	class FName GetCurrentStateName(class FName SlotName);
	class AActor* GetOwner();
	class AActor* GetOwnerActorClass(TSubclassOf<class AActor> ClassType);
	class UTngStateCoordinateComponent* GetOwnerComponent();
	class UActorComponent* GetOwnerComponentClass(TSubclassOf<class UActorComponent> ClassType);
	void SetFinish(bool Flag);
	void SetFinishAndNextState(class FName Name_0);
	void SetPassive(bool Flag);
	void SetRemove(bool Flag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngStateItem">();
	}
	static class UTngStateItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngStateItem>();
	}
};
static_assert(alignof(UTngStateItem) == 0x000008, "Wrong alignment on UTngStateItem");
static_assert(sizeof(UTngStateItem) == 0x000050, "Wrong size on UTngStateItem");
static_assert(offsetof(UTngStateItem, StateName) == 0x000028, "Member 'UTngStateItem::StateName' has a wrong offset!");
static_assert(offsetof(UTngStateItem, Priority) == 0x000030, "Member 'UTngStateItem::Priority' has a wrong offset!");
static_assert(offsetof(UTngStateItem, bCheckSamePriority) == 0x000034, "Member 'UTngStateItem::bCheckSamePriority' has a wrong offset!");

// Class TangoLib.TngAIPerceptionComponent
// 0x0058 (0x01E8 - 0x0190)
class UTngAIPerceptionComponent : public UAIPerceptionComponent
{
public:
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FTngDamageStimulus>        DamageStimuli;                                     // 0x0198(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	void ClearDamageStimulus();

	void FindDamageStimulus(int32 ID, struct FTngDamageStimulus* DamageStimulus, bool* Succeeded) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAIPerceptionComponent">();
	}
	static class UTngAIPerceptionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAIPerceptionComponent>();
	}
};
static_assert(alignof(UTngAIPerceptionComponent) == 0x000008, "Wrong alignment on UTngAIPerceptionComponent");
static_assert(sizeof(UTngAIPerceptionComponent) == 0x0001E8, "Wrong size on UTngAIPerceptionComponent");
static_assert(offsetof(UTngAIPerceptionComponent, DamageStimuli) == 0x000198, "Member 'UTngAIPerceptionComponent::DamageStimuli' has a wrong offset!");

// Class TangoLib.TngEffectActor
// 0x0008 (0x0230 - 0x0228)
class ATngEffectActor : public AActor
{
public:
	class UTngEffectComponent*                    EffectComponent;                                   // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void DestroyEffect();
	bool IsActiveEffect();
	void StartEffect(class UTngEffectAsset* EffectAsset, int32 ParticleSortPriority);
	void StopEffect();

	class UTngEffectComponent* GetEffectComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngEffectActor">();
	}
	static class ATngEffectActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATngEffectActor>();
	}
};
static_assert(alignof(ATngEffectActor) == 0x000008, "Wrong alignment on ATngEffectActor");
static_assert(sizeof(ATngEffectActor) == 0x000230, "Wrong size on ATngEffectActor");
static_assert(offsetof(ATngEffectActor, EffectComponent) == 0x000228, "Member 'ATngEffectActor::EffectComponent' has a wrong offset!");

// Class TangoLib.TngGameSystem
// 0x0010 (0x0038 - 0x0028)
class UTngGameSystem : public UObject
{
public:
	bool                                          bAllowPausedUpdate;                                // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0xF];                                       // 0x0029(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Blueprint_BeginPlay();
	void Blueprint_DisplayDebug(class UCanvas* Canvas);
	void Blueprint_Initialization();
	void Blueprint_LevelChanged(const class FString& LevelName);
	void Blueprint_PostInitialization();
	void Blueprint_PostUpdate(float DeltaSeconds);
	void Blueprint_PreUpdate(float DeltaSeconds);
	void Blueprint_PreWorldInitialization();
	void Blueprint_Shutdown();

	class UTngGameInstance* GetOwnerGameInstance() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngGameSystem">();
	}
	static class UTngGameSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngGameSystem>();
	}
};
static_assert(alignof(UTngGameSystem) == 0x000008, "Wrong alignment on UTngGameSystem");
static_assert(sizeof(UTngGameSystem) == 0x000038, "Wrong size on UTngGameSystem");
static_assert(offsetof(UTngGameSystem, bAllowPausedUpdate) == 0x000028, "Member 'UTngGameSystem::bAllowPausedUpdate' has a wrong offset!");

// Class TangoLib.TngSaveLoadSystem
// 0x01B0 (0x01E8 - 0x0038)
class UTngSaveLoadSystem final : public UTngGameSystem
{
public:
	uint8                                         Pad_38[0x1B0];                                     // 0x0038(0x01B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void LoadActorProperties(class AActor* Actor, bool CheckTag);
	static void SaveActorProperties(class AActor* Actor, bool CheckTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngSaveLoadSystem">();
	}
	static class UTngSaveLoadSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngSaveLoadSystem>();
	}
};
static_assert(alignof(UTngSaveLoadSystem) == 0x000008, "Wrong alignment on UTngSaveLoadSystem");
static_assert(sizeof(UTngSaveLoadSystem) == 0x0001E8, "Wrong size on UTngSaveLoadSystem");

// Class TangoLib.TngAbilityComponent
// 0x0000 (0x00B0 - 0x00B0)
class UTngAbilityComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAbilityComponent">();
	}
	static class UTngAbilityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAbilityComponent>();
	}
};
static_assert(alignof(UTngAbilityComponent) == 0x000008, "Wrong alignment on UTngAbilityComponent");
static_assert(sizeof(UTngAbilityComponent) == 0x0000B0, "Wrong size on UTngAbilityComponent");

// Class TangoLib.TngEffectAsset
// 0x0028 (0x0058 - 0x0030)
class UTngEffectAsset final : public UDataAsset
{
public:
	struct FTngEffectUnit                         Effect;                                            // 0x0030(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UParticleSystemComponent> ParticleComponent;                                 // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UAkComponent>            PlayingAkComponent;                                // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartEffect(class USceneComponent* AttachComponent, bool bFollow, const class FName& AttachName, int32 ParticleSortPriority);
	void StartEffectAtTransform(class UObject* WorldContextObject, const struct FTransform& Transform, int32 ParticleSortPriority);
	void StartEffectToAttach(class USceneComponent* AttachComponent, const class FName& AttachName, const struct FTransform& Offset, int32 ParticleSortPriority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngEffectAsset">();
	}
	static class UTngEffectAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngEffectAsset>();
	}
};
static_assert(alignof(UTngEffectAsset) == 0x000008, "Wrong alignment on UTngEffectAsset");
static_assert(sizeof(UTngEffectAsset) == 0x000058, "Wrong size on UTngEffectAsset");
static_assert(offsetof(UTngEffectAsset, Effect) == 0x000030, "Member 'UTngEffectAsset::Effect' has a wrong offset!");
static_assert(offsetof(UTngEffectAsset, ParticleComponent) == 0x000040, "Member 'UTngEffectAsset::ParticleComponent' has a wrong offset!");
static_assert(offsetof(UTngEffectAsset, PlayingAkComponent) == 0x000048, "Member 'UTngEffectAsset::PlayingAkComponent' has a wrong offset!");
static_assert(offsetof(UTngEffectAsset, PlayingID) == 0x000050, "Member 'UTngEffectAsset::PlayingID' has a wrong offset!");

// Class TangoLib.TngActorFunction
// 0x0000 (0x0028 - 0x0028)
class UTngActorFunction final : public UBlueprintFunctionLibrary
{
public:
	static void GetActorFeetLocation(const class AActor* TargetActor, struct FVector* FeetLocation);
	static const struct FVector GetAIInvalidLocation();
	static struct FRotator GetLocalRotation(const struct FVector& OriginLocation, const struct FRotator& OriginDirection, const struct FVector& TargetLocation);
	static struct FRotator GetLocalRotationActorToActor(const class AActor* OriginActor, const class AActor* TargetActor);
	static class AActor* GetNearActor(const class AActor* TargetActor, const TArray<class AActor*>& ActorList);
	static void MoveTeleportCharacter(class AActor* TargetActor, const struct FVector& SetVec);
	static void PointTeleportCharacter(class AActor* TargetActor, const struct FVector& SetPoint);
	static void RotationTeleportCharacter(class AActor* TargetActor, const struct FRotator& SetRotation);
	static void SetShowOnlyActors(class USceneCaptureComponent* Component, const TArray<class AActor*>& SetActors);
	static bool TngAttachToName(class AActor* ParentActor, class AActor* ChildActor, class FName ParentAttachName, class FName ChildAttachName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	static bool TngCheckRenderInWindow(class AActor* Actor, const struct FVector& Location, bool CheckTrace);
	static float TngGetActorLength(const class AActor* ActorA, const class AActor* ActorB);
	static void TngGetActorsInActorOwningLevel(class AActor* Actor, TArray<class AActor*>* OutActors);
	static void TngGetActorsInLevel(class ULevelStreamingDynamic* Level, TArray<class AActor*>* OutActors);
	static float TngGetLastRenderTime(class AActor* Actor);
	static struct FTransform TngGetTransformInActor(class AActor* Actor, class FName Name_0, ERelativeTransformSpace Space);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngActorFunction">();
	}
	static class UTngActorFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngActorFunction>();
	}
};
static_assert(alignof(UTngActorFunction) == 0x000008, "Wrong alignment on UTngActorFunction");
static_assert(sizeof(UTngActorFunction) == 0x000028, "Wrong size on UTngActorFunction");

// Class TangoLib.TngGameState
// 0x0000 (0x0298 - 0x0298)
class ATngGameState final : public AGameState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngGameState">();
	}
	static class ATngGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATngGameState>();
	}
};
static_assert(alignof(ATngGameState) == 0x000008, "Wrong alignment on ATngGameState");
static_assert(sizeof(ATngGameState) == 0x000298, "Wrong size on ATngGameState");

// Class TangoLib.TngEnvQueryTest_TraceIgnorable
// 0x00F0 (0x02E8 - 0x01F8)
class UTngEnvQueryTest_TraceIgnorable final : public UEnvQueryTest
{
public:
	struct FEnvTraceData                          TraceData;                                         // 0x01F8(0x0030)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               TraceFromContext;                                  // 0x0228(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              ItemHeightOffset;                                  // 0x0260(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              ContextHeightOffset;                               // 0x0298(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           Context;                                           // 0x02D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AActor>>             IgnoreActorClasses;                                // 0x02D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngEnvQueryTest_TraceIgnorable">();
	}
	static class UTngEnvQueryTest_TraceIgnorable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngEnvQueryTest_TraceIgnorable>();
	}
};
static_assert(alignof(UTngEnvQueryTest_TraceIgnorable) == 0x000008, "Wrong alignment on UTngEnvQueryTest_TraceIgnorable");
static_assert(sizeof(UTngEnvQueryTest_TraceIgnorable) == 0x0002E8, "Wrong size on UTngEnvQueryTest_TraceIgnorable");
static_assert(offsetof(UTngEnvQueryTest_TraceIgnorable, TraceData) == 0x0001F8, "Member 'UTngEnvQueryTest_TraceIgnorable::TraceData' has a wrong offset!");
static_assert(offsetof(UTngEnvQueryTest_TraceIgnorable, TraceFromContext) == 0x000228, "Member 'UTngEnvQueryTest_TraceIgnorable::TraceFromContext' has a wrong offset!");
static_assert(offsetof(UTngEnvQueryTest_TraceIgnorable, ItemHeightOffset) == 0x000260, "Member 'UTngEnvQueryTest_TraceIgnorable::ItemHeightOffset' has a wrong offset!");
static_assert(offsetof(UTngEnvQueryTest_TraceIgnorable, ContextHeightOffset) == 0x000298, "Member 'UTngEnvQueryTest_TraceIgnorable::ContextHeightOffset' has a wrong offset!");
static_assert(offsetof(UTngEnvQueryTest_TraceIgnorable, Context) == 0x0002D0, "Member 'UTngEnvQueryTest_TraceIgnorable::Context' has a wrong offset!");
static_assert(offsetof(UTngEnvQueryTest_TraceIgnorable, IgnoreActorClasses) == 0x0002D8, "Member 'UTngEnvQueryTest_TraceIgnorable::IgnoreActorClasses' has a wrong offset!");

// Class TangoLib.TngAIController
// 0x0070 (0x03A0 - 0x0330)
class ATngAIController : public AAIController
{
public:
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPostTakeDamage;                                  // 0x0340(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnAddCombatTargets;                                // 0x0350(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnRemoveCombatTargets;                             // 0x0360(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGenericTeamId                         InitialTeamID;                                     // 0x0370(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AActor>>          CombatTargets;                                     // 0x0378(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  CurCombatTarget;                                   // 0x0388(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_390[0x10];                                     // 0x0390(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Blueprint_PostTakeDamage(float Damage, const class UDamageType* DamageType, const struct FHitResult& Hit, const struct FVector& DamageImpulse, class AController* InstigatedBy, class AActor* DamageCauser);
	void ChooseRandomCombatTarget();
	void MoveToward(const struct FVector& Velocity);
	void NotifyTeleported();
	bool PauseMovement();
	void Receive_PostTakeDamage(float Damage, const class UDamageType* DamageType, const struct FHitResult& Hit, const struct FVector& DamageImpulse, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveShootAt();
	void ReceiveSmartLinkReached(class ATngNavLinkProxy* NavLink, const struct FVector& Destination);
	void ReceiveTeleported();
	bool ResumeMovement();
	void SetDivergenceWhenFollowingWalkway(float NewVal);
	void SetDriveInputMaxSpeed(float NewMaxSpeed);
	void SetGenericTeamId(const struct FGenericTeamId& NewTeamID);
	void TurnBodyForNavLinkMode(const struct FVector& Destination);

	class AActor* GetCombatTarget(int32 Index_0) const;
	int32 GetCombatTargetNum() const;
	class AActor* GetCurrentCombatTarget() const;
	float GetDivergenceWhenFollowingWalkway() const;
	struct FGenericTeamId GetGenericTeamId() const;
	bool IsCurrentCombatTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAIController">();
	}
	static class ATngAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATngAIController>();
	}
};
static_assert(alignof(ATngAIController) == 0x000008, "Wrong alignment on ATngAIController");
static_assert(sizeof(ATngAIController) == 0x0003A0, "Wrong size on ATngAIController");
static_assert(offsetof(ATngAIController, OnPostTakeDamage) == 0x000340, "Member 'ATngAIController::OnPostTakeDamage' has a wrong offset!");
static_assert(offsetof(ATngAIController, OnAddCombatTargets) == 0x000350, "Member 'ATngAIController::OnAddCombatTargets' has a wrong offset!");
static_assert(offsetof(ATngAIController, OnRemoveCombatTargets) == 0x000360, "Member 'ATngAIController::OnRemoveCombatTargets' has a wrong offset!");
static_assert(offsetof(ATngAIController, InitialTeamID) == 0x000370, "Member 'ATngAIController::InitialTeamID' has a wrong offset!");
static_assert(offsetof(ATngAIController, CombatTargets) == 0x000378, "Member 'ATngAIController::CombatTargets' has a wrong offset!");
static_assert(offsetof(ATngAIController, CurCombatTarget) == 0x000388, "Member 'ATngAIController::CurCombatTarget' has a wrong offset!");

// Class TangoLib.TngAIPerceptionSystem
// 0x0000 (0x0130 - 0x0130)
class UTngAIPerceptionSystem : public UAIPerceptionSystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAIPerceptionSystem">();
	}
	static class UTngAIPerceptionSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAIPerceptionSystem>();
	}
};
static_assert(alignof(UTngAIPerceptionSystem) == 0x000008, "Wrong alignment on UTngAIPerceptionSystem");
static_assert(sizeof(UTngAIPerceptionSystem) == 0x000130, "Wrong size on UTngAIPerceptionSystem");

// Class TangoLib.TngAISense_Damage
// 0x0010 (0x0090 - 0x0080)
class UTngAISense_Damage final : public UAISense
{
public:
	TArray<struct FTngAIDamageEvent>              RegisteredEvents;                                  // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static void ReportDamageEvent(class UObject* WorldContextObject, class AActor* DamagedActor, class AActor* Instigator, float DamageAmount, const struct FVector& EventLocation, const struct FVector& HitLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAISense_Damage">();
	}
	static class UTngAISense_Damage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAISense_Damage>();
	}
};
static_assert(alignof(UTngAISense_Damage) == 0x000008, "Wrong alignment on UTngAISense_Damage");
static_assert(sizeof(UTngAISense_Damage) == 0x000090, "Wrong size on UTngAISense_Damage");
static_assert(offsetof(UTngAISense_Damage, RegisteredEvents) == 0x000080, "Member 'UTngAISense_Damage::RegisteredEvents' has a wrong offset!");

// Class TangoLib.TngAISenseConfig_Damage
// 0x0008 (0x0050 - 0x0048)
class UTngAISenseConfig_Damage final : public UAISenseConfig
{
public:
	TSubclassOf<class UTngAISense_Damage>         Implementation;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAISenseConfig_Damage">();
	}
	static class UTngAISenseConfig_Damage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAISenseConfig_Damage>();
	}
};
static_assert(alignof(UTngAISenseConfig_Damage) == 0x000008, "Wrong alignment on UTngAISenseConfig_Damage");
static_assert(sizeof(UTngAISenseConfig_Damage) == 0x000050, "Wrong size on UTngAISenseConfig_Damage");
static_assert(offsetof(UTngAISenseConfig_Damage, Implementation) == 0x000048, "Member 'UTngAISenseConfig_Damage::Implementation' has a wrong offset!");

// Class TangoLib.TngAISenseEvent_Damage
// 0x0038 (0x0060 - 0x0028)
class UTngAISenseEvent_Damage final : public UAISenseEvent
{
public:
	struct FTngAIDamageEvent                      Event;                                             // 0x0028(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAISenseEvent_Damage">();
	}
	static class UTngAISenseEvent_Damage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAISenseEvent_Damage>();
	}
};
static_assert(alignof(UTngAISenseEvent_Damage) == 0x000008, "Wrong alignment on UTngAISenseEvent_Damage");
static_assert(sizeof(UTngAISenseEvent_Damage) == 0x000060, "Wrong size on UTngAISenseEvent_Damage");
static_assert(offsetof(UTngAISenseEvent_Damage, Event) == 0x000028, "Member 'UTngAISenseEvent_Damage::Event' has a wrong offset!");

// Class TangoLib.TngAnimInstance
// 0x0270 (0x0530 - 0x02C0)
#pragma pack(push, 0x1)
class alignas(0x10) UTngAnimInstance : public UAnimInstance
{
public:
	FMulticastInlineDelegateProperty_             OnBeginCoopAnim;                                   // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnEndCoopAnim;                                     // 0x02C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D8[0x20];                                     // 0x02D8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IdleIndex;                                         // 0x02F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngCoopAnimState                             CoopAnimState;                                     // 0x02FC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETngCoopAnimRole                              CoopAnimRole;                                      // 0x02FD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETngCoopAnimDataType                          CoopAnimDataType;                                  // 0x02FE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2FF[0x1];                                      // 0x02FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CoopAnimSeqBase;                                   // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FTngCoopAnimSlaveInfo>          CoopAnimSlaveInfo;                                 // 0x0308(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UAnimMontage*                           CoopAnimMontage;                                   // 0x0318(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0xC];                                      // 0x0320(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsPlayingCoopAnim;                                // 0x032C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCoopAnimPosAdjust;                                // 0x032D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32E[0x106];                                    // 0x032E(0x0106)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableSpecifyLeadLocation;                        // 0x0434(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_435[0x3];                                      // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpecifyLeadAngleThreshold;                         // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpecifyLeadLocationInterpTime;                     // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                             BlockCheckOffsetTransform;                         // 0x0440(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ETngBlockCheckShapeType                       BlockCheckShapeType;                               // 0x0470(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BlockCheckBoxExtent;                               // 0x0474(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlockCheckSphereRadius;                            // 0x0480(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlockCheckCapsuleRadius;                           // 0x0484(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlockCheckCapsuleHeight;                           // 0x0488(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           BlockCheckIgnoreActorList;                         // 0x0490(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	ECollisionChannel                             BlockCheckChannel;                                 // 0x04A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCollisionResponseContainer            BlockCheckResponse;                                // 0x04A1(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C1[0x47];                                     // 0x04C1(0x0047)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTngExtraPlayQueueData>         ExtraAnimQueue;                                    // 0x0508(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_518[0x10];                                     // 0x0518(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CancelCoopAnimation(float BlendOutTime);
	void ForceMeshUpdateFlagToTickAndRefresh(float Duration);
	struct FHitResult GetCurrentRootMoveHitResult();
	struct FTransform GetCurrentRootMoveVelocityTransform();
	struct FTransform GetRootMotionCurveValue();
	struct FTransform GetRootMotionCurveValueAtRotVelocity(float DeltaSeconds);
	float GetStateWeight(class FName MachineName, class FName StateName);
	bool IsAnyStateActive(class FName MachineName, const TArray<class FName>& StateNames, float ThresholdWeight);
	bool IsStateActive(class FName MachineName, class FName StateName, float ThresholdWeight);
	struct FHitResult ModifySweepMove(const struct FVector& InDeltaMove, struct FVector* OutDeltaMove);
	void OnBeginCoopAnimation();
	void OnEndCoopAnimation();
	void OnUpdateCoopAnimationAsMaster();
	void OnUpdateCoopAnimationAsSlave(class UTngAnimInstance* Master, const struct FVector& NewLocation, const struct FRotator& NewRotation, float ElaspedTime);
	bool PlayCoopAnimation(const struct FTngCoopAnimPlayParam& CoopAnimPlayParam, float PlayRate, class FName MontageSectionName);
	bool PlayExtraAnimation(const struct FTngPlayAnimData& InAnimData, ETngPlayAnimTransit TransitType);
	void RemoveDelegateOnBeginExtraAnim(TDelegate<void()> CallbackFunc);
	void RemoveDelegateOnChangeStateExtraAnim(TDelegate<void(ETngExtraPlayState NewState)> CallbackFunc);
	void RemoveDelegateOnCompletedExtraAnim(TDelegate<void(class FName ContactTag)> CallbackFunc);
	void SetCoopAnimPosAdjust(bool _Enable);
	void SetDelegateOnBeginExtraAnim(TDelegate<void()> CallbackFunc);
	void SetDelegateOnChangeStateExtraAnim(TDelegate<void(ETngExtraPlayState NewState)> CallbackFunc);
	void SetDelegateOnCompletedExtraAnim(TDelegate<void(class FName ContactTag)> CallbackFunc);
	void StopExtraAnimation(float BlendOutTime);
	void UpdateRootMotionCurveMove(float DeltaSeconds, bool bSweep);

	void GetExtraAnimPlayBlendInOut(float* InTime, float* OutTime) const;
	float GetExtraAnimPlayBlendInTime() const;
	float GetExtraAnimPlayBlendOutTime() const;
	class UTngCharacterMovementComponent* GetOwningCharacterMovement() const;
	class ATngCharacter* GetOwningTngCharacter() const;
	bool HasRootMotionCurveData() const;
	bool IsActiveExtraAnim() const;
	bool IsAnyPlayingSlotAnimation(class FName SlotNodeName) const;
	bool IsCompatibleAnim(class UAnimSequenceBase* AnimAsset) const;
	bool IsMontagePlaying(class FName SlotName) const;
	bool IsPlayingExtraAnim() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAnimInstance">();
	}
	static class UTngAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UTngAnimInstance) == 0x000010, "Wrong alignment on UTngAnimInstance");
static_assert(sizeof(UTngAnimInstance) == 0x000530, "Wrong size on UTngAnimInstance");
static_assert(offsetof(UTngAnimInstance, OnBeginCoopAnim) == 0x0002B8, "Member 'UTngAnimInstance::OnBeginCoopAnim' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, OnEndCoopAnim) == 0x0002C8, "Member 'UTngAnimInstance::OnEndCoopAnim' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, IdleIndex) == 0x0002F8, "Member 'UTngAnimInstance::IdleIndex' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, CoopAnimState) == 0x0002FC, "Member 'UTngAnimInstance::CoopAnimState' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, CoopAnimRole) == 0x0002FD, "Member 'UTngAnimInstance::CoopAnimRole' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, CoopAnimDataType) == 0x0002FE, "Member 'UTngAnimInstance::CoopAnimDataType' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, CoopAnimSeqBase) == 0x000300, "Member 'UTngAnimInstance::CoopAnimSeqBase' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, CoopAnimSlaveInfo) == 0x000308, "Member 'UTngAnimInstance::CoopAnimSlaveInfo' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, CoopAnimMontage) == 0x000318, "Member 'UTngAnimInstance::CoopAnimMontage' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, bIsPlayingCoopAnim) == 0x00032C, "Member 'UTngAnimInstance::bIsPlayingCoopAnim' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, bCoopAnimPosAdjust) == 0x00032D, "Member 'UTngAnimInstance::bCoopAnimPosAdjust' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, bEnableSpecifyLeadLocation) == 0x000434, "Member 'UTngAnimInstance::bEnableSpecifyLeadLocation' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, SpecifyLeadAngleThreshold) == 0x000438, "Member 'UTngAnimInstance::SpecifyLeadAngleThreshold' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, SpecifyLeadLocationInterpTime) == 0x00043C, "Member 'UTngAnimInstance::SpecifyLeadLocationInterpTime' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, BlockCheckOffsetTransform) == 0x000440, "Member 'UTngAnimInstance::BlockCheckOffsetTransform' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, BlockCheckShapeType) == 0x000470, "Member 'UTngAnimInstance::BlockCheckShapeType' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, BlockCheckBoxExtent) == 0x000474, "Member 'UTngAnimInstance::BlockCheckBoxExtent' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, BlockCheckSphereRadius) == 0x000480, "Member 'UTngAnimInstance::BlockCheckSphereRadius' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, BlockCheckCapsuleRadius) == 0x000484, "Member 'UTngAnimInstance::BlockCheckCapsuleRadius' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, BlockCheckCapsuleHeight) == 0x000488, "Member 'UTngAnimInstance::BlockCheckCapsuleHeight' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, BlockCheckIgnoreActorList) == 0x000490, "Member 'UTngAnimInstance::BlockCheckIgnoreActorList' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, BlockCheckChannel) == 0x0004A0, "Member 'UTngAnimInstance::BlockCheckChannel' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, BlockCheckResponse) == 0x0004A1, "Member 'UTngAnimInstance::BlockCheckResponse' has a wrong offset!");
static_assert(offsetof(UTngAnimInstance, ExtraAnimQueue) == 0x000508, "Member 'UTngAnimInstance::ExtraAnimQueue' has a wrong offset!");

// Class TangoLib.TngAnimInstanceUtility
// 0x0000 (0x0028 - 0x0028)
class UTngAnimInstanceUtility final : public UBlueprintFunctionLibrary
{
public:
	static class UTngAnimInstance* GetTngAnimInstance(class USkeletalMeshComponent* SkelMeshComp);
	static class UTngAnimInstance* GetTngAnimInstanceFromActor(class AActor* Actor);
	static struct FTngCoopAnimPlayParam MakeCoopAnimPlayParamForPair(class AActor* Master, class AActor* Slave, class UTngCoopAnimAsset* Asset);
	static struct FTngCoopAnimPlayParam MakeCoopAnimPlayParamForTrio(class AActor* Master, class AActor* Slave1, class AActor* Slave2, class UTngCoopAnimAsset* Asset);
	static bool PlayExtraAnimationUtil(class UAnimInstance* Instance, const struct FTngPlayAnimData& InAnimData, ETngPlayAnimTransit TransitType);
	static void StopExtraAnimationUtil(class UAnimInstance* Instance, float BlendOutTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAnimInstanceUtility">();
	}
	static class UTngAnimInstanceUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAnimInstanceUtility>();
	}
};
static_assert(alignof(UTngAnimInstanceUtility) == 0x000008, "Wrong alignment on UTngAnimInstanceUtility");
static_assert(sizeof(UTngAnimInstanceUtility) == 0x000028, "Wrong size on UTngAnimInstanceUtility");

// Class TangoLib.TngGameMode
// 0x0060 (0x0328 - 0x02C8)
class ATngGameMode : public AGameModeBase
{
public:
	uint8                                         Pad_2C8[0x38];                                     // 0x02C8(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AudioPauseEvent;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          AudioUnpauseEvent;                                 // 0x0308(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x18];                                     // 0x0310(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngGameMode">();
	}
	static class ATngGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATngGameMode>();
	}
};
static_assert(alignof(ATngGameMode) == 0x000008, "Wrong alignment on ATngGameMode");
static_assert(sizeof(ATngGameMode) == 0x000328, "Wrong size on ATngGameMode");
static_assert(offsetof(ATngGameMode, AudioPauseEvent) == 0x000300, "Member 'ATngGameMode::AudioPauseEvent' has a wrong offset!");
static_assert(offsetof(ATngGameMode, AudioUnpauseEvent) == 0x000308, "Member 'ATngGameMode::AudioUnpauseEvent' has a wrong offset!");

// Class TangoLib.TngAnimNotify_InvokeAbility
// 0x0020 (0x0058 - 0x0038)
class UTngAnimNotify_InvokeAbility final : public UAnimNotify
{
public:
	struct FGameplayTagContainer                  SendTags;                                          // 0x0038(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngAnimNotify_InvokeAbility">();
	}
	static class UTngAnimNotify_InvokeAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngAnimNotify_InvokeAbility>();
	}
};
static_assert(alignof(UTngAnimNotify_InvokeAbility) == 0x000008, "Wrong alignment on UTngAnimNotify_InvokeAbility");
static_assert(sizeof(UTngAnimNotify_InvokeAbility) == 0x000058, "Wrong size on UTngAnimNotify_InvokeAbility");
static_assert(offsetof(UTngAnimNotify_InvokeAbility, SendTags) == 0x000038, "Member 'UTngAnimNotify_InvokeAbility::SendTags' has a wrong offset!");

// Class TangoLib.TngImpactEffectTable
// 0x0060 (0x0090 - 0x0030)
class UTngImpactEffectTable final : public UDataAsset
{
public:
	struct FTngImpactEffect                       DefaultImpactEffect;                               // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TMap<EPhysicalSurface, struct FTngImpactEffect> EffectTable;                                       // 0x0040(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TngImpactEffectTable">();
	}
	static class UTngImpactEffectTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTngImpactEffectTable>();
	}
};
static_assert(alignof(UTngImpactEffectTable) == 0x000008, "Wrong alignment on UTngImpactEffectTable");
static_assert(sizeof(UTngImpactEffectTable) == 0x000090, "Wrong size on UTngImpactEffectTable");
