#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TangoAnimationRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// Enum TangoAnimationRuntime.ETngAnimHelperJointInterpolationType
// NumValues: 0x0005
enum class ETngAnimHelperJointInterpolationType : uint8
{
	None                                     = 0,
	Linear                                   = 1,
	Flat                                     = 2,
	Spline                                   = 3,
	ETngAnimHelperJointInterpolationType_MAX = 4,
};

// Enum TangoAnimationRuntime.ETngAnimHelperJointCurveExpressionType
// NumValues: 0x0004
enum class ETngAnimHelperJointCurveExpressionType : uint8
{
	None                                     = 0,
	Simple                                   = 1,
	Graph                                    = 2,
	ETngAnimHelperJointCurveExpressionType_MAX = 3,
};

// Enum TangoAnimationRuntime.ETngAnimHelperJointRotationSequence
// NumValues: 0x0008
enum class ETngAnimHelperJointRotationSequence : uint8
{
	None                                     = 0,
	XYZ                                      = 1,
	YZX                                      = 2,
	ZXY                                      = 3,
	XZY                                      = 4,
	YXZ                                      = 5,
	ZYX                                      = 6,
	ETngAnimHelperJointRotationSequence_MAX  = 7,
};

// Enum TangoAnimationRuntime.ETngAnimHelperJointReferenceType
// NumValues: 0x0005
enum class ETngAnimHelperJointReferenceType : uint8
{
	None                                     = 0,
	AnotherJoint                             = 1,
	BindPose                                 = 2,
	ParentJoint                              = 3,
	ETngAnimHelperJointReferenceType_MAX     = 4,
};

// Enum TangoAnimationRuntime.ETngAnimHelperJointSourceComponentType
// NumValues: 0x0009
enum class ETngAnimHelperJointSourceComponentType : uint8
{
	None                                     = 0,
	RotationX                                = 1,
	RotationY                                = 2,
	RotationZ                                = 3,
	TranslationX                             = 4,
	TranslationY                             = 5,
	TranslationZ                             = 6,
	Distance                                 = 7,
	ETngAnimHelperJointSourceComponentType_MAX = 8,
};

// Enum TangoAnimationRuntime.ETngAnimHelperJointType
// NumValues: 0x0006
enum class ETngAnimHelperJointType : uint8
{
	None                                     = 0,
	Expression                               = 1,
	DriveConstraint                          = 2,
	DriveBlendShape                          = 3,
	DriveMaterial                            = 4,
	ETngAnimHelperJointType_MAX              = 5,
};

// Enum TangoAnimationRuntime.ETngJCPSphereColliderType
// NumValues: 0x0003
enum class ETngJCPSphereColliderType : uint8
{
	Inner                                    = 0,
	Outer                                    = 1,
	ETngJCPSphereColliderType_MAX            = 2,
};

// Enum TangoAnimationRuntime.ETngJCPSimulationSpace
// NumValues: 0x0004
enum class ETngJCPSimulationSpace : uint8
{
	ComponentSpace                           = 0,
	WorldSpace                               = 1,
	BaseJointSpace                           = 2,
	ETngJCPSimulationSpace_MAX               = 3,
};

// Enum TangoAnimationRuntime.ETngJCPAxis
// NumValues: 0x0005
enum class ETngJCPAxis : uint8
{
	None                                     = 0,
	X                                        = 1,
	Y                                        = 2,
	Z                                        = 3,
	ETngJCPAxis_MAX                          = 4,
};

// Enum TangoAnimationRuntime.ETngAnimSpringType
// NumValues: 0x0004
enum class ETngAnimSpringType : uint8
{
	Translation                              = 0,
	ChildTransToRot                          = 1,
	Rotation                                 = 2,
	ETngAnimSpringType_MAX                   = 3,
};

// Enum TangoAnimationRuntime.ETngAnimTailAnimatorSpringSimulationMode
// NumValues: 0x0003
enum class ETngAnimTailAnimatorSpringSimulationMode : uint8
{
	TailAnimator                             = 0,
	TailAnimatorPlusSpring                   = 1,
	ETngAnimTailAnimatorSpringSimulationMode_MAX = 2,
};

// Enum TangoAnimationRuntime.ETngTwoBoneAxis
// NumValues: 0x0007
enum class ETngTwoBoneAxis : uint8
{
	PositiveX                                = 0,
	NegativeX                                = 1,
	PositiveY                                = 2,
	NegativeY                                = 3,
	PositiveZ                                = 4,
	NegativeZ                                = 5,
	ETngTwoBoneAxis_MAX                      = 6,
};

// Enum TangoAnimationRuntime.ETngTwoBoneFootIKQueryShape
// NumValues: 0x0004
enum class ETngTwoBoneFootIKQueryShape : uint8
{
	Line                                     = 0,
	Sphere                                   = 1,
	Box                                      = 2,
	ETngTwoBoneFootIKQueryShape_MAX          = 3,
};

// ScriptStruct TangoAnimationRuntime.TngAnimRichCurve
// 0x0000 (0x0080 - 0x0080)
struct FTngAnimRichCurve final : public FRichCurve
{
};
static_assert(alignof(FTngAnimRichCurve) == 0x000008, "Wrong alignment on FTngAnimRichCurve");
static_assert(sizeof(FTngAnimRichCurve) == 0x000080, "Wrong size on FTngAnimRichCurve");

// ScriptStruct TangoAnimationRuntime.TngAnimHelperJointDriveBlendShapeSetting
// 0x00B0 (0x00B0 - 0x0000)
struct FTngAnimHelperJointDriveBlendShapeSetting final
{
public:
	ETngAnimHelperJointCurveExpressionType        CurveMode;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointSourceComponentType        SourceComponent;                                   // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SourceMin;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceMax;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetBlendShape;                                  // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetBlendShapeWeight;                            // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetWeightMin;                                   // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetWeightMax;                                   // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationMin;                                  // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationBindPose;                             // 0x0025(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationMax;                                  // 0x0026(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngAnimRichCurve                      TargetWeightCurve;                                 // 0x0028(0x0080)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bUseYZXRotation : 1;                               // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ETngAnimHelperJointRotationSequence           SourceRotationSequence;                            // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTngAnimHelperJointDriveBlendShapeSetting) == 0x000008, "Wrong alignment on FTngAnimHelperJointDriveBlendShapeSetting");
static_assert(sizeof(FTngAnimHelperJointDriveBlendShapeSetting) == 0x0000B0, "Wrong size on FTngAnimHelperJointDriveBlendShapeSetting");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, CurveMode) == 0x000000, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::CurveMode' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, SourceComponent) == 0x000001, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::SourceComponent' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, SourceMin) == 0x000004, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::SourceMin' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, SourceMax) == 0x000008, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::SourceMax' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, TargetBlendShape) == 0x00000C, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::TargetBlendShape' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, TargetBlendShapeWeight) == 0x000014, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::TargetBlendShapeWeight' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, TargetWeightMin) == 0x00001C, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::TargetWeightMin' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, TargetWeightMax) == 0x000020, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::TargetWeightMax' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, InterpolationMin) == 0x000024, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::InterpolationMin' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, InterpolationBindPose) == 0x000025, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::InterpolationBindPose' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, InterpolationMax) == 0x000026, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::InterpolationMax' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, TargetWeightCurve) == 0x000028, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::TargetWeightCurve' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveBlendShapeSetting, SourceRotationSequence) == 0x0000AC, "Member 'FTngAnimHelperJointDriveBlendShapeSetting::SourceRotationSequence' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngAnimHelperJointExpressionSetting
// 0x0008 (0x0008 - 0x0000)
struct FTngAnimHelperJointExpressionSetting final
{
public:
	float                                         ScaleBend;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleTwist;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTngAnimHelperJointExpressionSetting) == 0x000004, "Wrong alignment on FTngAnimHelperJointExpressionSetting");
static_assert(sizeof(FTngAnimHelperJointExpressionSetting) == 0x000008, "Wrong size on FTngAnimHelperJointExpressionSetting");
static_assert(offsetof(FTngAnimHelperJointExpressionSetting, ScaleBend) == 0x000000, "Member 'FTngAnimHelperJointExpressionSetting::ScaleBend' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointExpressionSetting, ScaleTwist) == 0x000004, "Member 'FTngAnimHelperJointExpressionSetting::ScaleTwist' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngAnimHelperJointDriveConstraintSetting
// 0x0378 (0x0378 - 0x0000)
struct FTngAnimHelperJointDriveConstraintSetting final
{
public:
	ETngAnimHelperJointCurveExpressionType        CurveMode;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointSourceComponentType        SourceComponent;                                   // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SourceMin;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceMax;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bTargetTranslationX : 1;                           // 0x000C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetTranslationX_Min;                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetTranslationX_Max;                            // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationTranslationX_Min;                     // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationTranslationX_BindPose;                // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationTranslationX_Max;                     // 0x001A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngAnimRichCurve                      TargetTranslationX_Curve;                          // 0x0020(0x0080)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bTargetTranslationY : 1;                           // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetTranslationY_Min;                            // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetTranslationY_Max;                            // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationTranslationY_Min;                     // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationTranslationY_BindPose;                // 0x00AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationTranslationY_Max;                     // 0x00AE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngAnimRichCurve                      TargetTranslationY_Curve;                          // 0x00B0(0x0080)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bTargetTranslationZ : 1;                           // 0x0130(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetTranslationZ_Min;                            // 0x0134(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetTranslationZ_Max;                            // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationTranslationZ_Min;                     // 0x013C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationTranslationZ_BindPose;                // 0x013D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationTranslationZ_Max;                     // 0x013E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13F[0x1];                                      // 0x013F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngAnimRichCurve                      TargetTranslationZ_Curve;                          // 0x0140(0x0080)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bTargetRotationX : 1;                              // 0x01C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetRotationX_Min;                               // 0x01C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetRotationX_Max;                               // 0x01C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationRotationX_Min;                        // 0x01CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationRotationX_BindPose;                   // 0x01CD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationRotationX_Max;                        // 0x01CE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CF[0x1];                                      // 0x01CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngAnimRichCurve                      TargetRotationX_Curve;                             // 0x01D0(0x0080)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bTargetRotationY : 1;                              // 0x0250(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetRotationY_Min;                               // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetRotationY_Max;                               // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationRotationY_Min;                        // 0x025C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationRotationY_BindPose;                   // 0x025D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationRotationY_Max;                        // 0x025E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25F[0x1];                                      // 0x025F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngAnimRichCurve                      TargetRotationY_Curve;                             // 0x0260(0x0080)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bTargetRotationZ : 1;                              // 0x02E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetRotationZ_Min;                               // 0x02E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetRotationZ_Max;                               // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationRotationZ_Min;                        // 0x02EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationRotationZ_BindPose;                   // 0x02ED(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationRotationZ_Max;                        // 0x02EE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2EF[0x1];                                      // 0x02EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngAnimRichCurve                      TargetRotationZ_Curve;                             // 0x02F0(0x0080)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bUseYZXRotation : 1;                               // 0x0370(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ETngAnimHelperJointRotationSequence           SourceRotationSequence;                            // 0x0374(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTngAnimHelperJointDriveConstraintSetting) == 0x000008, "Wrong alignment on FTngAnimHelperJointDriveConstraintSetting");
static_assert(sizeof(FTngAnimHelperJointDriveConstraintSetting) == 0x000378, "Wrong size on FTngAnimHelperJointDriveConstraintSetting");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, CurveMode) == 0x000000, "Member 'FTngAnimHelperJointDriveConstraintSetting::CurveMode' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, SourceComponent) == 0x000001, "Member 'FTngAnimHelperJointDriveConstraintSetting::SourceComponent' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, SourceMin) == 0x000004, "Member 'FTngAnimHelperJointDriveConstraintSetting::SourceMin' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, SourceMax) == 0x000008, "Member 'FTngAnimHelperJointDriveConstraintSetting::SourceMax' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetTranslationX_Min) == 0x000010, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetTranslationX_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetTranslationX_Max) == 0x000014, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetTranslationX_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationTranslationX_Min) == 0x000018, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationTranslationX_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationTranslationX_BindPose) == 0x000019, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationTranslationX_BindPose' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationTranslationX_Max) == 0x00001A, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationTranslationX_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetTranslationX_Curve) == 0x000020, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetTranslationX_Curve' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetTranslationY_Min) == 0x0000A4, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetTranslationY_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetTranslationY_Max) == 0x0000A8, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetTranslationY_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationTranslationY_Min) == 0x0000AC, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationTranslationY_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationTranslationY_BindPose) == 0x0000AD, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationTranslationY_BindPose' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationTranslationY_Max) == 0x0000AE, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationTranslationY_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetTranslationY_Curve) == 0x0000B0, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetTranslationY_Curve' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetTranslationZ_Min) == 0x000134, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetTranslationZ_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetTranslationZ_Max) == 0x000138, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetTranslationZ_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationTranslationZ_Min) == 0x00013C, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationTranslationZ_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationTranslationZ_BindPose) == 0x00013D, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationTranslationZ_BindPose' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationTranslationZ_Max) == 0x00013E, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationTranslationZ_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetTranslationZ_Curve) == 0x000140, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetTranslationZ_Curve' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetRotationX_Min) == 0x0001C4, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetRotationX_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetRotationX_Max) == 0x0001C8, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetRotationX_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationRotationX_Min) == 0x0001CC, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationRotationX_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationRotationX_BindPose) == 0x0001CD, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationRotationX_BindPose' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationRotationX_Max) == 0x0001CE, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationRotationX_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetRotationX_Curve) == 0x0001D0, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetRotationX_Curve' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetRotationY_Min) == 0x000254, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetRotationY_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetRotationY_Max) == 0x000258, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetRotationY_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationRotationY_Min) == 0x00025C, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationRotationY_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationRotationY_BindPose) == 0x00025D, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationRotationY_BindPose' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationRotationY_Max) == 0x00025E, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationRotationY_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetRotationY_Curve) == 0x000260, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetRotationY_Curve' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetRotationZ_Min) == 0x0002E4, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetRotationZ_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetRotationZ_Max) == 0x0002E8, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetRotationZ_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationRotationZ_Min) == 0x0002EC, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationRotationZ_Min' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationRotationZ_BindPose) == 0x0002ED, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationRotationZ_BindPose' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, InterpolationRotationZ_Max) == 0x0002EE, "Member 'FTngAnimHelperJointDriveConstraintSetting::InterpolationRotationZ_Max' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, TargetRotationZ_Curve) == 0x0002F0, "Member 'FTngAnimHelperJointDriveConstraintSetting::TargetRotationZ_Curve' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveConstraintSetting, SourceRotationSequence) == 0x000374, "Member 'FTngAnimHelperJointDriveConstraintSetting::SourceRotationSequence' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngAnimHelperJointDriveMaterialSetting
// 0x00B0 (0x00B0 - 0x0000)
struct FTngAnimHelperJointDriveMaterialSetting final
{
public:
	ETngAnimHelperJointCurveExpressionType        CurveMode;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointSourceComponentType        SourceComponent;                                   // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SourceMin;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceMax;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetMaterial;                                    // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetMaterialParam;                               // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetParamMin;                                    // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetParamMax;                                    // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationMin;                                  // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationBindPose;                             // 0x0025(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngAnimHelperJointInterpolationType          InterpolationMax;                                  // 0x0026(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngAnimRichCurve                      TargetParamCurve;                                  // 0x0028(0x0080)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bUseYZXRotation : 1;                               // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ETngAnimHelperJointRotationSequence           SourceRotationSequence;                            // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTngAnimHelperJointDriveMaterialSetting) == 0x000008, "Wrong alignment on FTngAnimHelperJointDriveMaterialSetting");
static_assert(sizeof(FTngAnimHelperJointDriveMaterialSetting) == 0x0000B0, "Wrong size on FTngAnimHelperJointDriveMaterialSetting");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, CurveMode) == 0x000000, "Member 'FTngAnimHelperJointDriveMaterialSetting::CurveMode' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, SourceComponent) == 0x000001, "Member 'FTngAnimHelperJointDriveMaterialSetting::SourceComponent' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, SourceMin) == 0x000004, "Member 'FTngAnimHelperJointDriveMaterialSetting::SourceMin' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, SourceMax) == 0x000008, "Member 'FTngAnimHelperJointDriveMaterialSetting::SourceMax' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, TargetMaterial) == 0x00000C, "Member 'FTngAnimHelperJointDriveMaterialSetting::TargetMaterial' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, TargetMaterialParam) == 0x000014, "Member 'FTngAnimHelperJointDriveMaterialSetting::TargetMaterialParam' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, TargetParamMin) == 0x00001C, "Member 'FTngAnimHelperJointDriveMaterialSetting::TargetParamMin' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, TargetParamMax) == 0x000020, "Member 'FTngAnimHelperJointDriveMaterialSetting::TargetParamMax' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, InterpolationMin) == 0x000024, "Member 'FTngAnimHelperJointDriveMaterialSetting::InterpolationMin' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, InterpolationBindPose) == 0x000025, "Member 'FTngAnimHelperJointDriveMaterialSetting::InterpolationBindPose' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, InterpolationMax) == 0x000026, "Member 'FTngAnimHelperJointDriveMaterialSetting::InterpolationMax' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, TargetParamCurve) == 0x000028, "Member 'FTngAnimHelperJointDriveMaterialSetting::TargetParamCurve' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointDriveMaterialSetting, SourceRotationSequence) == 0x0000AC, "Member 'FTngAnimHelperJointDriveMaterialSetting::SourceRotationSequence' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngAnimHelperJointSetting
// 0x0528 (0x0528 - 0x0000)
struct FTngAnimHelperJointSetting final
{
public:
	uint8                                         bTypeExpression : 1;                               // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ETngAnimHelperJointType                       Type;                                              // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bUseSourceRef : 1;                                 // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ETngAnimHelperJointReferenceType              SourceRefType;                                     // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SourceRefJointName;                                // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SourceJointName;                                   // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseTargetRef : 1;                                 // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ETngAnimHelperJointReferenceType              TargetRefType;                                     // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetRefJointName;                                // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetJointName;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetJointOrient;                                 // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTngAnimHelperJointExpressionSetting   ExpressionSetting;                                 // 0x0044(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTngAnimHelperJointDriveConstraintSetting DriveConstraintSetting;                            // 0x0050(0x0378)(Edit, NativeAccessSpecifierPublic)
	struct FTngAnimHelperJointDriveBlendShapeSetting DriveBlendShapeSetting;                            // 0x03C8(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FTngAnimHelperJointDriveMaterialSetting DriveMaterialSetting;                              // 0x0478(0x00B0)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTngAnimHelperJointSetting) == 0x000008, "Wrong alignment on FTngAnimHelperJointSetting");
static_assert(sizeof(FTngAnimHelperJointSetting) == 0x000528, "Wrong size on FTngAnimHelperJointSetting");
static_assert(offsetof(FTngAnimHelperJointSetting, Type) == 0x000004, "Member 'FTngAnimHelperJointSetting::Type' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, SourceRefType) == 0x00000C, "Member 'FTngAnimHelperJointSetting::SourceRefType' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, SourceRefJointName) == 0x000010, "Member 'FTngAnimHelperJointSetting::SourceRefJointName' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, SourceJointName) == 0x000018, "Member 'FTngAnimHelperJointSetting::SourceJointName' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, TargetRefType) == 0x000024, "Member 'FTngAnimHelperJointSetting::TargetRefType' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, TargetRefJointName) == 0x000028, "Member 'FTngAnimHelperJointSetting::TargetRefJointName' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, TargetJointName) == 0x000030, "Member 'FTngAnimHelperJointSetting::TargetJointName' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, TargetJointOrient) == 0x000038, "Member 'FTngAnimHelperJointSetting::TargetJointOrient' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, ExpressionSetting) == 0x000044, "Member 'FTngAnimHelperJointSetting::ExpressionSetting' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, DriveConstraintSetting) == 0x000050, "Member 'FTngAnimHelperJointSetting::DriveConstraintSetting' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, DriveBlendShapeSetting) == 0x0003C8, "Member 'FTngAnimHelperJointSetting::DriveBlendShapeSetting' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointSetting, DriveMaterialSetting) == 0x000478, "Member 'FTngAnimHelperJointSetting::DriveMaterialSetting' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngAnimHelperJointMaterialMapping
// 0x0058 (0x0058 - 0x0000)
struct FTngAnimHelperJointMaterialMapping final
{
public:
	class FName                                   SlotName;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class FName>                ParamTable;                                        // 0x0008(0x0050)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTngAnimHelperJointMaterialMapping) == 0x000008, "Wrong alignment on FTngAnimHelperJointMaterialMapping");
static_assert(sizeof(FTngAnimHelperJointMaterialMapping) == 0x000058, "Wrong size on FTngAnimHelperJointMaterialMapping");
static_assert(offsetof(FTngAnimHelperJointMaterialMapping, SlotName) == 0x000000, "Member 'FTngAnimHelperJointMaterialMapping::SlotName' has a wrong offset!");
static_assert(offsetof(FTngAnimHelperJointMaterialMapping, ParamTable) == 0x000008, "Member 'FTngAnimHelperJointMaterialMapping::ParamTable' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngAnimHelperJointMaterialMeshMapping
// 0x0050 (0x0050 - 0x0000)
struct FTngAnimHelperJointMaterialMeshMapping final
{
public:
	TMap<class FName, class USkinnedMeshComponent*> MeshComponentTable;                                // 0x0000(0x0050)(Edit, BlueprintVisible, ExportObject, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTngAnimHelperJointMaterialMeshMapping) == 0x000008, "Wrong alignment on FTngAnimHelperJointMaterialMeshMapping");
static_assert(sizeof(FTngAnimHelperJointMaterialMeshMapping) == 0x000050, "Wrong size on FTngAnimHelperJointMaterialMeshMapping");
static_assert(offsetof(FTngAnimHelperJointMaterialMeshMapping, MeshComponentTable) == 0x000000, "Member 'FTngAnimHelperJointMaterialMeshMapping::MeshComponentTable' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngAnimNode_HelperJoint
// 0x0108 (0x01D0 - 0x00C8)
struct FTngAnimNode_HelperJoint final : public FAnimNode_SkeletalControlBase
{
public:
	class UTngAnimHelperJointData*                Settings;                                          // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FTngAnimHelperJointMaterialMapping> MaterialTable;                                     // 0x00D0(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FTngAnimHelperJointMaterialMeshMapping MeshCompTable;                                     // 0x0120(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x60];                                     // 0x0170(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTngAnimNode_HelperJoint) == 0x000008, "Wrong alignment on FTngAnimNode_HelperJoint");
static_assert(sizeof(FTngAnimNode_HelperJoint) == 0x0001D0, "Wrong size on FTngAnimNode_HelperJoint");
static_assert(offsetof(FTngAnimNode_HelperJoint, Settings) == 0x0000C8, "Member 'FTngAnimNode_HelperJoint::Settings' has a wrong offset!");
static_assert(offsetof(FTngAnimNode_HelperJoint, MaterialTable) == 0x0000D0, "Member 'FTngAnimNode_HelperJoint::MaterialTable' has a wrong offset!");
static_assert(offsetof(FTngAnimNode_HelperJoint, MeshCompTable) == 0x000120, "Member 'FTngAnimNode_HelperJoint::MeshCompTable' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngAnimNode_JointChainDelayed
// 0x0048 (0x0110 - 0x00C8)
struct FTngAnimNode_JointChainDelayed final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         RootJoint;                                         // 0x00C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         EndJoint;                                          // 0x00D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableStretch;                                    // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayAlpha;                                        // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawInputPose;                                    // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawOutputPose;                                   // 0x00F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x1E];                                      // 0x00F2(0x001E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTngAnimNode_JointChainDelayed) == 0x000008, "Wrong alignment on FTngAnimNode_JointChainDelayed");
static_assert(sizeof(FTngAnimNode_JointChainDelayed) == 0x000110, "Wrong size on FTngAnimNode_JointChainDelayed");
static_assert(offsetof(FTngAnimNode_JointChainDelayed, RootJoint) == 0x0000C8, "Member 'FTngAnimNode_JointChainDelayed::RootJoint' has a wrong offset!");
static_assert(offsetof(FTngAnimNode_JointChainDelayed, EndJoint) == 0x0000D8, "Member 'FTngAnimNode_JointChainDelayed::EndJoint' has a wrong offset!");
static_assert(offsetof(FTngAnimNode_JointChainDelayed, bEnableStretch) == 0x0000E8, "Member 'FTngAnimNode_JointChainDelayed::bEnableStretch' has a wrong offset!");
static_assert(offsetof(FTngAnimNode_JointChainDelayed, DelayAlpha) == 0x0000EC, "Member 'FTngAnimNode_JointChainDelayed::DelayAlpha' has a wrong offset!");
static_assert(offsetof(FTngAnimNode_JointChainDelayed, bDrawInputPose) == 0x0000F0, "Member 'FTngAnimNode_JointChainDelayed::bDrawInputPose' has a wrong offset!");
static_assert(offsetof(FTngAnimNode_JointChainDelayed, bDrawOutputPose) == 0x0000F1, "Member 'FTngAnimNode_JointChainDelayed::bDrawOutputPose' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngJointChainPhysicsParameters
// 0x0010 (0x0010 - 0x0000)
struct FTngJointChainPhysicsParameters final
{
public:
	float                                         Damping;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldDampingLocation;                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldDampingRotation;                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stiffness;                                         // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTngJointChainPhysicsParameters) == 0x000004, "Wrong alignment on FTngJointChainPhysicsParameters");
static_assert(sizeof(FTngJointChainPhysicsParameters) == 0x000010, "Wrong size on FTngJointChainPhysicsParameters");
static_assert(offsetof(FTngJointChainPhysicsParameters, Damping) == 0x000000, "Member 'FTngJointChainPhysicsParameters::Damping' has a wrong offset!");
static_assert(offsetof(FTngJointChainPhysicsParameters, WorldDampingLocation) == 0x000004, "Member 'FTngJointChainPhysicsParameters::WorldDampingLocation' has a wrong offset!");
static_assert(offsetof(FTngJointChainPhysicsParameters, WorldDampingRotation) == 0x000008, "Member 'FTngJointChainPhysicsParameters::WorldDampingRotation' has a wrong offset!");
static_assert(offsetof(FTngJointChainPhysicsParameters, Stiffness) == 0x00000C, "Member 'FTngJointChainPhysicsParameters::Stiffness' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngJCPColliderBase
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x10) FTngJCPColliderBase
{
public:
	struct FBoneReference                         DrivingBone;                                       // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                OffsetLocation;                                    // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OffsetRotation;                                    // 0x001C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTngJCPColliderBase) == 0x000010, "Wrong alignment on FTngJCPColliderBase");
static_assert(sizeof(FTngJCPColliderBase) == 0x000050, "Wrong size on FTngJCPColliderBase");
static_assert(offsetof(FTngJCPColliderBase, DrivingBone) == 0x000000, "Member 'FTngJCPColliderBase::DrivingBone' has a wrong offset!");
static_assert(offsetof(FTngJCPColliderBase, OffsetLocation) == 0x000010, "Member 'FTngJCPColliderBase::OffsetLocation' has a wrong offset!");
static_assert(offsetof(FTngJCPColliderBase, OffsetRotation) == 0x00001C, "Member 'FTngJCPColliderBase::OffsetRotation' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngJCPSphereCollider
// 0x0010 (0x0060 - 0x0050)
struct FTngJCPSphereCollider final : public FTngJCPColliderBase
{
public:
	float                                         Radius;                                            // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETngJCPSphereColliderType                     LimitType;                                         // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0xB];                                       // 0x0055(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTngJCPSphereCollider) == 0x000010, "Wrong alignment on FTngJCPSphereCollider");
static_assert(sizeof(FTngJCPSphereCollider) == 0x000060, "Wrong size on FTngJCPSphereCollider");
static_assert(offsetof(FTngJCPSphereCollider, Radius) == 0x000050, "Member 'FTngJCPSphereCollider::Radius' has a wrong offset!");
static_assert(offsetof(FTngJCPSphereCollider, LimitType) == 0x000054, "Member 'FTngJCPSphereCollider::LimitType' has a wrong offset!");

// ScriptStruct TangoAnimationRuntime.TngJCPCapsuleCollider
// 0x0010 (0x0060 - 0x0050)
struct FTngJCPCapsuleCollider final : public FTngJCPColliderBase
{
public:
	float                                         Radius;                                            // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
