#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wp0010_BowNormal_AC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Snowfall_structs.hpp"


namespace SDK::Params
{

// Function wp0010_BowNormal_AC.wp0010_BowNormal_AC_C.ExecuteUbergraph_wp0010_BowNormal_AC
// 0x0148 (0x0148 - 0x0000)
struct Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                K2Node_Event_MuzzleLocation;                       // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_MuzzleDirection;                      // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATngCharacter*                          K2Node_DynamicCast_AsTng_Character;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTngAnimInstance*                       CallFunc_GetTngAnimInstanceFromActor_ReturnValue;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USnfPlayerAnimInstance*                 K2Node_DynamicCast_AsSnf_Player_Anim_Instance;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBowShotTimeRate_ReturnValue;           // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATngCharacter*                          K2Node_DynamicCast_AsTng_Character_1;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATngCharacter*                          K2Node_DynamicCast_AsTng_Character_2;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTngAnimInstance*                       CallFunc_GetTngAnimInstance_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTngAnimInstance*                       CallFunc_GetTngAnimInstance_ReturnValue_1;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USnfPlayerAnimInstance*                 K2Node_DynamicCast_AsSnf_Player_Anim_Instance_1;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USnfPlayerAnimInstance*                 K2Node_DynamicCast_AsSnf_Player_Anim_Instance_2;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentState_ReturnValue;               // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESnfPlayerAnimState                           CallFunc_GetAnimState_ReturnValue;                 // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC) == 0x000008, "Wrong alignment on Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC");
static_assert(sizeof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC) == 0x000148, "Wrong size on Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, EntryPoint) == 0x000000, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, Temp_name_Variable) == 0x000004, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_CreateDelegate_OutputDelegate_3) == 0x00003C, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_Event_MuzzleLocation) == 0x00004C, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_Event_MuzzleLocation' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_Event_MuzzleDirection) == 0x000058, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_Event_MuzzleDirection' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_CreateDelegate_OutputDelegate_4) == 0x000064, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_CreateDelegate_OutputDelegate_5) == 0x000074, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_Event_DeltaSeconds) == 0x000084, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_GetInstigator_ReturnValue) == 0x000088, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_Not_PreBool_ReturnValue) == 0x000090, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_AsTng_Character) == 0x000098, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_AsTng_Character' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_GetTngAnimInstanceFromActor_ReturnValue) == 0x0000A8, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_GetTngAnimInstanceFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_AsSnf_Player_Anim_Instance) == 0x0000B0, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_AsSnf_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_GetBowShotTimeRate_ReturnValue) == 0x0000BC, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_GetBowShotTimeRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000C0, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000C4, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_GetInstigator_ReturnValue_1) == 0x0000D8, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_GetInstigator_ReturnValue_2) == 0x0000E0, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_AsTng_Character_1) == 0x0000E8, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_AsTng_Character_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_AsTng_Character_2) == 0x0000F8, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_AsTng_Character_2' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_bSuccess_3) == 0x000100, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_GetTngAnimInstance_ReturnValue) == 0x000108, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_GetTngAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_GetTngAnimInstance_ReturnValue_1) == 0x000110, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_GetTngAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_AsSnf_Player_Anim_Instance_1) == 0x000118, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_AsSnf_Player_Anim_Instance_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_bSuccess_4) == 0x000120, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_AsSnf_Player_Anim_Instance_2) == 0x000128, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_AsSnf_Player_Anim_Instance_2' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_DynamicCast_bSuccess_5) == 0x000130, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_IsCurrentState_ReturnValue) == 0x000131, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_IsCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_GetAnimState_ReturnValue) == 0x000132, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_GetAnimState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000133, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, Temp_name_Variable_1) == 0x000134, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, Temp_bool_Variable) == 0x00013C, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC, K2Node_Select_Default) == 0x000140, "Member 'Wp0010_BowNormal_AC_C_ExecuteUbergraph_wp0010_BowNormal_AC::K2Node_Select_Default' has a wrong offset!");

// Function wp0010_BowNormal_AC.wp0010_BowNormal_AC_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Wp0010_BowNormal_AC_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wp0010_BowNormal_AC_C_ReceiveTick) == 0x000004, "Wrong alignment on Wp0010_BowNormal_AC_C_ReceiveTick");
static_assert(sizeof(Wp0010_BowNormal_AC_C_ReceiveTick) == 0x000004, "Wrong size on Wp0010_BowNormal_AC_C_ReceiveTick");
static_assert(offsetof(Wp0010_BowNormal_AC_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Wp0010_BowNormal_AC_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function wp0010_BowNormal_AC.wp0010_BowNormal_AC_C.LaunchAmmo
// 0x0018 (0x0018 - 0x0000)
struct Wp0010_BowNormal_AC_C_LaunchAmmo final
{
public:
	struct FVector                                MuzzleLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MuzzleDirection;                                   // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wp0010_BowNormal_AC_C_LaunchAmmo) == 0x000004, "Wrong alignment on Wp0010_BowNormal_AC_C_LaunchAmmo");
static_assert(sizeof(Wp0010_BowNormal_AC_C_LaunchAmmo) == 0x000018, "Wrong size on Wp0010_BowNormal_AC_C_LaunchAmmo");
static_assert(offsetof(Wp0010_BowNormal_AC_C_LaunchAmmo, MuzzleLocation) == 0x000000, "Member 'Wp0010_BowNormal_AC_C_LaunchAmmo::MuzzleLocation' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_LaunchAmmo, MuzzleDirection) == 0x00000C, "Member 'Wp0010_BowNormal_AC_C_LaunchAmmo::MuzzleDirection' has a wrong offset!");

// Function wp0010_BowNormal_AC.wp0010_BowNormal_AC_C.IsHitIgnoreActor
// 0x0048 (0x0048 - 0x0000)
struct Wp0010_BowNormal_AC_C_IsHitIgnoreActor final
{
public:
	const class AActor*                           Causer;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InHitActor;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheckTeamId;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCheckOwner;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCheckClass;                                       // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0013(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHitIgnoreActor_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor) == 0x000008, "Wrong alignment on Wp0010_BowNormal_AC_C_IsHitIgnoreActor");
static_assert(sizeof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor) == 0x000048, "Wrong size on Wp0010_BowNormal_AC_C_IsHitIgnoreActor");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, Causer) == 0x000000, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::Causer' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, InHitActor) == 0x000008, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::InHitActor' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, bCheckTeamId) == 0x000010, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::bCheckTeamId' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, bCheckOwner) == 0x000011, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::bCheckOwner' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, bCheckClass) == 0x000012, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::bCheckClass' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, ReturnValue) == 0x000013, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, CallFunc_GetInstigator_ReturnValue) == 0x000018, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, CallFunc_IsHitIgnoreActor_ReturnValue) == 0x000029, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::CallFunc_IsHitIgnoreActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, CallFunc_GetOwner_ReturnValue_1) == 0x000030, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, CallFunc_GetOwner_ReturnValue_2) == 0x000038, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000041, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_IsHitIgnoreActor, CallFunc_BooleanOR_ReturnValue) == 0x000042, "Member 'Wp0010_BowNormal_AC_C_IsHitIgnoreActor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function wp0010_BowNormal_AC.wp0010_BowNormal_AC_C.PlayAmmoFxProp
// 0x0038 (0x0038 - 0x0000)
struct Wp0010_BowNormal_AC_C_PlayAmmoFxProp final
{
public:
	class FName                                   PlayListName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetCurrentAmmo_ReturnValue;               // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASnfWeaponAmmo*                         K2Node_DynamicCast_AsSnf_Weapon_Ammo;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Wp0010_BowNormal_AC_C_PlayAmmoFxProp) == 0x000008, "Wrong alignment on Wp0010_BowNormal_AC_C_PlayAmmoFxProp");
static_assert(sizeof(Wp0010_BowNormal_AC_C_PlayAmmoFxProp) == 0x000038, "Wrong size on Wp0010_BowNormal_AC_C_PlayAmmoFxProp");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayAmmoFxProp, PlayListName) == 0x000000, "Member 'Wp0010_BowNormal_AC_C_PlayAmmoFxProp::PlayListName' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayAmmoFxProp, CallFunc_GetCurrentAmmo_ReturnValue) == 0x000008, "Member 'Wp0010_BowNormal_AC_C_PlayAmmoFxProp::CallFunc_GetCurrentAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayAmmoFxProp, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'Wp0010_BowNormal_AC_C_PlayAmmoFxProp::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayAmmoFxProp, CallFunc_Array_Get_Item) == 0x000020, "Member 'Wp0010_BowNormal_AC_C_PlayAmmoFxProp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayAmmoFxProp, K2Node_DynamicCast_AsSnf_Weapon_Ammo) == 0x000028, "Member 'Wp0010_BowNormal_AC_C_PlayAmmoFxProp::K2Node_DynamicCast_AsSnf_Weapon_Ammo' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayAmmoFxProp, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Wp0010_BowNormal_AC_C_PlayAmmoFxProp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayAmmoFxProp, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'Wp0010_BowNormal_AC_C_PlayAmmoFxProp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function wp0010_BowNormal_AC.wp0010_BowNormal_AC_C.GetChargeRate
// 0x0038 (0x0038 - 0x0000)
struct Wp0010_BowNormal_AC_C_GetChargeRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATngCharacter*                          K2Node_DynamicCast_AsTng_Character;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTngAnimInstance*                       CallFunc_GetTngAnimInstance_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USnfPlayerAnimInstance*                 K2Node_DynamicCast_AsSnf_Player_Anim_Instance;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBowFireEndRate_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wp0010_BowNormal_AC_C_GetChargeRate) == 0x000008, "Wrong alignment on Wp0010_BowNormal_AC_C_GetChargeRate");
static_assert(sizeof(Wp0010_BowNormal_AC_C_GetChargeRate) == 0x000038, "Wrong size on Wp0010_BowNormal_AC_C_GetChargeRate");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetChargeRate, ReturnValue) == 0x000000, "Member 'Wp0010_BowNormal_AC_C_GetChargeRate::ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetChargeRate, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'Wp0010_BowNormal_AC_C_GetChargeRate::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetChargeRate, K2Node_DynamicCast_AsTng_Character) == 0x000010, "Member 'Wp0010_BowNormal_AC_C_GetChargeRate::K2Node_DynamicCast_AsTng_Character' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetChargeRate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Wp0010_BowNormal_AC_C_GetChargeRate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetChargeRate, CallFunc_GetTngAnimInstance_ReturnValue) == 0x000020, "Member 'Wp0010_BowNormal_AC_C_GetChargeRate::CallFunc_GetTngAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetChargeRate, K2Node_DynamicCast_AsSnf_Player_Anim_Instance) == 0x000028, "Member 'Wp0010_BowNormal_AC_C_GetChargeRate::K2Node_DynamicCast_AsSnf_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetChargeRate, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Wp0010_BowNormal_AC_C_GetChargeRate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetChargeRate, CallFunc_GetBowFireEndRate_ReturnValue) == 0x000034, "Member 'Wp0010_BowNormal_AC_C_GetChargeRate::CallFunc_GetBowFireEndRate_ReturnValue' has a wrong offset!");

// Function wp0010_BowNormal_AC.wp0010_BowNormal_AC_C.PlayGainAnim
// 0x0020 (0x0020 - 0x0000)
struct Wp0010_BowNormal_AC_C_PlayGainAnim final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWp0010_AN_C*                           K2Node_DynamicCast_AsWp_0010_AN;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Wp0010_BowNormal_AC_C_PlayGainAnim) == 0x000008, "Wrong alignment on Wp0010_BowNormal_AC_C_PlayGainAnim");
static_assert(sizeof(Wp0010_BowNormal_AC_C_PlayGainAnim) == 0x000020, "Wrong size on Wp0010_BowNormal_AC_C_PlayGainAnim");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayGainAnim, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'Wp0010_BowNormal_AC_C_PlayGainAnim::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayGainAnim, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Wp0010_BowNormal_AC_C_PlayGainAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayGainAnim, K2Node_DynamicCast_AsWp_0010_AN) == 0x000010, "Member 'Wp0010_BowNormal_AC_C_PlayGainAnim::K2Node_DynamicCast_AsWp_0010_AN' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_PlayGainAnim, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Wp0010_BowNormal_AC_C_PlayGainAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function wp0010_BowNormal_AC.wp0010_BowNormal_AC_C.GetLaunchDirection
// 0x00B0 (0x00B0 - 0x0000)
struct Wp0010_BowNormal_AC_C_GetLaunchDirection final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             MuzzleTransform;                                   // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FVector                                ReturnValue;                                       // 0x0040(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegreesToRadians_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLaunchDirection_ReturnValue;           // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotatorFromAxis_ReturnValue;          // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wp0010_BowNormal_AC_C_GetLaunchDirection) == 0x000010, "Wrong alignment on Wp0010_BowNormal_AC_C_GetLaunchDirection");
static_assert(sizeof(Wp0010_BowNormal_AC_C_GetLaunchDirection) == 0x0000B0, "Wrong size on Wp0010_BowNormal_AC_C_GetLaunchDirection");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetLaunchDirection, ID) == 0x000000, "Member 'Wp0010_BowNormal_AC_C_GetLaunchDirection::ID' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetLaunchDirection, MuzzleTransform) == 0x000010, "Member 'Wp0010_BowNormal_AC_C_GetLaunchDirection::MuzzleTransform' has a wrong offset!");
static_assert(offsetof(Wp0010_BowNormal_AC_C_GetLaunchDirection, ReturnValue) == 0x000040, "Member 'Wp0010_BowNormal_AC_C_GetLaunchDirection::ReturnValue' has a wrong offset!");
