#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEvent_ShootRock

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEvent_ShootRock.BP_TresPlayerStateEvent_ShootRock_C.ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock
// 0x0108 (0x0108 - 0x0000)
struct BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0004(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0018(0x0014)(NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerControllerLowerBase*         CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraManager*                     CallFunc_GetTresCameraManager_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraNormal*                      CallFunc_GetTresCameraNormal_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x0070(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x0084(0x0014)(NoDestructor)
	class ATresCharPawnBase*                      K2Node_Event_SendActor2;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName2;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID2;                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param2;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x00EC(0x0014)(NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock) == 0x000008, "Wrong alignment on BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock");
static_assert(sizeof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock) == 0x000108, "Wrong size on BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000004, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000018, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue) == 0x000030, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000038, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_GetTresCameraManager_ReturnValue) == 0x000040, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_GetTresCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_GetTresCameraNormal_ReturnValue) == 0x000048, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_GetTresCameraNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000058, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x000060, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000068, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x000070, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x000084, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, K2Node_Event_SendActor2) == 0x000098, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::K2Node_Event_SendActor2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, K2Node_Event_AnimSeqName2) == 0x0000A0, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::K2Node_Event_AnimSeqName2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, K2Node_Event_EventID2) == 0x0000A8, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::K2Node_Event_EventID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, K2Node_Event_Param2) == 0x0000AC, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::K2Node_Event_Param2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, K2Node_Event_SendActor) == 0x0000B0, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, K2Node_Event_AnimSeqName) == 0x0000B8, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, K2Node_Event_EventID) == 0x0000C0, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, K2Node_Event_Param) == 0x0000C4, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000C8, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0000C9, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x0000CA, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x0000D0, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000D8, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0000E0, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0000E8, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x0000EC, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000100, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ExecuteUbergraph_BP_TresPlayerStateEvent_ShootRock::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_TresPlayerStateEvent_ShootRock.BP_TresPlayerStateEvent_ShootRock_C.ReceiveAnimNotifyEndBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent");
static_assert(sizeof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyEndBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEvent_ShootRock.BP_TresPlayerStateEvent_ShootRock_C.ReceiveAnimNotifyStartBpEvent
// 0x800000 (0x800000 - 0x0000)
struct alignas(0x800000) BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent) == 0x800000, "Wrong alignment on BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent) == 0x800000, "Wrong size on BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEvent_ShootRock_C_ReceiveAnimNotifyStartBpEvent::Param' has a wrong offset!");

}

