#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_Rapunzel

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_Rapunzel.BP_TresPlayerStateEventCamera_Rapunzel_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0004(0x0014)(NoDestructor)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0020(0x0014)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x0040(0x0014)(NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x0060(0x0014)(NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x0080(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x0094(0x0014)(NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresNpcPawnBase*                       CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNpcPawnBase*                       CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue2;  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNpcPawnBase*                       CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue3;  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNpcPawnBase*                       CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue4;  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue3;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue7; // 0x00F0(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue8; // 0x0104(0x0014)(NoDestructor)
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue;  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue9; // 0x0130(0x0014)(NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue2;         // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubID;                                // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7;  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      CallFunc_GetSpecificActionAccompanyPawn_ReturnValue; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  CallFunc_GetStateID_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x019E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19F[0x1];                                      // 0x019F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTresFriendComponent*                   CallFunc_TresGetFriendManager_ReturnValue;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCameraTargetActor_ReturnValue;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue4;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTresFriendComponent*                   CallFunc_TresGetFriendManager_ReturnValue2;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCameraShortAnime_ReturnValue;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue5;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000020, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000038, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x000058, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x000060, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000078, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x000080, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x000094, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x0000A8, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, Temp_int_Variable) == 0x0000B0, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue) == 0x0000B8, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_Less_IntInt_ReturnValue2) == 0x0000C1, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue2) == 0x0000C8, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue3) == 0x0000D0, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue4) == 0x0000D8, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_SpawnTresCameraAnim_ReturnValue3) == 0x0000E0, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_SpawnTresCameraAnim_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0000E8, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_SetTresCameraTransitionParams_ReturnValue7) == 0x0000F0, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_SetTresCameraTransitionParams_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_SetTresCameraTransitionParams_ReturnValue8) == 0x000104, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_SetTresCameraTransitionParams_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue) == 0x000118, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x000120, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x000128, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_SetTresCameraTransitionParams_ReturnValue9) == 0x000130, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_SetTresCameraTransitionParams_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000144, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_NotEqual_FloatFloat_ReturnValue2) == 0x000145, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_NotEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000146, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000148, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_Event_ActionID) == 0x000150, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_Event_ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_Event_SubID) == 0x000154, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_Event_SubID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7) == 0x000158, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_SwitchEnum_CmpSuccess) == 0x000160, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetSpecificActionAccompanyPawn_ReturnValue) == 0x000168, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetSpecificActionAccompanyPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetStateID_ReturnValue) == 0x000170, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetStateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_SwitchEnum2_CmpSuccess) == 0x000171, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_SwitchEnum3_CmpSuccess) == 0x000172, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_SwitchEnum4_CmpSuccess) == 0x000173, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_SwitchEnum5_CmpSuccess) == 0x000174, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_Event_SendActor) == 0x000178, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_Event_AnimSeqName) == 0x000180, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_Event_EventID) == 0x000188, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_Event_Param) == 0x00018C, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8) == 0x000190, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000198, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000199, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x00019A, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x00019B, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x00019C, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, Temp_bool_Has_Been_Initd_Variable) == 0x00019D, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x00019E, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_TresGetFriendManager_ReturnValue) == 0x0001A0, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_TresGetFriendManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, Temp_bool_IsClosed_Variable) == 0x0001A8, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_GetCameraTargetActor_ReturnValue) == 0x0001B0, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_GetCameraTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_SpawnTresCameraAnim_ReturnValue4) == 0x0001B8, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_SpawnTresCameraAnim_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_TresGetFriendManager_ReturnValue2) == 0x0001C0, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_TresGetFriendManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_IsCameraShortAnime_ReturnValue) == 0x0001C8, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_IsCameraShortAnime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, CallFunc_BP_SpawnTresCameraAnim_ReturnValue5) == 0x0001D0, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::CallFunc_BP_SpawnTresCameraAnim_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_Event_StateID) == 0x0001D8, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel, K2Node_SwitchEnum6_CmpSuccess) == 0x0001D9, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Rapunzel::K2Node_SwitchEnum6_CmpSuccess' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Rapunzel.BP_TresPlayerStateEventCamera_Rapunzel_C.ReceivePlayerDtorState
// 0xC000000 (0xC000000 - 0x0000)
struct alignas(0xC000000) BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerDtorState) == 0xC000000, "Wrong alignment on BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerDtorState) == 0xC000000, "Wrong size on BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Rapunzel.BP_TresPlayerStateEventCamera_Rapunzel_C.ReceiveAnimNotifyStartBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ReceiveAnimNotifyStartBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Rapunzel.BP_TresPlayerStateEventCamera_Rapunzel_C.ReceivePlayerSpecificAction
// 0x60C50AC0 (0x60C50AC0 - 0x0000)
struct alignas(0x60C50AC0) BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerSpecificAction final
{
public:
	ETresPlayerSpecificActionID                   ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerSpecificAction) == 0x60C50AC0, "Wrong alignment on BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerSpecificAction) == 0x60C50AC0, "Wrong size on BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerSpecificAction::ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerSpecificAction, SubID) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_Rapunzel_C_ReceivePlayerSpecificAction::SubID' has a wrong offset!");

}

