#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEvent_DevilWave

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "G_ex_SpotLightAnim_LightColor_structs.hpp"
#include "G_ex_SpotLightAnim_Intensity_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEvent_DevilWave.BP_TresPlayerStateEvent_DevilWave_C.ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave
// 0x1FAE4540 (0x1FAE4540 - 0x0000)
struct BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FG_ex_SpotLightAnim_LightColor         K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor;   // 0x0040(0x1FAD0458)(HasGetValueTypeHash)
	struct FG_ex_SpotLightAnim_Intensity          K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity;    // 0x0070(0x1FAE4540)(HasGetValueTypeHash)
	struct FG_ex_SpotLightAnim_LightColor         K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor2;  // 0x0088(0x1FAD0458)(HasGetValueTypeHash)
	struct FG_ex_SpotLightAnim_Intensity          K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity2;   // 0x00B8(0x1FAE4540)(HasGetValueTypeHash)
	struct FG_ex_SpotLightAnim_LightColor         K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor3;  // 0x00D0(0x1FAD0458)(HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0108(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x011C(0x0014)(NoDestructor)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x0140(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x0154(0x0014)(NoDestructor)
	struct FG_ex_SpotLightAnim_LightColor         K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor4;  // 0x0168(0x1FAD0458)(HasGetValueTypeHash)
	struct FG_ex_SpotLightAnim_Intensity          K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity3;   // 0x0198(0x1FAE4540)(HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x01C0(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x01D4(0x0014)(NoDestructor)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue3;      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue7; // 0x01F8(0x0014)(NoDestructor)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue4;      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue8; // 0x0218(0x0014)(NoDestructor)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerControllerLowerBase*         CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FG_ex_SpotLightAnim_Intensity          K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity4;   // 0x0238(0x1FAE4540)(HasGetValueTypeHash)
	class ATresCameraManager*                     CallFunc_GetTresCameraManager_ReturnValue;         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraNormal*                      CallFunc_GetTresCameraNormal_ReturnValue;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue9; // 0x0260(0x0014)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue10; // 0x0278(0x0014)(NoDestructor)
	struct FTresScreenBlurParams                  K2Node_MakeStruct_TresScreenBlurParams;            // 0x028C(0x112E95F0)(NoDestructor)
	class ATresCharPawnBase*                      K2Node_Event_SendActor2;                           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName2;                         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID2;                             // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param2;                               // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0313(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue5;           // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0316(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x0317(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresGameState*                         CallFunc_GetTresGameState_ReturnValue;             // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7;  // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresSceneManager*                      CallFunc_GetSceneManager_ReturnValue;              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubID;                                // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8;  // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FG_ex_SpotLightAnim_LightColor         K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor5;  // 0x0360(0x1FAD0458)(HasGetValueTypeHash)
	class ATresCharPawnBase*                      CallFunc_GetSpecificActionAccompanyPawn_ReturnValue; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue11; // 0x0398(0x0014)(NoDestructor)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraTargetOTS*                   CallFunc_BP_SpawnTresCameraTargetOTS_ReturnValue;  // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue12; // 0x03B8(0x0014)(NoDestructor)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FG_ex_SpotLightAnim_Intensity          K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity5;   // 0x03D0(0x1FAE4540)(HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue5;      // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresGameState*                         CallFunc_GetTresGameState_ReturnValue2;            // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresSceneManager*                      CallFunc_GetSceneManager_ReturnValue2;             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9;  // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0410(0x112E9D50)(IsPlainOldData, NoDestructor)
	class ATresNpcPawnBase*                       CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue;   // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0450(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x0480(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x04B0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x04E0(0x112E9D50)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue2;           // 0x0520(0x112E9D50)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AG_ex_SpotLightAnim_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AG_ex_SpotLightAnim_C*                  CallFunc_FinishSpawningActor_ReturnValue2;         // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTresScreenBlurParams                  K2Node_MakeStruct_TresScreenBlurParams2;           // 0x0568(0x112E95F0)(NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10; // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x05C0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue4;               // 0x05F0(0x112E9D50)(IsPlainOldData, NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11; // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12; // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue4;                // 0x0630(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue5;                // 0x0660(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue3;           // 0x0690(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue4;           // 0x06C0(0x112E9D50)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3; // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4; // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AG_ex_SpotLightAnim_C*                  CallFunc_FinishSpawningActor_ReturnValue3;         // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AG_ex_SpotLightAnim_C*                  CallFunc_FinishSpawningActor_ReturnValue4;         // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue5;               // 0x0710(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue5;           // 0x0740(0x112E9D50)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5; // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AG_ex_SpotLightAnim_C*                  CallFunc_FinishSpawningActor_ReturnValue5;         // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave) == 0x1FAE4540, "Wrong alignment on BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave");
static_assert(sizeof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave) == 0x1FAE4540, "Wrong size on BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor) == 0x000040, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity) == 0x000070, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor2) == 0x000088, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity2) == 0x0000B8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor3) == 0x0000D0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000100, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000108, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x00011C, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000130, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000138, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x000140, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x000154, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor4) == 0x000168, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity3) == 0x000198, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x0001B0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x0001B8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x0001C0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x0001D4, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BP_SpawnTresCameraAnim_ReturnValue3) == 0x0001E8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BP_SpawnTresCameraAnim_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0001F0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue7) == 0x0001F8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BP_SpawnTresCameraAnim_ReturnValue4) == 0x000210, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BP_SpawnTresCameraAnim_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue8) == 0x000218, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue) == 0x000230, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity4) == 0x000238, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetTresCameraManager_ReturnValue) == 0x000250, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetTresCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetTresCameraNormal_ReturnValue) == 0x000258, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetTresCameraNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue9) == 0x000260, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_IsValid_ReturnValue) == 0x000274, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue10) == 0x000278, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_TresScreenBlurParams) == 0x00028C, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_TresScreenBlurParams' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_SendActor2) == 0x0002E0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_SendActor2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_AnimSeqName2) == 0x0002E8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_AnimSeqName2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_EventID2) == 0x0002F0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_EventID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_Param2) == 0x0002F4, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_Param2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_SendActor) == 0x0002F8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_AnimSeqName) == 0x000300, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_EventID) == 0x000308, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_Param) == 0x00030C, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000310, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000311, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000312, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x000313, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_IntInt_ReturnValue4) == 0x000314, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_IntInt_ReturnValue5) == 0x000315, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000316, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x000317, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x000318, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x000320, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000328, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000329, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetTresGameState_ReturnValue) == 0x000330, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetTresGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7) == 0x000338, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetSceneManager_ReturnValue) == 0x000340, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetSceneManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_ActionID) == 0x000348, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_Event_SubID) == 0x00034C, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_Event_SubID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_SwitchEnum_CmpSuccess) == 0x000350, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8) == 0x000358, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor5) == 0x000360, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_LightColor5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetSpecificActionAccompanyPawn_ReturnValue) == 0x000390, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetSpecificActionAccompanyPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue11) == 0x000398, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BP_SpawnTresCameraTargetOTS_ReturnValue) == 0x0003B0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BP_SpawnTresCameraTargetOTS_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_SetTresCameraTransitionParams_ReturnValue12) == 0x0003B8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_SetTresCameraTransitionParams_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity5) == 0x0003D0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_g_ex_SpotLightAnim_Intensity5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BP_SpawnTresCameraAnim_ReturnValue5) == 0x0003E8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BP_SpawnTresCameraAnim_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetTresGameState_ReturnValue2) == 0x0003F0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetTresGameState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetSceneManager_ReturnValue2) == 0x0003F8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetSceneManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9) == 0x000400, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_MakeTransform_ReturnValue) == 0x000410, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue) == 0x000440, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_MakeTransform_ReturnValue2) == 0x000450, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetTransform_ReturnValue2) == 0x000480, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_ComposeTransforms_ReturnValue) == 0x0004B0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetTransform_ReturnValue3) == 0x0004E0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000510, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_ComposeTransforms_ReturnValue2) == 0x000520, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_ComposeTransforms_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2) == 0x000550, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_FinishSpawningActor_ReturnValue) == 0x000558, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_FinishSpawningActor_ReturnValue2) == 0x000560, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_FinishSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, K2Node_MakeStruct_TresScreenBlurParams2) == 0x000568, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::K2Node_MakeStruct_TresScreenBlurParams2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10) == 0x0005B8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_MakeTransform_ReturnValue3) == 0x0005C0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_MakeTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_MakeTransform_ReturnValue4) == 0x0005F0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_MakeTransform_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11) == 0x000620, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12) == 0x000628, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetTransform_ReturnValue4) == 0x000630, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetTransform_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_GetTransform_ReturnValue5) == 0x000660, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_GetTransform_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_ComposeTransforms_ReturnValue3) == 0x000690, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_ComposeTransforms_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_ComposeTransforms_ReturnValue4) == 0x0006C0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_ComposeTransforms_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3) == 0x0006F0, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4) == 0x0006F8, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_FinishSpawningActor_ReturnValue3) == 0x000700, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_FinishSpawningActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_FinishSpawningActor_ReturnValue4) == 0x000708, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_FinishSpawningActor_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_MakeTransform_ReturnValue5) == 0x000710, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_MakeTransform_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_ComposeTransforms_ReturnValue5) == 0x000740, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_ComposeTransforms_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5) == 0x000770, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave, CallFunc_FinishSpawningActor_ReturnValue5) == 0x000778, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ExecuteUbergraph_BP_TresPlayerStateEvent_DevilWave::CallFunc_FinishSpawningActor_ReturnValue5' has a wrong offset!");

// Function BP_TresPlayerStateEvent_DevilWave.BP_TresPlayerStateEvent_DevilWave_C.ReceivePlayerSpecificAction
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEvent_DevilWave_C_ReceivePlayerSpecificAction final
{
public:
	ETresPlayerSpecificActionID                   ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_DevilWave_C_ReceivePlayerSpecificAction) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEvent_DevilWave_C_ReceivePlayerSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEvent_DevilWave_C_ReceivePlayerSpecificAction) == 0x8020800, "Wrong size on BP_TresPlayerStateEvent_DevilWave_C_ReceivePlayerSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ReceivePlayerSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ReceivePlayerSpecificAction::ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ReceivePlayerSpecificAction, SubID) == 0x000004, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ReceivePlayerSpecificAction::SubID' has a wrong offset!");

// Function BP_TresPlayerStateEvent_DevilWave.BP_TresPlayerStateEvent_DevilWave_C.ReceiveAnimNotifyEndBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent");
static_assert(sizeof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyEndBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEvent_DevilWave.BP_TresPlayerStateEvent_DevilWave_C.ReceiveAnimNotifyStartBpEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyStartBpEvent) == 0x000008, "Wrong alignment on BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyStartBpEvent) == 0x000018, "Wrong size on BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyStartBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEvent_DevilWave_C_ReceiveAnimNotifyStartBpEvent::AnimSeqName' has a wrong offset!");
