#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEvent_motion_notify_0

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEvent_motion_notify.BP_TresPlayerStateEvent_motion_notify_C.ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify
// 0xC020800 (0xC020800 - 0x0000)
struct alignas(0xC020800) BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0010(0x0014)(NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0030(0x0014)(NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      K2Node_Event_SendActor2;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName2;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID2;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param2;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x00A4(0x0014)(NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x00D0(0x0014)(NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00F0(0x112E9D50)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNoteMovable*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify) == 0xC020800, "Wrong alignment on BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify");
static_assert(sizeof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify) == 0xC020800, "Wrong size on BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000008, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000010, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000028, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000030, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000048, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, K2Node_Event_SendActor2) == 0x000050, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::K2Node_Event_SendActor2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, K2Node_Event_AnimSeqName2) == 0x000058, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::K2Node_Event_AnimSeqName2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, K2Node_Event_EventID2) == 0x000060, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::K2Node_Event_EventID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, K2Node_Event_Param2) == 0x000064, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::K2Node_Event_Param2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, K2Node_Event_SendActor) == 0x000068, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, K2Node_Event_AnimSeqName) == 0x000070, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, K2Node_Event_EventID) == 0x000078, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, K2Node_Event_Param) == 0x00007C, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000080, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x000088, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000090, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000091, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, Temp_int_Variable) == 0x000094, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000099, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_Less_IntInt_ReturnValue2) == 0x00009A, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0000A0, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x0000A4, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0000B8, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x0000C0, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x0000C1, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, K2Node_Event_DeltaSeconds) == 0x0000C4, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x0000C8, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x0000D0, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, Temp_bool_Has_Been_Initd_Variable) == 0x0000E4, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, Temp_bool_IsClosed_Variable) == 0x0000E5, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x0000E8, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_GetTransform_ReturnValue) == 0x0000F0, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify, CallFunc_FinishSpawningActor_ReturnValue) == 0x000128, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_TresPlayerStateEvent_motion_notify.BP_TresPlayerStateEvent_motion_notify_C.ReceiveTick
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEvent_motion_notify_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveTick) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEvent_motion_notify_C_ReceiveTick");
static_assert(sizeof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveTick) == 0x8020800, "Wrong size on BP_TresPlayerStateEvent_motion_notify_C_ReceiveTick");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TresPlayerStateEvent_motion_notify.BP_TresPlayerStateEvent_motion_notify_C.ReceiveAnimNotifyEndBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName_0;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent");
static_assert(sizeof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent, AnimSeqName_0) == 0x000008, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent::AnimSeqName_0' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyEndBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEvent_motion_notify.BP_TresPlayerStateEvent_motion_notify_C.ReceiveAnimNotifyStartBpEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName_0;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent) == 0x000008, "Wrong alignment on BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent) == 0x000018, "Wrong size on BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent, AnimSeqName_0) == 0x000008, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent::AnimSeqName_0' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEvent_motion_notify_C_ReceiveAnimNotifyStartBpEvent::Param' has a wrong offset!");

}

