#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_UnionDiscode

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_UnionDiscode.BP_TresPlayerStateEventCamera_UnionDiscode_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode
// 0x112F5920 (0x112F5920 - 0x0000)
struct BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0028(0x0014)(NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0054(0x0014)(NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0080(0x112E9D50)(IsPlainOldData, NoDestructor)
	class ATresPlayerControllerLowerBase*         CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraManager*                     CallFunc_GetTresCameraManager_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit;         // 0x00D0(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue;    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraNormal*                      CallFunc_GetTresCameraNormal_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0xC];                                      // 0x0184(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x0190(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x01C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue2;           // 0x01CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      K2Node_Event_SendActor2;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName2;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID2;                             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param2;                               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x023C(0x0014)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit2;        // 0x0268(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue2;   // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode) == 0x112F5920, "Wrong alignment on BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode");
static_assert(sizeof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode) == 0x112F5920, "Wrong size on BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, Temp_object_Variable) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue) == 0x000020, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000028, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000054, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetTransform_ReturnValue) == 0x000080, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue) == 0x0000B0, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_TransformLocation_ReturnValue) == 0x0000B8, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetTresCameraManager_ReturnValue) == 0x0000C8, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetTresCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_BP_TresLineTraceByChannel_OutHit) == 0x0000D0, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_BP_TresLineTraceByChannel_OutHit' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_BP_TresLineTraceByChannel_ReturnValue) == 0x000158, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_BP_TresLineTraceByChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetTresCameraNormal_ReturnValue) == 0x000160, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetTresCameraNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x000170, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000178, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetTransform_ReturnValue2) == 0x000190, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_Add_VectorVector_ReturnValue2) == 0x0001C0, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_TransformLocation_ReturnValue2) == 0x0001CC, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_TransformLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_Event_SendActor2) == 0x0001D8, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_Event_SendActor2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_Event_AnimSeqName2) == 0x0001E0, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_Event_AnimSeqName2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_Event_EventID2) == 0x0001E8, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_Event_EventID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_Event_Param2) == 0x0001EC, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_Event_Param2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0001F0, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001F8, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001F9, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x000200, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_Event_SendActor) == 0x000208, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_Event_AnimSeqName) == 0x000210, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_Event_EventID) == 0x000218, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_Event_Param) == 0x00021C, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x000220, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000228, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000229, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000230, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_Event_StateID) == 0x000238, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x00023C, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, K2Node_SwitchEnum_CmpSuccess) == 0x000250, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, Temp_object_Variable2) == 0x000258, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_BP_TresLineTraceByChannel_OutHit2) == 0x000268, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_BP_TresLineTraceByChannel_OutHit2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode, CallFunc_BP_TresLineTraceByChannel_ReturnValue2) == 0x0002F0, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_UnionDiscode::CallFunc_BP_TresLineTraceByChannel_ReturnValue2' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_UnionDiscode.BP_TresPlayerStateEventCamera_UnionDiscode_C.ReceivePlayerDtorState
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceivePlayerDtorState) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceivePlayerDtorState) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_UnionDiscode.BP_TresPlayerStateEventCamera_UnionDiscode_C.ReceiveAnimNotifyEndBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyEndBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_UnionDiscode.BP_TresPlayerStateEventCamera_UnionDiscode_C.ReceiveAnimNotifyStartBpEvent
// 0xC120000 (0xC120000 - 0x0000)
struct alignas(0xC120000) BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyStartBpEvent) == 0xC120000, "Wrong alignment on BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyStartBpEvent) == 0xC120000, "Wrong size on BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_UnionDiscode_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
