#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_Mashmallow

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_Mashmallow.BP_TresPlayerStateEventCamera_Mashmallow_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow
// 0x0128 (0x0128 - 0x0000)
struct BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0004(0x0014)(NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0020(0x0014)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerControllerLowerBase*         CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraManager*                     CallFunc_GetTresCameraManager_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraNormal*                      CallFunc_GetTresCameraNormal_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x005C(0x0014)(NoDestructor)
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubID;                                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x0088(0x0014)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  CallFunc_GetStateID_ReturnValue;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x00D0(0x0014)(NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNpcPawnBase*                       CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue;   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x0114(0x0014)(NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow) == 0x000008, "Wrong alignment on BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow) == 0x000128, "Wrong size on BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000020, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000038, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetTresCameraManager_ReturnValue) == 0x000048, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetTresCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetTresCameraNormal_ReturnValue) == 0x000050, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetTresCameraNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x00005C, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue) == 0x000070, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000078, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_Event_ActionID) == 0x000080, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_Event_ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_Event_SubID) == 0x000084, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_Event_SubID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x000088, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_SwitchEnum_CmpSuccess) == 0x00009C, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x0000A0, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x0000A8, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetStateID_ReturnValue) == 0x0000B0, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetStateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_SwitchEnum2_CmpSuccess) == 0x0000B1, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_SwitchEnum3_CmpSuccess) == 0x0000B2, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_Event_SendActor) == 0x0000B8, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_Event_AnimSeqName) == 0x0000C0, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_Event_EventID) == 0x0000C8, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_Event_Param) == 0x0000CC, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x0000D0, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000E4, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0000E5, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0000E8, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F0, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x0000F8, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue) == 0x000100, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x000108, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_Event_StateID) == 0x000110, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, K2Node_SwitchEnum4_CmpSuccess) == 0x000111, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x000114, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Mashmallow::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Mashmallow.BP_TresPlayerStateEventCamera_Mashmallow_C.ReceivePlayerDtorState
// 0xC000000 (0xC000000 - 0x0000)
struct alignas(0xC000000) BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerDtorState) == 0xC000000, "Wrong alignment on BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerDtorState) == 0xC000000, "Wrong size on BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Mashmallow.BP_TresPlayerStateEventCamera_Mashmallow_C.ReceiveAnimNotifyStartBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ReceiveAnimNotifyStartBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Mashmallow.BP_TresPlayerStateEventCamera_Mashmallow_C.ReceivePlayerSpecificAction
// 0x800000 (0x800000 - 0x0000)
struct alignas(0x800000) BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerSpecificAction final
{
public:
	ETresPlayerSpecificActionID                   ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerSpecificAction) == 0x800000, "Wrong alignment on BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerSpecificAction) == 0x800000, "Wrong size on BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerSpecificAction::ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerSpecificAction, SubID) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_Mashmallow_C_ReceivePlayerSpecificAction::SubID' has a wrong offset!");

}

