#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_AthleticFlow

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_AthleticFlow.BP_TresPlayerStateEventCamera_AthleticFlow_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow
// 0x00D0 (0x00D0 - 0x0000)
struct BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubID;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0014(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0028(0x0014)(NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0070(0x112E9D50)(IsPlainOldData, NoDestructor)
	ESpawnActorCollisionHandlingMethod            K2Node_Select_Default;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverlapTresCameraActor_ReturnValue;     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow) == 0x000008, "Wrong alignment on BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow");
static_assert(sizeof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow) == 0x0000D0, "Wrong size on BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, K2Node_Event_ActionID) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::K2Node_Event_ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, K2Node_Event_SubID) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::K2Node_Event_SubID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x00000E, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x00000F, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_EqualEqual_IntInt_ReturnValue4) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_EqualEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000014, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000028, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, Temp_bool_Variable) == 0x000054, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue) == 0x000058, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000060, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_GetTransform_ReturnValue) == 0x000070, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, K2Node_Select_Default) == 0x0000A0, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A8, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B0, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_IsOverlapTresCameraActor_ReturnValue) == 0x0000B8, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_IsOverlapTresCameraActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, CallFunc_SpawnSound2D_ReturnValue) == 0x0000C0, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, K2Node_Event_StateID) == 0x0000C8, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow, K2Node_SwitchEnum2_CmpSuccess) == 0x0000C9, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_AthleticFlow::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_AthleticFlow.BP_TresPlayerStateEventCamera_AthleticFlow_C.ReceivePlayerDtorState
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerDtorState) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerDtorState) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_AthleticFlow.BP_TresPlayerStateEventCamera_AthleticFlow_C.ReceivePlayerSpecificAction
// 0x0008 (0x0008 - 0x0000)
struct BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerSpecificAction final
{
public:
	ETresPlayerSpecificActionID                   ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerSpecificAction) == 0x000004, "Wrong alignment on BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerSpecificAction) == 0x000008, "Wrong size on BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerSpecificAction::ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerSpecificAction, SubID) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_AthleticFlow_C_ReceivePlayerSpecificAction::SubID' has a wrong offset!");

}

