#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_Bazooka

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TresPlayerStateEventCamera_Bazooka.BP_TresPlayerStateEventCamera_Bazooka_C
// 0x6ED6 (0x6F26 - 0x0050)
class UBP_TresPlayerStateEventCamera_Bazooka_C final : public UTresPlayerStateEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0050(0x6F26)(Transient, DuplicateTransient)
	class UCameraAnim*                            Waza_name;                                         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        bazooka_cam_anim;                                  // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraRotTarget*                   Cam_Rot;                                           // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka(int32 EntryPoint);
	void ReceivePlayerCtorState(ETresStateID StateID);
	void ReceiveAnimNotifyStartBpEvent(class ATresCharPawnBase* SendActor, class FName AnimSeqName, ETresAnimNotifyBpEventID EventID, int32 Param);
	void ReceivePlayerDtorState(ETresStateID StateID);
	void ReceivePlayerBeginCommandAction(ETresCommandKind CommandKind);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TresPlayerStateEventCamera_Bazooka_C">();
	}
	static class UBP_TresPlayerStateEventCamera_Bazooka_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TresPlayerStateEventCamera_Bazooka_C>();
	}
};
static_assert(alignof(UBP_TresPlayerStateEventCamera_Bazooka_C) == 0x006F26, "Wrong alignment on UBP_TresPlayerStateEventCamera_Bazooka_C");
static_assert(sizeof(UBP_TresPlayerStateEventCamera_Bazooka_C) == 0x006F26, "Wrong size on UBP_TresPlayerStateEventCamera_Bazooka_C");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Bazooka_C, UberGraphFrame) == 0x000050, "Member 'UBP_TresPlayerStateEventCamera_Bazooka_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Bazooka_C, Waza_name) == 0x000058, "Member 'UBP_TresPlayerStateEventCamera_Bazooka_C::Waza_name' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Bazooka_C, bazooka_cam_anim) == 0x000060, "Member 'UBP_TresPlayerStateEventCamera_Bazooka_C::bazooka_cam_anim' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Bazooka_C, Cam_Rot) == 0x000068, "Member 'UBP_TresPlayerStateEventCamera_Bazooka_C::Cam_Rot' has a wrong offset!");

}

