#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_shooting_ride

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_shooting_ride.BP_TresPlayerStateEventCamera_shooting_ride_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride
// 0x112F5920 (0x112F5920 - 0x0000)
struct BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0004(0x0014)(NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0020(0x0014)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x00D0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue2;           // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable3;                             // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0130(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit;         // 0x0140(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue;    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x01CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D8[0x8];                                      // 0x01D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x01E0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue3;           // 0x0210(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit2;        // 0x0228(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue2;   // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x02C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue4;                // 0x02D0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x0300(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue4;           // 0x030C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit3;        // 0x0318(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue3;   // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x03A4(0x0014)(NoDestructor)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubID;                                // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      CallFunc_GetSpecificActionAccompanyPawn_ReturnValue; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  CallFunc_GetStateID_ReturnValue;                   // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor2;                           // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName2;                         // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID2;                             // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param2;                               // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresAccompanyPawnBase*                 K2Node_DynamicCast_AsTres_Accompany_Pawn_Base;     // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x2];                                      // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetSafetyPos_ReturnValue;              // 0x0404(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7;  // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8;  // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x0430(0x0014)(NoDestructor)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresAccompanyPawnBase*                 K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2;    // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BP_GetSafetyPos_ReturnValue2;             // 0x0470(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47D[0x3];                                      // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9;  // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable4;                             // 0x0498(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit4;        // 0x04A8(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue4;   // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532[0x2];                                      // 0x0532(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x0534(0x0014)(NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride) == 0x112F5920, "Wrong alignment on BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride");
static_assert(sizeof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride) == 0x112F5920, "Wrong size on BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000020, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000038, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, Temp_object_Variable) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_TransformLocation_ReturnValue) == 0x00009C, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x0000A8, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, Temp_object_Variable2) == 0x0000B0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000C0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetTransform_ReturnValue2) == 0x0000D0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_Add_VectorVector_ReturnValue2) == 0x000100, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_TransformLocation_ReturnValue2) == 0x00010C, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_TransformLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x000118, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, Temp_object_Variable3) == 0x000120, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000130, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_TresLineTraceByChannel_OutHit) == 0x000140, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_TresLineTraceByChannel_OutHit' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_TresLineTraceByChannel_ReturnValue) == 0x0001C8, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_TresLineTraceByChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_Add_VectorVector_ReturnValue3) == 0x0001CC, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetTransform_ReturnValue3) == 0x0001E0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_TransformLocation_ReturnValue3) == 0x000210, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_TransformLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000220, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_TresLineTraceByChannel_OutHit2) == 0x000228, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_TresLineTraceByChannel_OutHit2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_TresLineTraceByChannel_ReturnValue2) == 0x0002B0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_TresLineTraceByChannel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x0002B8, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0002C0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetTransform_ReturnValue4) == 0x0002D0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetTransform_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_Add_VectorVector_ReturnValue4) == 0x000300, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_Add_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_TransformLocation_ReturnValue4) == 0x00030C, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_TransformLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_TresLineTraceByChannel_OutHit3) == 0x000318, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_TresLineTraceByChannel_OutHit3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_TresLineTraceByChannel_ReturnValue3) == 0x0003A0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_TresLineTraceByChannel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x0003A4, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_ActionID) == 0x0003B8, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_SubID) == 0x0003BC, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_SubID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x0003C0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_SwitchEnum_CmpSuccess) == 0x0003C8, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetSpecificActionAccompanyPawn_ReturnValue) == 0x0003D0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetSpecificActionAccompanyPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetStateID_ReturnValue) == 0x0003D8, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetStateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_SwitchEnum2_CmpSuccess) == 0x0003D9, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_SendActor2) == 0x0003E0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_SendActor2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_AnimSeqName2) == 0x0003E8, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_AnimSeqName2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_EventID2) == 0x0003F0, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_EventID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_Param2) == 0x0003F4, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_Param2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_DynamicCast_AsTres_Accompany_Pawn_Base) == 0x0003F8, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_DynamicCast_AsTres_Accompany_Pawn_Base' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_DynamicCast_bSuccess) == 0x000400, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000401, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_GetSafetyPos_ReturnValue) == 0x000404, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_GetSafetyPos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000410, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7) == 0x000418, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000420, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8) == 0x000428, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x000430, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2) == 0x000448, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_DynamicCast_bSuccess2) == 0x000450, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_SendActor) == 0x000458, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_AnimSeqName) == 0x000460, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_EventID) == 0x000468, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_Param) == 0x00046C, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_GetSafetyPos_ReturnValue2) == 0x000470, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_GetSafetyPos_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x00047C, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9) == 0x000480, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000488, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x000490, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, Temp_object_Variable4) == 0x000498, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_TresLineTraceByChannel_OutHit4) == 0x0004A8, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_TresLineTraceByChannel_OutHit4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_BP_TresLineTraceByChannel_ReturnValue4) == 0x000530, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_BP_TresLineTraceByChannel_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_Event_StateID) == 0x000531, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x000534, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride, K2Node_SwitchEnum3_CmpSuccess) == 0x000548, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_shooting_ride::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_shooting_ride.BP_TresPlayerStateEventCamera_shooting_ride_C.ReceivePlayerDtorState
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerDtorState) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerDtorState) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_shooting_ride.BP_TresPlayerStateEventCamera_shooting_ride_C.ReceiveAnimNotifyEndBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyEndBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_shooting_ride.BP_TresPlayerStateEventCamera_shooting_ride_C.ReceiveAnimNotifyStartBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceiveAnimNotifyStartBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_shooting_ride.BP_TresPlayerStateEventCamera_shooting_ride_C.ReceivePlayerSpecificAction
// 0x5B8ACF40 (0x5B8ACF40 - 0x0000)
struct alignas(0x5B8ACF40) BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerSpecificAction final
{
public:
	ETresPlayerSpecificActionID                   ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerSpecificAction) == 0x5B8ACF40, "Wrong alignment on BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerSpecificAction) == 0x5B8ACF40, "Wrong size on BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_shooting_ride_C_ReceivePlayerSpecificAction::ActionID' has a wrong offset!");
