#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_WaterRide

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_WaterRide.BP_TresPlayerStateEventCamera_WaterRide_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide
// 0x112E9AF0 (0x112E9AF0 - 0x0000)
struct BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue2;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue3;         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue4;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x000C(0x0014)(NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue5;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue6;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue7;         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue8;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue3;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0038(0x0014)(NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue2; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x0060(0x0014)(NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue9;         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue10;        // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue4;             // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue11;        // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue12;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue5;             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue13;        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue14;        // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue6;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue2;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue3; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x00A8(0x0014)(NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue4; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x00D0(0x0014)(NoDestructor)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue5; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerControllerBase*              CallFunc_GetLocalTresPlayerControllerBase_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x0100(0x0014)(NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraManager*                     CallFunc_GetTresCameraManager_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraBase*                        CallFunc_GetActiveCamera_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraNormalLoc*                   K2Node_DynamicCast_AsTres_Camera_Normal_Loc;       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BP_GetCurrentDistance_ReturnValue;        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraNormal*                      K2Node_DynamicCast_AsTres_Camera_Normal;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraRailSlide*                   K2Node_DynamicCast_AsTres_Camera_Rail_Slide;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraPath*                        K2Node_DynamicCast_AsTres_Camera_Path;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraRotTarget*                   K2Node_DynamicCast_AsTres_Camera_Rot_Target;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue7; // 0x0190(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue8; // 0x01A4(0x0014)(NoDestructor)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubID;                                // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8;  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      CallFunc_GetSpecificActionAccompanyPawn_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  CallFunc_GetStateID_ReturnValue;                   // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9;  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue9; // 0x0210(0x0014)(NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresAttractionPawnWaterRide*           K2Node_DynamicCast_AsTres_Attraction_Pawn_Water_Ride; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue3;      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresAttractionPawnWaterRide*           K2Node_DynamicCast_AsTres_Attraction_Pawn_Water_Ride2; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSlideRotation_ReturnValue;             // 0x024C(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSlideLocation_ReturnValue;             // 0x0258(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0264(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresAttractionPawnWaterRide*           K2Node_DynamicCast_AsTres_Attraction_Pawn_Water_Ride3; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue10; // 0x027C(0x0014)(NoDestructor)
	struct FRotator                               CallFunc_GetSlideRotation_ReturnValue2;            // 0x0290(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSlideLocation_ReturnValue2;            // 0x029C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSlideRotation_ReturnValue3;            // 0x02A8(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue2;              // 0x02B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll2;                       // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch2;                      // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw2;                        // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll3;                       // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch3;                      // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw3;                        // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll4;                       // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch4;                      // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw4;                        // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02F8(0x112E9AF0)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x0308(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue3;                 // 0x0314(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue4;                 // 0x0320(0x112E9AF0)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332[0x2];                                      // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll5;                       // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch5;                      // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw5;                        // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll6;                       // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch6;                      // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw6;                        // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0354(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromYZ_ReturnValue;                // 0x0360(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x036C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0380(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromYZ_ReturnValue2;               // 0x03B0(0x112E9AF0)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x03D0(0x112E9D50)(IsPlainOldData, NoDestructor)
	class ATresNote*                              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNote*                              CallFunc_FinishSpawningActor_ReturnValue2;         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue7;             // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B[0x1];                                      // 0x041B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue11; // 0x041C(0x0014)(NoDestructor)
	class ATresAttractionPawnWaterRide*           K2Node_DynamicCast_AsTres_Attraction_Pawn_Water_Ride4; // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFinishLastDisRate_ReturnValue;         // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A[0x2];                                      // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue3;              // 0x0450(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x045C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromYZ_ReturnValue3;               // 0x0468(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x0480(0x112E9D50)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3; // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNote*                              CallFunc_FinishSpawningActor_ReturnValue3;         // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue12; // 0x04C0(0x0014)(NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x04D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue4;              // 0x04E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromYZ_ReturnValue4;               // 0x04EC(0x112E9AF0)(IsPlainOldData, NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10; // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue4;               // 0x0500(0x112E9D50)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4; // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNote*                              CallFunc_FinishSpawningActor_ReturnValue4;         // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue4;      // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue6; // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue13; // 0x0560(0x0014)(NoDestructor)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue2;                // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll7;                       // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch7;                      // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw7;                        // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue5;                 // 0x0590(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue6;                 // 0x059C(0x112E9AF0)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresAttractionPawnWaterRide*           K2Node_DynamicCast_AsTres_Attraction_Pawn_Water_Ride5; // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BA[0x2];                                      // 0x05BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFinishSlideDistance_ReturnValue;       // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue3;     // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue14; // 0x05C4(0x0014)(NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11; // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue7; // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12; // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable4;                // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue15; // 0x05F4(0x0014)(NoDestructor)
	class ATresAccompanyPawnBase*                 K2Node_DynamicCast_AsTres_Accompany_Pawn_Base;     // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x3];                                      // 0x0611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetSafetyPos_ReturnValue;              // 0x0614(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresAccompanyPawnBase*                 K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2;    // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetSafetyPos_ReturnValue2;             // 0x062C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresAttractionPawnWaterRide*           K2Node_DynamicCast_AsTres_Attraction_Pawn_Water_Ride6; // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFinishSlideBlockCollision_ReturnValue;  // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642[0x2];                                      // 0x0642(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue16; // 0x0644(0x0014)(NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable4;                      // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x3];                                      // 0x0659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue17; // 0x065C(0x0014)(NoDestructor)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide) == 0x112E9AF0, "Wrong alignment on BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide");
static_assert(sizeof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide) == 0x112E9AF0, "Wrong size on BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue2) == 0x000005, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000006, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue3) == 0x000007, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue4) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x00000C, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue5) == 0x000020, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue6) == 0x000021, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x000022, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue7) == 0x000023, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue8) == 0x000024, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_IntInt_ReturnValue3) == 0x000025, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue) == 0x000028, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000030, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000038, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue2) == 0x000050, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000058, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x000060, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue9) == 0x000074, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue10) == 0x000075, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_IntInt_ReturnValue4) == 0x000076, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue11) == 0x000077, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue12) == 0x000078, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_IntInt_ReturnValue5) == 0x000079, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue13) == 0x00007A, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_FloatFloat_ReturnValue14) == 0x00007B, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_FloatFloat_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_NotEqual_IntInt_ReturnValue6) == 0x00007C, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_NotEqual_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000080, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x000088, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetLocalPlayerController_ReturnValue2) == 0x000090, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetLocalPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue3) == 0x000098, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0000A0, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x0000A8, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue4) == 0x0000C0, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x0000C8, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x0000D0, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue5) == 0x0000E8, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x0000F0, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetLocalTresPlayerControllerBase_ReturnValue) == 0x0000F8, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetLocalTresPlayerControllerBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x000100, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetTresCameraManager_ReturnValue) == 0x000118, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetTresCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_GetActiveCamera_ReturnValue) == 0x000120, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_GetActiveCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, Temp_bool_IsClosed_Variable) == 0x000128, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, K2Node_DynamicCast_AsTres_Camera_Normal_Loc) == 0x000130, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::K2Node_DynamicCast_AsTres_Camera_Normal_Loc' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, CallFunc_BP_GetCurrentDistance_ReturnValue) == 0x00013C, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::CallFunc_BP_GetCurrentDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, K2Node_DynamicCast_AsTres_Camera_Normal) == 0x000140, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::K2Node_DynamicCast_AsTres_Camera_Normal' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide, K2Node_DynamicCast_bSuccess2) == 0x000148, "Member 'BP_TresPlayerStateEventCamera_WaterRide_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_WaterRide::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
