#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_goofy_shoot

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_goofy_shoot.BP_TresPlayerStateEventCamera_goofy_shoot_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0004(0x0014)(NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0020(0x0014)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x0048(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x005C(0x0014)(NoDestructor)
	class ATresPlayerControllerLowerBase*         CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraManager*                     CallFunc_GetTresCameraManager_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraNormal*                      CallFunc_GetTresCameraNormal_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue3;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x00A8(0x0014)(NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x00C0(0x0014)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerControllerBase*              CallFunc_GetLocalTresPlayerControllerBase_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue2;    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerControllerBase*              CallFunc_GetLocalTresPlayerControllerBase_ReturnValue2; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraTargetOTS*                   CallFunc_BP_SpawnTresCameraTargetOTS_ReturnValue;  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TresIsCinematicMode_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue7; // 0x0124(0x0014)(NoDestructor)
	bool                                          CallFunc_TresIsCinematicMode_ReturnValue2;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue;  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue8; // 0x0150(0x0014)(NoDestructor)
	ETresStateID                                  K2Node_Event_StateID2;                             // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATresCharPawnBase*                      K2Node_Event_SendActor2;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue9; // 0x0194(0x0014)(NoDestructor)
	ETresActorSpecificActionID                    K2Node_Event_ActionID2;                            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_SendActor;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubID2;                               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BE[0x2];                                      // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerControllerBase*              CallFunc_GetLocalTresPlayerControllerBase_ReturnValue3; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7;  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubID;                                // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      CallFunc_GetSpecificActionAccompanyPawn_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETresStateID                                  CallFunc_GetStateID_ReturnValue;                   // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8;  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3[0x1];                                      // 0x01F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue10; // 0x01F4(0x0014)(NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot");
static_assert(sizeof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000020, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000038, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x000048, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x00005C, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue) == 0x000070, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerControllerLowerBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetTresCameraManager_ReturnValue) == 0x000078, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetTresCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x000080, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetTresCameraNormal_ReturnValue) == 0x000088, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetTresCameraNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_BP_SpawnTresCameraAnim_ReturnValue3) == 0x000098, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_BP_SpawnTresCameraAnim_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x0000A0, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x0000A8, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, Temp_int_Variable) == 0x0000BC, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x0000C0, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_Less_IntInt_ReturnValue2) == 0x0000D5, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, Temp_int_Variable2) == 0x0000DC, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_Less_IntInt_ReturnValue3) == 0x0000E0, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_Less_IntInt_ReturnValue4) == 0x0000E1, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_Add_IntInt_ReturnValue2) == 0x0000E4, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000E8, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerControllerBase_ReturnValue) == 0x0000F0, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerControllerBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalPlayerController_ReturnValue2) == 0x0000F8, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerControllerBase_ReturnValue2) == 0x000100, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerControllerBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, Temp_bool_Has_Been_Initd_Variable) == 0x000108, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_BP_SpawnTresCameraTargetOTS_ReturnValue) == 0x000110, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_BP_SpawnTresCameraTargetOTS_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x000118, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_TresIsCinematicMode_ReturnValue) == 0x000120, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_TresIsCinematicMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue7) == 0x000124, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_TresIsCinematicMode_ReturnValue2) == 0x000138, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_TresIsCinematicMode_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, Temp_bool_IsClosed_Variable) == 0x000139, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue) == 0x000140, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x000148, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue8) == 0x000150, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_StateID2) == 0x000164, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_StateID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_SwitchEnum_CmpSuccess) == 0x000165, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_StateID) == 0x000166, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_SwitchEnum2_CmpSuccess) == 0x000167, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_SendActor2) == 0x000168, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_SendActor2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_AnimSeqName) == 0x000170, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_EventID) == 0x000178, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_Param) == 0x00017C, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000180, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000181, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000182, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x000183, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x000184, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x000188, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000190, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue9) == 0x000194, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_ActionID2) == 0x0001A8, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_ActionID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_SendActor) == 0x0001B0, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_SubID2) == 0x0001B8, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_SubID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_SwitchEnum3_CmpSuccess) == 0x0001BC, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, Temp_bool_Has_Been_Initd_Variable2) == 0x0001BD, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerControllerBase_ReturnValue3) == 0x0001C0, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerControllerBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7) == 0x0001C8, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_ActionID) == 0x0001D0, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_Event_SubID) == 0x0001D4, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_Event_SubID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetSpecificActionAccompanyPawn_ReturnValue) == 0x0001D8, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetSpecificActionAccompanyPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_SwitchEnum4_CmpSuccess) == 0x0001E0, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetStateID_ReturnValue) == 0x0001E1, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetStateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, K2Node_SwitchEnum5_CmpSuccess) == 0x0001E2, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8) == 0x0001E8, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0001F0, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, Temp_bool_IsClosed_Variable2) == 0x0001F1, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0001F2, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_SetTresCameraTransitionParams_ReturnValue10) == 0x0001F4, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_SetTresCameraTransitionParams_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot, CallFunc_IsValidClass_ReturnValue) == 0x000208, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_goofy_shoot::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_goofy_shoot.BP_TresPlayerStateEventCamera_goofy_shoot_C.ReceivePlayerSpecificAction
// 0x800000 (0x800000 - 0x0000)
struct alignas(0x800000) BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerSpecificAction final
{
public:
	ETresPlayerSpecificActionID                   ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerSpecificAction) == 0x800000, "Wrong alignment on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerSpecificAction) == 0x800000, "Wrong size on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerSpecificAction::ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerSpecificAction, SubID) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerSpecificAction::SubID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_goofy_shoot.BP_TresPlayerStateEventCamera_goofy_shoot_C.ReceiveActorSpecificAction
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction final
{
public:
	ETresActorSpecificActionID                    ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SendActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubID;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction::ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction, SendActor) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction, SubID) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveActorSpecificAction::SubID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_goofy_shoot.BP_TresPlayerStateEventCamera_goofy_shoot_C.ReceiveAnimNotifyStartBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceiveAnimNotifyStartBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_goofy_shoot.BP_TresPlayerStateEventCamera_goofy_shoot_C.ReceivePlayerCtorState
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerCtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerCtorState) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerCtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerCtorState) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerCtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerCtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerCtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_goofy_shoot.BP_TresPlayerStateEventCamera_goofy_shoot_C.ReceivePlayerDtorState
// 0xC000000 (0xC000000 - 0x0000)
struct alignas(0xC000000) BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerDtorState) == 0xC000000, "Wrong alignment on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerDtorState) == 0xC000000, "Wrong size on BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_goofy_shoot_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

}

