#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEvent_motion_notify

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TresPlayerStateEvent_motion_notify.BP_TresPlayerStateEvent_motion_notify_C
// 0x6ED6 (0x6F26 - 0x0050)
class BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C final : public UTresPlayerStateEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0050(0x6F26)(Transient, DuplicateTransient)
	class ATresCharPawnBase*                      Tres_Char_Pawn_base;                               // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ON_teacup_finish;                                  // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Center;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraBase*                        Camera;                                            // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraRotTarget*                   Camera_RotTarget;                                  // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        Camera_anim;                                       // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VECTOR01;                                          // 0x0088(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VECTOR02;                                          // 0x0094(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VECTOR00;                                          // 0x00A0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ON_teacup_start;                                   // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name_0;                                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TresPlayerStateEvent_motion_notify(int32 EntryPoint);
	void Special_Railslide_Camera();
	void DiveFallAttack_camera();
	void ReceiveAnimNotifyStartBpEvent(class ATresCharPawnBase* SendActor, class FName AnimSeqName, ETresAnimNotifyBpEventID EventID, int32 Param);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass BP_TresPlayerStateEvent_motion_notify.BP_TresPlayerStateEvent_motion_notify_C", true, "BP_TresPlayerStateEvent_motion_notify_C">();
	}
	static class BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C>();
	}
};
static_assert(alignof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C) == 0x006F26, "Wrong alignment on BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C");
static_assert(sizeof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C) == 0x006F26, "Wrong size on BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, UberGraphFrame) == 0x000050, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, Tres_Char_Pawn_base) == 0x000058, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::Tres_Char_Pawn_base' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, ON_teacup_finish) == 0x000060, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::ON_teacup_finish' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, Center) == 0x000068, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::Center' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, Camera) == 0x000070, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::Camera' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, Camera_RotTarget) == 0x000078, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::Camera_RotTarget' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, Camera_anim) == 0x000080, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::Camera_anim' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, VECTOR01) == 0x000088, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::VECTOR01' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, VECTOR02) == 0x000094, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::VECTOR02' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, VECTOR00) == 0x0000A0, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::VECTOR00' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, Actor) == 0x0000B0, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::Actor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, ON_teacup_start) == 0x0000B8, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::ON_teacup_start' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C, Name_0) == 0x0000C0, "Member 'BP_TresPlayerStateEvent_motion_notify::UBP_TresPlayerStateEvent_motion_notify_C::Name_0' has a wrong offset!");

}

