#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_Bazooka

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_Bazooka.BP_TresPlayerStateEventCamera_Bazooka_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka
// 0x112F5920 (0x112F5920 - 0x0000)
struct BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0010(0x0014)(NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x112E9D50)(IsPlainOldData, NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x00B0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue2;           // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0108(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0xC];                                      // 0x0114(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x0120(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x0150(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue3;           // 0x015C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7;  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x0184(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue4;                // 0x0190(0x112E9D50)(IsPlainOldData, NoDestructor)
	class ATresCameraRotTarget*                   CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue2; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue4;           // 0x01C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8;  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue; // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x01E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue5;            // 0x01F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue5;                // 0x0200(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue5;           // 0x0230(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0240(0x0014)(NoDestructor)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0258(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue2; // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x026C(0x0014)(NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x0280(0x0010)(ZeroConstructor, ReferenceParm)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9;  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable3;                             // 0x0298(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x02A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0xC];                                      // 0x02B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue6;                // 0x02C0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue6;            // 0x02F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue6;           // 0x02FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x0310(0x0014)(NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue7;         // 0x0324(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue7;                // 0x0330(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue7;            // 0x0360(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue7;           // 0x036C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable4;                             // 0x0378(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit;         // 0x0388(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue;    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit2;        // 0x0418(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue2;   // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11; // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable5;                             // 0x04B0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue8;         // 0x04C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit3;        // 0x04D0(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue3;   // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue8;            // 0x055C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue8;                // 0x0570(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue8;           // 0x05A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit4;        // 0x05B0(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue4;   // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x063C(0x0014)(NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12; // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue9;         // 0x0658(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664[0xC];                                      // 0x0664(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue9;                // 0x0670(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue9;            // 0x06A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue9;           // 0x06AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresCommandKind                              K2Node_Event_CommandKind;                          // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit5;        // 0x06C0(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue5;   // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0749(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74A[0x6];                                      // 0x074A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable6;                             // 0x0750(0x0010)(ZeroConstructor, ReferenceParm)
	ETresStateID                                  K2Node_Event_StateID2;                             // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit6;        // 0x0768(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue6;   // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x07F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F2[0x2];                                      // 0x07F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x07F4(0x0014)(NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue13; // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_812[0x6];                                      // 0x0812(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x3];                                      // 0x0829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable7;                             // 0x0830(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_841[0x7];                                      // 0x0841(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit7;        // 0x0848(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue7;   // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalTresPlayerPawnBase_ReturnValue;    // 0x08D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D2[0x2];                                      // 0x08D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D9[0x7];                                      // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable8;                             // 0x08E8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit8;        // 0x08F8(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue8;   // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981[0x3];                                      // 0x0981(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue2;        // 0x0984(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_989[0x3];                                      // 0x0989(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue7; // 0x098C(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue8; // 0x09A0(0x0014)(NoDestructor)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x09B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x09B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x09B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x09B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue14; // 0x09B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue9; // 0x09C0(0x0014)(NoDestructor)
	ETresItemDefWeapon                            CallFunc_BP_GetEquipWeaponID_ReturnValue;          // 0x09D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x09D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D6[0x2];                                      // 0x09D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue15; // 0x09D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x09E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E1[0x7];                                      // 0x09E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue3;      // 0x09E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable9;                             // 0x09F0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit9;        // 0x0A00(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue9;   // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka) == 0x112F5920, "Wrong alignment on BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka) == 0x112F5920, "Wrong size on BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000028, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000030, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue) == 0x000038, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_Add_VectorVector_ReturnValue) == 0x00004C, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x000090, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_TransformLocation_ReturnValue) == 0x000098, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000A4, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetTransform_ReturnValue2) == 0x0000B0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_Add_VectorVector_ReturnValue2) == 0x0000E0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_TransformLocation_ReturnValue2) == 0x0000EC, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_TransformLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0000F8, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x000100, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000108, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetTransform_ReturnValue3) == 0x000120, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_Add_VectorVector_ReturnValue3) == 0x000150, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_TransformLocation_ReturnValue3) == 0x00015C, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_TransformLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x000168, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7) == 0x000170, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x000178, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_Add_VectorVector_ReturnValue4) == 0x000184, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_Add_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetTransform_ReturnValue4) == 0x000190, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetTransform_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue2) == 0x0001C0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_SpawnTresCameraRotTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_TransformLocation_ReturnValue4) == 0x0001C8, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_TransformLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_IsValid_ReturnValue) == 0x0001D4, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8) == 0x0001D8, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue) == 0x0001E0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x0001E4, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_Add_VectorVector_ReturnValue5) == 0x0001F0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_Add_VectorVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetTransform_ReturnValue5) == 0x000200, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetTransform_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_TransformLocation_ReturnValue5) == 0x000230, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_TransformLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_IsValid_ReturnValue2) == 0x00023C, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000240, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, Temp_object_Variable) == 0x000258, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue2) == 0x000268, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x00026C, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, Temp_object_Variable2) == 0x000280, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9) == 0x000290, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, Temp_object_Variable3) == 0x000298, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_K2_GetActorLocation_ReturnValue6) == 0x0002A8, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_K2_GetActorLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetTransform_ReturnValue6) == 0x0002C0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetTransform_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_Add_VectorVector_ReturnValue6) == 0x0002F0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_Add_VectorVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_TransformLocation_ReturnValue6) == 0x0002FC, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_TransformLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10) == 0x000308, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x000310, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_K2_GetActorLocation_ReturnValue7) == 0x000324, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_K2_GetActorLocation_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetTransform_ReturnValue7) == 0x000330, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetTransform_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_Add_VectorVector_ReturnValue7) == 0x000360, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_Add_VectorVector_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_TransformLocation_ReturnValue7) == 0x00036C, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_TransformLocation_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, Temp_object_Variable4) == 0x000378, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_OutHit) == 0x000388, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_OutHit' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_ReturnValue) == 0x000410, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_OutHit2) == 0x000418, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_OutHit2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_ReturnValue2) == 0x0004A0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11) == 0x0004A8, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, Temp_object_Variable5) == 0x0004B0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_K2_GetActorLocation_ReturnValue8) == 0x0004C0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_K2_GetActorLocation_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_OutHit3) == 0x0004D0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_OutHit3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_ReturnValue3) == 0x000558, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_Add_VectorVector_ReturnValue8) == 0x00055C, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_Add_VectorVector_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetTransform_ReturnValue8) == 0x000570, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetTransform_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_TransformLocation_ReturnValue8) == 0x0005A0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_TransformLocation_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_OutHit4) == 0x0005B0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_OutHit4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_ReturnValue4) == 0x000638, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x00063C, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12) == 0x000650, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_K2_GetActorLocation_ReturnValue9) == 0x000658, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_K2_GetActorLocation_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetTransform_ReturnValue9) == 0x000670, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetTransform_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_Add_VectorVector_ReturnValue9) == 0x0006A0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_Add_VectorVector_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_TransformLocation_ReturnValue9) == 0x0006AC, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_TransformLocation_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, K2Node_Event_CommandKind) == 0x0006B8, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::K2Node_Event_CommandKind' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_OutHit5) == 0x0006C0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_OutHit5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_ReturnValue5) == 0x000748, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, K2Node_SwitchEnum_CmpSuccess) == 0x000749, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, Temp_object_Variable6) == 0x000750, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, K2Node_Event_StateID2) == 0x000760, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::K2Node_Event_StateID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_OutHit6) == 0x000768, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_OutHit6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_ReturnValue6) == 0x0007F0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, K2Node_SwitchEnum2_CmpSuccess) == 0x0007F1, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x0007F4, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue13) == 0x000808, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000810, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_IsValid_ReturnValue3) == 0x000811, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, K2Node_Event_SendActor) == 0x000818, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, K2Node_Event_AnimSeqName) == 0x000820, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, K2Node_Event_EventID) == 0x000828, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, K2Node_Event_Param) == 0x00082C, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, Temp_object_Variable7) == 0x000830, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000840, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_OutHit7) == 0x000848, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_OutHit7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_BP_TresLineTraceByChannel_ReturnValue7) == 0x0008D0, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_BP_TresLineTraceByChannel_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_IsLocalTresPlayerPawnBase_ReturnValue) == 0x0008D1, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_IsLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0008D4, "Member 'BP_TresPlayerStateEventCamera_Bazooka_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Bazooka::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
