#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_With_ven

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_With_ven.BP_TresPlayerStateEventCamera_With_ven_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven
// 0x112E9AF0 (0x112E9AF0 - 0x0000)
struct BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0018(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x002C(0x0014)(NoDestructor)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x0050(0x0014)(NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue3;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x0070(0x0014)(NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x0090(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x00A4(0x0014)(NoDestructor)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      K2Node_Event_SendActor2;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName2;                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID2;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param2;                               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue7; // 0x00E4(0x0014)(NoDestructor)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubID;                                // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresNpcPawnBase*                       CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue;   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNpcPawnBase*                       CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue2;  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7;  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresNpcPawnBase*                       CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue3;  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8;  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      CallFunc_GetSpecificActionAccompanyPawn_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresFriendLinkPawnBlizzagaBoard*       K2Node_DynamicCast_AsTres_Friend_Link_Pawn_Blizzaga_Board; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_BP_GetRotationToBlizzagaBoardTarget_ReturnValue; // 0x018C(0x112E9AF0)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A7[0x1];                                      // 0x01A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraFix*                         CallFunc_BP_SpawnTresCameraFix_ReturnValue;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerControllerBase*              CallFunc_GetTresPlayerControllerBase_ReturnValue;  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven) == 0x112E9AF0, "Wrong alignment on BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven");
static_assert(sizeof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven) == 0x112E9AF0, "Wrong size on BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x00002C, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000048, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x000050, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BP_SpawnTresCameraAnim_ReturnValue3) == 0x000068, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BP_SpawnTresCameraAnim_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x000070, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x000088, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x000090, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x0000A4, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000B8, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_SendActor2) == 0x0000C0, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_SendActor2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_AnimSeqName2) == 0x0000C8, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_AnimSeqName2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_EventID2) == 0x0000D0, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_EventID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_Param2) == 0x0000D4, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_Param2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0000D8, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000E0, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E1, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0000E2, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_SetTresCameraTransitionParams_ReturnValue7) == 0x0000E4, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_SetTresCameraTransitionParams_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_StateID) == 0x0000F8, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F9, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000FA, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_ActionID) == 0x0000FB, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_SubID) == 0x0000FC, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_SubID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x000100, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_SwitchEnum_CmpSuccess) == 0x000108, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue) == 0x000110, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, Temp_bool_Has_Been_Initd_Variable) == 0x000118, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x000120, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue2) == 0x000128, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000130, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_SendActor) == 0x000138, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_AnimSeqName) == 0x000140, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_EventID) == 0x000148, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_Event_Param) == 0x00014C, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7) == 0x000150, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x000158, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue3) == 0x000160, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BP_GetFriendPawnByUniqueID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000168, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8) == 0x000170, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetSpecificActionAccompanyPawn_ReturnValue) == 0x000178, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetSpecificActionAccompanyPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_DynamicCast_AsTres_Friend_Link_Pawn_Blizzaga_Board) == 0x000180, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_DynamicCast_AsTres_Friend_Link_Pawn_Blizzaga_Board' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BP_GetRotationToBlizzagaBoardTarget_ReturnValue) == 0x00018C, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BP_GetRotationToBlizzagaBoardTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BreakRotator_Roll) == 0x000198, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BreakRotator_Pitch) == 0x00019C, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BreakRotator_Yaw) == 0x0001A0, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001A4, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_Less_FloatFloat_ReturnValue2) == 0x0001A5, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, Temp_bool_IsClosed_Variable) == 0x0001A6, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, Temp_int_Variable) == 0x0001A8, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_Less_IntInt_ReturnValue) == 0x0001AC, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_Less_IntInt_ReturnValue2) == 0x0001AD, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_Add_IntInt_ReturnValue) == 0x0001B0, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_BP_SpawnTresCameraFix_ReturnValue) == 0x0001B8, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_BP_SpawnTresCameraFix_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven, CallFunc_GetTresPlayerControllerBase_ReturnValue) == 0x0001C0, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_With_ven::CallFunc_GetTresPlayerControllerBase_ReturnValue' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_With_ven.BP_TresPlayerStateEventCamera_With_ven_C.ReceiveAnimNotifyEndBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyEndBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_With_ven.BP_TresPlayerStateEventCamera_With_ven_C.ReceivePlayerSpecificAction
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerSpecificAction final
{
public:
	ETresPlayerSpecificActionID                   ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerSpecificAction) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerSpecificAction) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerSpecificAction::ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerSpecificAction, SubID) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerSpecificAction::SubID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_With_ven.BP_TresPlayerStateEventCamera_With_ven_C.ReceivePlayerDtorState
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerDtorState) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerDtorState) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_With_ven.BP_TresPlayerStateEventCamera_With_ven_C.ReceiveAnimNotifyStartBpEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyStartBpEvent) == 0x000008, "Wrong alignment on BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyStartBpEvent) == 0x000018, "Wrong size on BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_With_ven_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
