#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_viking

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_viking.BP_TresPlayerStateEventCamera_viking_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking
// 0x112F5920 (0x112F5920 - 0x0000)
struct BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0004(0x0014)(NoDestructor)
	class ATresPlayerControllerBase*              CallFunc_GetLocalTresPlayerControllerBase_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0050(0x0014)(NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x0078(0x0014)(NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable3;                             // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable4;                             // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue2;         // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable5;                             // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable6;                             // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x00F0(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x0104(0x0014)(NoDestructor)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubID;                                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCharPawnBase*                      CallFunc_GetSpecificActionAccompanyPawn_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  CallFunc_GetStateID_ReturnValue;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0150(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0180(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x018C(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0198(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0xC];                                      // 0x01C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01D0(0x112E9D50)(IsPlainOldData, NoDestructor)
	class ATresAccompanyPawnBase*                 K2Node_DynamicCast_AsTres_Accompany_Pawn_Base;     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetSafetyPos_ReturnValue;              // 0x020C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitterCameraLensEffectBase*           CallFunc_StartLensEffect_ReturnValue;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x0220(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0250(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue2;           // 0x025C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue3;           // 0x0268(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue4;           // 0x0274(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue5;           // 0x0280(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0290(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit2;                  // 0x0320(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue2;             // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit3;                  // 0x03B0(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue3;             // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit4;                  // 0x0440(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue4;             // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x04D0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue6;           // 0x0500(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue7;           // 0x050C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue8;           // 0x0518(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit5;                  // 0x0530(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue5;             // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x05BC(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x05D0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit6;                  // 0x0600(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue6;             // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNote*                              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue2;         // 0x06A0(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x06AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x06B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x06C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraNormal*                      CallFunc_BP_SpawnTresCameraNormal_ReturnValue;     // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x06D8(0x112E9AF0)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x06F0(0x112E9D50)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresNote*                              CallFunc_FinishSpawningActor_ReturnValue2;         // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresAccompanyPawnBase*                 K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2;    // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_741[0x3];                                      // 0x0741(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetSafetyPos_ReturnValue2;             // 0x0744(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresAttractionPawnVikingShip*          K2Node_DynamicCast_AsTres_Attraction_Pawn_Viking_Ship; // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_761[0x3];                                      // 0x0761(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetSafetyPos_ReturnValue3;             // 0x0764(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue3;      // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x0780(0x0014)(NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking) == 0x112F5920, "Wrong alignment on BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking");
static_assert(sizeof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking) == 0x112F5920, "Wrong size on BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetLocalTresPlayerControllerBase_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetLocalTresPlayerControllerBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, Temp_object_Variable) == 0x000020, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, Temp_int_Variable) == 0x000030, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000038, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_Less_IntInt_ReturnValue2) == 0x000041, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000048, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000050, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, Temp_object_Variable2) == 0x000068, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x000078, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, Temp_object_Variable3) == 0x000090, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000A0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, Temp_object_Variable4) == 0x0000A8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0000B8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_NotEqual_FloatFloat_ReturnValue2) == 0x0000B9, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_NotEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000BA, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, Temp_object_Variable5) == 0x0000C0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, Temp_object_Variable6) == 0x0000D0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x0000E0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x0000E8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x0000F0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x000104, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_Event_StateID) == 0x000118, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_Event_ActionID) == 0x000119, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_Event_ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_Event_SubID) == 0x00011C, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_Event_SubID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_SwitchEnum_CmpSuccess) == 0x000120, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_SwitchEnum2_CmpSuccess) == 0x000121, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x000128, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetSpecificActionAccompanyPawn_ReturnValue) == 0x000130, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetSpecificActionAccompanyPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetStateID_ReturnValue) == 0x000138, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetStateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_SwitchEnum3_CmpSuccess) == 0x000139, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_RemoteEvent_ReturnValue) == 0x00013A, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_RemoteEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x000140, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetTransform_ReturnValue) == 0x000150, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BreakTransform_Location) == 0x000180, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BreakTransform_Rotation) == 0x00018C, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BreakTransform_Scale) == 0x000198, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BreakVector_X) == 0x0001A4, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BreakVector_Y) == 0x0001A8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BreakVector_Z) == 0x0001AC, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, Temp_bool_Has_Been_Initd_Variable) == 0x0001B0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001B4, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_MakeVector_ReturnValue) == 0x0001B8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_MakeTransform_ReturnValue) == 0x0001D0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_DynamicCast_AsTres_Accompany_Pawn_Base) == 0x000200, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_DynamicCast_AsTres_Accompany_Pawn_Base' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BP_GetSafetyPos_ReturnValue) == 0x00020C, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BP_GetSafetyPos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_StartLensEffect_ReturnValue) == 0x000218, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_StartLensEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetTransform_ReturnValue2) == 0x000220, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_TransformLocation_ReturnValue) == 0x000250, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_TransformLocation_ReturnValue2) == 0x00025C, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_TransformLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_TransformLocation_ReturnValue3) == 0x000268, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_TransformLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_TransformLocation_ReturnValue4) == 0x000274, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_TransformLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_TransformLocation_ReturnValue5) == 0x000280, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_TransformLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_OutHit) == 0x000290, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_ReturnValue) == 0x000318, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_OutHit2) == 0x000320, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_OutHit2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_ReturnValue2) == 0x0003A8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_OutHit3) == 0x0003B0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_OutHit3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_ReturnValue3) == 0x000438, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_OutHit4) == 0x000440, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_OutHit4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_ReturnValue4) == 0x0004C8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetTransform_ReturnValue3) == 0x0004D0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_TransformLocation_ReturnValue6) == 0x000500, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_TransformLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_TransformLocation_ReturnValue7) == 0x00050C, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_TransformLocation_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_TransformLocation_ReturnValue8) == 0x000518, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_TransformLocation_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x000528, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_OutHit5) == 0x000530, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_OutHit5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_ReturnValue5) == 0x0005B8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0005BC, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_MakeTransform_ReturnValue2) == 0x0005D0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_OutHit6) == 0x000600, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_OutHit6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_LineTraceSingle_ReturnValue6) == 0x000688, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_LineTraceSingle_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000690, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_FinishSpawningActor_ReturnValue) == 0x000698, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_K2_GetActorRotation_ReturnValue2) == 0x0006A0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_K2_GetActorRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0006AC, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x0006B8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_Add_VectorVector_ReturnValue) == 0x0006C4, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BP_SpawnTresCameraNormal_ReturnValue) == 0x0006D0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BP_SpawnTresCameraNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0006D8, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_MakeTransform_ReturnValue3) == 0x0006F0, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_MakeTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2) == 0x000720, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_FinishSpawningActor_ReturnValue2) == 0x000728, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_FinishSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, Temp_bool_IsClosed_Variable) == 0x000730, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2) == 0x000738, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_DynamicCast_bSuccess2) == 0x000740, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BP_GetSafetyPos_ReturnValue2) == 0x000744, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BP_GetSafetyPos_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_IsValid_ReturnValue) == 0x000750, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_DynamicCast_AsTres_Attraction_Pawn_Viking_Ship) == 0x000758, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_DynamicCast_AsTres_Attraction_Pawn_Viking_Ship' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, K2Node_DynamicCast_bSuccess3) == 0x000760, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BP_GetSafetyPos_ReturnValue3) == 0x000764, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BP_GetSafetyPos_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_BP_SpawnTresCameraAnim_ReturnValue3) == 0x000770, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_BP_SpawnTresCameraAnim_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x000778, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x000780, "Member 'BP_TresPlayerStateEventCamera_viking_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_viking::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_viking.BP_TresPlayerStateEventCamera_viking_C.ReceivePlayerSpecificAction
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerSpecificAction final
{
public:
	ETresPlayerSpecificActionID                   ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerSpecificAction) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerSpecificAction) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerSpecificAction::ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerSpecificAction, SubID) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerSpecificAction::SubID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_viking.BP_TresPlayerStateEventCamera_viking_C.ReceivePlayerDtorState
// 0xC000000 (0xC000000 - 0x0000)
struct alignas(0xC000000) BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerDtorState) == 0xC000000, "Wrong alignment on BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerDtorState) == 0xC000000, "Wrong size on BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_viking_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

}

