#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_Teacup

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_Teacup.BP_TresPlayerStateEventCamera_Teacup_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup
// 0x112F5920 (0x112F5920 - 0x0000)
struct BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0018(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x002C(0x0014)(NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x0078(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x008C(0x0014)(NoDestructor)
	ETresPlayerSpecificActionID                   K2Node_Event_ActionID;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SubID;                                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      CallFunc_GetSpecificActionAccompanyPawn_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  CallFunc_GetStateID_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_SqEX_GetActorBoneLocation_ReturnValue; // 0x00E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemotePlayerStateEvent_ReturnValue;       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0110(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFinishTargetPos_ReturnValue;           // 0x01B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01D4(0x112E9AF0)(IsPlainOldData, NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01FC(0x112E9AF0)(IsPlainOldData, NoDestructor)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0210(0x112E9D50)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0250(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresNoteMovable*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x02E8(0x0014)(NoDestructor)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresAccompanyPawnBase*                 K2Node_DynamicCast_AsTres_Accompany_Pawn_Base;     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresAttractionPawnTeaCup*              K2Node_DynamicCast_AsTres_Attraction_Pawn_Tea_Cup; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetSafetyPos_ReturnValue;              // 0x031C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresAccompanyPawnBase*                 K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2;    // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup) == 0x112F5920, "Wrong alignment on BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup) == 0x112F5920, "Wrong size on BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x00002C, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, Temp_bool_Has_Been_Initd_Variable) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000048, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x000050, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_Add_VectorVector_ReturnValue) == 0x000064, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000070, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x000078, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x00008C, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_Event_ActionID) == 0x0000A0, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_Event_ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_Event_SubID) == 0x0000A4, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_Event_SubID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_SwitchEnum_CmpSuccess) == 0x0000A8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x0000B0, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_RemoteEvent_ReturnValue) == 0x0000B8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_RemoteEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetSpecificActionAccompanyPawn_ReturnValue) == 0x0000C0, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetSpecificActionAccompanyPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetStateID_ReturnValue) == 0x0000C8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetStateID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_SwitchEnum2_CmpSuccess) == 0x0000C9, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_Event_DeltaSeconds) == 0x0000CC, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x0000D0, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000D8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, Temp_bool_IsClosed_Variable) == 0x0000E4, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_K2_SqEX_GetActorBoneLocation_ReturnValue) == 0x0000E8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_K2_SqEX_GetActorBoneLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, Temp_int_Variable) == 0x0000F4, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x0000F8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_Less_IntInt_ReturnValue2) == 0x000101, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_Add_IntInt_ReturnValue) == 0x000104, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_RemotePlayerStateEvent_ReturnValue) == 0x000108, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_RemotePlayerStateEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000110, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000198, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_Event_SendActor) == 0x0001A0, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_Event_AnimSeqName) == 0x0001A8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_Event_EventID) == 0x0001B0, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_Event_Param) == 0x0001B4, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetFinishTargetPos_ReturnValue) == 0x0001B8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetFinishTargetPos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001C4, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001C8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001D4, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x0001E0, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_BreakRotator_Roll) == 0x0001E8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_BreakRotator_Pitch) == 0x0001EC, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_BreakRotator_Yaw) == 0x0001F0, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001F4, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001F8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_MakeRotator_ReturnValue) == 0x0001FC, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_Event_StateID) == 0x000208, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_MakeTransform_ReturnValue) == 0x000210, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_SwitchEnum3_CmpSuccess) == 0x000240, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000248, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000250, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0002D8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002E0, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x0002E8, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_DynamicCast_AsTres_Accompany_Pawn_Base) == 0x000300, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_DynamicCast_AsTres_Accompany_Pawn_Base' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_DynamicCast_AsTres_Attraction_Pawn_Tea_Cup) == 0x000310, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_DynamicCast_AsTres_Attraction_Pawn_Tea_Cup' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_DynamicCast_bSuccess2) == 0x000318, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, CallFunc_BP_GetSafetyPos_ReturnValue) == 0x00031C, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::CallFunc_BP_GetSafetyPos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2) == 0x000328, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_DynamicCast_AsTres_Accompany_Pawn_Base2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup, K2Node_DynamicCast_bSuccess3) == 0x000330, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_Teacup::K2Node_DynamicCast_bSuccess3' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Teacup.BP_TresPlayerStateEventCamera_Teacup_C.ReceivePlayerDtorState
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerDtorState) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerDtorState) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Teacup.BP_TresPlayerStateEventCamera_Teacup_C.ReceiveAnimNotifyStartBpEvent
// 0xC000000 (0xC000000 - 0x0000)
struct alignas(0xC000000) BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent) == 0xC000000, "Wrong alignment on BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent) == 0xC000000, "Wrong size on BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ReceiveAnimNotifyStartBpEvent::Param' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Teacup.BP_TresPlayerStateEventCamera_Teacup_C.ReceiveTick
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEventCamera_Teacup_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Teacup_C_ReceiveTick) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEventCamera_Teacup_C_ReceiveTick");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Teacup_C_ReceiveTick) == 0x8020800, "Wrong size on BP_TresPlayerStateEventCamera_Teacup_C_ReceiveTick");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_Teacup.BP_TresPlayerStateEventCamera_Teacup_C.ReceivePlayerSpecificAction
// 0x800000 (0x800000 - 0x0000)
struct alignas(0x800000) BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerSpecificAction final
{
public:
	ETresPlayerSpecificActionID                   ActionID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubID;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerSpecificAction) == 0x800000, "Wrong alignment on BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerSpecificAction");
static_assert(sizeof(BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerSpecificAction) == 0x800000, "Wrong size on BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerSpecificAction");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerSpecificAction, ActionID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerSpecificAction::ActionID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerSpecificAction, SubID) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_Teacup_C_ReceivePlayerSpecificAction::SubID' has a wrong offset!");

}

