#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DirectInput

#include "Basic.hpp"

#include "DirectInput_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DirectInput.DirectInputSettings
// 0x0040 (0x0090 - 0x0050)
class UDirectInputSettings final : public UDeveloperSettings
{
public:
	TArray<struct FDirectInputDeviceConfiguration> DeviceConfigurations;                              // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	float                                         InitialButtonRepeatDelay;                          // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ButtonRepeatDelay;                                 // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectInputIgnoreDeviceSettings       IgnoreDeviceSettings;                              // 0x0068(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectInputCalibration>        DeviceCalibrations;                                // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DirectInputSettings">();
	}
	static class UDirectInputSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDirectInputSettings>();
	}
};
static_assert(alignof(UDirectInputSettings) == 0x000008, "Wrong alignment on UDirectInputSettings");
static_assert(sizeof(UDirectInputSettings) == 0x000090, "Wrong size on UDirectInputSettings");
static_assert(offsetof(UDirectInputSettings, DeviceConfigurations) == 0x000050, "Member 'UDirectInputSettings::DeviceConfigurations' has a wrong offset!");
static_assert(offsetof(UDirectInputSettings, InitialButtonRepeatDelay) == 0x000060, "Member 'UDirectInputSettings::InitialButtonRepeatDelay' has a wrong offset!");
static_assert(offsetof(UDirectInputSettings, ButtonRepeatDelay) == 0x000064, "Member 'UDirectInputSettings::ButtonRepeatDelay' has a wrong offset!");
static_assert(offsetof(UDirectInputSettings, IgnoreDeviceSettings) == 0x000068, "Member 'UDirectInputSettings::IgnoreDeviceSettings' has a wrong offset!");
static_assert(offsetof(UDirectInputSettings, DeviceCalibrations) == 0x000080, "Member 'UDirectInputSettings::DeviceCalibrations' has a wrong offset!");

}

