#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Engine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InputCore_structs.hpp"
#include "PacketHandler_classes.hpp"


namespace SDK
{

// Class Engine.Actor
// 0x1EF72DC0 (0x1EF72E00 - 0x0040)
#pragma pack(push, 0x1)
class alignas(0x1EF72E00) AActor : public UObject
{
public:
	struct FActorTickFunction                     PrimaryActorTick;                                  // 0x0040(0x1EF72E00)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         CustomTimeDilation;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHidden : 1;                                       // 0x00A4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNetTemporary : 1;                                 // 0x00A4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNetStartup : 1;                                   // 0x00A4(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOnlyRelevantToOwner : 1;                          // 0x00A4(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysRelevant : 1;                               // 0x00A4(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReplicateMovement : 1;                            // 0x00A4(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTearOff : 1;                                      // 0x00A4(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bExchangedRoles : 1;                               // 0x00A4(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_A5_0 : 1;                                   // 0x00A5(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bNetLoadOnClient : 1;                              // 0x00A5(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNetUseOwnerRelevancy : 1;                         // 0x00A5(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bBlockInput : 1;                                   // 0x00A5(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_A5_4 : 1;                                   // 0x00A5(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bAllowTickBeforeBeginPlay : 1;                     // 0x00A5(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_A5_6 : 2;                                   // 0x00A5(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         BitPad_A6_0 : 1;                                   // 0x00A6(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bActorEnableCollision : 1;                         // 0x00A6(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_A6_2 : 1;                                   // 0x00A6(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bReplicates : 1;                                   // 0x00A6(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NetDriverName;                                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENetRole                                      RemoteRole;                                        // 0x00B0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x00B8(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRepMovement                           ReplicatedMovement;                                // 0x00C0(0x112E9AF0)(Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FRepAttachment                         AttachmentReplication;                             // 0x00F8(0x112E9AF0)(Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	ENetRole                                      Role;                                              // 0x0138(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x1];                                      // 0x0139(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EAutoReceiveInput                             AutoReceiveInput;                                  // 0x013A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InputPriority;                                     // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputComponent*                        InputComponent;                                    // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputConsumeOptions                          InputConsumeOption;                                // 0x0148(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NetCullDistanceSquared;                            // 0x014C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NetTag;                                            // 0x0150(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NetUpdateFrequency;                                // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinNetUpdateFrequency;                             // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetPriority;                                       // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAutoDestroyWhenFinished : 1;                      // 0x0168(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanBeDamaged : 1;                                 // 0x0168(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, Net, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bActorIsBeingDestroyed : 1;                        // 0x0168(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_168_3 : 1;                                  // 0x0168(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bCollideWhenPlacing : 1;                           // 0x0168(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFindCameraComponentWhenViewTarget : 1;            // 0x0168(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRelevantForNetworkReplays : 1;                    // 0x0168(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bGenerateOverlapEventsDuringLevelStreaming : 1;    // 0x0168(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanBeInCluster : 1;                               // 0x0169(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	ESpawnActorCollisionHandlingMethod            SpawnCollisionHandlingMethod;                      // 0x016A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Instigator;                                        // 0x0170(0x0008)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         Children;                                          // 0x0178(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class USceneComponent*                        RootComponent;                                     // 0x0188(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AMatineeActor*>                  ControllingMatineeActors;                          // 0x0190(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         InitialLifeSpan;                                   // 0x01A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A4[0xC];                                      // 0x01A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Layers;                                            // 0x01B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  ParentComponentActor;                              // 0x01C0(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UChildActorComponent>    ParentComponent;                                   // 0x01C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bAllowReceiveTickEventOnDedicatedServer : 1;       // 0x01D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_1D0_1 : 3;                                  // 0x01D0(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bActorSeamlessTraveled : 1;                        // 0x01D0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIgnoresOriginShifting : 1;                        // 0x01D0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAutoLODGeneration : 1;                      // 0x01D0(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Tags;                                              // 0x01D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint64                                        HiddenEditorViews;                                 // 0x01E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTakeAnyDamage;                                   // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTakePointDamage;                                 // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnActorBeginOverlap;                               // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnActorEndOverlap;                                 // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnBeginCursorOver;                                 // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnEndCursorOver;                                   // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnReleased;                                        // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInputTouchBegin;                                 // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInputTouchEnd;                                   // 0x0280(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInputTouchEnter;                                 // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInputTouchLeave;                                 // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnActorHit;                                        // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnDestroyed;                                       // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnEndPlay;                                         // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0xA0];                                     // 0x02E0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                BlueprintCreatedComponents;                        // 0x0380(0x0010)(ExportObject, ZeroConstructor, NonTransactional, ContainsInstancedReference, TextExportTransient, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>                InstanceComponents;                                // 0x0390(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A0[0x10];                                     // 0x03A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ESQEX_ObjectType                              M_ObjType;                                         // 0x03B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         M_bDisableObjTypeTimeDilation : 1;                 // 0x03B4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         M_bIgnoreDangle : 1;                               // 0x03B4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         M_bIgnoreWallRun : 1;                              // 0x03B4(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         M_bPermissionLockOn : 1;                           // 0x03B4(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         M_bDisableObjTypeCollision : 1;                    // 0x03B4(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ESQEX_AttackHitResponseType                   M_DefaultAttackHitResponse;                        // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructionFactor;                                 // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         M_CameraFadeAlpha;                                 // 0x03C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C4[0x1C];                                     // 0x03C4(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UActorComponent* AddComponent(class FName TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, const class UObject* ComponentTemplateContext);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void DisableInput(class APlayerController* PlayerController);
	void EnableInput(class APlayerController* PlayerController);
	void FlushNetDormancy();
	void ForceNetUpdate();
	float GetGameTimeSinceCreation();
	bool GetTickableWhenPaused();
	void K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_AttachRootComponentTo(class USceneComponent* InParent, class FName InSocketName, EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentToActor(class AActor* InParentActor, class FName InSocketName, EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachToActor(class AActor* ParentActor, class FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void K2_AttachToComponent(class USceneComponent* Parent, class FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void K2_DestroyActor();
	void K2_DestroyComponent(class UActorComponent* Component);
	void K2_DetachFromActor(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule);
	void K2_OnBecomeViewTarget(class APlayerController* Pc);
	void K2_OnEndViewTarget(class APlayerController* Pc);
	void K2_OnReset();
	bool K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	bool K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics);
	bool K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_SqEX_AttachActorToActor(class AActor* InParentActor, class FName InBoneSocketName, EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	struct FVector K2_SqEX_GetActorBoneLocation(class FName InBoneSocketName);
	float K2_SqEX_GetCameraFadeAlpha();
	void K2_SqEX_SetCameraFadeAlpha(float InAlpha);
	bool K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation);
	class UMaterialInstanceDynamic* MakeMIDForMaterial(class UMaterialInterface* Parent);
	void MakeNoise(float Loudness, class APawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, class FName Tag);
	void OnRep_AttachmentReplication();
	void OnRep_Instigator();
	void OnRep_Owner();
	void OnRep_ReplicatedMovement();
	void OnRep_ReplicateMovement();
	void OnRep_SQEX_ObjType();
	void OnSetActorHiddenInGame(bool bNewHidden);
	void ReceiveActorBeginCursorOver();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorOnClicked(const struct FKey& ButtonPressed);
	void ReceiveActorOnInputTouchBegin(const ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnd(const ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnter(const ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchLeave(const ETouchIndex FingerIndex);
	void ReceiveActorOnReleased(const struct FKey& ButtonReleased);
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceivePointDamage(float Damage, const class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
	void ReceiveRadialDamage(float DamageReceived, const class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveTick(float DeltaSeconds);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void SetActorEnableCollision(bool bNewActorEnableCollision);
	void SetActorHiddenInGame(bool bNewHidden);
	void SetActorRelativeScale3D(const struct FVector& NewRelativeScale);
	void SetActorScale3D(const struct FVector& NewScale3D);
	void SetActorTickEnabled(bool bEnabled);
	void SetActorTickInterval(float TickInterval);
	void SetLifeSpan(float InLifespan);
	void SetOwner(class AActor* NewOwner);
	void SetReplicateMovement(bool bInReplicateMovement);
	void SetReplicates(bool bInReplicates);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetTickGroup(ETickingGroup NewTickGroup);
	void SnapRootComponentTo(class AActor* InParentActor, class FName InSocketName);
	void SQEX_EnableCollisionFromBrueprint(bool Enable);
	void SQEX_RegisterTickFunctionFromBlueprint(bool Enable, bool DoComponents);
	void SQEX_RegisterTickFunctionFromBlueprintEx(bool Enable, bool DoComponents, const TArray<class UActorComponent*>& IgnoreComponents);
	void SqEX_ServerSetObjType(ESQEX_ObjectType InObjType);
	void SQEX_SetHiddenFromBrueprint(bool Hidden);
	void TearOff();
	void UserConstructionScript();

	bool ActorHasTag(class FName Tag) const;
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector* Origin, struct FVector* BoxExtent) const;
	bool GetActorEnableCollision() const;
	void GetActorEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation) const;
	struct FVector GetActorForwardVector() const;
	struct FVector GetActorRelativeScale3D() const;
	struct FVector GetActorRightVector() const;
	struct FVector GetActorScale3D() const;
	float GetActorTickInterval() const;
	float GetActorTimeDilation() const;
	struct FVector GetActorUpVector() const;
	void GetAllChildActors(TArray<class AActor*>* ChildActors, bool bIncludeDescendants) const;
	void GetAttachedActors(TArray<class AActor*>* OutActors) const;
	class AActor* GetAttachParentActor() const;
	class FName GetAttachParentSocketName() const;
	class UActorComponent* GetComponentByClass(TSubclassOf<class UActorComponent> ComponentClass) const;
	TArray<class UActorComponent*> GetComponentsByClass(TSubclassOf<class UActorComponent> ComponentClass) const;
	TArray<class UActorComponent*> GetComponentsByTag(TSubclassOf<class UActorComponent> ComponentClass, class FName Tag) const;
	float GetDistanceTo(const class AActor* OtherActor) const;
	float GetDotProductTo(const class AActor* OtherActor) const;
	float GetHorizontalDistanceTo(const class AActor* OtherActor) const;
	float GetHorizontalDotProductTo(const class AActor* OtherActor) const;
	float GetInputAxisKeyValue(const struct FKey& InputAxisKey) const;
	float GetInputAxisValue(const class FName InputAxisName) const;
	struct FVector GetInputVectorAxisValue(const struct FKey& InputAxisKey) const;
	class APawn* GetInstigator() const;
	class AController* GetInstigatorController() const;
	float GetLifeSpan() const;
	void GetOverlappingActors(TArray<class AActor*>* OverlappingActors, TSubclassOf<class AActor> ClassFilter) const;
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OverlappingComponents) const;
	class AActor* GetOwner() const;
	class AActor* GetParentActor() const;
	class UChildActorComponent* GetParentComponent() const;
	ENetRole GetRemoteRole() const;
	float GetSquaredDistanceTo(const class AActor* OtherActor) const;
	struct FVector GetTargetActorLocation() const;
	struct FTransform GetTransform() const;
	struct FVector GetVelocity() const;
	float GetVerticalDistanceTo(const class AActor* OtherActor) const;
	bool HasAuthority() const;
	bool IsActorBeingDestroyed() const;
	bool IsActorTickEnabled() const;
	bool IsChildActor() const;
	bool IsOverlappingActor(const class AActor* Other) const;
	struct FVector K2_GetActorLocation() const;
	struct FRotator K2_GetActorRotation() const;
	class USceneComponent* K2_GetRootComponent() const;
	struct FVector K2_SqEX_GetLockonCursorLookAtPos(int32 InIndex) const;
	struct FVector K2_SqEX_GetLockonCursorPos(int32 InIndex) const;
	int32 K2_SqEX_GetLockonCursorPosNum() const;
	ESQEX_ObjectType K2_SqEX_GetObjType() const;
	bool K2_SqEX_IsLockonCursorPosValid(int32 InIndex) const;
	bool SQEX_IsEnableCollisionFromBrueprint() const;
	bool SQEX_IsHidden() const;
	bool SQEX_IsHiddenFromBrueprint() const;
	bool SqEX_IsObjTypeCamera() const;
	bool SqEX_IsObjTypeEnemy() const;
	bool SqEX_IsObjTypeFriend() const;
	bool SqEX_IsObjTypeGimmick() const;
	bool SqEX_IsObjTypePlayer() const;
	bool SqEX_IsObjTypePrize() const;
	bool SqEX_IsObjTypeProjectile() const;
	bool SqEX_IsObjTypeVehicle() const;
	bool SQEX_IsRegisterTickFunctionFromBlueprint() const;
	bool WasRecentlyRendered(float Tolerance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Actor">();
	}
	static class AActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActor>();
	}
};
#pragma pack(pop)
static_assert(alignof(AActor) == 0x1EF72E00, "Wrong alignment on AActor");
static_assert(sizeof(AActor) == 0x1EF72E00, "Wrong size on AActor");
static_assert(offsetof(AActor, PrimaryActorTick) == 0x000040, "Member 'AActor::PrimaryActorTick' has a wrong offset!");
static_assert(offsetof(AActor, CustomTimeDilation) == 0x0000A0, "Member 'AActor::CustomTimeDilation' has a wrong offset!");
static_assert(offsetof(AActor, NetDriverName) == 0x0000A8, "Member 'AActor::NetDriverName' has a wrong offset!");
static_assert(offsetof(AActor, RemoteRole) == 0x0000B0, "Member 'AActor::RemoteRole' has a wrong offset!");
static_assert(offsetof(AActor, Owner) == 0x0000B8, "Member 'AActor::Owner' has a wrong offset!");
static_assert(offsetof(AActor, ReplicatedMovement) == 0x0000C0, "Member 'AActor::ReplicatedMovement' has a wrong offset!");
static_assert(offsetof(AActor, AttachmentReplication) == 0x0000F8, "Member 'AActor::AttachmentReplication' has a wrong offset!");
static_assert(offsetof(AActor, Role) == 0x000138, "Member 'AActor::Role' has a wrong offset!");
static_assert(offsetof(AActor, AutoReceiveInput) == 0x00013A, "Member 'AActor::AutoReceiveInput' has a wrong offset!");
static_assert(offsetof(AActor, InputPriority) == 0x00013C, "Member 'AActor::InputPriority' has a wrong offset!");
static_assert(offsetof(AActor, InputComponent) == 0x000140, "Member 'AActor::InputComponent' has a wrong offset!");
static_assert(offsetof(AActor, InputConsumeOption) == 0x000148, "Member 'AActor::InputConsumeOption' has a wrong offset!");
static_assert(offsetof(AActor, NetCullDistanceSquared) == 0x00014C, "Member 'AActor::NetCullDistanceSquared' has a wrong offset!");
static_assert(offsetof(AActor, NetTag) == 0x000150, "Member 'AActor::NetTag' has a wrong offset!");
static_assert(offsetof(AActor, NetUpdateFrequency) == 0x000158, "Member 'AActor::NetUpdateFrequency' has a wrong offset!");
static_assert(offsetof(AActor, MinNetUpdateFrequency) == 0x00015C, "Member 'AActor::MinNetUpdateFrequency' has a wrong offset!");
static_assert(offsetof(AActor, NetPriority) == 0x000160, "Member 'AActor::NetPriority' has a wrong offset!");
static_assert(offsetof(AActor, SpawnCollisionHandlingMethod) == 0x00016A, "Member 'AActor::SpawnCollisionHandlingMethod' has a wrong offset!");
static_assert(offsetof(AActor, Instigator) == 0x000170, "Member 'AActor::Instigator' has a wrong offset!");
static_assert(offsetof(AActor, Children) == 0x000178, "Member 'AActor::Children' has a wrong offset!");
static_assert(offsetof(AActor, RootComponent) == 0x000188, "Member 'AActor::RootComponent' has a wrong offset!");
static_assert(offsetof(AActor, ControllingMatineeActors) == 0x000190, "Member 'AActor::ControllingMatineeActors' has a wrong offset!");
static_assert(offsetof(AActor, InitialLifeSpan) == 0x0001A0, "Member 'AActor::InitialLifeSpan' has a wrong offset!");
static_assert(offsetof(AActor, Layers) == 0x0001B0, "Member 'AActor::Layers' has a wrong offset!");
static_assert(offsetof(AActor, ParentComponentActor) == 0x0001C0, "Member 'AActor::ParentComponentActor' has a wrong offset!");
static_assert(offsetof(AActor, ParentComponent) == 0x0001C8, "Member 'AActor::ParentComponent' has a wrong offset!");
static_assert(offsetof(AActor, Tags) == 0x0001D8, "Member 'AActor::Tags' has a wrong offset!");
static_assert(offsetof(AActor, HiddenEditorViews) == 0x0001E8, "Member 'AActor::HiddenEditorViews' has a wrong offset!");
static_assert(offsetof(AActor, OnTakeAnyDamage) == 0x0001F0, "Member 'AActor::OnTakeAnyDamage' has a wrong offset!");
static_assert(offsetof(AActor, OnTakePointDamage) == 0x000200, "Member 'AActor::OnTakePointDamage' has a wrong offset!");
static_assert(offsetof(AActor, OnActorBeginOverlap) == 0x000210, "Member 'AActor::OnActorBeginOverlap' has a wrong offset!");
static_assert(offsetof(AActor, OnActorEndOverlap) == 0x000220, "Member 'AActor::OnActorEndOverlap' has a wrong offset!");
static_assert(offsetof(AActor, OnBeginCursorOver) == 0x000230, "Member 'AActor::OnBeginCursorOver' has a wrong offset!");
static_assert(offsetof(AActor, OnEndCursorOver) == 0x000240, "Member 'AActor::OnEndCursorOver' has a wrong offset!");
static_assert(offsetof(AActor, OnClicked) == 0x000250, "Member 'AActor::OnClicked' has a wrong offset!");
static_assert(offsetof(AActor, OnReleased) == 0x000260, "Member 'AActor::OnReleased' has a wrong offset!");
static_assert(offsetof(AActor, OnInputTouchBegin) == 0x000270, "Member 'AActor::OnInputTouchBegin' has a wrong offset!");
static_assert(offsetof(AActor, OnInputTouchEnd) == 0x000280, "Member 'AActor::OnInputTouchEnd' has a wrong offset!");
static_assert(offsetof(AActor, OnInputTouchEnter) == 0x000290, "Member 'AActor::OnInputTouchEnter' has a wrong offset!");
static_assert(offsetof(AActor, OnInputTouchLeave) == 0x0002A0, "Member 'AActor::OnInputTouchLeave' has a wrong offset!");
static_assert(offsetof(AActor, OnActorHit) == 0x0002B0, "Member 'AActor::OnActorHit' has a wrong offset!");
static_assert(offsetof(AActor, OnDestroyed) == 0x0002C0, "Member 'AActor::OnDestroyed' has a wrong offset!");
static_assert(offsetof(AActor, OnEndPlay) == 0x0002D0, "Member 'AActor::OnEndPlay' has a wrong offset!");
static_assert(offsetof(AActor, BlueprintCreatedComponents) == 0x000380, "Member 'AActor::BlueprintCreatedComponents' has a wrong offset!");
static_assert(offsetof(AActor, InstanceComponents) == 0x000390, "Member 'AActor::InstanceComponents' has a wrong offset!");
static_assert(offsetof(AActor, M_ObjType) == 0x0003B0, "Member 'AActor::M_ObjType' has a wrong offset!");
static_assert(offsetof(AActor, M_DefaultAttackHitResponse) == 0x0003B8, "Member 'AActor::M_DefaultAttackHitResponse' has a wrong offset!");
static_assert(offsetof(AActor, ObstructionFactor) == 0x0003BC, "Member 'AActor::ObstructionFactor' has a wrong offset!");
static_assert(offsetof(AActor, M_CameraFadeAlpha) == 0x0003C0, "Member 'AActor::M_CameraFadeAlpha' has a wrong offset!");

// Class Engine.MaterialExpression
// 0x0038 (0x0078 - 0x0040)
class UMaterialExpression : public UObject
{
public:
	class UMaterial*                              Material;                                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialFunction*                      Function;                                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Desc;                                              // 0x0050(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 BorderColor;                                       // 0x0060(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRealtimePreview : 1;                              // 0x0064(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNeedToUpdatePreview : 1;                          // 0x0064(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsParameterExpression : 1;                        // 0x0064(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCommentBubbleVisible : 1;                         // 0x0064(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowOutputNameOnPin : 1;                          // 0x0064(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowMaskColorsOnPin : 1;                          // 0x0064(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHidePreviewWindow : 1;                            // 0x0064(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCollapsed : 1;                                    // 0x0064(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShaderInputData : 1;                              // 0x0065(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowInputs : 1;                                   // 0x0065(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowOutputs : 1;                                  // 0x0065(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FExpressionOutput>              Outputs;                                           // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpression">();
	}
	static class UMaterialExpression* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpression>();
	}
};
static_assert(alignof(UMaterialExpression) == 0x000008, "Wrong alignment on UMaterialExpression");
static_assert(sizeof(UMaterialExpression) == 0x000078, "Wrong size on UMaterialExpression");
static_assert(offsetof(UMaterialExpression, Material) == 0x000040, "Member 'UMaterialExpression::Material' has a wrong offset!");
static_assert(offsetof(UMaterialExpression, Function) == 0x000048, "Member 'UMaterialExpression::Function' has a wrong offset!");
static_assert(offsetof(UMaterialExpression, Desc) == 0x000050, "Member 'UMaterialExpression::Desc' has a wrong offset!");
static_assert(offsetof(UMaterialExpression, BorderColor) == 0x000060, "Member 'UMaterialExpression::BorderColor' has a wrong offset!");
static_assert(offsetof(UMaterialExpression, Outputs) == 0x000068, "Member 'UMaterialExpression::Outputs' has a wrong offset!");

// Class Engine.MaterialExpressionConstantBiasScale
// 0x112F26B8 (0x112F2730 - 0x0078)
class UMaterialExpressionConstantBiasScale final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x0078(0x112F2730)(NativeAccessSpecifierPublic)
	float                                         Bias;                                              // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionConstantBiasScale">();
	}
	static class UMaterialExpressionConstantBiasScale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionConstantBiasScale>();
	}
};
static_assert(alignof(UMaterialExpressionConstantBiasScale) == 0x112F2730, "Wrong alignment on UMaterialExpressionConstantBiasScale");
static_assert(sizeof(UMaterialExpressionConstantBiasScale) == 0x112F2730, "Wrong size on UMaterialExpressionConstantBiasScale");
static_assert(offsetof(UMaterialExpressionConstantBiasScale, Input) == 0x000078, "Member 'UMaterialExpressionConstantBiasScale::Input' has a wrong offset!");
static_assert(offsetof(UMaterialExpressionConstantBiasScale, Bias) == 0x0000B0, "Member 'UMaterialExpressionConstantBiasScale::Bias' has a wrong offset!");
static_assert(offsetof(UMaterialExpressionConstantBiasScale, Scale) == 0x0000B4, "Member 'UMaterialExpressionConstantBiasScale::Scale' has a wrong offset!");

// Class Engine.BodySetup
// 0x11389E20 (0x11389E60 - 0x0040)
#pragma pack(push, 0x1)
class alignas(0x11389E60) UBodySetup : public UObject
{
public:
	struct FKAggregateGeom                        AggGeom;                                           // 0x0040(0x0048)(Edit, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0088(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicsType                                  PhysicsType;                                       // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAlwaysFullAnimWeight : 1;                         // 0x0094(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bConsiderForBounds : 1;                            // 0x0094(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMeshCollideAll : 1;                               // 0x0094(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDoubleSidedGeometry : 1;                          // 0x0094(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bGenerateNonMirroredCollision : 1;                 // 0x0094(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSharedCookedData : 1;                             // 0x0094(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bGenerateMirroredCollision : 1;                    // 0x0094(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      PhysMaterial;                                      // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBodyCollisionResponse                        CollisionReponse;                                  // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionTraceFlag                           CollisionTraceFlag;                                // 0x00A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0xE];                                       // 0x00A2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBodyInstance                          DefaultInstance;                                   // 0x00B0(0x11389E60)(Edit, NativeAccessSpecifierPublic)
	struct FWalkableSlopeOverride                 WalkableSlopeOverride;                             // 0x02E0(0x11389E60)(Edit, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         BuildScale;                                        // 0x02F0(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BuildScale3D;                                      // 0x02F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0xB8];                                     // 0x0300(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BodySetup">();
	}
	static class UBodySetup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodySetup>();
	}
};
#pragma pack(pop)
static_assert(alignof(UBodySetup) == 0x11389E60, "Wrong alignment on UBodySetup");
static_assert(sizeof(UBodySetup) == 0x11389E60, "Wrong size on UBodySetup");
static_assert(offsetof(UBodySetup, AggGeom) == 0x000040, "Member 'UBodySetup::AggGeom' has a wrong offset!");
static_assert(offsetof(UBodySetup, BoneName) == 0x000088, "Member 'UBodySetup::BoneName' has a wrong offset!");
static_assert(offsetof(UBodySetup, PhysicsType) == 0x000090, "Member 'UBodySetup::PhysicsType' has a wrong offset!");
static_assert(offsetof(UBodySetup, PhysMaterial) == 0x000098, "Member 'UBodySetup::PhysMaterial' has a wrong offset!");
static_assert(offsetof(UBodySetup, CollisionReponse) == 0x0000A0, "Member 'UBodySetup::CollisionReponse' has a wrong offset!");
static_assert(offsetof(UBodySetup, CollisionTraceFlag) == 0x0000A1, "Member 'UBodySetup::CollisionTraceFlag' has a wrong offset!");
static_assert(offsetof(UBodySetup, DefaultInstance) == 0x0000B0, "Member 'UBodySetup::DefaultInstance' has a wrong offset!");
static_assert(offsetof(UBodySetup, WalkableSlopeOverride) == 0x0002E0, "Member 'UBodySetup::WalkableSlopeOverride' has a wrong offset!");
static_assert(offsetof(UBodySetup, BuildScale) == 0x0002F0, "Member 'UBodySetup::BuildScale' has a wrong offset!");
static_assert(offsetof(UBodySetup, BuildScale3D) == 0x0002F4, "Member 'UBodySetup::BuildScale3D' has a wrong offset!");

// Class Engine.MovementComponent
// 0x0000 (0xD38D - 0xD38D)
#pragma pack(push, 0x1)
class alignas(0xD38D) UMovementComponent : public UActorComponent
{
public:
	class USceneComponent*                        UpdatedComponent;                                  // 0x0200(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    UpdatedPrimitive;                                  // 0x0208(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_210[0x4];                                      // 0x0210(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Velocity;                                          // 0x0214(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bConstrainToPlane : 1;                             // 0x0220(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSnapToPlaneAtStart : 1;                           // 0x0220(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EPlaneConstraintAxisSetting                   PlaneConstraintAxisSetting;                        // 0x0224(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlaneConstraintNormal;                             // 0x0228(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PlaneConstraintOrigin;                             // 0x0234(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUpdateOnlyIfRendered : 1;                         // 0x0240(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoUpdateTickRegistration : 1;                   // 0x0240(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTickBeforeOwner : 1;                              // 0x0240(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoRegisterUpdatedComponent : 1;                 // 0x0240(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool K2_MoveUpdatedComponent(const struct FVector& Delta, const struct FRotator& NewRotation, struct FHitResult* OutHit, bool bSweep, bool bTeleport);
	void PhysicsVolumeChanged(class APhysicsVolume* NewVolume);
	void SetPlaneConstraintAxisSetting(EPlaneConstraintAxisSetting NewAxisSetting);
	void SetPlaneConstraintEnabled(bool bEnabled);
	void SetPlaneConstraintFromVectors(const struct FVector& Forward, const struct FVector& Up);
	void SetPlaneConstraintNormal(const struct FVector& PlaneNormal);
	void SetPlaneConstraintOrigin(const struct FVector& PlaneOrigin);
	void SetUpdatedComponent(class USceneComponent* NewUpdatedComponent);
	void SnapUpdatedComponentToPlane();
	void StopMovementImmediately();

	struct FVector ConstrainDirectionToPlane(const struct FVector& Direction) const;
	struct FVector ConstrainLocationToPlane(const struct FVector& Location) const;
	struct FVector ConstrainNormalToPlane(const struct FVector& Normal) const;
	float GetGravityZ() const;
	float GetMaxSpeed() const;
	class APhysicsVolume* GetPhysicsVolume() const;
	EPlaneConstraintAxisSetting GetPlaneConstraintAxisSetting() const;
	const struct FVector GetPlaneConstraintNormal() const;
	const struct FVector GetPlaneConstraintOrigin() const;
	bool IsExceedingMaxSpeed(float MaxSpeed) const;
	float K2_GetMaxSpeedModifier() const;
	float K2_GetModifiedMaxSpeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovementComponent">();
	}
	static class UMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovementComponent>();
	}
};
#pragma pack(pop)
static_assert(alignof(UMovementComponent) == 0x00D38D, "Wrong alignment on UMovementComponent");
static_assert(sizeof(UMovementComponent) == 0x00D38D, "Wrong size on UMovementComponent");
static_assert(offsetof(UMovementComponent, UpdatedComponent) == 0x000200, "Member 'UMovementComponent::UpdatedComponent' has a wrong offset!");
static_assert(offsetof(UMovementComponent, UpdatedPrimitive) == 0x000208, "Member 'UMovementComponent::UpdatedPrimitive' has a wrong offset!");
static_assert(offsetof(UMovementComponent, Velocity) == 0x000214, "Member 'UMovementComponent::Velocity' has a wrong offset!");
static_assert(offsetof(UMovementComponent, PlaneConstraintAxisSetting) == 0x000224, "Member 'UMovementComponent::PlaneConstraintAxisSetting' has a wrong offset!");
static_assert(offsetof(UMovementComponent, PlaneConstraintNormal) == 0x000228, "Member 'UMovementComponent::PlaneConstraintNormal' has a wrong offset!");
static_assert(offsetof(UMovementComponent, PlaneConstraintOrigin) == 0x000234, "Member 'UMovementComponent::PlaneConstraintOrigin' has a wrong offset!");

// Class Engine.NavMovementComponent
// 0x56D4 (0x12A61 - 0xD38D)
#pragma pack(push, 0x1)
class alignas(0x12A61) UNavMovementComponent : public UMovementComponent
{
public:
	struct FNavAgentProperties                    NavAgentProps;                                     // 0x0248(0x12A61)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FixedPathBrakingDistance;                          // 0x0268(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUpdateNavAgentWithOwnersCollision : 1;            // 0x026C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
