#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: G_dw_TreasureBox_l_Anim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass g_dw_TreasureBox_l_Anim.g_dw_TreasureBox_l_Anim_C
// 0x115C1070 (0x115C1550 - 0x04E0)
class UG_dw_TreasureBox_l_Anim_C final : public UTresAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x6F26)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_D644A741484C27A4598C27AF90115F2E; // 0x04E8(0x112BD)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_75DBC6834E884BB049D259B77DD6FFFC; // 0x0530(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_BD9FA73D4E55B0DC6F8131B81353DD85; // 0x0568(0x115C1550)()
	struct FTresAnimNode_SaveCachedPose           TresAnimGraphNode_SaveCachedPose_C8DC5BB04CDAFF450D22E5B9E01DEA96; // 0x05C8(0x112BD)()

public:
	void ExecuteUbergraph_g_dw_TreasureBox_l_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"g_dw_TreasureBox_l_Anim_C">();
	}
	static class UG_dw_TreasureBox_l_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UG_dw_TreasureBox_l_Anim_C>();
	}
};
static_assert(alignof(UG_dw_TreasureBox_l_Anim_C) == 0x115C1550, "Wrong alignment on UG_dw_TreasureBox_l_Anim_C");
static_assert(sizeof(UG_dw_TreasureBox_l_Anim_C) == 0x115C1550, "Wrong size on UG_dw_TreasureBox_l_Anim_C");
static_assert(offsetof(UG_dw_TreasureBox_l_Anim_C, UberGraphFrame) == 0x0004E0, "Member 'UG_dw_TreasureBox_l_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UG_dw_TreasureBox_l_Anim_C, AnimGraphNode_Root_D644A741484C27A4598C27AF90115F2E) == 0x0004E8, "Member 'UG_dw_TreasureBox_l_Anim_C::AnimGraphNode_Root_D644A741484C27A4598C27AF90115F2E' has a wrong offset!");
static_assert(offsetof(UG_dw_TreasureBox_l_Anim_C, TresAnimGraphNode_UseCachedPose_75DBC6834E884BB049D259B77DD6FFFC) == 0x000530, "Member 'UG_dw_TreasureBox_l_Anim_C::TresAnimGraphNode_UseCachedPose_75DBC6834E884BB049D259B77DD6FFFC' has a wrong offset!");
static_assert(offsetof(UG_dw_TreasureBox_l_Anim_C, AnimGraphNode_Slot_BD9FA73D4E55B0DC6F8131B81353DD85) == 0x000568, "Member 'UG_dw_TreasureBox_l_Anim_C::AnimGraphNode_Slot_BD9FA73D4E55B0DC6F8131B81353DD85' has a wrong offset!");
static_assert(offsetof(UG_dw_TreasureBox_l_Anim_C, TresAnimGraphNode_SaveCachedPose_C8DC5BB04CDAFF450D22E5B9E01DEA96) == 0x0005C8, "Member 'UG_dw_TreasureBox_l_Anim_C::TresAnimGraphNode_SaveCachedPose_C8DC5BB04CDAFF450D22E5B9E01DEA96' has a wrong offset!");

}

