#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: G_TresPrizeGimmickStaticBase

#include "Basic.hpp"

#include "TresGame_structs.hpp"


namespace SDK::Params
{

// Function g_TresPrizeGimmickStaticBase.g_TresPrizeGimmickStaticBase_C.ExecuteUbergraph_g_TresPrizeGimmickStaticBase
// 0x0078 (0x0078 - 0x0000)
struct G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_playAnimation;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQEX_CapsuleIndirectShadowComponent*   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPhysObjSkeletalMeshActor*          K2Node_DynamicCast_AsTres_Phys_Obj_Skeletal_Mesh_Actor; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPhysObjStaticMeshActor*            K2Node_DynamicCast_AsTres_Phys_Obj_Static_Mesh_Actor; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresGimmickActor*                      K2Node_DynamicCast_AsTres_Gimmick_Actor;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresGimmickInstanceManagerInstanceState      K2Node_Event_State;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresGimmickInstanceManagerInstanceState      K2Node_Event_OldState;                             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase) == 0x000008, "Wrong alignment on G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase");
static_assert(sizeof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase) == 0x000078, "Wrong size on G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, EntryPoint) == 0x000000, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, Temp_int_Array_Index_Variable) == 0x000004, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, Temp_int_Array_Index_Variable2) == 0x000010, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_Event_playAnimation) == 0x000014, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_Event_playAnimation' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_ComponentBoundEvent_DamageCauser) == 0x000018, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_Array_Get_Item) == 0x000020, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, Temp_int_Loop_Counter_Variable2) == 0x00002C, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_Array_Get_Item2) == 0x000030, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_Array_Length_ReturnValue2) == 0x000038, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_DynamicCast_AsTres_Phys_Obj_Skeletal_Mesh_Actor) == 0x000040, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_DynamicCast_AsTres_Phys_Obj_Skeletal_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_DynamicCast_AsTres_Phys_Obj_Static_Mesh_Actor) == 0x000050, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_DynamicCast_AsTres_Phys_Obj_Static_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_DynamicCast_bSuccess2) == 0x000058, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_DynamicCast_AsTres_Gimmick_Actor) == 0x000060, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_DynamicCast_AsTres_Gimmick_Actor' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_DynamicCast_bSuccess3) == 0x000068, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000069, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_Less_IntInt_ReturnValue2) == 0x00006A, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_Add_IntInt_ReturnValue2) == 0x00006C, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_Event_State) == 0x000070, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, K2Node_Event_OldState) == 0x000071, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000072, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000073, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_BooleanAND_ReturnValue) == 0x000074, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase, CallFunc_IsValid_ReturnValue2) == 0x000075, "Member 'G_TresPrizeGimmickStaticBase_C_ExecuteUbergraph_g_TresPrizeGimmickStaticBase::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function g_TresPrizeGimmickStaticBase.g_TresPrizeGimmickStaticBase_C.BPEV_OnGimmickInstanceInitialize
// 0x0002 (0x0002 - 0x0000)
struct G_TresPrizeGimmickStaticBase_C_BPEV_OnGimmickInstanceInitialize final
{
public:
	ETresGimmickInstanceManagerInstanceState      State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresGimmickInstanceManagerInstanceState      OldState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_TresPrizeGimmickStaticBase_C_BPEV_OnGimmickInstanceInitialize) == 0x000001, "Wrong alignment on G_TresPrizeGimmickStaticBase_C_BPEV_OnGimmickInstanceInitialize");
static_assert(sizeof(G_TresPrizeGimmickStaticBase_C_BPEV_OnGimmickInstanceInitialize) == 0x000002, "Wrong size on G_TresPrizeGimmickStaticBase_C_BPEV_OnGimmickInstanceInitialize");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_BPEV_OnGimmickInstanceInitialize, State) == 0x000000, "Member 'G_TresPrizeGimmickStaticBase_C_BPEV_OnGimmickInstanceInitialize::State' has a wrong offset!");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_BPEV_OnGimmickInstanceInitialize, OldState) == 0x000001, "Member 'G_TresPrizeGimmickStaticBase_C_BPEV_OnGimmickInstanceInitialize::OldState' has a wrong offset!");

// Function g_TresPrizeGimmickStaticBase.g_TresPrizeGimmickStaticBase_C.BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_4_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct G_TresPrizeGimmickStaticBase_C_BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_4_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_TresPrizeGimmickStaticBase_C_BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_4_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature) == 0x000008, "Wrong alignment on G_TresPrizeGimmickStaticBase_C_BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_4_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature");
static_assert(sizeof(G_TresPrizeGimmickStaticBase_C_BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_4_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature) == 0x000008, "Wrong size on G_TresPrizeGimmickStaticBase_C_BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_4_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_4_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature, DamageCauser) == 0x000000, "Member 'G_TresPrizeGimmickStaticBase_C_BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_4_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature::DamageCauser' has a wrong offset!");

// Function g_TresPrizeGimmickStaticBase.g_TresPrizeGimmickStaticBase_C.BPEV_OnDestroyedGimmickForPlan
// 0x0001 (0x0001 - 0x0000)
struct G_TresPrizeGimmickStaticBase_C_BPEV_OnDestroyedGimmickForPlan final
{
public:
	bool                                          PlayAnimation;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(G_TresPrizeGimmickStaticBase_C_BPEV_OnDestroyedGimmickForPlan) == 0x000001, "Wrong alignment on G_TresPrizeGimmickStaticBase_C_BPEV_OnDestroyedGimmickForPlan");
static_assert(sizeof(G_TresPrizeGimmickStaticBase_C_BPEV_OnDestroyedGimmickForPlan) == 0x000001, "Wrong size on G_TresPrizeGimmickStaticBase_C_BPEV_OnDestroyedGimmickForPlan");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_BPEV_OnDestroyedGimmickForPlan, PlayAnimation) == 0x000000, "Member 'G_TresPrizeGimmickStaticBase_C_BPEV_OnDestroyedGimmickForPlan::PlayAnimation' has a wrong offset!");

// Function g_TresPrizeGimmickStaticBase.g_TresPrizeGimmickStaticBase_C.UserConstructionScript
// 0x4E5F0A00 (0x4E5F0A00 - 0x0000)
struct alignas(0x4E5F0A00) G_TresPrizeGimmickStaticBase_C_UserConstructionScript final
{
public:
	TArray<class USQEX_CapsuleIndirectShadowComponent*> CallFunc_GetComponentsByClass_ReturnValue;         // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(G_TresPrizeGimmickStaticBase_C_UserConstructionScript) == 0x4E5F0A00, "Wrong alignment on G_TresPrizeGimmickStaticBase_C_UserConstructionScript");
static_assert(sizeof(G_TresPrizeGimmickStaticBase_C_UserConstructionScript) == 0x4E5F0A00, "Wrong size on G_TresPrizeGimmickStaticBase_C_UserConstructionScript");
static_assert(offsetof(G_TresPrizeGimmickStaticBase_C_UserConstructionScript, CallFunc_GetComponentsByClass_ReturnValue) == 0x000000, "Member 'G_TresPrizeGimmickStaticBase_C_UserConstructionScript::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");

}

