#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: G_tt_Train_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "G_TresGimmickSkeletalBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass g_tt_Train_02.g_tt_Train_02_C
// 0x0000 (0x1EF72E00 - 0x1EF72E00)
class AG_tt_Train_02_C final : public AG_TresGimmickSkeletalBase_C
{
public:
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_G_tt_Train_02_C;                    // 0x06C8(0x6F26)(Transient, DuplicateTransient)
	class USQEX_CapsuleIndirectShadowComponent*   SQEX_CapsuleIndirectShadow;                        // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTresSplineMoverComponent*              TresSplineMover;                                   // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTresStaticMeshComponent*               TresStaticMesh;                                    // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ASQEX_SplineActor*                      Spline;                                            // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_g_tt_Train_02(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"g_tt_Train_02_C">();
	}
	static class AG_tt_Train_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AG_tt_Train_02_C>();
	}
};
static_assert(alignof(AG_tt_Train_02_C) == 0x1EF72E00, "Wrong alignment on AG_tt_Train_02_C");
static_assert(sizeof(AG_tt_Train_02_C) == 0x1EF72E00, "Wrong size on AG_tt_Train_02_C");
static_assert(offsetof(AG_tt_Train_02_C, UberGraphFrame_G_tt_Train_02_C) == 0x0006C8, "Member 'AG_tt_Train_02_C::UberGraphFrame_G_tt_Train_02_C' has a wrong offset!");
static_assert(offsetof(AG_tt_Train_02_C, SQEX_CapsuleIndirectShadow) == 0x0006D0, "Member 'AG_tt_Train_02_C::SQEX_CapsuleIndirectShadow' has a wrong offset!");
static_assert(offsetof(AG_tt_Train_02_C, TresSplineMover) == 0x0006D8, "Member 'AG_tt_Train_02_C::TresSplineMover' has a wrong offset!");
static_assert(offsetof(AG_tt_Train_02_C, TresStaticMesh) == 0x0006E0, "Member 'AG_tt_Train_02_C::TresStaticMesh' has a wrong offset!");
static_assert(offsetof(AG_tt_Train_02_C, Spline) == 0x0006E8, "Member 'AG_tt_Train_02_C::Spline' has a wrong offset!");

}

