#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: N_ex109_Anim

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass n_ex109_Anim.n_ex109_Anim_C
// 0x2D7A60 (0x115C1550 - 0x112E9AF0)
class UN_ex109_Anim_C final : public UTresNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x6F26)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1A52946D45BC925E3186CF86A0882940; // 0x06E0(0x112BD)()
	struct FTresAnimNode_SaveCachedPose           TresAnimGraphNode_SaveCachedPose_FE8013EE4F94E8597A9946932B9C4ED8; // 0x0728(0x112BD)()
	struct FTresAnimNode_ExLookAt                 TresAnimGraphNode_ExLookAt_BCA2823E4B539A46D4A7FD83B34C3F6F; // 0x0770(0x1149AB00)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_F430237143B78B30BA8167A5B3E0302A; // 0x08C8(0x1129E)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6364118A4ACC0979C7DC1EADE93B77CD; // 0x0910(0x112BD)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_E3BA3C4F4C06F926DD06119B8C925551; // 0x0958(0x112E8D20)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_BD6C740140D5E850A2CA0F9DFEBFE4C0; // 0x0A38(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6D6FF4664E4C6858D05D1DB6246D5E8B; // 0x0A70(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_99F75335421522FB4F0B988C1B42A31A; // 0x0AD0(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9B37E8204E064673BA6474866EB3FFA0; // 0x0B08(0x115C1550)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_ECBCF4E54F77398BF736BCB2D62FACC8; // 0x0B68(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_0FC2553C4AF70A640221D98827476121; // 0x0BC8(0x0038)()

public:
	void ExecuteUbergraph_n_ex109_Anim(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_n_ex109_Anim_TresAnimGraphNode_ExLookAt_BCA2823E4B539A46D4A7FD83B34C3F6F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_n_ex109_Anim_AnimGraphNode_LayeredBoneBlend_E3BA3C4F4C06F926DD06119B8C925551();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"n_ex109_Anim_C">();
	}
	static class UN_ex109_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UN_ex109_Anim_C>();
	}
};
static_assert(alignof(UN_ex109_Anim_C) == 0x115C1550, "Wrong alignment on UN_ex109_Anim_C");
static_assert(sizeof(UN_ex109_Anim_C) == 0x115C1550, "Wrong size on UN_ex109_Anim_C");
static_assert(offsetof(UN_ex109_Anim_C, UberGraphFrame) == 0x0006D8, "Member 'UN_ex109_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, AnimGraphNode_Root_1A52946D45BC925E3186CF86A0882940) == 0x0006E0, "Member 'UN_ex109_Anim_C::AnimGraphNode_Root_1A52946D45BC925E3186CF86A0882940' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, TresAnimGraphNode_SaveCachedPose_FE8013EE4F94E8597A9946932B9C4ED8) == 0x000728, "Member 'UN_ex109_Anim_C::TresAnimGraphNode_SaveCachedPose_FE8013EE4F94E8597A9946932B9C4ED8' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, TresAnimGraphNode_ExLookAt_BCA2823E4B539A46D4A7FD83B34C3F6F) == 0x000770, "Member 'UN_ex109_Anim_C::TresAnimGraphNode_ExLookAt_BCA2823E4B539A46D4A7FD83B34C3F6F' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, AnimGraphNode_ComponentToLocalSpace_F430237143B78B30BA8167A5B3E0302A) == 0x0008C8, "Member 'UN_ex109_Anim_C::AnimGraphNode_ComponentToLocalSpace_F430237143B78B30BA8167A5B3E0302A' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, AnimGraphNode_LocalToComponentSpace_6364118A4ACC0979C7DC1EADE93B77CD) == 0x000910, "Member 'UN_ex109_Anim_C::AnimGraphNode_LocalToComponentSpace_6364118A4ACC0979C7DC1EADE93B77CD' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, AnimGraphNode_LayeredBoneBlend_E3BA3C4F4C06F926DD06119B8C925551) == 0x000958, "Member 'UN_ex109_Anim_C::AnimGraphNode_LayeredBoneBlend_E3BA3C4F4C06F926DD06119B8C925551' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, TresAnimGraphNode_UseCachedPose_BD6C740140D5E850A2CA0F9DFEBFE4C0) == 0x000A38, "Member 'UN_ex109_Anim_C::TresAnimGraphNode_UseCachedPose_BD6C740140D5E850A2CA0F9DFEBFE4C0' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, AnimGraphNode_Slot_6D6FF4664E4C6858D05D1DB6246D5E8B) == 0x000A70, "Member 'UN_ex109_Anim_C::AnimGraphNode_Slot_6D6FF4664E4C6858D05D1DB6246D5E8B' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, TresAnimGraphNode_UseCachedPose_99F75335421522FB4F0B988C1B42A31A) == 0x000AD0, "Member 'UN_ex109_Anim_C::TresAnimGraphNode_UseCachedPose_99F75335421522FB4F0B988C1B42A31A' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, AnimGraphNode_Slot_9B37E8204E064673BA6474866EB3FFA0) == 0x000B08, "Member 'UN_ex109_Anim_C::AnimGraphNode_Slot_9B37E8204E064673BA6474866EB3FFA0' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, AnimGraphNode_Slot_ECBCF4E54F77398BF736BCB2D62FACC8) == 0x000B68, "Member 'UN_ex109_Anim_C::AnimGraphNode_Slot_ECBCF4E54F77398BF736BCB2D62FACC8' has a wrong offset!");
static_assert(offsetof(UN_ex109_Anim_C, TresAnimGraphNode_UseCachedPose_0FC2553C4AF70A640221D98827476121) == 0x000BC8, "Member 'UN_ex109_Anim_C::TresAnimGraphNode_UseCachedPose_0FC2553C4AF70A640221D98827476121' has a wrong offset!");

}

