#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: N_tt203_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass n_tt203_Anim.n_tt203_Anim_C
// 0x2D7A60 (0x115C1550 - 0x112E9AF0)
class UN_tt203_Anim_C final : public UTresNpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x6F26)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_861084CD4A2C6DA231B5C097C77FD984; // 0x06E0(0x112BD)()
	struct FTresAnimNode_SaveCachedPose           TresAnimGraphNode_SaveCachedPose_95AFB6FB4B76F2175F2694AE965EFFFF; // 0x0728(0x112BD)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_F69529514E0B12BD49F4D8ACA3F75CEA; // 0x0770(0x112E8D20)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_17041B8749DD3361A9050CBF94B4B3E4; // 0x0850(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_864B062843AB8D8AC6DF5A99F460DD7D; // 0x0888(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_657486C34F7C79D3F1E4EDB51544508A; // 0x08E8(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9762744D446F9D6E8F82F398BEC462CF; // 0x0920(0x115C1550)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_789FBC354EA4E1BD98570F8B2C2371B3; // 0x0980(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_4BCED0F44C4BA2F72E5EB18CB0FF0DEF; // 0x09E0(0x0038)()
	struct FTresAnimNode_ExLookAt                 TresAnimGraphNode_ExLookAt_D50972DA4472665616D530ADBA9CBD3B; // 0x0A18(0x1149AB00)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8DDD63314F16DF3798A8669D3B4E1D51; // 0x0B70(0x1129E)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2A4AF41D42A386834487ABB7FC2D5868; // 0x0BB8(0x112BD)()

public:
	void ExecuteUbergraph_n_tt203_Anim(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_n_tt203_Anim_AnimGraphNode_LayeredBoneBlend_F69529514E0B12BD49F4D8ACA3F75CEA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_n_tt203_Anim_TresAnimGraphNode_ExLookAt_D50972DA4472665616D530ADBA9CBD3B();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"n_tt203_Anim_C">();
	}
	static class UN_tt203_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UN_tt203_Anim_C>();
	}
};
static_assert(alignof(UN_tt203_Anim_C) == 0x115C1550, "Wrong alignment on UN_tt203_Anim_C");
static_assert(sizeof(UN_tt203_Anim_C) == 0x115C1550, "Wrong size on UN_tt203_Anim_C");
static_assert(offsetof(UN_tt203_Anim_C, UberGraphFrame) == 0x0006D8, "Member 'UN_tt203_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, AnimGraphNode_Root_861084CD4A2C6DA231B5C097C77FD984) == 0x0006E0, "Member 'UN_tt203_Anim_C::AnimGraphNode_Root_861084CD4A2C6DA231B5C097C77FD984' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, TresAnimGraphNode_SaveCachedPose_95AFB6FB4B76F2175F2694AE965EFFFF) == 0x000728, "Member 'UN_tt203_Anim_C::TresAnimGraphNode_SaveCachedPose_95AFB6FB4B76F2175F2694AE965EFFFF' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, AnimGraphNode_LayeredBoneBlend_F69529514E0B12BD49F4D8ACA3F75CEA) == 0x000770, "Member 'UN_tt203_Anim_C::AnimGraphNode_LayeredBoneBlend_F69529514E0B12BD49F4D8ACA3F75CEA' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, TresAnimGraphNode_UseCachedPose_17041B8749DD3361A9050CBF94B4B3E4) == 0x000850, "Member 'UN_tt203_Anim_C::TresAnimGraphNode_UseCachedPose_17041B8749DD3361A9050CBF94B4B3E4' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, AnimGraphNode_Slot_864B062843AB8D8AC6DF5A99F460DD7D) == 0x000888, "Member 'UN_tt203_Anim_C::AnimGraphNode_Slot_864B062843AB8D8AC6DF5A99F460DD7D' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, TresAnimGraphNode_UseCachedPose_657486C34F7C79D3F1E4EDB51544508A) == 0x0008E8, "Member 'UN_tt203_Anim_C::TresAnimGraphNode_UseCachedPose_657486C34F7C79D3F1E4EDB51544508A' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, AnimGraphNode_Slot_9762744D446F9D6E8F82F398BEC462CF) == 0x000920, "Member 'UN_tt203_Anim_C::AnimGraphNode_Slot_9762744D446F9D6E8F82F398BEC462CF' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, AnimGraphNode_Slot_789FBC354EA4E1BD98570F8B2C2371B3) == 0x000980, "Member 'UN_tt203_Anim_C::AnimGraphNode_Slot_789FBC354EA4E1BD98570F8B2C2371B3' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, TresAnimGraphNode_UseCachedPose_4BCED0F44C4BA2F72E5EB18CB0FF0DEF) == 0x0009E0, "Member 'UN_tt203_Anim_C::TresAnimGraphNode_UseCachedPose_4BCED0F44C4BA2F72E5EB18CB0FF0DEF' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, TresAnimGraphNode_ExLookAt_D50972DA4472665616D530ADBA9CBD3B) == 0x000A18, "Member 'UN_tt203_Anim_C::TresAnimGraphNode_ExLookAt_D50972DA4472665616D530ADBA9CBD3B' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, AnimGraphNode_ComponentToLocalSpace_8DDD63314F16DF3798A8669D3B4E1D51) == 0x000B70, "Member 'UN_tt203_Anim_C::AnimGraphNode_ComponentToLocalSpace_8DDD63314F16DF3798A8669D3B4E1D51' has a wrong offset!");
static_assert(offsetof(UN_tt203_Anim_C, AnimGraphNode_LocalToComponentSpace_2A4AF41D42A386834487ABB7FC2D5868) == 0x000BB8, "Member 'UN_tt203_Anim_C::AnimGraphNode_LocalToComponentSpace_2A4AF41D42A386834487ABB7FC2D5868' has a wrong offset!");

}

