#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_ex001_Anim

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass p_ex001_Anim.p_ex001_Anim_C
// 0x315CD0 (0x115FF7C0 - 0x112E9AF0)
class UP_ex001_Anim_C final : public UTresPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x6F26)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F5C0BB2E4B78B1E57548C781D26AC7BC; // 0x0650(0x112BD)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1EDAA0E749FA9B1DCD1E32A25E7973CA; // 0x0698(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_9BAA9768472F85B269B854AB2ED41E3E; // 0x06F8(0x0038)()
	struct FTresAnimNode_SaveCachedPose           TresAnimGraphNode_SaveCachedPose_ECE131FE4E41BFA4FA6FC5B0E4CA6115; // 0x0730(0x112BD)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3CFF092E48C10BCE58C0DE90E9DE3AED; // 0x0778(0x112BD)()
	struct FTresAnimNode_CollTwoBoneIK            TresAnimGraphNode_CollTwoBoneIK_206119884403AF126663C384885FA9A0; // 0x07C0(0x11498FB0)()
	struct FTresAnimNode_CollTwoBoneIK            TresAnimGraphNode_CollTwoBoneIK_B13A9A3841214C6ADA53D3A748C8DAA1; // 0x0900(0x11498FB0)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_C786982B4A365A43A67373B458D8632B; // 0x0A40(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7E3CDD674AF131CC56F95FAB46A5CBF0; // 0x0A78(0x115C1550)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_AAECC28448491B9EFD955482FDF63A9E; // 0x0AD8(0x112E8D20)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_9EBA5E0B444C379F3C7134A492577C46; // 0x0BB8(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9D8E98BB4A71C78A6F9FC4A669C0B4BA; // 0x0BF0(0x115C1550)()
	struct FTresAnimNode_ExLookAt                 TresAnimGraphNode_ExLookAt_C5C7660E493040F24ED44C96D8D3D859; // 0x0C50(0x1149AB00)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_527F75AD4E27DD406FE091A90B8F2D0F; // 0x0DA8(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_77F8F932492DB320831D83B66ABDAD2F; // 0x0E78(0x115FE030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52B480084A88E1782D0013856AEC9E17; // 0x0F20(0x115FF7C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5E0B9B2C4A3F431B2D2CE1B0684D3564; // 0x0F70(0x115FF7C0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_E85C777C4C7568959FF471B1D915E6C0; // 0x0FC0(0x1129E)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_CA94C0AF491009439E73538A8AC10680; // 0x1008(0x112BD)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_62AB809740E5EF1950E0E19788A4D066; // 0x1050(0x1129E)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_C2C69783498EBFF033B16B9B5D83581B; // 0x1098(0x11498FB0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3ADA78FE448454C625615BB403982CB8; // 0x1110(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_D5FBEFE549C400B138E6DD9AA48A38B7; // 0x1170(0x0038)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_669AE9A349B52A118E63F9A0489F883B; // 0x11A8(0x11498FB0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_AEB695C347410086608011891AD0E885; // 0x1260(0x11498FB0)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_1E7220D24FBB098B8E4A7B887FA671A3; // 0x1318(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_462B18D64DE191572703B7B593348657; // 0x1350(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_812030C342F56C6FEC260D916875EAEF; // 0x13B0(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7CC21B264753BEC404BD4EA0804AB212; // 0x13E8(0x115C1550)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_D41F33F84E3D24DE6190238B1BD58939; // 0x1448(0x112E8D20)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_D53062F04958D3F2D1302FB5E8BE2974; // 0x1528(0x112E8D20)()
	struct FTresAnimNode_TwoBoneIKMultiped        TresAnimGraphNode_TwoBoneIKMultiped_A9192FE44A453F291C1CD7960B27DE46; // 0x1610(0x1149CFD0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5038632B4FE661FCC58C889F0A48F0CF; // 0x1830(0x112BD)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3E97C51E43A5EA26404B9BAAED92EFB0; // 0x1878(0x1129E)()

public:
	void ExecuteUbergraph_p_ex001_Anim(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_TresAnimGraphNode_CollTwoBoneIK_206119884403AF126663C384885FA9A0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_TresAnimGraphNode_CollTwoBoneIK_B13A9A3841214C6ADA53D3A748C8DAA1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_AnimGraphNode_LayeredBoneBlend_AAECC28448491B9EFD955482FDF63A9E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_AnimGraphNode_LayeredBoneBlend_D53062F04958D3F2D1302FB5E8BE2974();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_TresAnimGraphNode_TwoBoneIKMultiped_A9192FE44A453F291C1CD7960B27DE46();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_TresAnimGraphNode_ExLookAt_C5C7660E493040F24ED44C96D8D3D859();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_AnimGraphNode_BlendListByBool_527F75AD4E27DD406FE091A90B8F2D0F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_AnimGraphNode_TwoWayBlend_C2C69783498EBFF033B16B9B5D83581B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_AnimGraphNode_ModifyBone_669AE9A349B52A118E63F9A0489F883B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_AnimGraphNode_ModifyBone_AEB695C347410086608011891AD0E885();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex001_Anim_AnimGraphNode_LayeredBoneBlend_D41F33F84E3D24DE6190238B1BD58939();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"p_ex001_Anim_C">();
	}
	static class UP_ex001_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UP_ex001_Anim_C>();
	}
};
static_assert(alignof(UP_ex001_Anim_C) == 0x115FF7C0, "Wrong alignment on UP_ex001_Anim_C");
static_assert(sizeof(UP_ex001_Anim_C) == 0x115FF7C0, "Wrong size on UP_ex001_Anim_C");
static_assert(offsetof(UP_ex001_Anim_C, UberGraphFrame) == 0x000648, "Member 'UP_ex001_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_Root_F5C0BB2E4B78B1E57548C781D26AC7BC) == 0x000650, "Member 'UP_ex001_Anim_C::AnimGraphNode_Root_F5C0BB2E4B78B1E57548C781D26AC7BC' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_Slot_1EDAA0E749FA9B1DCD1E32A25E7973CA) == 0x000698, "Member 'UP_ex001_Anim_C::AnimGraphNode_Slot_1EDAA0E749FA9B1DCD1E32A25E7973CA' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_UseCachedPose_9BAA9768472F85B269B854AB2ED41E3E) == 0x0006F8, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_UseCachedPose_9BAA9768472F85B269B854AB2ED41E3E' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_SaveCachedPose_ECE131FE4E41BFA4FA6FC5B0E4CA6115) == 0x000730, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_SaveCachedPose_ECE131FE4E41BFA4FA6FC5B0E4CA6115' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_LocalToComponentSpace_3CFF092E48C10BCE58C0DE90E9DE3AED) == 0x000778, "Member 'UP_ex001_Anim_C::AnimGraphNode_LocalToComponentSpace_3CFF092E48C10BCE58C0DE90E9DE3AED' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_CollTwoBoneIK_206119884403AF126663C384885FA9A0) == 0x0007C0, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_CollTwoBoneIK_206119884403AF126663C384885FA9A0' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_CollTwoBoneIK_B13A9A3841214C6ADA53D3A748C8DAA1) == 0x000900, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_CollTwoBoneIK_B13A9A3841214C6ADA53D3A748C8DAA1' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_UseCachedPose_C786982B4A365A43A67373B458D8632B) == 0x000A40, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_UseCachedPose_C786982B4A365A43A67373B458D8632B' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_Slot_7E3CDD674AF131CC56F95FAB46A5CBF0) == 0x000A78, "Member 'UP_ex001_Anim_C::AnimGraphNode_Slot_7E3CDD674AF131CC56F95FAB46A5CBF0' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_LayeredBoneBlend_AAECC28448491B9EFD955482FDF63A9E) == 0x000AD8, "Member 'UP_ex001_Anim_C::AnimGraphNode_LayeredBoneBlend_AAECC28448491B9EFD955482FDF63A9E' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_UseCachedPose_9EBA5E0B444C379F3C7134A492577C46) == 0x000BB8, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_UseCachedPose_9EBA5E0B444C379F3C7134A492577C46' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_Slot_9D8E98BB4A71C78A6F9FC4A669C0B4BA) == 0x000BF0, "Member 'UP_ex001_Anim_C::AnimGraphNode_Slot_9D8E98BB4A71C78A6F9FC4A669C0B4BA' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_ExLookAt_C5C7660E493040F24ED44C96D8D3D859) == 0x000C50, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_ExLookAt_C5C7660E493040F24ED44C96D8D3D859' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_BlendListByBool_527F75AD4E27DD406FE091A90B8F2D0F) == 0x000DA8, "Member 'UP_ex001_Anim_C::AnimGraphNode_BlendListByBool_527F75AD4E27DD406FE091A90B8F2D0F' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_SaveCachedPose_77F8F932492DB320831D83B66ABDAD2F) == 0x000E78, "Member 'UP_ex001_Anim_C::AnimGraphNode_SaveCachedPose_77F8F932492DB320831D83B66ABDAD2F' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_UseCachedPose_52B480084A88E1782D0013856AEC9E17) == 0x000F20, "Member 'UP_ex001_Anim_C::AnimGraphNode_UseCachedPose_52B480084A88E1782D0013856AEC9E17' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_UseCachedPose_5E0B9B2C4A3F431B2D2CE1B0684D3564) == 0x000F70, "Member 'UP_ex001_Anim_C::AnimGraphNode_UseCachedPose_5E0B9B2C4A3F431B2D2CE1B0684D3564' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_ComponentToLocalSpace_E85C777C4C7568959FF471B1D915E6C0) == 0x000FC0, "Member 'UP_ex001_Anim_C::AnimGraphNode_ComponentToLocalSpace_E85C777C4C7568959FF471B1D915E6C0' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_LocalToComponentSpace_CA94C0AF491009439E73538A8AC10680) == 0x001008, "Member 'UP_ex001_Anim_C::AnimGraphNode_LocalToComponentSpace_CA94C0AF491009439E73538A8AC10680' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_ComponentToLocalSpace_62AB809740E5EF1950E0E19788A4D066) == 0x001050, "Member 'UP_ex001_Anim_C::AnimGraphNode_ComponentToLocalSpace_62AB809740E5EF1950E0E19788A4D066' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_TwoWayBlend_C2C69783498EBFF033B16B9B5D83581B) == 0x001098, "Member 'UP_ex001_Anim_C::AnimGraphNode_TwoWayBlend_C2C69783498EBFF033B16B9B5D83581B' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_Slot_3ADA78FE448454C625615BB403982CB8) == 0x001110, "Member 'UP_ex001_Anim_C::AnimGraphNode_Slot_3ADA78FE448454C625615BB403982CB8' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_UseCachedPose_D5FBEFE549C400B138E6DD9AA48A38B7) == 0x001170, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_UseCachedPose_D5FBEFE549C400B138E6DD9AA48A38B7' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_ModifyBone_669AE9A349B52A118E63F9A0489F883B) == 0x0011A8, "Member 'UP_ex001_Anim_C::AnimGraphNode_ModifyBone_669AE9A349B52A118E63F9A0489F883B' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_ModifyBone_AEB695C347410086608011891AD0E885) == 0x001260, "Member 'UP_ex001_Anim_C::AnimGraphNode_ModifyBone_AEB695C347410086608011891AD0E885' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_UseCachedPose_1E7220D24FBB098B8E4A7B887FA671A3) == 0x001318, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_UseCachedPose_1E7220D24FBB098B8E4A7B887FA671A3' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_Slot_462B18D64DE191572703B7B593348657) == 0x001350, "Member 'UP_ex001_Anim_C::AnimGraphNode_Slot_462B18D64DE191572703B7B593348657' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_UseCachedPose_812030C342F56C6FEC260D916875EAEF) == 0x0013B0, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_UseCachedPose_812030C342F56C6FEC260D916875EAEF' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_Slot_7CC21B264753BEC404BD4EA0804AB212) == 0x0013E8, "Member 'UP_ex001_Anim_C::AnimGraphNode_Slot_7CC21B264753BEC404BD4EA0804AB212' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_LayeredBoneBlend_D41F33F84E3D24DE6190238B1BD58939) == 0x001448, "Member 'UP_ex001_Anim_C::AnimGraphNode_LayeredBoneBlend_D41F33F84E3D24DE6190238B1BD58939' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_LayeredBoneBlend_D53062F04958D3F2D1302FB5E8BE2974) == 0x001528, "Member 'UP_ex001_Anim_C::AnimGraphNode_LayeredBoneBlend_D53062F04958D3F2D1302FB5E8BE2974' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, TresAnimGraphNode_TwoBoneIKMultiped_A9192FE44A453F291C1CD7960B27DE46) == 0x001610, "Member 'UP_ex001_Anim_C::TresAnimGraphNode_TwoBoneIKMultiped_A9192FE44A453F291C1CD7960B27DE46' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_LocalToComponentSpace_5038632B4FE661FCC58C889F0A48F0CF) == 0x001830, "Member 'UP_ex001_Anim_C::AnimGraphNode_LocalToComponentSpace_5038632B4FE661FCC58C889F0A48F0CF' has a wrong offset!");
static_assert(offsetof(UP_ex001_Anim_C, AnimGraphNode_ComponentToLocalSpace_3E97C51E43A5EA26404B9BAAED92EFB0) == 0x001878, "Member 'UP_ex001_Anim_C::AnimGraphNode_ComponentToLocalSpace_3E97C51E43A5EA26404B9BAAED92EFB0' has a wrong offset!");

}

