#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_ex001_CM_Anim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass p_ex001_CM_Anim.p_ex001_CM_Anim_C
// 0x115C0FF0 (0x115C1550 - 0x0560)
class UP_ex001_CM_Anim_C final : public UTresUIActorAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x6F26)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_30BC10EA4CAFFBD78527078F8D6D7C38; // 0x0568(0x112BD)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_8097CBFC4B1792A6A555E992D15ECBB4; // 0x05B0(0x0038)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_383D6B074AF3EEBD32C6739F91D77A3D; // 0x05E8(0x112E8D20)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_EDD83D0341515D126FDAC7B87DAE99A1; // 0x06C8(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_B45DD4D545DAD95CDD7A2FB6247CF99B; // 0x0728(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_BC26C76945A93F6B9E2F88A776B58514; // 0x0760(0x115C1550)()

public:
	void ExecuteUbergraph_p_ex001_CM_Anim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"p_ex001_CM_Anim_C">();
	}
	static class UP_ex001_CM_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UP_ex001_CM_Anim_C>();
	}
};
static_assert(alignof(UP_ex001_CM_Anim_C) == 0x115C1550, "Wrong alignment on UP_ex001_CM_Anim_C");
static_assert(sizeof(UP_ex001_CM_Anim_C) == 0x115C1550, "Wrong size on UP_ex001_CM_Anim_C");
static_assert(offsetof(UP_ex001_CM_Anim_C, UberGraphFrame) == 0x000560, "Member 'UP_ex001_CM_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UP_ex001_CM_Anim_C, AnimGraphNode_Root_30BC10EA4CAFFBD78527078F8D6D7C38) == 0x000568, "Member 'UP_ex001_CM_Anim_C::AnimGraphNode_Root_30BC10EA4CAFFBD78527078F8D6D7C38' has a wrong offset!");
static_assert(offsetof(UP_ex001_CM_Anim_C, TresAnimGraphNode_UseCachedPose_8097CBFC4B1792A6A555E992D15ECBB4) == 0x0005B0, "Member 'UP_ex001_CM_Anim_C::TresAnimGraphNode_UseCachedPose_8097CBFC4B1792A6A555E992D15ECBB4' has a wrong offset!");
static_assert(offsetof(UP_ex001_CM_Anim_C, AnimGraphNode_LayeredBoneBlend_383D6B074AF3EEBD32C6739F91D77A3D) == 0x0005E8, "Member 'UP_ex001_CM_Anim_C::AnimGraphNode_LayeredBoneBlend_383D6B074AF3EEBD32C6739F91D77A3D' has a wrong offset!");
static_assert(offsetof(UP_ex001_CM_Anim_C, AnimGraphNode_Slot_EDD83D0341515D126FDAC7B87DAE99A1) == 0x0006C8, "Member 'UP_ex001_CM_Anim_C::AnimGraphNode_Slot_EDD83D0341515D126FDAC7B87DAE99A1' has a wrong offset!");
static_assert(offsetof(UP_ex001_CM_Anim_C, TresAnimGraphNode_UseCachedPose_B45DD4D545DAD95CDD7A2FB6247CF99B) == 0x000728, "Member 'UP_ex001_CM_Anim_C::TresAnimGraphNode_UseCachedPose_B45DD4D545DAD95CDD7A2FB6247CF99B' has a wrong offset!");
static_assert(offsetof(UP_ex001_CM_Anim_C, AnimGraphNode_Slot_BC26C76945A93F6B9E2F88A776B58514) == 0x000760, "Member 'UP_ex001_CM_Anim_C::AnimGraphNode_Slot_BC26C76945A93F6B9E2F88A776B58514' has a wrong offset!");

}

