#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_mi_key

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEventCamera_mi_key.BP_TresPlayerStateEventCamera_mi_key_C.ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key
// 0x112F5920 (0x112F5920 - 0x0000)
struct BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x0004(0x0014)(NoDestructor)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x0090(0x0014)(NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x00B0(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x00C4(0x0014)(NoDestructor)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x00E0(0x0014)(NoDestructor)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x0120(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue2;           // 0x0150(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x0168(0x0014)(NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x017C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x0188(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0xC];                                      // 0x0194(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x01A0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue3;           // 0x01D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x01E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x01F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue4;                // 0x0200(0x112E9D50)(IsPlainOldData, NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue4;           // 0x0238(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x0244(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue5;                // 0x0250(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue5;            // 0x0280(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue5;           // 0x028C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue2; // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue3;      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7;  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue7; // 0x02B0(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue8; // 0x02C4(0x0014)(NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x02D8(0x0010)(ZeroConstructor, ReferenceParm)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue4;      // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8;  // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue9; // 0x02F8(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue10; // 0x030C(0x0014)(NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x0320(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit;         // 0x0330(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue;    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue3; // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA[0x6];                                      // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable3;                             // 0x03C0(0x0010)(ZeroConstructor, ReferenceParm)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9;  // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit2;        // 0x03D8(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue2;   // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue4; // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable4;                             // 0x0468(0x0010)(ZeroConstructor, ReferenceParm)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10; // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit3;        // 0x0480(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue3;   // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x050C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue6;            // 0x0518(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0xC];                                      // 0x0524(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue6;                // 0x0530(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue6;           // 0x0560(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit4;        // 0x0588(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue4;   // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0612(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x0613(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x0614(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue5;         // 0x0615(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue6;         // 0x0616(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue7;         // 0x0617(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11; // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue5;      // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable5;                             // 0x0630(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit5;        // 0x0640(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue5;   // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue11; // 0x06CC(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue12; // 0x06E0(0x0014)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F5[0x3];                                      // 0x06F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue13; // 0x06F8(0x0014)(NoDestructor)
	uint8                                         Pad_70C[0x4];                                      // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12; // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue13; // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0721(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x0722(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_723[0x5];                                      // 0x0723(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue6;      // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable6;                             // 0x0730(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit6;        // 0x0740(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue6;   // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key) == 0x112F5920, "Wrong alignment on BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key");
static_assert(sizeof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key) == 0x112F5920, "Wrong size on BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x000004, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000020, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_TransformLocation_ReturnValue) == 0x00007C, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000088, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x000090, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x0000A8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x0000B0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x0000C4, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x0000D8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x0000E0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x0000F8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000100, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_Add_VectorVector_ReturnValue2) == 0x00010C, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetTransform_ReturnValue2) == 0x000120, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_TransformLocation_ReturnValue2) == 0x000150, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_TransformLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x000160, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x000168, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x00017C, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_Add_VectorVector_ReturnValue3) == 0x000188, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetTransform_ReturnValue3) == 0x0001A0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_TransformLocation_ReturnValue3) == 0x0001D0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_TransformLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x0001E0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x0001E8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_Add_VectorVector_ReturnValue4) == 0x0001F4, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_Add_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetTransform_ReturnValue4) == 0x000200, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetTransform_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x000230, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_TransformLocation_ReturnValue4) == 0x000238, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_TransformLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x000244, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetTransform_ReturnValue5) == 0x000250, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetTransform_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_Add_VectorVector_ReturnValue5) == 0x000280, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_Add_VectorVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_TransformLocation_ReturnValue5) == 0x00028C, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_TransformLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue2) == 0x000298, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_SpawnTresCameraAnim_ReturnValue3) == 0x0002A0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_SpawnTresCameraAnim_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7) == 0x0002A8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue7) == 0x0002B0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue8) == 0x0002C4, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, Temp_object_Variable) == 0x0002D8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_SpawnTresCameraAnim_ReturnValue4) == 0x0002E8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_SpawnTresCameraAnim_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8) == 0x0002F0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue9) == 0x0002F8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue10) == 0x00030C, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, Temp_object_Variable2) == 0x000320, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_OutHit) == 0x000330, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_OutHit' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_ReturnValue) == 0x0003B8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue3) == 0x0003B9, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, Temp_object_Variable3) == 0x0003C0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9) == 0x0003D0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_OutHit2) == 0x0003D8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_OutHit2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_ReturnValue2) == 0x000460, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue4) == 0x000461, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, Temp_object_Variable4) == 0x000468, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10) == 0x000478, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_OutHit3) == 0x000480, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_OutHit3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_ReturnValue3) == 0x000508, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_K2_GetActorLocation_ReturnValue6) == 0x00050C, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_K2_GetActorLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_Add_VectorVector_ReturnValue6) == 0x000518, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_Add_VectorVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetTransform_ReturnValue6) == 0x000530, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetTransform_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_TransformLocation_ReturnValue6) == 0x000560, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_TransformLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, K2Node_Event_SendActor) == 0x000570, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, K2Node_Event_AnimSeqName) == 0x000578, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, K2Node_Event_EventID) == 0x000580, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, K2Node_Event_Param) == 0x000584, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_OutHit4) == 0x000588, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_OutHit4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_ReturnValue4) == 0x000610, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000611, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000612, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x000613, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x000614, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_EqualEqual_NameName_ReturnValue5) == 0x000615, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_EqualEqual_NameName_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_EqualEqual_NameName_ReturnValue6) == 0x000616, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_EqualEqual_NameName_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_EqualEqual_NameName_ReturnValue7) == 0x000617, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_EqualEqual_NameName_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11) == 0x000618, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000620, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_SpawnTresCameraAnim_ReturnValue5) == 0x000628, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_SpawnTresCameraAnim_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, Temp_object_Variable5) == 0x000630, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_OutHit5) == 0x000640, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_OutHit5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_ReturnValue5) == 0x0006C8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue11) == 0x0006CC, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue12) == 0x0006E0, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_IsValid_ReturnValue) == 0x0006F4, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_SetTresCameraTransitionParams_ReturnValue13) == 0x0006F8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_SetTresCameraTransitionParams_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12) == 0x000710, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue13) == 0x000718, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, K2Node_Event_StateID) == 0x000720, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, K2Node_SwitchEnum_CmpSuccess) == 0x000721, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_RemoteEvent_ReturnValue) == 0x000722, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_RemoteEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_SpawnTresCameraAnim_ReturnValue6) == 0x000728, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_SpawnTresCameraAnim_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, Temp_object_Variable6) == 0x000730, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_OutHit6) == 0x000740, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_OutHit6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key, CallFunc_BP_TresLineTraceByChannel_ReturnValue6) == 0x0007C8, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ExecuteUbergraph_BP_TresPlayerStateEventCamera_mi_key::CallFunc_BP_TresLineTraceByChannel_ReturnValue6' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_mi_key.BP_TresPlayerStateEventCamera_mi_key_C.ReceivePlayerDtorState
// 0xC000000 (0xC000000 - 0x0000)
struct alignas(0xC000000) BP_TresPlayerStateEventCamera_mi_key_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_mi_key_C_ReceivePlayerDtorState) == 0xC000000, "Wrong alignment on BP_TresPlayerStateEventCamera_mi_key_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEventCamera_mi_key_C_ReceivePlayerDtorState) == 0xC000000, "Wrong size on BP_TresPlayerStateEventCamera_mi_key_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEventCamera_mi_key.BP_TresPlayerStateEventCamera_mi_key_C.ReceiveAnimNotifyStartBpEvent
// 0xC000000 (0xC000000 - 0x0000)
struct alignas(0xC000000) BP_TresPlayerStateEventCamera_mi_key_C_ReceiveAnimNotifyStartBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEventCamera_mi_key_C_ReceiveAnimNotifyStartBpEvent) == 0xC000000, "Wrong alignment on BP_TresPlayerStateEventCamera_mi_key_C_ReceiveAnimNotifyStartBpEvent");
static_assert(sizeof(BP_TresPlayerStateEventCamera_mi_key_C_ReceiveAnimNotifyStartBpEvent) == 0xC000000, "Wrong size on BP_TresPlayerStateEventCamera_mi_key_C_ReceiveAnimNotifyStartBpEvent");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ReceiveAnimNotifyStartBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ReceiveAnimNotifyStartBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEventCamera_mi_key_C_ReceiveAnimNotifyStartBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEventCamera_mi_key_C_ReceiveAnimNotifyStartBpEvent::AnimSeqName' has a wrong offset!");
