#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEventCamera_Attraction_Chant

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TresPlayerStateEventCamera_Attraction_Chant.BP_TresPlayerStateEventCamera_Attraction_Chant_C
// 0x6ED6 (0x6F26 - 0x0050)
class UBP_TresPlayerStateEventCamera_Attraction_Chant_C final : public UTresPlayerStateEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0050(0x6F26)(Transient, DuplicateTransient)
	class ATresCharPawnBase*                      Tres_Char_Pawn_base;                               // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Center;                                            // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraBase*                        Camera;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraRotTarget*                   Camera_RotTarget;                                  // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        Camera_anim;                                       // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendTime;                                         // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TakeOver;                                          // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name_0;                                            // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraAnim*                            Tres_camera_anim;                                  // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Start;                                             // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_TresPlayerStateEventCamera_Attraction_Chant(int32 EntryPoint);
	void ReceivePlayerDtorState(ETresStateID StateID);
	void ReceivePlayerSpecificAction(ETresPlayerSpecificActionID ActionID, int32 SubID);
	void ReceivePlayerCtorState(ETresStateID StateID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TresPlayerStateEventCamera_Attraction_Chant_C">();
	}
	static class UBP_TresPlayerStateEventCamera_Attraction_Chant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TresPlayerStateEventCamera_Attraction_Chant_C>();
	}
};
static_assert(alignof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C) == 0x006F26, "Wrong alignment on UBP_TresPlayerStateEventCamera_Attraction_Chant_C");
static_assert(sizeof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C) == 0x006F26, "Wrong size on UBP_TresPlayerStateEventCamera_Attraction_Chant_C");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, UberGraphFrame) == 0x000050, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, Tres_Char_Pawn_base) == 0x000058, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::Tres_Char_Pawn_base' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, Center) == 0x000060, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::Center' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, Camera) == 0x000068, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::Camera' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, Camera_RotTarget) == 0x000070, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::Camera_RotTarget' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, Camera_anim) == 0x000078, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::Camera_anim' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, BlendTime) == 0x000080, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::BlendTime' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, Actor) == 0x000088, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::Actor' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, TakeOver) == 0x000090, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::TakeOver' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, Name_0) == 0x000098, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::Name_0' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, Tres_camera_anim) == 0x0000A0, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::Tres_camera_anim' has a wrong offset!");
static_assert(offsetof(UBP_TresPlayerStateEventCamera_Attraction_Chant_C, Start) == 0x0000A8, "Member 'UBP_TresPlayerStateEventCamera_Attraction_Chant_C::Start' has a wrong offset!");

}

