#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TresPlayerStateEvent_form_change

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TresPlayerStateEvent_form_change.BP_TresPlayerStateEvent_form_change_C.ExecuteUbergraph_BP_TresPlayerStateEvent_form_change
// 0x112F5920 (0x112F5920 - 0x0000)
struct BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x112E9D50)(IsPlainOldData, NoDestructor)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0084(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x00A0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue2;           // 0x00D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue; // 0x00DC(0x0014)(NoDestructor)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue2; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue2; // 0x00F4(0x0014)(NoDestructor)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue3; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue4; // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue5; // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue6; // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue7; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable2;                             // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4;  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable3;                             // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0150(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x0160(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue3;            // 0x0190(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue3;           // 0x019C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit;         // 0x01B0(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue;    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x023C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue4;            // 0x0248(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0xC];                                      // 0x0254(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue4;                // 0x0260(0x112E9D50)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable4;                             // 0x0290(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_TransformLocation_ReturnValue4;           // 0x02A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6;  // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit2;        // 0x02B8(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue2;   // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x0344(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue5;            // 0x0350(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue5;                // 0x0360(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue5;           // 0x0390(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor2;                           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName2;                         // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID2;                             // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param2;                               // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit3;        // 0x03B8(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue3;   // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x0443(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue5;         // 0x0445(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue6;         // 0x0446(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue7;         // 0x0447(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue8;         // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue9;         // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue10;        // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue11;        // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCharPawnBase*                      K2Node_Event_SendActor;                            // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimSeqName;                          // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      K2Node_Event_EventID;                              // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Param;                                // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7;  // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue12;        // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue13;        // 0x0472(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_473[0x5];                                      // 0x0473(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8;  // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9;  // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x0498(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0xC];                                      // 0x04A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue6;                // 0x04B0(0x112E9D50)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue6;            // 0x04E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue6;           // 0x04EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit4;        // 0x04F8(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue4;   // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraManager*                     CallFunc_GetLocalTresCameraManager_ReturnValue;    // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraBase*                        CallFunc_GetActiveCamera_ReturnValue;              // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDefaultFieldOfView_ReturnValue;        // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue2;      // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable5;                             // 0x05A8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit5;        // 0x05B8(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue5;   // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresCameraManager*                     CallFunc_GetLocalTresCameraManager_ReturnValue2;   // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraBase*                        CallFunc_GetActiveCamera_ReturnValue2;             // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x3];                                      // 0x0659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue3; // 0x065C(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue4; // 0x0670(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue5; // 0x0684(0x0014)(NoDestructor)
	struct FViewTargetTransitionParamsEx          CallFunc_SetTresCameraTransitionParams_ReturnValue6; // 0x0698(0x0014)(NoDestructor)
	ETresStateID                                  K2Node_Event_StateID;                              // 0x06AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x06AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AE[0x2];                                      // 0x06AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATresPlayerPawnBase*                    CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11; // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATresCameraAnim*                        CallFunc_BP_SpawnTresCameraAnim_ReturnValue3;      // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable6;                             // 0x06C0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_BP_TresLineTraceByChannel_OutHit6;        // 0x06D0(0x112F5920)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_TresLineTraceByChannel_ReturnValue6;   // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change) == 0x112F5920, "Wrong alignment on BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change");
static_assert(sizeof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change) == 0x112F5920, "Wrong size on BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, EntryPoint) == 0x000000, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue) == 0x000008, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_SpawnTresCameraAnim_ReturnValue) == 0x000010, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_SpawnTresCameraAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_Add_VectorVector_ReturnValue) == 0x000024, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2) == 0x000060, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_TransformLocation_ReturnValue) == 0x000068, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3) == 0x000078, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue) == 0x000080, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000084, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_Add_VectorVector_ReturnValue2) == 0x000090, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetTransform_ReturnValue2) == 0x0000A0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_TransformLocation_ReturnValue2) == 0x0000D0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_TransformLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_SetTresCameraTransitionParams_ReturnValue) == 0x0000DC, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_SetTresCameraTransitionParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue2) == 0x0000F0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_SetTresCameraTransitionParams_ReturnValue2) == 0x0000F4, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_SetTresCameraTransitionParams_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue3) == 0x000108, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue4) == 0x000109, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue5) == 0x00010A, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue6) == 0x00010B, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, Temp_object_Variable) == 0x000110, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue7) == 0x000120, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresIsGameEnablePerformanceCamera_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, Temp_object_Variable2) == 0x000128, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4) == 0x000138, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, Temp_object_Variable3) == 0x000140, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_K2_GetActorLocation_ReturnValue3) == 0x000150, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_K2_GetActorLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetTransform_ReturnValue3) == 0x000160, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_Add_VectorVector_ReturnValue3) == 0x000190, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_Add_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_TransformLocation_ReturnValue3) == 0x00019C, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_TransformLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5) == 0x0001A8, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_OutHit) == 0x0001B0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_OutHit' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_ReturnValue) == 0x000238, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_K2_GetActorLocation_ReturnValue4) == 0x00023C, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_K2_GetActorLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_Add_VectorVector_ReturnValue4) == 0x000248, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_Add_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetTransform_ReturnValue4) == 0x000260, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetTransform_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, Temp_object_Variable4) == 0x000290, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_TransformLocation_ReturnValue4) == 0x0002A0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_TransformLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6) == 0x0002B0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_OutHit2) == 0x0002B8, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_OutHit2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_ReturnValue2) == 0x000340, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_K2_GetActorLocation_ReturnValue5) == 0x000344, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_K2_GetActorLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_Add_VectorVector_ReturnValue5) == 0x000350, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_Add_VectorVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetTransform_ReturnValue5) == 0x000360, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetTransform_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_TransformLocation_ReturnValue5) == 0x000390, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_TransformLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_Event_SendActor2) == 0x0003A0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_Event_SendActor2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_Event_AnimSeqName2) == 0x0003A8, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_Event_AnimSeqName2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_Event_EventID2) == 0x0003B0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_Event_EventID2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_Event_Param2) == 0x0003B4, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_Event_Param2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_OutHit3) == 0x0003B8, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_OutHit3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_ReturnValue3) == 0x000440, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000441, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x000442, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x000443, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x000444, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue5) == 0x000445, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue6) == 0x000446, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue7) == 0x000447, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue8) == 0x000448, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue9) == 0x000449, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue10) == 0x00044A, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue11) == 0x00044B, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_Event_SendActor) == 0x000450, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_Event_SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_Event_AnimSeqName) == 0x000458, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_Event_AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_Event_EventID) == 0x000460, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_Event_Param) == 0x000464, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7) == 0x000468, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue12) == 0x000470, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000471, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_NameName_ReturnValue13) == 0x000472, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_NameName_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8) == 0x000478, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000480, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9) == 0x000488, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10) == 0x000490, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_K2_GetActorLocation_ReturnValue6) == 0x000498, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_K2_GetActorLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetTransform_ReturnValue6) == 0x0004B0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetTransform_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_Add_VectorVector_ReturnValue6) == 0x0004E0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_Add_VectorVector_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_TransformLocation_ReturnValue6) == 0x0004EC, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_TransformLocation_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_OutHit4) == 0x0004F8, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_OutHit4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_ReturnValue4) == 0x000580, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresCameraManager_ReturnValue) == 0x000588, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetActiveCamera_ReturnValue) == 0x000590, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetActiveCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetDefaultFieldOfView_ReturnValue) == 0x000598, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetDefaultFieldOfView_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_SpawnTresCameraAnim_ReturnValue2) == 0x0005A0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_SpawnTresCameraAnim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, Temp_object_Variable5) == 0x0005A8, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_OutHit5) == 0x0005B8, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_OutHit5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_ReturnValue5) == 0x000640, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresCameraManager_ReturnValue2) == 0x000648, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresCameraManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetActiveCamera_ReturnValue2) == 0x000650, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetActiveCamera_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_EqualEqual_ObjectObject_ReturnValue3) == 0x000658, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_EqualEqual_ObjectObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_SetTresCameraTransitionParams_ReturnValue3) == 0x00065C, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_SetTresCameraTransitionParams_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_SetTresCameraTransitionParams_ReturnValue4) == 0x000670, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_SetTresCameraTransitionParams_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_SetTresCameraTransitionParams_ReturnValue5) == 0x000684, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_SetTresCameraTransitionParams_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_SetTresCameraTransitionParams_ReturnValue6) == 0x000698, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_SetTresCameraTransitionParams_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_Event_StateID) == 0x0006AC, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_Event_StateID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, K2Node_SwitchEnum_CmpSuccess) == 0x0006AD, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11) == 0x0006B0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_GetLocalTresPlayerPawnBase_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_SpawnTresCameraAnim_ReturnValue3) == 0x0006B8, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_SpawnTresCameraAnim_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, Temp_object_Variable6) == 0x0006C0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_OutHit6) == 0x0006D0, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_OutHit6' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change, CallFunc_BP_TresLineTraceByChannel_ReturnValue6) == 0x000758, "Member 'BP_TresPlayerStateEvent_form_change_C_ExecuteUbergraph_BP_TresPlayerStateEvent_form_change::CallFunc_BP_TresLineTraceByChannel_ReturnValue6' has a wrong offset!");

// Function BP_TresPlayerStateEvent_form_change.BP_TresPlayerStateEvent_form_change_C.ReceivePlayerDtorState
// 0xC000000 (0xC000000 - 0x0000)
struct alignas(0xC000000) BP_TresPlayerStateEvent_form_change_C_ReceivePlayerDtorState final
{
public:
	ETresStateID                                  StateID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_form_change_C_ReceivePlayerDtorState) == 0xC000000, "Wrong alignment on BP_TresPlayerStateEvent_form_change_C_ReceivePlayerDtorState");
static_assert(sizeof(BP_TresPlayerStateEvent_form_change_C_ReceivePlayerDtorState) == 0xC000000, "Wrong size on BP_TresPlayerStateEvent_form_change_C_ReceivePlayerDtorState");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ReceivePlayerDtorState, StateID) == 0x000000, "Member 'BP_TresPlayerStateEvent_form_change_C_ReceivePlayerDtorState::StateID' has a wrong offset!");

// Function BP_TresPlayerStateEvent_form_change.BP_TresPlayerStateEvent_form_change_C.ReceiveAnimNotifyEndBpEvent
// 0x8020800 (0x8020800 - 0x0000)
struct alignas(0x8020800) BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent final
{
public:
	class ATresCharPawnBase*                      SendActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSeqName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETresAnimNotifyBpEventID                      EventID;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong alignment on BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent");
static_assert(sizeof(BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent) == 0x8020800, "Wrong size on BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent, SendActor) == 0x000000, "Member 'BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent::SendActor' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent, AnimSeqName) == 0x000008, "Member 'BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent::AnimSeqName' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent, EventID) == 0x000010, "Member 'BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent::EventID' has a wrong offset!");
static_assert(offsetof(BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent, Param) == 0x000014, "Member 'BP_TresPlayerStateEvent_form_change_C_ReceiveAnimNotifyEndBpEvent::Param' has a wrong offset!");

