#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CriWareRuntime_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class CriWareRuntime.AtomAsrRack
// 0x0008 (0x0048 - 0x0040)
class UAtomAsrRack final : public UObject
{
public:
	int32                                         RackId;                                            // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAtomAsrRack* GetAsrRack(int32 AsrRackId);
	static class UAtomAsrRack* GetDefaultAsrRack();

	void ApplyDspBusSnapshot(const class FString& SnapshotName, int32 Milliseconds);
	void AttachDspBusSetting(const class FString& SettingName);
	void DetachDspBusSetting();
	void SetBusSendLevelByName(const class FString& SourceBusName, const class FString& DestBusName, float Level);
	void SetBusVolumeByName(const class FString& BusName, float Volume);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAsrRack">();
	}
	static class UAtomAsrRack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAsrRack>();
	}
};
static_assert(alignof(UAtomAsrRack) == 0x000008, "Wrong alignment on UAtomAsrRack");
static_assert(sizeof(UAtomAsrRack) == 0x000048, "Wrong size on UAtomAsrRack");
static_assert(offsetof(UAtomAsrRack, RackId) == 0x000040, "Member 'UAtomAsrRack::RackId' has a wrong offset!");

// Class CriWareRuntime.AtomCategory
// 0x0000 (0x0040 - 0x0040)
class UAtomCategory final : public UBlueprintFunctionLibrary
{
public:
	static float GetVolumeByName(const class FString& CategoryName);
	static bool IsPausedByName(const class FString& CategoryName);
	static void PauseByName(const class FString& CategoryName, bool bPause);
	static void SetAisacControlByName(const class FString& CategoryName, const class FString& AisacName, float Value);
	static void SetVolumeByName(const class FString& CategoryName, float Volume);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCategory">();
	}
	static class UAtomCategory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCategory>();
	}
};
static_assert(alignof(UAtomCategory) == 0x000008, "Wrong alignment on UAtomCategory");
static_assert(sizeof(UAtomCategory) == 0x000040, "Wrong size on UAtomCategory");

// Class CriWareRuntime.AtomComponent
// 0x0000 (0x112E9AF0 - 0x112E9AF0)
class UAtomComponent final : public USceneComponent
{
public:
	class USoundAtomCue*                          Sound;                                             // 0x0418(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoDestroy : 1;                                  // 0x0420(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStopWhenOwnerDestroyed : 1;                       // 0x0420(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsUISound : 1;                                    // 0x0420(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultVolume;                                     // 0x0424(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMultipleSoundPlayback;                      // 0x0428(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSoundObject*                       DefaultSoundObject;                                // 0x0430(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultBlockIndex;                                 // 0x0438(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomAisacControlParam>         DefaultAisacControl;                               // 0x0440(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomSelectorParam>             DefaultSelectorLabel;                              // 0x0450(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnAudioFinished;                                   // 0x0460(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_470[0x70];                                     // 0x0470(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverrideAttenuation : 1;                          // 0x04E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      AttenuationSettings;                               // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundAttenuationSettings              AttenuationOverrides;                              // 0x04F0(0x11487DA0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	EAtomComponentStatus GetStatus();
	bool IsPaused();
	bool IsPlaying();
	void OnAudioFinished__DelegateSignature();
	void Pause(bool bPause);
	void Play(float StartTime);
	void SetAisacByName(const class FString& ControlName, float ControlValue);
	void SetBusSendLevel(int32 BusId, float Level);
	void SetBusSendLevelOffset(int32 BusId, float LevelOffset);
	void SetNextBlockIndex(int32 BlockIndex);
	void SetPitch(float Pitch);
	void SetPitchMultiplier(float NewPitchMultiplier);
	void SetSelectorLabel(const class FString& Selector, const class FString& Label);
	void SetSound(class USoundAtomCue* NewSound);
	void SetVolume(float Volume);
	void Stop();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomComponent">();
	}
	static class UAtomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomComponent>();
	}
};
static_assert(alignof(UAtomComponent) == 0x112E9AF0, "Wrong alignment on UAtomComponent");
static_assert(sizeof(UAtomComponent) == 0x112E9AF0, "Wrong size on UAtomComponent");
static_assert(offsetof(UAtomComponent, Sound) == 0x000418, "Member 'UAtomComponent::Sound' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultVolume) == 0x000424, "Member 'UAtomComponent::DefaultVolume' has a wrong offset!");
static_assert(offsetof(UAtomComponent, bEnableMultipleSoundPlayback) == 0x000428, "Member 'UAtomComponent::bEnableMultipleSoundPlayback' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultSoundObject) == 0x000430, "Member 'UAtomComponent::DefaultSoundObject' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultBlockIndex) == 0x000438, "Member 'UAtomComponent::DefaultBlockIndex' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultAisacControl) == 0x000440, "Member 'UAtomComponent::DefaultAisacControl' has a wrong offset!");
static_assert(offsetof(UAtomComponent, DefaultSelectorLabel) == 0x000450, "Member 'UAtomComponent::DefaultSelectorLabel' has a wrong offset!");
static_assert(offsetof(UAtomComponent, OnAudioFinished) == 0x000460, "Member 'UAtomComponent::OnAudioFinished' has a wrong offset!");
static_assert(offsetof(UAtomComponent, AttenuationSettings) == 0x0004E8, "Member 'UAtomComponent::AttenuationSettings' has a wrong offset!");
static_assert(offsetof(UAtomComponent, AttenuationOverrides) == 0x0004F0, "Member 'UAtomComponent::AttenuationOverrides' has a wrong offset!");

// Class CriWareRuntime.AtomListenerFocusPoint
// 0x0000 (0x112E9AF0 - 0x112E9AF0)
class UAtomListenerFocusPoint final : public USceneComponent
{
public:
	float                                         DistanceFocusLevel;                                // 0x0418(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirectionFocusLevel;                               // 0x041C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomListenerFocusPoint">();
	}
	static class UAtomListenerFocusPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomListenerFocusPoint>();
	}
};
static_assert(alignof(UAtomListenerFocusPoint) == 0x112E9AF0, "Wrong alignment on UAtomListenerFocusPoint");
static_assert(sizeof(UAtomListenerFocusPoint) == 0x112E9AF0, "Wrong size on UAtomListenerFocusPoint");
static_assert(offsetof(UAtomListenerFocusPoint, DistanceFocusLevel) == 0x000418, "Member 'UAtomListenerFocusPoint::DistanceFocusLevel' has a wrong offset!");
static_assert(offsetof(UAtomListenerFocusPoint, DirectionFocusLevel) == 0x00041C, "Member 'UAtomListenerFocusPoint::DirectionFocusLevel' has a wrong offset!");

// Class CriWareRuntime.AtomParameter
// 0x0000 (0x1EF72E00 - 0x1EF72E00)
class AAtomParameter final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomParameter">();
	}
	static class AAtomParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomParameter>();
	}
};
static_assert(alignof(AAtomParameter) == 0x1EF72E00, "Wrong alignment on AAtomParameter");
static_assert(sizeof(AAtomParameter) == 0x1EF72E00, "Wrong size on AAtomParameter");

// Class CriWareRuntime.AtomSound
// 0x0000 (0x1EF72E00 - 0x1EF72E00)
class AAtomSound final : public AActor
{
public:
	class UAtomComponent*                         AtomComponent;                                     // 0x03E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSound">();
	}
	static class AAtomSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomSound>();
	}
};
static_assert(alignof(AAtomSound) == 0x1EF72E00, "Wrong alignment on AAtomSound");
static_assert(sizeof(AAtomSound) == 0x1EF72E00, "Wrong size on AAtomSound");
static_assert(offsetof(AAtomSound, AtomComponent) == 0x0003E0, "Member 'AAtomSound::AtomComponent' has a wrong offset!");

// Class CriWareRuntime.AtomSoundData
// 0x0000 (0x1EF72E00 - 0x1EF72E00)
class AAtomSoundData final : public AActor
{
public:
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSoundData">();
	}
	static class AAtomSoundData* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomSoundData>();
	}
};
static_assert(alignof(AAtomSoundData) == 0x1EF72E00, "Wrong alignment on AAtomSoundData");
static_assert(sizeof(AAtomSoundData) == 0x1EF72E00, "Wrong size on AAtomSoundData");
static_assert(offsetof(AAtomSoundData, CueSheet) == 0x0003E0, "Member 'AAtomSoundData::CueSheet' has a wrong offset!");

// Class CriWareRuntime.AtomSoundObject
// 0x0010 (0x0058 - 0x0048)
class UAtomSoundObject final : public UDataAsset
{
public:
	bool                                          EnableVoiceLimitScope;                             // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableCategoryCueLimitScope;                       // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0xE];                                       // 0x004A(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSoundObject">();
	}
	static class UAtomSoundObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSoundObject>();
	}
};
static_assert(alignof(UAtomSoundObject) == 0x000008, "Wrong alignment on UAtomSoundObject");
static_assert(sizeof(UAtomSoundObject) == 0x000058, "Wrong size on UAtomSoundObject");
static_assert(offsetof(UAtomSoundObject, EnableVoiceLimitScope) == 0x000048, "Member 'UAtomSoundObject::EnableVoiceLimitScope' has a wrong offset!");
static_assert(offsetof(UAtomSoundObject, EnableCategoryCueLimitScope) == 0x000049, "Member 'UAtomSoundObject::EnableCategoryCueLimitScope' has a wrong offset!");

// Class CriWareRuntime.AtomStatics
// 0x0000 (0x0040 - 0x0040)
class UAtomStatics final : public UBlueprintFunctionLibrary
{
public:
	static void PauseAudioOutput(bool bPause);
	static void PlaySoundAtLocation(class UObject* WorldContextObject, class USoundAtomCue* Sound, const struct FVector& Location, const struct FRotator& Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, class USoundConcurrency* ConcurrencySettings);
	static class UAtomComponent* PlaySoundAttached(class USoundAtomCue* Sound, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings);
	static class UAtomComponent* SpawnSoundAtLocation(const class UObject* WorldContextObject, class USoundAtomCue* Sound, const struct FVector& Location, const struct FRotator& Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, class USoundConcurrency* ConcurrencySettings);
	static class UAtomComponent* SpawnSoundAttached(class USoundAtomCue* Sound, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation, EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, class USoundConcurrency* ConcurrencySettings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomStatics">();
	}
	static class UAtomStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomStatics>();
	}
};
static_assert(alignof(UAtomStatics) == 0x000008, "Wrong alignment on UAtomStatics");
static_assert(sizeof(UAtomStatics) == 0x000040, "Wrong size on UAtomStatics");

// Class CriWareRuntime.AtomTriggerTableFunctionLibrary
// 0x0000 (0x0040 - 0x0040)
class UAtomTriggerTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetDataTableRowFromName(class UDataTable* Table, class FName RowName, struct FAtomTriggerRow* OutRow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomTriggerTableFunctionLibrary">();
	}
	static class UAtomTriggerTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomTriggerTableFunctionLibrary>();
	}
};
static_assert(alignof(UAtomTriggerTableFunctionLibrary) == 0x000008, "Wrong alignment on UAtomTriggerTableFunctionLibrary");
static_assert(sizeof(UAtomTriggerTableFunctionLibrary) == 0x000040, "Wrong size on UAtomTriggerTableFunctionLibrary");

// Class CriWareRuntime.CriFsLoader
// 0x0000 (0x1EF72E00 - 0x1EF72E00)
class ACriFsLoader final : public AActor
{
public:
	class UCriFsLoaderComponent*                  LoaderComponent;                                   // 0x03E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriFsLoader">();
	}
	static class ACriFsLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACriFsLoader>();
	}
};
static_assert(alignof(ACriFsLoader) == 0x1EF72E00, "Wrong alignment on ACriFsLoader");
static_assert(sizeof(ACriFsLoader) == 0x1EF72E00, "Wrong size on ACriFsLoader");
static_assert(offsetof(ACriFsLoader, LoaderComponent) == 0x0003E0, "Member 'ACriFsLoader::LoaderComponent' has a wrong offset!");

// Class CriWareRuntime.CriFsLoaderComponent
// 0x0000 (0x112E9AF0 - 0x112E9AF0)
class UCriFsLoaderComponent final : public USceneComponent
{
public:
	class FString                                 FilePath;                                          // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnLoadCompleted;                                   // 0x0428(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnLoadError;                                       // 0x0438(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_448[0x48];                                     // 0x0448(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<uint8> GetDataArray();
	ECriFsLoaderStatus GetStatus();
	void Load();
	void OnLoadCompleted__DelegateSignature();
	void OnLoadError__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriFsLoaderComponent">();
	}
	static class UCriFsLoaderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriFsLoaderComponent>();
	}
};
static_assert(alignof(UCriFsLoaderComponent) == 0x112E9AF0, "Wrong alignment on UCriFsLoaderComponent");
static_assert(sizeof(UCriFsLoaderComponent) == 0x112E9AF0, "Wrong size on UCriFsLoaderComponent");
static_assert(offsetof(UCriFsLoaderComponent, FilePath) == 0x000418, "Member 'UCriFsLoaderComponent::FilePath' has a wrong offset!");
static_assert(offsetof(UCriFsLoaderComponent, OnLoadCompleted) == 0x000428, "Member 'UCriFsLoaderComponent::OnLoadCompleted' has a wrong offset!");
static_assert(offsetof(UCriFsLoaderComponent, OnLoadError) == 0x000438, "Member 'UCriFsLoaderComponent::OnLoadError' has a wrong offset!");

// Class CriWareRuntime.CriWareFunctionLibrary
// 0x0000 (0x0040 - 0x0040)
class UCriWareFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetGameVariableByName(const class FString& GameVariableName, float Value);
	static void SetGlobalLabelToSelectorByName(const class FString& SelectorName, const class FString& LabelName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareFunctionLibrary">();
	}
	static class UCriWareFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareFunctionLibrary>();
	}
};
static_assert(alignof(UCriWareFunctionLibrary) == 0x000008, "Wrong alignment on UCriWareFunctionLibrary");
static_assert(sizeof(UCriWareFunctionLibrary) == 0x000040, "Wrong size on UCriWareFunctionLibrary");

// Class CriWareRuntime.CriWareInitializer
// 0x0000 (0x0040 - 0x0040)
class UCriWareInitializer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareInitializer">();
	}
	static class UCriWareInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareInitializer>();
	}
};
static_assert(alignof(UCriWareInitializer) == 0x000008, "Wrong alignment on UCriWareInitializer");
static_assert(sizeof(UCriWareInitializer) == 0x000040, "Wrong size on UCriWareInitializer");

// Class CriWareRuntime.CriWarePluginSettings
// 0x01A8 (0x01E8 - 0x0040)
class UCriWarePluginSettings final : public UObject
{
public:
	bool                                          bNoExistCriWareIni;                                // 0x0040(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ContentDir;                                        // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBinders;                                        // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBinds;                                          // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumLoaders;                                        // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxFiles;                                          // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          OutputsLogFileSystem;                              // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_FileAccessThreadAffinityMask;                  // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x4];                                       // 0x0090(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_DataDecompressionThreadAffinityMask;           // 0x0094(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x4];                                       // 0x0098(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_MemoryFileSystemThreadAffinityMask;            // 0x009C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x4];                                       // 0x00A0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_FileAccessThreadPriority;                      // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x4];                                       // 0x00A8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_DataDecompressionThreadPriority;               // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x4];                                       // 0x00B0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_MemoryFileSystemThreadPriority;                // 0x00B4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x4];                                       // 0x00B8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxVirtualVoices;                                  // 0x00BC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x4];                                       // 0x00C0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          UsesInGamePreview;                                 // 0x00C4(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0x1];                                       // 0x00C5(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          OutputsLogAtom;                                    // 0x00C6(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumStandardMemoryVoices;                           // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardMemoryVoiceNumChannels;                    // 0x00D0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardMemoryVoiceSamplingRate;                   // 0x00D8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumStandardStreamingVoices;                        // 0x00E0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardStreamingVoiceNumChannels;                 // 0x00E8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardStreamingVoiceSamplingRate;                // 0x00F0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AcfFileName;                                       // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceFactor;                                    // 0x0118(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HcaMxVoiceSamplingRate;                            // 0x0120(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumHcaMxMemoryVoices;                              // 0x0128(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HcaMxMemoryVoiceNumChannels;                       // 0x0130(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumHcaMxStreamingVoices;                           // 0x0138(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HcaMxStreamingVoiceNumChannels;                    // 0x0140(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          WASAPI_IsExclusive;                                // 0x0148(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_BitsPerSample;                              // 0x014C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_150[0x4];                                      // 0x0150(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_SamplingRate;                               // 0x0154(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x4];                                      // 0x0158(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_NumChannels;                                // 0x015C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_160[0x4];                                      // 0x0160(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_ServerThreadAffinityMask;                      // 0x0164(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x4];                                      // 0x0168(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_OutputThreadAffinityMask;                      // 0x016C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x4];                                      // 0x0170(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_ServerThreadPriority;                          // 0x0174(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x4];                                      // 0x0178(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_OutputThreadPriority;                          // 0x017C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x4];                                      // 0x0180(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          PS4_UseAudio3d;                                    // 0x0184(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_NumberOfAudio3dMemoryVoices;                   // 0x0188(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_SamplingRateOfAudio3dMemoryVoices;             // 0x0190(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_NumberOfAudio3dStreamingVoices;                // 0x0198(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_SamplingRateOfAudio3dStreamingVoices;          // 0x01A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          InitializeMana;                                    // 0x01A8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x1];                                      // 0x01A9(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          EnableDecodeSkip;                                  // 0x01AA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxDecoderHandles;                                 // 0x01AC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x4];                                      // 0x01B0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxManaBPS;                                        // 0x01B4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B8[0x4];                                      // 0x01B8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          UseH264Decoder;                                    // 0x01BC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BD[0x1];                                      // 0x01BD(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseManaStartupMovies;                             // 0x01BE(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForMoviesToComplete;                          // 0x01BF(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMoviesAreSkippable;                               // 0x01C0(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         StartupMovies;                                     // 0x01C8(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D8[0x10];                                     // 0x01D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWarePluginSettings">();
	}
	static class UCriWarePluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWarePluginSettings>();
	}
};
static_assert(alignof(UCriWarePluginSettings) == 0x000008, "Wrong alignment on UCriWarePluginSettings");
static_assert(sizeof(UCriWarePluginSettings) == 0x0001E8, "Wrong size on UCriWarePluginSettings");
static_assert(offsetof(UCriWarePluginSettings, bNoExistCriWareIni) == 0x000040, "Member 'UCriWarePluginSettings::bNoExistCriWareIni' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, ContentDir) == 0x000048, "Member 'UCriWarePluginSettings::ContentDir' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, NumBinders) == 0x000068, "Member 'UCriWarePluginSettings::NumBinders' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, MaxBinds) == 0x000070, "Member 'UCriWarePluginSettings::MaxBinds' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, NumLoaders) == 0x000078, "Member 'UCriWarePluginSettings::NumLoaders' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, MaxFiles) == 0x000080, "Member 'UCriWarePluginSettings::MaxFiles' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, OutputsLogFileSystem) == 0x000088, "Member 'UCriWarePluginSettings::OutputsLogFileSystem' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_FileAccessThreadAffinityMask) == 0x00008C, "Member 'UCriWarePluginSettings::PS4_FileAccessThreadAffinityMask' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_DataDecompressionThreadAffinityMask) == 0x000094, "Member 'UCriWarePluginSettings::PS4_DataDecompressionThreadAffinityMask' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_MemoryFileSystemThreadAffinityMask) == 0x00009C, "Member 'UCriWarePluginSettings::PS4_MemoryFileSystemThreadAffinityMask' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_FileAccessThreadPriority) == 0x0000A4, "Member 'UCriWarePluginSettings::PS4_FileAccessThreadPriority' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_DataDecompressionThreadPriority) == 0x0000AC, "Member 'UCriWarePluginSettings::PS4_DataDecompressionThreadPriority' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_MemoryFileSystemThreadPriority) == 0x0000B4, "Member 'UCriWarePluginSettings::PS4_MemoryFileSystemThreadPriority' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, MaxVirtualVoices) == 0x0000BC, "Member 'UCriWarePluginSettings::MaxVirtualVoices' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, UsesInGamePreview) == 0x0000C4, "Member 'UCriWarePluginSettings::UsesInGamePreview' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, OutputsLogAtom) == 0x0000C6, "Member 'UCriWarePluginSettings::OutputsLogAtom' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, NumStandardMemoryVoices) == 0x0000C8, "Member 'UCriWarePluginSettings::NumStandardMemoryVoices' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, StandardMemoryVoiceNumChannels) == 0x0000D0, "Member 'UCriWarePluginSettings::StandardMemoryVoiceNumChannels' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, StandardMemoryVoiceSamplingRate) == 0x0000D8, "Member 'UCriWarePluginSettings::StandardMemoryVoiceSamplingRate' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, NumStandardStreamingVoices) == 0x0000E0, "Member 'UCriWarePluginSettings::NumStandardStreamingVoices' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, StandardStreamingVoiceNumChannels) == 0x0000E8, "Member 'UCriWarePluginSettings::StandardStreamingVoiceNumChannels' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, StandardStreamingVoiceSamplingRate) == 0x0000F0, "Member 'UCriWarePluginSettings::StandardStreamingVoiceSamplingRate' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, AcfFileName) == 0x0000F8, "Member 'UCriWarePluginSettings::AcfFileName' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, DistanceFactor) == 0x000118, "Member 'UCriWarePluginSettings::DistanceFactor' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, HcaMxVoiceSamplingRate) == 0x000120, "Member 'UCriWarePluginSettings::HcaMxVoiceSamplingRate' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, NumHcaMxMemoryVoices) == 0x000128, "Member 'UCriWarePluginSettings::NumHcaMxMemoryVoices' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, HcaMxMemoryVoiceNumChannels) == 0x000130, "Member 'UCriWarePluginSettings::HcaMxMemoryVoiceNumChannels' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, NumHcaMxStreamingVoices) == 0x000138, "Member 'UCriWarePluginSettings::NumHcaMxStreamingVoices' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, HcaMxStreamingVoiceNumChannels) == 0x000140, "Member 'UCriWarePluginSettings::HcaMxStreamingVoiceNumChannels' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, WASAPI_IsExclusive) == 0x000148, "Member 'UCriWarePluginSettings::WASAPI_IsExclusive' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, WASAPI_BitsPerSample) == 0x00014C, "Member 'UCriWarePluginSettings::WASAPI_BitsPerSample' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, WASAPI_SamplingRate) == 0x000154, "Member 'UCriWarePluginSettings::WASAPI_SamplingRate' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, WASAPI_NumChannels) == 0x00015C, "Member 'UCriWarePluginSettings::WASAPI_NumChannels' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_ServerThreadAffinityMask) == 0x000164, "Member 'UCriWarePluginSettings::PS4_ServerThreadAffinityMask' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_OutputThreadAffinityMask) == 0x00016C, "Member 'UCriWarePluginSettings::PS4_OutputThreadAffinityMask' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_ServerThreadPriority) == 0x000174, "Member 'UCriWarePluginSettings::PS4_ServerThreadPriority' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_OutputThreadPriority) == 0x00017C, "Member 'UCriWarePluginSettings::PS4_OutputThreadPriority' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_UseAudio3d) == 0x000184, "Member 'UCriWarePluginSettings::PS4_UseAudio3d' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_NumberOfAudio3dMemoryVoices) == 0x000188, "Member 'UCriWarePluginSettings::PS4_NumberOfAudio3dMemoryVoices' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_SamplingRateOfAudio3dMemoryVoices) == 0x000190, "Member 'UCriWarePluginSettings::PS4_SamplingRateOfAudio3dMemoryVoices' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_NumberOfAudio3dStreamingVoices) == 0x000198, "Member 'UCriWarePluginSettings::PS4_NumberOfAudio3dStreamingVoices' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, PS4_SamplingRateOfAudio3dStreamingVoices) == 0x0001A0, "Member 'UCriWarePluginSettings::PS4_SamplingRateOfAudio3dStreamingVoices' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, InitializeMana) == 0x0001A8, "Member 'UCriWarePluginSettings::InitializeMana' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, EnableDecodeSkip) == 0x0001AA, "Member 'UCriWarePluginSettings::EnableDecodeSkip' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, MaxDecoderHandles) == 0x0001AC, "Member 'UCriWarePluginSettings::MaxDecoderHandles' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, MaxManaBPS) == 0x0001B4, "Member 'UCriWarePluginSettings::MaxManaBPS' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, UseH264Decoder) == 0x0001BC, "Member 'UCriWarePluginSettings::UseH264Decoder' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, bUseManaStartupMovies) == 0x0001BE, "Member 'UCriWarePluginSettings::bUseManaStartupMovies' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, bWaitForMoviesToComplete) == 0x0001BF, "Member 'UCriWarePluginSettings::bWaitForMoviesToComplete' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, bMoviesAreSkippable) == 0x0001C0, "Member 'UCriWarePluginSettings::bMoviesAreSkippable' has a wrong offset!");
static_assert(offsetof(UCriWarePluginSettings, StartupMovies) == 0x0001C8, "Member 'UCriWarePluginSettings::StartupMovies' has a wrong offset!");

// Class CriWareRuntime.ManaComponent
// 0x0000 (0xD38D - 0xD38D)
class UManaComponent final : public UActorComponent
{
public:
	class UManaTexture*                           Movie;                                             // 0x0200(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0208(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FManaEventPointInfo& EventPointInfo)> OnEventPoint;                                      // 0x0210(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSubtitlesEnabled;                                 // 0x0220(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubtitlesChannel;                                  // 0x0224(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EManaSubtitlesEncoding                        SubtitlesEncoding;                                 // 0x0228(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnSubtitleChanged;                                 // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0x60];                                     // 0x0240(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeSubtitlesChannel(int32 Channel);
	void EnableSubtitles(bool bEnable);
	int32 GetFrameNumber();
	EManaComponentStatus GetStatus();
	class UTexture* GetTexture();
	float GetTime();
	float GetVolume();
	bool IsPaused();
	void OnEventPoint__DelegateSignature(const struct FManaEventPointInfo& EventPointInfo);
	void OnSubtitleChanged__DelegateSignature(const class FText& Subtitle);
	void Pause(bool bPause);
	void Play();
	void Prepare();
	void ResetCachedData();
	void SeekToPosition(int32 FrameNumber);
	void SetCachedData(const TArray<uint8>& DataArray);
	void SetTexture(class UManaTexture* Texture);
	void SetVolume(float Volume);
	void Stop();
	void StopAndWaitCompletion();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ManaComponent">();
	}
	static class UManaComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UManaComponent>();
	}
};
static_assert(alignof(UManaComponent) == 0x00D38D, "Wrong alignment on UManaComponent");
static_assert(sizeof(UManaComponent) == 0x00D38D, "Wrong size on UManaComponent");
static_assert(offsetof(UManaComponent, Movie) == 0x000200, "Member 'UManaComponent::Movie' has a wrong offset!");
static_assert(offsetof(UManaComponent, bLoop) == 0x000208, "Member 'UManaComponent::bLoop' has a wrong offset!");
static_assert(offsetof(UManaComponent, OnEventPoint) == 0x000210, "Member 'UManaComponent::OnEventPoint' has a wrong offset!");
static_assert(offsetof(UManaComponent, bSubtitlesEnabled) == 0x000220, "Member 'UManaComponent::bSubtitlesEnabled' has a wrong offset!");
static_assert(offsetof(UManaComponent, SubtitlesChannel) == 0x000224, "Member 'UManaComponent::SubtitlesChannel' has a wrong offset!");
static_assert(offsetof(UManaComponent, SubtitlesEncoding) == 0x000228, "Member 'UManaComponent::SubtitlesEncoding' has a wrong offset!");
static_assert(offsetof(UManaComponent, OnSubtitleChanged) == 0x000230, "Member 'UManaComponent::OnSubtitleChanged' has a wrong offset!");

// Class CriWareRuntime.ManaComponentTexture
// 0x0000 (0x112E8D20 - 0x112E8D20)
class UManaComponentTexture final : public UTexture
{
public:
	int32                                         SizeX;                                             // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SizeY;                                             // 0x00FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  Format;                                            // 0x0100(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EManaComponentTextureType                     ComponentType;                                     // 0x0101(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressX;                                          // 0x0102(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x0103(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0xC];                                      // 0x0104(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ManaComponentTexture">();
	}
	static class UManaComponentTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UManaComponentTexture>();
	}
};
static_assert(alignof(UManaComponentTexture) == 0x112E8D20, "Wrong alignment on UManaComponentTexture");
static_assert(sizeof(UManaComponentTexture) == 0x112E8D20, "Wrong size on UManaComponentTexture");
static_assert(offsetof(UManaComponentTexture, SizeX) == 0x0000F8, "Member 'UManaComponentTexture::SizeX' has a wrong offset!");
static_assert(offsetof(UManaComponentTexture, SizeY) == 0x0000FC, "Member 'UManaComponentTexture::SizeY' has a wrong offset!");
static_assert(offsetof(UManaComponentTexture, Format) == 0x000100, "Member 'UManaComponentTexture::Format' has a wrong offset!");
static_assert(offsetof(UManaComponentTexture, ComponentType) == 0x000101, "Member 'UManaComponentTexture::ComponentType' has a wrong offset!");
static_assert(offsetof(UManaComponentTexture, AddressX) == 0x000102, "Member 'UManaComponentTexture::AddressX' has a wrong offset!");
static_assert(offsetof(UManaComponentTexture, AddressY) == 0x000103, "Member 'UManaComponentTexture::AddressY' has a wrong offset!");

// Class CriWareRuntime.ManaTexture
// 0x2160 (0x112EAE80 - 0x112E8D20)
class UManaTexture final : public UTexture
{
public:
	class FString                                 MovieFilePath;                                     // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FManaVideoTrackInfo>            VideoTrackInfo;                                    // 0x0108(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FManaEventPointInfo>            EventPointInfo;                                    // 0x0118(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         NumSubtitleChannels;                               // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
