#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: G_TresPrizeGimmickSkeletalBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TresGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass g_TresPrizeGimmickSkeletalBase.g_TresPrizeGimmickSkeletalBase_C
// 0x0000 (0x1EF72E00 - 0x1EF72E00)
#pragma pack(push, 0x1)
class alignas(0x1EF72E00) AG_TresPrizeGimmickSkeletalBase_C : public ATresGimmickPrizeGimmickSkeletalBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D0(0x6F26)(Transient, DuplicateTransient)
	class UTresGimmickHitCountComponent*          TresGimmickHitCount;                               // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTresBodyCollPrimitive*                 TresBodyCollPrimitive;                             // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTresPrizeGenComponent*                 TresPrizeGen;                                      // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTresLockonTargetComponent*             TresLockonTarget;                                  // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         DestroyGroupGimmicks;                              // 0x06F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         PirzeIndex;                                        // 0x0708(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DestroyDisableBodyCollision;                       // 0x070C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70D[0x3];                                      // 0x070D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   DoReaction;                                        // 0x0710(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void DoReaction__DelegateSignature();
	void ExecuteUbergraph_g_TresPrizeGimmickSkeletalBase(int32 EntryPoint);
	void OnSpawnPrize();
	void ReceiveAnimationEnded(class UAnimationAsset* AnimAsset, bool bInterrupted);
	void OnAnimation();
	void BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_0_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature(class AActor* DamageCauser);
	void BPEV_OnDestroyedGimmickForPlan(bool PlayAnimation);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"g_TresPrizeGimmickSkeletalBase_C">();
	}
	static class AG_TresPrizeGimmickSkeletalBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AG_TresPrizeGimmickSkeletalBase_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AG_TresPrizeGimmickSkeletalBase_C) == 0x1EF72E00, "Wrong alignment on AG_TresPrizeGimmickSkeletalBase_C");
static_assert(sizeof(AG_TresPrizeGimmickSkeletalBase_C) == 0x1EF72E00, "Wrong size on AG_TresPrizeGimmickSkeletalBase_C");
static_assert(offsetof(AG_TresPrizeGimmickSkeletalBase_C, UberGraphFrame) == 0x0006D0, "Member 'AG_TresPrizeGimmickSkeletalBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickSkeletalBase_C, TresGimmickHitCount) == 0x0006D8, "Member 'AG_TresPrizeGimmickSkeletalBase_C::TresGimmickHitCount' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickSkeletalBase_C, TresBodyCollPrimitive) == 0x0006E0, "Member 'AG_TresPrizeGimmickSkeletalBase_C::TresBodyCollPrimitive' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickSkeletalBase_C, TresPrizeGen) == 0x0006E8, "Member 'AG_TresPrizeGimmickSkeletalBase_C::TresPrizeGen' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickSkeletalBase_C, TresLockonTarget) == 0x0006F0, "Member 'AG_TresPrizeGimmickSkeletalBase_C::TresLockonTarget' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickSkeletalBase_C, DestroyGroupGimmicks) == 0x0006F8, "Member 'AG_TresPrizeGimmickSkeletalBase_C::DestroyGroupGimmicks' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickSkeletalBase_C, PirzeIndex) == 0x000708, "Member 'AG_TresPrizeGimmickSkeletalBase_C::PirzeIndex' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickSkeletalBase_C, DestroyDisableBodyCollision) == 0x00070C, "Member 'AG_TresPrizeGimmickSkeletalBase_C::DestroyDisableBodyCollision' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickSkeletalBase_C, DoReaction) == 0x000710, "Member 'AG_TresPrizeGimmickSkeletalBase_C::DoReaction' has a wrong offset!");

}

