#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: G_TresPrizeGimmickStaticBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass g_TresPrizeGimmickStaticBase.g_TresPrizeGimmickStaticBase_C
// 0x0000 (0x1EF72E00 - 0x1EF72E00)
#pragma pack(push, 0x1)
class alignas(0x1EF72E00) AG_TresPrizeGimmickStaticBase_C : public ATresGimmickPrizeGimmickStaticBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E8(0x6F26)(Transient, DuplicateTransient)
	class UTresNavModifierComponent*              TresNavModifier;                                   // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTresGimmickHitCountComponent*          TresGimmickHitCount;                               // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTresBodyCollPrimitive*                 TresBodyCollPrimitive;                             // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTresPrizeGenComponent*                 TresPrizeGen;                                      // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTresLockonTargetComponent*             TresLockonTarget;                                  // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USQEX_CapsuleIndirectShadowComponent*> Temp_Indirect_shadow;                              // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class AActor*>                         DestroyGroupGimmicks;                              // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	bool                                          DestroyDisableBodyCollision;                       // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PirzeIndex;                                        // 0x063C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   DoReaction;                                        // 0x0640(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void DoReaction__DelegateSignature();
	void ExecuteUbergraph_g_TresPrizeGimmickStaticBase(int32 EntryPoint);
	void BPEV_OnGimmickInstanceInitialize(ETresGimmickInstanceManagerInstanceState State, ETresGimmickInstanceManagerInstanceState OldState);
	void OnSpawnPrize();
	void ReceiveDestroyed();
	void OnAnimation();
	void BndEvt__TresGimmickHitCount_K2Node_ComponentBoundEvent_4_TresGimmickHitCountComponentOnTresDestroyedGimmickSignature__DelegateSignature(class AActor* DamageCauser);
	void BPEV_OnDestroyedGimmickForPlan(bool PlayAnimation);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"g_TresPrizeGimmickStaticBase_C">();
	}
	static class AG_TresPrizeGimmickStaticBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AG_TresPrizeGimmickStaticBase_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AG_TresPrizeGimmickStaticBase_C) == 0x1EF72E00, "Wrong alignment on AG_TresPrizeGimmickStaticBase_C");
static_assert(sizeof(AG_TresPrizeGimmickStaticBase_C) == 0x1EF72E00, "Wrong size on AG_TresPrizeGimmickStaticBase_C");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, UberGraphFrame) == 0x0005E8, "Member 'AG_TresPrizeGimmickStaticBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, TresNavModifier) == 0x0005F0, "Member 'AG_TresPrizeGimmickStaticBase_C::TresNavModifier' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, TresGimmickHitCount) == 0x0005F8, "Member 'AG_TresPrizeGimmickStaticBase_C::TresGimmickHitCount' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, TresBodyCollPrimitive) == 0x000600, "Member 'AG_TresPrizeGimmickStaticBase_C::TresBodyCollPrimitive' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, TresPrizeGen) == 0x000608, "Member 'AG_TresPrizeGimmickStaticBase_C::TresPrizeGen' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, TresLockonTarget) == 0x000610, "Member 'AG_TresPrizeGimmickStaticBase_C::TresLockonTarget' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, Temp_Indirect_shadow) == 0x000618, "Member 'AG_TresPrizeGimmickStaticBase_C::Temp_Indirect_shadow' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, DestroyGroupGimmicks) == 0x000628, "Member 'AG_TresPrizeGimmickStaticBase_C::DestroyGroupGimmicks' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, DestroyDisableBodyCollision) == 0x000638, "Member 'AG_TresPrizeGimmickStaticBase_C::DestroyDisableBodyCollision' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, PirzeIndex) == 0x00063C, "Member 'AG_TresPrizeGimmickStaticBase_C::PirzeIndex' has a wrong offset!");
static_assert(offsetof(AG_TresPrizeGimmickStaticBase_C, DoReaction) == 0x000640, "Member 'AG_TresPrizeGimmickStaticBase_C::DoReaction' has a wrong offset!");

}

