#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_ex002_Anim

#include "Basic.hpp"

#include "TresGame_structs.hpp"
#include "TresGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass p_ex002_Anim.p_ex002_Anim_C
// 0x2D7A60 (0x115C1550 - 0x112E9AF0)
class UP_ex002_Anim_C final : public UTresPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x6F26)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_26C53761431267AAD9FDACA7A8040C85; // 0x0650(0x112BD)()
	struct FTresAnimNode_SaveCachedPose           TresAnimGraphNode_SaveCachedPose_C93016DE491D58F51504B9B2C12791C4; // 0x0698(0x112BD)()
	struct FTresAnimNode_ExLookAt                 TresAnimGraphNode_ExLookAt_943F743C4C04FDA316CCB8A6360F5851; // 0x06E0(0x1149AB00)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_C677BDB542AD217283A164BED7C6C728; // 0x0838(0x11498FB0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7FDE4CD84FD8A89B5F17A0AE5DC0A996; // 0x08F0(0x11498FB0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C9412476443C721B5092AC946D7F79DD; // 0x09A8(0x1129E)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_DCA6E56547DBEF1D0E46878EF7A6870B; // 0x09F0(0x112BD)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_4D5137F04FE022E262A823836C092CF2; // 0x0A38(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9836E64841B9CC1B70F9909D0BC0E20F; // 0x0A70(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_9385E5E94A5F6C3B485C10ADCDFDC9AF; // 0x0AD0(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_EF4DAAA540C91D218C8D85A70A2D7BE8; // 0x0B08(0x115C1550)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_A3442A7649807BD339118E84F1793508; // 0x0B68(0x112E8D20)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_F688CF8A42073155C0F99A8E772C258B; // 0x0C48(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_993DBEB84E9AE3FA75EE739DABD7A0CC; // 0x0C80(0x115C1550)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_E2101785420BFAFBCED3268EE4BC24DE; // 0x0CE0(0x115C1550)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_76DB08E7491EE01B6ABD108780B7DC18; // 0x0D40(0x0038)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_C63C747B4C4D6BE5AA9DD3BC47BADDBC; // 0x0D78(0x11498FB0)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_64517ABB4F42F29500702EB19B1D97EA; // 0x0DF0(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6FA2F0C742C2635EDB1DE182ADCE6F29; // 0x0E28(0x115C1550)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_A2235256438A97A6D0ED59832BD60FB3; // 0x0E88(0x112E8D20)()
	struct FTresAnimNode_UseCachedPose            TresAnimGraphNode_UseCachedPose_334FAEC64356355A6D62579715D4B6EF; // 0x0F68(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6065D3D94AC42C63F9D28E914816CB57; // 0x0FA0(0x115C1550)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_287BE03F467A8DA2014698987CB661CD; // 0x1000(0x112E8D20)()
	float                                         NewVar_0;                                          // 0x10E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_p_ex002_Anim(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex002_Anim_AnimGraphNode_LayeredBoneBlend_A2235256438A97A6D0ED59832BD60FB3();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex002_Anim_TresAnimGraphNode_ExLookAt_943F743C4C04FDA316CCB8A6360F5851();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex002_Anim_AnimGraphNode_ModifyBone_C677BDB542AD217283A164BED7C6C728();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex002_Anim_AnimGraphNode_ModifyBone_7FDE4CD84FD8A89B5F17A0AE5DC0A996();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex002_Anim_AnimGraphNode_LayeredBoneBlend_A3442A7649807BD339118E84F1793508();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex002_Anim_AnimGraphNode_TwoWayBlend_C63C747B4C4D6BE5AA9DD3BC47BADDBC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_p_ex002_Anim_AnimGraphNode_LayeredBoneBlend_287BE03F467A8DA2014698987CB661CD();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"p_ex002_Anim_C">();
	}
	static class UP_ex002_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UP_ex002_Anim_C>();
	}
};
static_assert(alignof(UP_ex002_Anim_C) == 0x115C1550, "Wrong alignment on UP_ex002_Anim_C");
static_assert(sizeof(UP_ex002_Anim_C) == 0x115C1550, "Wrong size on UP_ex002_Anim_C");
static_assert(offsetof(UP_ex002_Anim_C, UberGraphFrame) == 0x000648, "Member 'UP_ex002_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_Root_26C53761431267AAD9FDACA7A8040C85) == 0x000650, "Member 'UP_ex002_Anim_C::AnimGraphNode_Root_26C53761431267AAD9FDACA7A8040C85' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, TresAnimGraphNode_SaveCachedPose_C93016DE491D58F51504B9B2C12791C4) == 0x000698, "Member 'UP_ex002_Anim_C::TresAnimGraphNode_SaveCachedPose_C93016DE491D58F51504B9B2C12791C4' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, TresAnimGraphNode_ExLookAt_943F743C4C04FDA316CCB8A6360F5851) == 0x0006E0, "Member 'UP_ex002_Anim_C::TresAnimGraphNode_ExLookAt_943F743C4C04FDA316CCB8A6360F5851' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_ModifyBone_C677BDB542AD217283A164BED7C6C728) == 0x000838, "Member 'UP_ex002_Anim_C::AnimGraphNode_ModifyBone_C677BDB542AD217283A164BED7C6C728' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_ModifyBone_7FDE4CD84FD8A89B5F17A0AE5DC0A996) == 0x0008F0, "Member 'UP_ex002_Anim_C::AnimGraphNode_ModifyBone_7FDE4CD84FD8A89B5F17A0AE5DC0A996' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_ComponentToLocalSpace_C9412476443C721B5092AC946D7F79DD) == 0x0009A8, "Member 'UP_ex002_Anim_C::AnimGraphNode_ComponentToLocalSpace_C9412476443C721B5092AC946D7F79DD' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_LocalToComponentSpace_DCA6E56547DBEF1D0E46878EF7A6870B) == 0x0009F0, "Member 'UP_ex002_Anim_C::AnimGraphNode_LocalToComponentSpace_DCA6E56547DBEF1D0E46878EF7A6870B' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, TresAnimGraphNode_UseCachedPose_4D5137F04FE022E262A823836C092CF2) == 0x000A38, "Member 'UP_ex002_Anim_C::TresAnimGraphNode_UseCachedPose_4D5137F04FE022E262A823836C092CF2' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_Slot_9836E64841B9CC1B70F9909D0BC0E20F) == 0x000A70, "Member 'UP_ex002_Anim_C::AnimGraphNode_Slot_9836E64841B9CC1B70F9909D0BC0E20F' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, TresAnimGraphNode_UseCachedPose_9385E5E94A5F6C3B485C10ADCDFDC9AF) == 0x000AD0, "Member 'UP_ex002_Anim_C::TresAnimGraphNode_UseCachedPose_9385E5E94A5F6C3B485C10ADCDFDC9AF' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_Slot_EF4DAAA540C91D218C8D85A70A2D7BE8) == 0x000B08, "Member 'UP_ex002_Anim_C::AnimGraphNode_Slot_EF4DAAA540C91D218C8D85A70A2D7BE8' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_LayeredBoneBlend_A3442A7649807BD339118E84F1793508) == 0x000B68, "Member 'UP_ex002_Anim_C::AnimGraphNode_LayeredBoneBlend_A3442A7649807BD339118E84F1793508' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, TresAnimGraphNode_UseCachedPose_F688CF8A42073155C0F99A8E772C258B) == 0x000C48, "Member 'UP_ex002_Anim_C::TresAnimGraphNode_UseCachedPose_F688CF8A42073155C0F99A8E772C258B' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_Slot_993DBEB84E9AE3FA75EE739DABD7A0CC) == 0x000C80, "Member 'UP_ex002_Anim_C::AnimGraphNode_Slot_993DBEB84E9AE3FA75EE739DABD7A0CC' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_Slot_E2101785420BFAFBCED3268EE4BC24DE) == 0x000CE0, "Member 'UP_ex002_Anim_C::AnimGraphNode_Slot_E2101785420BFAFBCED3268EE4BC24DE' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, TresAnimGraphNode_UseCachedPose_76DB08E7491EE01B6ABD108780B7DC18) == 0x000D40, "Member 'UP_ex002_Anim_C::TresAnimGraphNode_UseCachedPose_76DB08E7491EE01B6ABD108780B7DC18' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_TwoWayBlend_C63C747B4C4D6BE5AA9DD3BC47BADDBC) == 0x000D78, "Member 'UP_ex002_Anim_C::AnimGraphNode_TwoWayBlend_C63C747B4C4D6BE5AA9DD3BC47BADDBC' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, TresAnimGraphNode_UseCachedPose_64517ABB4F42F29500702EB19B1D97EA) == 0x000DF0, "Member 'UP_ex002_Anim_C::TresAnimGraphNode_UseCachedPose_64517ABB4F42F29500702EB19B1D97EA' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_Slot_6FA2F0C742C2635EDB1DE182ADCE6F29) == 0x000E28, "Member 'UP_ex002_Anim_C::AnimGraphNode_Slot_6FA2F0C742C2635EDB1DE182ADCE6F29' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_LayeredBoneBlend_A2235256438A97A6D0ED59832BD60FB3) == 0x000E88, "Member 'UP_ex002_Anim_C::AnimGraphNode_LayeredBoneBlend_A2235256438A97A6D0ED59832BD60FB3' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, TresAnimGraphNode_UseCachedPose_334FAEC64356355A6D62579715D4B6EF) == 0x000F68, "Member 'UP_ex002_Anim_C::TresAnimGraphNode_UseCachedPose_334FAEC64356355A6D62579715D4B6EF' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_Slot_6065D3D94AC42C63F9D28E914816CB57) == 0x000FA0, "Member 'UP_ex002_Anim_C::AnimGraphNode_Slot_6065D3D94AC42C63F9D28E914816CB57' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, AnimGraphNode_LayeredBoneBlend_287BE03F467A8DA2014698987CB661CD) == 0x001000, "Member 'UP_ex002_Anim_C::AnimGraphNode_LayeredBoneBlend_287BE03F467A8DA2014698987CB661CD' has a wrong offset!");
static_assert(offsetof(UP_ex002_Anim_C, NewVar_0) == 0x0010E0, "Member 'UP_ex002_Anim_C::NewVar_0' has a wrong offset!");

}

