#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_Beastmaster_Enrage_Base

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_Beastmaster_Enrage_Base.A_Beastmaster_Enrage_Base_C
// 0x0028 (0x0290 - 0x0268)
class UA_Beastmaster_Enrage_Base_C : public UOakAction_Anim_ActionAbility_Pet_Jabbermon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               PreTeleportFX;                                     // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PetSpawnLoc;                                       // 0x0278(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPPetEnrageRift_C*                     Rift;                                              // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_A_Beastmaster_Enrage_Base(int32 EntryPoint);
	void Notify_CS_FoV();
	void Notify_CS_Pitch();
	void Notify_Rumble();
	void OnEnd(EGbxActionEndState ActionEndState, class AActor* Actor);
	void OnBegin(class AActor* Actor);
	void Notify_SkillEnd();
	void Notify_Skill();
	void DoPreTeleportEffects();
	void GetPetSpawnLoc(struct FVector* Res);
	void InitRegisterProperties();
	void GetEnrageRiftActorClass(class UClass** Res);
	void FirePetSummonStarted();

	void GetOwnerPet(class AOakCharacter** Res) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"A_Beastmaster_Enrage_Base_C">();
	}
	static class UA_Beastmaster_Enrage_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UA_Beastmaster_Enrage_Base_C>();
	}
};
static_assert(alignof(UA_Beastmaster_Enrage_Base_C) == 0x000008, "Wrong alignment on UA_Beastmaster_Enrage_Base_C");
static_assert(sizeof(UA_Beastmaster_Enrage_Base_C) == 0x000290, "Wrong size on UA_Beastmaster_Enrage_Base_C");
static_assert(offsetof(UA_Beastmaster_Enrage_Base_C, UberGraphFrame) == 0x000268, "Member 'UA_Beastmaster_Enrage_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UA_Beastmaster_Enrage_Base_C, PreTeleportFX) == 0x000270, "Member 'UA_Beastmaster_Enrage_Base_C::PreTeleportFX' has a wrong offset!");
static_assert(offsetof(UA_Beastmaster_Enrage_Base_C, PetSpawnLoc) == 0x000278, "Member 'UA_Beastmaster_Enrage_Base_C::PetSpawnLoc' has a wrong offset!");
static_assert(offsetof(UA_Beastmaster_Enrage_Base_C, Rift) == 0x000288, "Member 'UA_Beastmaster_Enrage_Base_C::Rift' has a wrong offset!");

}

