#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_HeavyGunner_JetJump

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function A_HeavyGunner_JetJump.A_HeavyGunner_JetJump_C.ExecuteUbergraph_A_HeavyGunner_JetJump
// 0x0068 (0x0068 - 0x0000)
struct A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared;             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared1;            // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared2;            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump) == 0x000008, "Wrong alignment on A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump");
static_assert(sizeof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump) == 0x000068, "Wrong size on A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, EntryPoint) == 0x000000, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, K2Node_Event_ActionEndState) == 0x000004, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, K2Node_Event_Actor) == 0x000008, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, K2Node_DynamicCast_AsBPI_Heavy_Shared) == 0x000018, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::K2Node_DynamicCast_AsBPI_Heavy_Shared' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, K2Node_DynamicCast_AsBPI_Heavy_Shared1) == 0x000030, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::K2Node_DynamicCast_AsBPI_Heavy_Shared1' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, K2Node_DynamicCast_bSuccess1) == 0x000040, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, K2Node_Event_Actor1) == 0x000048, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, K2Node_DynamicCast_AsBPI_Heavy_Shared2) == 0x000050, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::K2Node_DynamicCast_AsBPI_Heavy_Shared2' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'A_HeavyGunner_JetJump_C_ExecuteUbergraph_A_HeavyGunner_JetJump::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function A_HeavyGunner_JetJump.A_HeavyGunner_JetJump_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct A_HeavyGunner_JetJump_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_HeavyGunner_JetJump_C_OnEnd) == 0x000008, "Wrong alignment on A_HeavyGunner_JetJump_C_OnEnd");
static_assert(sizeof(A_HeavyGunner_JetJump_C_OnEnd) == 0x000010, "Wrong size on A_HeavyGunner_JetJump_C_OnEnd");
static_assert(offsetof(A_HeavyGunner_JetJump_C_OnEnd, ActionEndState) == 0x000000, "Member 'A_HeavyGunner_JetJump_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(A_HeavyGunner_JetJump_C_OnEnd, Actor) == 0x000008, "Member 'A_HeavyGunner_JetJump_C_OnEnd::Actor' has a wrong offset!");

// Function A_HeavyGunner_JetJump.A_HeavyGunner_JetJump_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_HeavyGunner_JetJump_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_HeavyGunner_JetJump_C_OnBegin) == 0x000008, "Wrong alignment on A_HeavyGunner_JetJump_C_OnBegin");
static_assert(sizeof(A_HeavyGunner_JetJump_C_OnBegin) == 0x000008, "Wrong size on A_HeavyGunner_JetJump_C_OnBegin");
static_assert(offsetof(A_HeavyGunner_JetJump_C_OnBegin, Actor) == 0x000000, "Member 'A_HeavyGunner_JetJump_C_OnBegin::Actor' has a wrong offset!");

}

