#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_HitReact_ServiceBot_Stagger_LeftArm

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function A_HitReact_ServiceBot_Stagger_LeftArm.A_HitReact_ServiceBot_Stagger_LeftArm_C.ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm
// 0x02D0 (0x02D0 - 0x0000)
struct A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0010(0x0218)()
	TScriptInterface<class IBPI_ServiceBot_C>     K2Node_DynamicCast_AsBPI_Service_Bot;              // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x023C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0284(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0290(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x029C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x02B0(0x0018)()
};
static_assert(alignof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm) == 0x000010, "Wrong alignment on A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm");
static_assert(sizeof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm) == 0x0002D0, "Wrong size on A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, EntryPoint) == 0x000000, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, K2Node_Event_Actor) == 0x000008, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_NewDialogContext_ReturnValue) == 0x000010, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, K2Node_DynamicCast_AsBPI_Service_Bot) == 0x000228, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::K2Node_DynamicCast_AsBPI_Service_Bot' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_FinishTriggerDialog_Conversation) == 0x00023C, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_FinishTriggerDialog_SequenceID) == 0x000248, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_FinishTriggerDialog_ReturnValue) == 0x00024C, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_GetActorSocket_ReturnValue) == 0x000250, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_Conv_IntToBool_ReturnValue) == 0x000280, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_BreakTransform_Location) == 0x000284, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_BreakTransform_Rotation) == 0x000290, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_BreakTransform_Scale) == 0x00029C, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0002A8, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm, CallFunc_PostEventAtLocation_ReturnValue) == 0x0002B0, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_ExecuteUbergraph_A_HitReact_ServiceBot_Stagger_LeftArm::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function A_HitReact_ServiceBot_Stagger_LeftArm.A_HitReact_ServiceBot_Stagger_LeftArm_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_HitReact_ServiceBot_Stagger_LeftArm_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_HitReact_ServiceBot_Stagger_LeftArm_C_OnBegin) == 0x000008, "Wrong alignment on A_HitReact_ServiceBot_Stagger_LeftArm_C_OnBegin");
static_assert(sizeof(A_HitReact_ServiceBot_Stagger_LeftArm_C_OnBegin) == 0x000008, "Wrong size on A_HitReact_ServiceBot_Stagger_LeftArm_C_OnBegin");
static_assert(offsetof(A_HitReact_ServiceBot_Stagger_LeftArm_C_OnBegin, Actor) == 0x000000, "Member 'A_HitReact_ServiceBot_Stagger_LeftArm_C_OnBegin::Actor' has a wrong offset!");

}

