#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_IronCub_Stomp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function A_IronCub_Stomp.A_IronCub_Stomp_C.ExecuteUbergraph_A_IronCub_Stomp
// 0x0138 (0x0138 - 0x0000)
struct A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             Temp_struct_Variable1;                             // 0x0098(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue1;                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp) == 0x000008, "Wrong alignment on A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp");
static_assert(sizeof(A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp) == 0x000138, "Wrong size on A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp");
static_assert(offsetof(A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp, EntryPoint) == 0x000000, "Member 'A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp, Temp_struct_Variable) == 0x000008, "Member 'A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp, Temp_struct_Variable1) == 0x000098, "Member 'A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp, CallFunc_K2_GetActor_ReturnValue) == 0x000128, "Member 'A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp, CallFunc_K2_GetActor_ReturnValue1) == 0x000130, "Member 'A_IronCub_Stomp_C_ExecuteUbergraph_A_IronCub_Stomp::CallFunc_K2_GetActor_ReturnValue1' has a wrong offset!");

}

