#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_Lilith_PhasewalkDoor

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function A_Lilith_PhasewalkDoor.A_Lilith_PhasewalkDoor_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_Lilith_PhasewalkDoor_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Lilith_PhasewalkDoor_C_OnBegin) == 0x000008, "Wrong alignment on A_Lilith_PhasewalkDoor_C_OnBegin");
static_assert(sizeof(A_Lilith_PhasewalkDoor_C_OnBegin) == 0x000008, "Wrong size on A_Lilith_PhasewalkDoor_C_OnBegin");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_OnBegin, Actor) == 0x000000, "Member 'A_Lilith_PhasewalkDoor_C_OnBegin::Actor' has a wrong offset!");

// Function A_Lilith_PhasewalkDoor.A_Lilith_PhasewalkDoor_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct A_Lilith_PhasewalkDoor_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Lilith_PhasewalkDoor_C_OnEnd) == 0x000008, "Wrong alignment on A_Lilith_PhasewalkDoor_C_OnEnd");
static_assert(sizeof(A_Lilith_PhasewalkDoor_C_OnEnd) == 0x000010, "Wrong size on A_Lilith_PhasewalkDoor_C_OnEnd");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_OnEnd, ActionEndState) == 0x000000, "Member 'A_Lilith_PhasewalkDoor_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_OnEnd, Actor) == 0x000008, "Member 'A_Lilith_PhasewalkDoor_C_OnEnd::Actor' has a wrong offset!");

// Function A_Lilith_PhasewalkDoor.A_Lilith_PhasewalkDoor_C.ExecuteUbergraph_A_Lilith_PhasewalkDoor
// 0x0068 (0x0068 - 0x0000)
struct A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable1;                             // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_AI_C*                           K2Node_DynamicCast_AsBPChar_AI;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue1;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor) == 0x000008, "Wrong alignment on A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor");
static_assert(sizeof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor) == 0x000068, "Wrong size on A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, EntryPoint) == 0x000000, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, Temp_struct_Variable) == 0x000008, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, Temp_struct_Variable1) == 0x000018, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, Temp_bool_Has_Been_Initd_Variable) == 0x000028, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, Temp_bool_IsClosed_Variable) == 0x000029, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, K2Node_Event_Actor1) == 0x000030, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, K2Node_Event_ActionEndState) == 0x000038, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, K2Node_Event_Actor) == 0x000040, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, K2Node_DynamicCast_AsBPChar_AI) == 0x000048, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::K2Node_DynamicCast_AsBPChar_AI' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, CallFunc_K2Play_ReturnValue) == 0x000058, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::CallFunc_K2Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor, CallFunc_K2Play_ReturnValue1) == 0x000060, "Member 'A_Lilith_PhasewalkDoor_C_ExecuteUbergraph_A_Lilith_PhasewalkDoor::CallFunc_K2Play_ReturnValue1' has a wrong offset!");

}

