#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_Maya_PhaseMove

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function A_Maya_PhaseMove.A_Maya_PhaseMove_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_Maya_PhaseMove_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Maya_PhaseMove_C_OnBegin) == 0x000008, "Wrong alignment on A_Maya_PhaseMove_C_OnBegin");
static_assert(sizeof(A_Maya_PhaseMove_C_OnBegin) == 0x000008, "Wrong size on A_Maya_PhaseMove_C_OnBegin");
static_assert(offsetof(A_Maya_PhaseMove_C_OnBegin, Actor) == 0x000000, "Member 'A_Maya_PhaseMove_C_OnBegin::Actor' has a wrong offset!");

// Function A_Maya_PhaseMove.A_Maya_PhaseMove_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct A_Maya_PhaseMove_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Maya_PhaseMove_C_OnEnd) == 0x000008, "Wrong alignment on A_Maya_PhaseMove_C_OnEnd");
static_assert(sizeof(A_Maya_PhaseMove_C_OnEnd) == 0x000010, "Wrong size on A_Maya_PhaseMove_C_OnEnd");
static_assert(offsetof(A_Maya_PhaseMove_C_OnEnd, ActionEndState) == 0x000000, "Member 'A_Maya_PhaseMove_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_OnEnd, Actor) == 0x000008, "Member 'A_Maya_PhaseMove_C_OnEnd::Actor' has a wrong offset!");

// Function A_Maya_PhaseMove.A_Maya_PhaseMove_C.OnLoop
// 0x0008 (0x0008 - 0x0000)
struct A_Maya_PhaseMove_C_OnLoop final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Maya_PhaseMove_C_OnLoop) == 0x000008, "Wrong alignment on A_Maya_PhaseMove_C_OnLoop");
static_assert(sizeof(A_Maya_PhaseMove_C_OnLoop) == 0x000008, "Wrong size on A_Maya_PhaseMove_C_OnLoop");
static_assert(offsetof(A_Maya_PhaseMove_C_OnLoop, Actor) == 0x000000, "Member 'A_Maya_PhaseMove_C_OnLoop::Actor' has a wrong offset!");

// Function A_Maya_PhaseMove.A_Maya_PhaseMove_C.OnStop
// 0x0008 (0x0008 - 0x0000)
struct A_Maya_PhaseMove_C_OnStop final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Maya_PhaseMove_C_OnStop) == 0x000008, "Wrong alignment on A_Maya_PhaseMove_C_OnStop");
static_assert(sizeof(A_Maya_PhaseMove_C_OnStop) == 0x000008, "Wrong size on A_Maya_PhaseMove_C_OnStop");
static_assert(offsetof(A_Maya_PhaseMove_C_OnStop, Actor) == 0x000000, "Member 'A_Maya_PhaseMove_C_OnStop::Actor' has a wrong offset!");

// Function A_Maya_PhaseMove.A_Maya_PhaseMove_C.ExecuteUbergraph_A_Maya_PhaseMove
// 0x0100 (0x0100 - 0x0000)
struct A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor3;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor2;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_K2_GetCharacter_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Maya_C>           K2Node_DynamicCast_AsBPI_Maya;                     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x0040(0x0018)()
	class ACharacter*                             CallFunc_K2_GetCharacter_ReturnValue1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetMoveTarget_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetMoveTarget_ReturnValue1;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetMoveTarget_ReturnValue2;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue1;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue1;           // 0x00A0(0x0018)()
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue2;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor;                                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetMoveTarget_ReturnValue3;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetMoveTarget_ReturnValue4;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue2;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue2;           // 0x00E0(0x0018)()
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue3;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove) == 0x000008, "Wrong alignment on A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove");
static_assert(sizeof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove) == 0x000100, "Wrong size on A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, EntryPoint) == 0x000000, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, K2Node_Event_Actor3) == 0x000008, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::K2Node_Event_Actor3' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, K2Node_Event_ActionEndState) == 0x000010, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, K2Node_Event_Actor2) == 0x000018, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::K2Node_Event_Actor2' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetCharacter_ReturnValue) == 0x000020, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, K2Node_DynamicCast_AsBPI_Maya) == 0x000028, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::K2Node_DynamicCast_AsBPI_Maya' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_PostAttachedEvent_ReturnValue) == 0x000040, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetCharacter_ReturnValue1) == 0x000058, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetMoveTarget_ReturnValue) == 0x000060, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetMoveTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000068, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000070, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_SpawnEmitterAttached_ReturnValue1) == 0x000078, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_SpawnEmitterAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, K2Node_Event_Actor1) == 0x000080, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetMoveTarget_ReturnValue1) == 0x000088, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetMoveTarget_ReturnValue1' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetMoveTarget_ReturnValue2) == 0x000090, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetMoveTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetRootComponent_ReturnValue1) == 0x000098, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetRootComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_PostAttachedEvent_ReturnValue1) == 0x0000A0, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_PostAttachedEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_SpawnEmitterAttached_ReturnValue2) == 0x0000B8, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_SpawnEmitterAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, K2Node_Event_Actor) == 0x0000C0, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetMoveTarget_ReturnValue3) == 0x0000C8, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetMoveTarget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetMoveTarget_ReturnValue4) == 0x0000D0, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetMoveTarget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_K2_GetRootComponent_ReturnValue2) == 0x0000D8, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_K2_GetRootComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_PostAttachedEvent_ReturnValue2) == 0x0000E0, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_PostAttachedEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove, CallFunc_SpawnEmitterAttached_ReturnValue3) == 0x0000F8, "Member 'A_Maya_PhaseMove_C_ExecuteUbergraph_A_Maya_PhaseMove::CallFunc_SpawnEmitterAttached_ReturnValue3' has a wrong offset!");

}

