#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_Nav_Leap

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function A_Nav_Leap.A_Nav_Leap_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct A_Nav_Leap_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Nav_Leap_C_OnEnd) == 0x000008, "Wrong alignment on A_Nav_Leap_C_OnEnd");
static_assert(sizeof(A_Nav_Leap_C_OnEnd) == 0x000010, "Wrong size on A_Nav_Leap_C_OnEnd");
static_assert(offsetof(A_Nav_Leap_C_OnEnd, ActionEndState) == 0x000000, "Member 'A_Nav_Leap_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(A_Nav_Leap_C_OnEnd, Actor) == 0x000008, "Member 'A_Nav_Leap_C_OnEnd::Actor' has a wrong offset!");

// Function A_Nav_Leap.A_Nav_Leap_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_Nav_Leap_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Nav_Leap_C_OnBegin) == 0x000008, "Wrong alignment on A_Nav_Leap_C_OnBegin");
static_assert(sizeof(A_Nav_Leap_C_OnBegin) == 0x000008, "Wrong size on A_Nav_Leap_C_OnBegin");
static_assert(offsetof(A_Nav_Leap_C_OnBegin, Actor) == 0x000000, "Member 'A_Nav_Leap_C_OnBegin::Actor' has a wrong offset!");

// Function A_Nav_Leap.A_Nav_Leap_C.ExecuteUbergraph_A_Nav_Leap
// 0x0050 (0x0050 - 0x0000)
struct A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x0028(0x0018)()
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap) == 0x000008, "Wrong alignment on A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap");
static_assert(sizeof(A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap) == 0x000050, "Wrong size on A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap");
static_assert(offsetof(A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap, EntryPoint) == 0x000000, "Member 'A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap, K2Node_Event_Actor) == 0x000008, "Member 'A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap, CallFunc_GetObjectName_ReturnValue) == 0x000010, "Member 'A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap, CallFunc_Conv_StringToName_ReturnValue) == 0x000020, "Member 'A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap, CallFunc_PostAttachedEvent_ReturnValue) == 0x000028, "Member 'A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap, K2Node_Event_ActionEndState) == 0x000040, "Member 'A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap, K2Node_Event_Actor1) == 0x000048, "Member 'A_Nav_Leap_C_ExecuteUbergraph_A_Nav_Leap::K2Node_Event_Actor1' has a wrong offset!");

}

