#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_PetSkag_Barf

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function A_PetSkag_Barf.A_PetSkag_Barf_C.ExecuteUbergraph_A_PetSkag_Barf
// 0x0340 (0x0340 - 0x0000)
struct A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFacingInfo                            K2Node_MakeStruct_FacingInfo;                      // 0x0010(0x003C)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0068(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0100(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf) == 0x000010, "Wrong alignment on A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf");
static_assert(sizeof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf) == 0x000340, "Wrong size on A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf");
static_assert(offsetof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf, EntryPoint) == 0x000000, "Member 'A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf, K2Node_Event_Actor) == 0x000008, "Member 'A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf, K2Node_MakeStruct_FacingInfo) == 0x000010, "Member 'A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf::K2Node_MakeStruct_FacingInfo' has a wrong offset!");
static_assert(offsetof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf, Temp_struct_Variable) == 0x000068, "Member 'A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000100, "Member 'A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf, CallFunc_SpawnActorAsync_ReturnValue) == 0x000330, "Member 'A_PetSkag_Barf_C_ExecuteUbergraph_A_PetSkag_Barf::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");

// Function A_PetSkag_Barf.A_PetSkag_Barf_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_PetSkag_Barf_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_PetSkag_Barf_C_OnBegin) == 0x000008, "Wrong alignment on A_PetSkag_Barf_C_OnBegin");
static_assert(sizeof(A_PetSkag_Barf_C_OnBegin) == 0x000008, "Wrong size on A_PetSkag_Barf_C_OnBegin");
static_assert(offsetof(A_PetSkag_Barf_C_OnBegin, Actor) == 0x000000, "Member 'A_PetSkag_Barf_C_OnBegin::Actor' has a wrong offset!");

}

