#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_ServiceBot_Shared_RangedBackup

#include "Basic.hpp"


namespace SDK::Params
{

// Function A_ServiceBot_Shared_RangedBackup.A_ServiceBot_Shared_RangedBackup_C.ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup
// 0x0028 (0x0028 - 0x0000)
struct A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_ServiceBot_C>     K2Node_DynamicCast_AsBPI_Service_Bot;              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup) == 0x000008, "Wrong alignment on A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup");
static_assert(sizeof(A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup) == 0x000028, "Wrong size on A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup");
static_assert(offsetof(A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup, EntryPoint) == 0x000000, "Member 'A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup, K2Node_Event_Actor) == 0x000008, "Member 'A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup, K2Node_DynamicCast_AsBPI_Service_Bot) == 0x000010, "Member 'A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup::K2Node_DynamicCast_AsBPI_Service_Bot' has a wrong offset!");
static_assert(offsetof(A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'A_ServiceBot_Shared_RangedBackup_C_ExecuteUbergraph_A_ServiceBot_Shared_RangedBackup::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function A_ServiceBot_Shared_RangedBackup.A_ServiceBot_Shared_RangedBackup_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_ServiceBot_Shared_RangedBackup_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_ServiceBot_Shared_RangedBackup_C_OnBegin) == 0x000008, "Wrong alignment on A_ServiceBot_Shared_RangedBackup_C_OnBegin");
static_assert(sizeof(A_ServiceBot_Shared_RangedBackup_C_OnBegin) == 0x000008, "Wrong size on A_ServiceBot_Shared_RangedBackup_C_OnBegin");
static_assert(offsetof(A_ServiceBot_Shared_RangedBackup_C_OnBegin, Actor) == 0x000000, "Member 'A_ServiceBot_Shared_RangedBackup_C_OnBegin::Actor' has a wrong offset!");

}

