#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_TrooperMelee_Slide_1

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function A_TrooperMelee_Slide_1.A_TrooperMelee_Slide_1_C.ExecuteUbergraph_A_TrooperMelee_Slide_1
// 0x0198 (0x0198 - 0x0000)
struct A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxBlackboardKeySelector              K2Node_MakeStruct_GbxBlackboardKeySelector;        // 0x0020(0x0010)(NoDestructor)
	TScriptInterface<class IBPI_Trooper_C>        K2Node_DynamicCast_AsBPI_Trooper;                  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Trooper_C>        K2Node_DynamicCast_AsBPI_Trooper1;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValueAsEnum_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x0088(0x0018)()
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Trooper_C>        K2Node_DynamicCast_AsBPI_Trooper2;                 // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Trooper_C>        K2Node_DynamicCast_AsBPI_Trooper3;                 // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x00E8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UClass*                                 Temp_class_Variable3;                              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable5;                              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1) == 0x000008, "Wrong alignment on A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1");
static_assert(sizeof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1) == 0x000198, "Wrong size on A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, EntryPoint) == 0x000000, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, Temp_class_Variable) == 0x000008, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, Temp_class_Variable1) == 0x000010, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, Temp_class_Variable2) == 0x000018, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_MakeStruct_GbxBlackboardKeySelector) == 0x000020, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_MakeStruct_GbxBlackboardKeySelector' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_DynamicCast_AsBPI_Trooper) == 0x000030, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_DynamicCast_AsBPI_Trooper' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_Event_Actor1) == 0x000048, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_DynamicCast_AsBPI_Trooper1) == 0x000050, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_DynamicCast_AsBPI_Trooper1' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, CallFunc_GetBlackboard_ReturnValue) == 0x000068, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, CallFunc_GetValueAsEnum_ReturnValue) == 0x000070, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::CallFunc_GetValueAsEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000074, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, CallFunc_GetValidValue_ReturnValue) == 0x000080, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, CallFunc_PostEventAtLocation_ReturnValue) == 0x000088, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_Event_ActionEndState) == 0x0000A0, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_Event_Actor) == 0x0000A8, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, Temp_byte_Variable) == 0x0000B0, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_DynamicCast_AsBPI_Trooper2) == 0x0000B8, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_DynamicCast_AsBPI_Trooper2' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_DynamicCast_bSuccess2) == 0x0000C8, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_DynamicCast_AsBPI_Trooper3) == 0x0000D0, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_DynamicCast_AsBPI_Trooper3' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_DynamicCast_bSuccess3) == 0x0000E0, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, Temp_struct_Variable) == 0x0000E8, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, Temp_class_Variable3) == 0x000178, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, Temp_class_Variable4) == 0x000180, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, Temp_class_Variable5) == 0x000188, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::Temp_class_Variable5' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1, K2Node_Select_Default) == 0x000190, "Member 'A_TrooperMelee_Slide_1_C_ExecuteUbergraph_A_TrooperMelee_Slide_1::K2Node_Select_Default' has a wrong offset!");

// Function A_TrooperMelee_Slide_1.A_TrooperMelee_Slide_1_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct A_TrooperMelee_Slide_1_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_TrooperMelee_Slide_1_C_OnEnd) == 0x000008, "Wrong alignment on A_TrooperMelee_Slide_1_C_OnEnd");
static_assert(sizeof(A_TrooperMelee_Slide_1_C_OnEnd) == 0x000010, "Wrong size on A_TrooperMelee_Slide_1_C_OnEnd");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_OnEnd, ActionEndState) == 0x000000, "Member 'A_TrooperMelee_Slide_1_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_OnEnd, Actor) == 0x000008, "Member 'A_TrooperMelee_Slide_1_C_OnEnd::Actor' has a wrong offset!");

// Function A_TrooperMelee_Slide_1.A_TrooperMelee_Slide_1_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_TrooperMelee_Slide_1_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_TrooperMelee_Slide_1_C_OnBegin) == 0x000008, "Wrong alignment on A_TrooperMelee_Slide_1_C_OnBegin");
static_assert(sizeof(A_TrooperMelee_Slide_1_C_OnBegin) == 0x000008, "Wrong size on A_TrooperMelee_Slide_1_C_OnBegin");
static_assert(offsetof(A_TrooperMelee_Slide_1_C_OnBegin, Actor) == 0x000000, "Member 'A_TrooperMelee_Slide_1_C_OnBegin::Actor' has a wrong offset!");

}

