#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_TrooperMelee_Lunge

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function A_TrooperMelee_Lunge.A_TrooperMelee_Lunge_C.ExecuteUbergraph_A_TrooperMelee_Lunge
// 0x01C8 (0x01C8 - 0x0000)
struct A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0030(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGbxBlackboardKeySelector              K2Node_MakeStruct_GbxBlackboardKeySelector;        // 0x00C0(0x0010)(NoDestructor)
	class AActor*                                 K2Node_Event_Actor1;                               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Trooper_C>        K2Node_DynamicCast_AsBPI_Trooper;                  // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValueAsEnum_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable5;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable1;                             // 0x0110(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Trooper_C>        K2Node_DynamicCast_AsBPI_Trooper1;                 // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge) == 0x000008, "Wrong alignment on A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge");
static_assert(sizeof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge) == 0x0001C8, "Wrong size on A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, EntryPoint) == 0x000000, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, Temp_byte_Variable) == 0x000004, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, Temp_class_Variable) == 0x000008, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, Temp_class_Variable1) == 0x000010, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, Temp_class_Variable2) == 0x000018, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, Temp_class_Variable3) == 0x000020, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, Temp_class_Variable4) == 0x000028, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, Temp_struct_Variable) == 0x000030, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, K2Node_MakeStruct_GbxBlackboardKeySelector) == 0x0000C0, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::K2Node_MakeStruct_GbxBlackboardKeySelector' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, K2Node_Event_Actor1) == 0x0000D0, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, K2Node_DynamicCast_AsBPI_Trooper) == 0x0000D8, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::K2Node_DynamicCast_AsBPI_Trooper' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, CallFunc_GetBlackboard_ReturnValue) == 0x0000F0, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, CallFunc_GetValueAsEnum_ReturnValue) == 0x0000F8, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::CallFunc_GetValueAsEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, CallFunc_GetValidValue_ReturnValue) == 0x0000F9, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, Temp_class_Variable5) == 0x000100, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::Temp_class_Variable5' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, K2Node_Select_Default) == 0x000108, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, Temp_struct_Variable1) == 0x000110, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, K2Node_Event_ActionEndState) == 0x0001A0, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, K2Node_Event_Actor) == 0x0001A8, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, K2Node_DynamicCast_AsBPI_Trooper1) == 0x0001B0, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::K2Node_DynamicCast_AsBPI_Trooper1' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge, K2Node_DynamicCast_bSuccess1) == 0x0001C0, "Member 'A_TrooperMelee_Lunge_C_ExecuteUbergraph_A_TrooperMelee_Lunge::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function A_TrooperMelee_Lunge.A_TrooperMelee_Lunge_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct A_TrooperMelee_Lunge_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_TrooperMelee_Lunge_C_OnEnd) == 0x000008, "Wrong alignment on A_TrooperMelee_Lunge_C_OnEnd");
static_assert(sizeof(A_TrooperMelee_Lunge_C_OnEnd) == 0x000010, "Wrong size on A_TrooperMelee_Lunge_C_OnEnd");
static_assert(offsetof(A_TrooperMelee_Lunge_C_OnEnd, ActionEndState) == 0x000000, "Member 'A_TrooperMelee_Lunge_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Lunge_C_OnEnd, Actor) == 0x000008, "Member 'A_TrooperMelee_Lunge_C_OnEnd::Actor' has a wrong offset!");

// Function A_TrooperMelee_Lunge.A_TrooperMelee_Lunge_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_TrooperMelee_Lunge_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_TrooperMelee_Lunge_C_OnBegin) == 0x000008, "Wrong alignment on A_TrooperMelee_Lunge_C_OnBegin");
static_assert(sizeof(A_TrooperMelee_Lunge_C_OnBegin) == 0x000008, "Wrong size on A_TrooperMelee_Lunge_C_OnBegin");
static_assert(offsetof(A_TrooperMelee_Lunge_C_OnBegin, Actor) == 0x000000, "Member 'A_TrooperMelee_Lunge_C_OnBegin::Actor' has a wrong offset!");

}

