#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_Trooper_Melee

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function A_Trooper_Melee.A_Trooper_Melee_C.ExecuteUbergraph_A_Trooper_Melee
// 0x00A0 (0x00A0 - 0x0000)
struct A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Actor;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee) == 0x000008, "Wrong alignment on A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee");
static_assert(sizeof(A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee) == 0x0000A0, "Wrong size on A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee");
static_assert(offsetof(A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee, EntryPoint) == 0x000000, "Member 'A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee, Temp_struct_Variable) == 0x000008, "Member 'A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee, K2Node_Event_Actor) == 0x000098, "Member 'A_Trooper_Melee_C_ExecuteUbergraph_A_Trooper_Melee::K2Node_Event_Actor' has a wrong offset!");

// Function A_Trooper_Melee.A_Trooper_Melee_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_Trooper_Melee_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Trooper_Melee_C_OnBegin) == 0x000008, "Wrong alignment on A_Trooper_Melee_C_OnBegin");
static_assert(sizeof(A_Trooper_Melee_C_OnBegin) == 0x000008, "Wrong size on A_Trooper_Melee_C_OnBegin");
static_assert(offsetof(A_Trooper_Melee_C_OnBegin, Actor) == 0x000000, "Member 'A_Trooper_Melee_C_OnBegin::Actor' has a wrong offset!");

}

