#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_TrooperMelee_Swing_Random

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_TrooperMelee_Swing_Random.A_TrooperMelee_Swing_Random_C
// 0x0018 (0x0250 - 0x0238)
class UA_TrooperMelee_Swing_Random_C final : public UOakAction_RandomAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 DamageType;                                        // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MySelf;                                            // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_A_TrooperMelee_Swing_Random(int32 EntryPoint);
	void Notify_BoneMod_Disable_End();
	void Notify_BoneMod_Disable_Abort();
	void Notify_BoneMod_Disable_Begin();
	void OnEnd(EGbxActionEndState ActionEndState, class AActor* Actor);
	void Notify_Melee();
	void Notify_Melee_Knockback();
	void OnBegin(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"A_TrooperMelee_Swing_Random_C">();
	}
	static class UA_TrooperMelee_Swing_Random_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UA_TrooperMelee_Swing_Random_C>();
	}
};
static_assert(alignof(UA_TrooperMelee_Swing_Random_C) == 0x000008, "Wrong alignment on UA_TrooperMelee_Swing_Random_C");
static_assert(sizeof(UA_TrooperMelee_Swing_Random_C) == 0x000250, "Wrong size on UA_TrooperMelee_Swing_Random_C");
static_assert(offsetof(UA_TrooperMelee_Swing_Random_C, UberGraphFrame) == 0x000238, "Member 'UA_TrooperMelee_Swing_Random_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UA_TrooperMelee_Swing_Random_C, DamageType) == 0x000240, "Member 'UA_TrooperMelee_Swing_Random_C::DamageType' has a wrong offset!");
static_assert(offsetof(UA_TrooperMelee_Swing_Random_C, MySelf) == 0x000248, "Member 'UA_TrooperMelee_Swing_Random_C::MySelf' has a wrong offset!");

}

