#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_TrooperMelee_Throw

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function A_TrooperMelee_Throw.A_TrooperMelee_Throw_C.ExecuteUbergraph_A_TrooperMelee_Throw
// 0x0270 (0x0270 - 0x0000)
struct A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_AIMeleeHandling_C> K2Node_DynamicCast_AsBPI_AIMelee_Handling;         // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0020(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0238(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_AIMeleeHandling_C> K2Node_DynamicCast_AsBPI_AIMelee_Handling1;        // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw) == 0x000008, "Wrong alignment on A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw");
static_assert(sizeof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw) == 0x000270, "Wrong size on A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, EntryPoint) == 0x000000, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, K2Node_DynamicCast_AsBPI_AIMelee_Handling) == 0x000008, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::K2Node_DynamicCast_AsBPI_AIMelee_Handling' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, CallFunc_NewDialogContext_ReturnValue) == 0x000020, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, CallFunc_FinishTriggerDialog_Conversation) == 0x000238, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, CallFunc_FinishTriggerDialog_SequenceID) == 0x000244, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000248, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, CallFunc_Conv_IntToBool_ReturnValue) == 0x000249, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, K2Node_Event_Actor) == 0x000250, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, K2Node_DynamicCast_AsBPI_AIMelee_Handling1) == 0x000258, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::K2Node_DynamicCast_AsBPI_AIMelee_Handling1' has a wrong offset!");
static_assert(offsetof(A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw, K2Node_DynamicCast_bSuccess1) == 0x000268, "Member 'A_TrooperMelee_Throw_C_ExecuteUbergraph_A_TrooperMelee_Throw::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function A_TrooperMelee_Throw.A_TrooperMelee_Throw_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_TrooperMelee_Throw_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_TrooperMelee_Throw_C_OnBegin) == 0x000008, "Wrong alignment on A_TrooperMelee_Throw_C_OnBegin");
static_assert(sizeof(A_TrooperMelee_Throw_C_OnBegin) == 0x000008, "Wrong size on A_TrooperMelee_Throw_C_OnBegin");
static_assert(offsetof(A_TrooperMelee_Throw_C_OnBegin, Actor) == 0x000000, "Member 'A_TrooperMelee_Throw_C_OnBegin::Actor' has a wrong offset!");

}

