#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_Zero_MeleeAttack

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function A_Zero_MeleeAttack.A_Zero_MeleeAttack_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct A_Zero_MeleeAttack_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Zero_MeleeAttack_C_OnBegin) == 0x000008, "Wrong alignment on A_Zero_MeleeAttack_C_OnBegin");
static_assert(sizeof(A_Zero_MeleeAttack_C_OnBegin) == 0x000008, "Wrong size on A_Zero_MeleeAttack_C_OnBegin");
static_assert(offsetof(A_Zero_MeleeAttack_C_OnBegin, Actor) == 0x000000, "Member 'A_Zero_MeleeAttack_C_OnBegin::Actor' has a wrong offset!");

// Function A_Zero_MeleeAttack.A_Zero_MeleeAttack_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct A_Zero_MeleeAttack_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(A_Zero_MeleeAttack_C_OnEnd) == 0x000008, "Wrong alignment on A_Zero_MeleeAttack_C_OnEnd");
static_assert(sizeof(A_Zero_MeleeAttack_C_OnEnd) == 0x000010, "Wrong size on A_Zero_MeleeAttack_C_OnEnd");
static_assert(offsetof(A_Zero_MeleeAttack_C_OnEnd, ActionEndState) == 0x000000, "Member 'A_Zero_MeleeAttack_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_OnEnd, Actor) == 0x000008, "Member 'A_Zero_MeleeAttack_C_OnEnd::Actor' has a wrong offset!");

// Function A_Zero_MeleeAttack.A_Zero_MeleeAttack_C.ExecuteUbergraph_A_Zero_MeleeAttack
// 0x0150 (0x0150 - 0x0000)
struct A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameResourcePoolManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakAIController*                       CallFunc_GetOakAIController_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameResourcePoolReference             CallFunc_GetResourcePoolByResource_ReturnValue;    // 0x0018(0x0018)(NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTargetingComponent*                    CallFunc_GetTargetingComponent_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBestTargetActor_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_DynamicCast_AsGbx_Character;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0068(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IBPI_NPC_C>            K2Node_DynamicCast_AsBPI_NPC;                      // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_NPC_C>            K2Node_DynamicCast_AsBPI_NPC1;                     // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue1;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack) == 0x000008, "Wrong alignment on A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack");
static_assert(sizeof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack) == 0x000150, "Wrong size on A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, EntryPoint) == 0x000000, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, CallFunc_GetOakAIController_ReturnValue) == 0x000010, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::CallFunc_GetOakAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, CallFunc_GetResourcePoolByResource_ReturnValue) == 0x000018, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::CallFunc_GetResourcePoolByResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, Temp_bool_Has_Been_Initd_Variable) == 0x000030, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, CallFunc_GetTargetingComponent_ReturnValue) == 0x000038, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::CallFunc_GetTargetingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, CallFunc_GetBestTargetActor_ReturnValue) == 0x000040, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::CallFunc_GetBestTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, CallFunc_GetAssociatedCharacter_ReturnValue) == 0x000048, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::CallFunc_GetAssociatedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_DynamicCast_AsGbx_Character) == 0x000050, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_DynamicCast_AsGbx_Character' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_Event_Actor1) == 0x000060, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, Temp_struct_Variable) == 0x000068, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_DynamicCast_AsBPI_NPC) == 0x0000F8, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_DynamicCast_AsBPI_NPC' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_DynamicCast_bSuccess1) == 0x000108, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_DynamicCast_AsBPI_NPC1) == 0x000110, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_DynamicCast_AsBPI_NPC1' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_DynamicCast_bSuccess2) == 0x000120, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, CallFunc_GetAssociatedCharacter_ReturnValue1) == 0x000128, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::CallFunc_GetAssociatedCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_DynamicCast_AsOak_Character) == 0x000130, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_DynamicCast_bSuccess3) == 0x000138, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_Event_ActionEndState) == 0x000139, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, K2Node_Event_Actor) == 0x000140, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack, Temp_bool_IsClosed_Variable) == 0x000148, "Member 'A_Zero_MeleeAttack_C_ExecuteUbergraph_A_Zero_MeleeAttack::Temp_bool_IsClosed_Variable' has a wrong offset!");

}

