#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_CM_Ixora_SRN_L01

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function Ability_CM_Ixora_SRN_L01.Ability_CM_Ixora_SRN_L01_C.ExecuteUbergraph_Ability_CM_Ixora_SRN_L01
// 0x0110 (0x0110 - 0x0000)
struct Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0050(0x0028)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakDamageCauserComponent*              CallFunc_GetComponentByClass_ReturnValue1;         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue2;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ConditionalDamageModifier K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier; // 0x0090(0x0028)(NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue2;         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x00D0(0x0028)(NoDestructor)
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec;             // 0x00F8(0x0018)(NoDestructor)
};
static_assert(alignof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01) == 0x000008, "Wrong alignment on Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01");
static_assert(sizeof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01) == 0x000110, "Wrong size on Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, EntryPoint) == 0x000000, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, K2Node_CustomEvent_ActionAbility) == 0x000020, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::K2Node_CustomEvent_ActionAbility' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, K2Node_CreateDelegate_OutputDelegate1) == 0x000038, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetAbilityOwner_ReturnValue1) == 0x000048, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000050, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetOwner_ReturnValue1) == 0x000078, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetComponentByClass_ReturnValue1) == 0x000080, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetAbilityOwner_ReturnValue2) == 0x000088, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetAbilityOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier) == 0x000090, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetOwner_ReturnValue2) == 0x0000B8, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetComponentByClass_ReturnValue2) == 0x0000C0, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, CallFunc_GetValueOfAttribute_ReturnValue) == 0x0000C8, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x0000D0, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01, K2Node_MakeStruct_OakAbilityTimerSpec) == 0x0000F8, "Member 'Ability_CM_Ixora_SRN_L01_C_ExecuteUbergraph_Ability_CM_Ixora_SRN_L01::K2Node_MakeStruct_OakAbilityTimerSpec' has a wrong offset!");

// Function Ability_CM_Ixora_SRN_L01.Ability_CM_Ixora_SRN_L01_C.SirenIxoraClassMod_OnActionSkillActivated
// 0x0008 (0x0008 - 0x0000)
struct Ability_CM_Ixora_SRN_L01_C_SirenIxoraClassMod_OnActionSkillActivated final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_CM_Ixora_SRN_L01_C_SirenIxoraClassMod_OnActionSkillActivated) == 0x000008, "Wrong alignment on Ability_CM_Ixora_SRN_L01_C_SirenIxoraClassMod_OnActionSkillActivated");
static_assert(sizeof(Ability_CM_Ixora_SRN_L01_C_SirenIxoraClassMod_OnActionSkillActivated) == 0x000008, "Wrong size on Ability_CM_Ixora_SRN_L01_C_SirenIxoraClassMod_OnActionSkillActivated");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_SirenIxoraClassMod_OnActionSkillActivated, ActionAbility) == 0x000000, "Member 'Ability_CM_Ixora_SRN_L01_C_SirenIxoraClassMod_OnActionSkillActivated::ActionAbility' has a wrong offset!");

// Function Ability_CM_Ixora_SRN_L01.Ability_CM_Ixora_SRN_L01_C.CalculateAbilityState
// 0x0018 (0x0018 - 0x0000)
struct Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState final
{
public:
	EGbxAbilityState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAbilityState                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityTimerActive_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAbilityState                              CallFunc_CalculateAbilityState_ReturnValue;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState) == 0x000008, "Wrong alignment on Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState");
static_assert(sizeof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState) == 0x000018, "Wrong size on Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState, ReturnValue) == 0x000000, "Member 'Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState, Temp_bool_Variable) == 0x000001, "Member 'Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState, Temp_byte_Variable) == 0x000002, "Member 'Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState, Temp_byte_Variable1) == 0x000003, "Member 'Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState, CallFunc_IsAbilityTimerActive_ReturnValue) == 0x000010, "Member 'Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState::CallFunc_IsAbilityTimerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState, K2Node_Select_Default) == 0x000012, "Member 'Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState, CallFunc_CalculateAbilityState_ReturnValue) == 0x000013, "Member 'Ability_CM_Ixora_SRN_L01_C_CalculateAbilityState::CallFunc_CalculateAbilityState_ReturnValue' has a wrong offset!");

}

