#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Juju

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Juju.Ability_Juju_C
// 0x0038 (0x0130 - 0x00F8)
class UAbility_Juju_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	class APlayerController*                      PlayerController;                                  // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_SleepingGiant; // 0x0108(0x0028)()

public:
	void ExecuteUbergraph_Ability_Juju(int32 EntryPoint);
	void OnResumed();
	void OnCausedDeath_CE(const class UDamageComponent* Damaged, const struct FCausedDeathDetails& Details);
	void OnCausedDmg_CE(class AActor* DamageInstigator, float Damage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);
	void OnUnregistered();
	void ReloadStartedEvent(class AWeapon* EventWeapon, bool bAutoReload);
	void OnActivated();
	void OnRegistered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Juju_C">();
	}
	static class UAbility_Juju_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Juju_C>();
	}
};
static_assert(alignof(UAbility_Juju_C) == 0x000008, "Wrong alignment on UAbility_Juju_C");
static_assert(sizeof(UAbility_Juju_C) == 0x000130, "Wrong size on UAbility_Juju_C");
static_assert(offsetof(UAbility_Juju_C, UberGraphFrame) == 0x0000F8, "Member 'UAbility_Juju_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbility_Juju_C, PlayerController) == 0x000100, "Member 'UAbility_Juju_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UAbility_Juju_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_SleepingGiant) == 0x000108, "Member 'UAbility_Juju_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_SleepingGiant' has a wrong offset!");

}

