#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_CM_Ixora2_OPE_L01

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Ability_CM_Ixora2_OPE_L01.Ability_CM_Ixora2_OPE_L01_C.ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01
// 0x00E8 (0x00E8 - 0x0000)
struct Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	const class UDamageComponent*                 K2Node_CustomEvent_Damaged;                        // 0x0030(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x0038(0x0068)(ConstParm)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x00C0(0x0028)(NoDestructor)
};
static_assert(alignof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01) == 0x000008, "Wrong alignment on Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01");
static_assert(sizeof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01) == 0x0000E8, "Wrong size on Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, EntryPoint) == 0x000000, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, CallFunc_GetWeapon_ReturnValue) == 0x000008, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, CallFunc_GetDataTableValue_OutValue) == 0x000010, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, CallFunc_GetDataTableValue_ReturnValue) == 0x000014, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, CallFunc_Round_ReturnValue) == 0x00001C, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, K2Node_CustomEvent_Damaged) == 0x000030, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, K2Node_CustomEvent_Details) == 0x000038, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, CallFunc_GetAbilityOwner_ReturnValue) == 0x0000A0, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, K2Node_DynamicCast_AsOak_Character) == 0x0000B0, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x0000C0, "Member 'Ability_CM_Ixora2_OPE_L01_C_ExecuteUbergraph_Ability_CM_Ixora2_OPE_L01::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

// Function Ability_CM_Ixora2_OPE_L01.Ability_CM_Ixora2_OPE_L01_C.CSM_OPE_Ixora2_OnCausedDeath
// 0x0070 (0x0070 - 0x0000)
struct Ability_CM_Ixora2_OPE_L01_C_CSM_OPE_Ixora2_OnCausedDeath final
{
public:
	const class UDamageComponent*                 Damaged;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Ability_CM_Ixora2_OPE_L01_C_CSM_OPE_Ixora2_OnCausedDeath) == 0x000008, "Wrong alignment on Ability_CM_Ixora2_OPE_L01_C_CSM_OPE_Ixora2_OnCausedDeath");
static_assert(sizeof(Ability_CM_Ixora2_OPE_L01_C_CSM_OPE_Ixora2_OnCausedDeath) == 0x000070, "Wrong size on Ability_CM_Ixora2_OPE_L01_C_CSM_OPE_Ixora2_OnCausedDeath");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_CSM_OPE_Ixora2_OnCausedDeath, Damaged) == 0x000000, "Member 'Ability_CM_Ixora2_OPE_L01_C_CSM_OPE_Ixora2_OnCausedDeath::Damaged' has a wrong offset!");
static_assert(offsetof(Ability_CM_Ixora2_OPE_L01_C_CSM_OPE_Ixora2_OnCausedDeath, Details) == 0x000008, "Member 'Ability_CM_Ixora2_OPE_L01_C_CSM_OPE_Ixora2_OnCausedDeath::Details' has a wrong offset!");

}

