#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Hydrafrost

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Ability_Hydrafrost.Ability_Hydrafrost_C.ExecuteUbergraph_Ability_Hydrafrost
// 0x01B0 (0x01B0 - 0x0000)
struct Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakAbilityResourceSpec_WeaponShotModifier K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier; // 0x0048(0x0028)(NoDestructor, ContainsInstancedReference)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0080(0x0028)(NoDestructor)
	struct FOakAbilityResourceSpec_WeaponShotModifier K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier1; // 0x00A8(0x0028)(NoDestructor, ContainsInstancedReference)
	struct FOakAbilityResourceSpec_WeaponShotModifier K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier2; // 0x00D0(0x0028)(NoDestructor, ContainsInstancedReference)
	const class UDamageComponent*                 K2Node_CustomEvent_Damaged;                        // 0x00F8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x0100(0x0068)(ConstParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_EvaluateConditionType_ReturnValue;     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17B[0x5];                                      // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue2;             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakAbilityResourceSpec_WeaponShotModifier K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier3; // 0x0188(0x0028)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost) == 0x000008, "Wrong alignment on Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost");
static_assert(sizeof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost) == 0x0001B0, "Wrong size on Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, EntryPoint) == 0x000000, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_CreateDelegate_OutputDelegate1) == 0x000018, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_GetDataTableValue_OutValue) == 0x000028, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_GetDataTableValue_ReturnValue) == 0x00002C, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_GetAbilityOwner_ReturnValue) == 0x000038, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_GetAbilityOwner_ReturnValue1) == 0x000040, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier) == 0x000048, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_DynamicCast_AsOak_Character) == 0x000070, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000080, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier1) == 0x0000A8, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier1' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier2) == 0x0000D0, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier2' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_CustomEvent_Damaged) == 0x0000F8, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_CustomEvent_Details) == 0x000100, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_GetOwner_ReturnValue) == 0x000168, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_GetObjectClass_ReturnValue) == 0x000170, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_K2_EvaluateConditionType_ReturnValue) == 0x000178, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_K2_EvaluateConditionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_ClassIsChildOf_ReturnValue) == 0x000179, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00017A, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, CallFunc_GetAbilityOwner_ReturnValue2) == 0x000180, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::CallFunc_GetAbilityOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost, K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier3) == 0x000188, "Member 'Ability_Hydrafrost_C_ExecuteUbergraph_Ability_Hydrafrost::K2Node_MakeStruct_OakAbilityResourceSpec_WeaponShotModifier3' has a wrong offset!");

// Function Ability_Hydrafrost.Ability_Hydrafrost_C.OnCauseDeath_CE
// 0x0070 (0x0070 - 0x0000)
struct Ability_Hydrafrost_C_OnCauseDeath_CE final
{
public:
	const class UDamageComponent*                 Damaged;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Ability_Hydrafrost_C_OnCauseDeath_CE) == 0x000008, "Wrong alignment on Ability_Hydrafrost_C_OnCauseDeath_CE");
static_assert(sizeof(Ability_Hydrafrost_C_OnCauseDeath_CE) == 0x000070, "Wrong size on Ability_Hydrafrost_C_OnCauseDeath_CE");
static_assert(offsetof(Ability_Hydrafrost_C_OnCauseDeath_CE, Damaged) == 0x000000, "Member 'Ability_Hydrafrost_C_OnCauseDeath_CE::Damaged' has a wrong offset!");
static_assert(offsetof(Ability_Hydrafrost_C_OnCauseDeath_CE, Details) == 0x000008, "Member 'Ability_Hydrafrost_C_OnCauseDeath_CE::Details' has a wrong offset!");

}

