#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Siren_Grasp_TerrorSkulls

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Siren_Grasp_TerrorSkulls.Ability_Siren_Grasp_TerrorSkulls_C
// 0x0040 (0x0138 - 0x00F8)
class UAbility_Siren_Grasp_TerrorSkulls_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_TestEndGame; // 0x0100(0x0028)()
	class UClass*                                 ActionSkillElement;                                // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Player_C*                       Player;                                            // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls(int32 EntryPoint);
	void GraspedTarget(class AActor* Enemy, EPhaseTranceElementalType Element);
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Siren_Grasp_TerrorSkulls_C">();
	}
	static class UAbility_Siren_Grasp_TerrorSkulls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Siren_Grasp_TerrorSkulls_C>();
	}
};
static_assert(alignof(UAbility_Siren_Grasp_TerrorSkulls_C) == 0x000008, "Wrong alignment on UAbility_Siren_Grasp_TerrorSkulls_C");
static_assert(sizeof(UAbility_Siren_Grasp_TerrorSkulls_C) == 0x000138, "Wrong size on UAbility_Siren_Grasp_TerrorSkulls_C");
static_assert(offsetof(UAbility_Siren_Grasp_TerrorSkulls_C, UberGraphFrame) == 0x0000F8, "Member 'UAbility_Siren_Grasp_TerrorSkulls_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbility_Siren_Grasp_TerrorSkulls_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_TestEndGame) == 0x000100, "Member 'UAbility_Siren_Grasp_TerrorSkulls_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_TestEndGame' has a wrong offset!");
static_assert(offsetof(UAbility_Siren_Grasp_TerrorSkulls_C, ActionSkillElement) == 0x000128, "Member 'UAbility_Siren_Grasp_TerrorSkulls_C::ActionSkillElement' has a wrong offset!");
static_assert(offsetof(UAbility_Siren_Grasp_TerrorSkulls_C, Player) == 0x000130, "Member 'UAbility_Siren_Grasp_TerrorSkulls_C::Player' has a wrong offset!");

}

