#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_RocketBoots

#include "Basic.hpp"

#include "GbxWeapon_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_RocketBoots.Ability_Artifact_RocketBoots_C.ExecuteUbergraph_Ability_Artifact_RocketBoots
// 0x02B0 (0x02B0 - 0x0000)
struct Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FSlideEndedDetails& Details)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnFan_ReturnValue;          // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0060(0x0028)(NoDestructor)
	struct FSlideEndedDetails                     K2Node_CustomEvent_Details;                        // 0x0088(0x0018)(ConstParm, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x00A0(0x0028)(NoDestructor)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00F0(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0110(0x0008)(NoDestructor)
	struct FVector                                CallFunc_GetActorAimViewPoint_OutLocation;         // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorAimViewPoint_OutRotation;         // 0x0124(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue1;            // 0x0130(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x013C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_RunEnvQueryForBestActor_ResultActor;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunEnvQueryForBestActor_ReturnValue;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x0158(0x0140)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0298(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue1;         // 0x02A8(0x0008)(NoDestructor)
};
static_assert(alignof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots) == 0x000008, "Wrong alignment on Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots");
static_assert(sizeof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots) == 0x0002B0, "Wrong size on Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, EntryPoint) == 0x000000, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_GetForwardVector_ReturnValue) == 0x000018, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_GetSocketLocation_ReturnValue) == 0x000024, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, K2Node_CreateDelegate_OutputDelegate1) == 0x000030, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_GeneratePointsOnFan_ReturnValue) == 0x000050, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_GeneratePointsOnFan_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000060, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, K2Node_CustomEvent_Details) == 0x000088, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x0000A0, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_GetValueOfAttribute_ReturnValue) == 0x0000C8, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000CC, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, K2Node_CreateDelegate_OutputDelegate2) == 0x0000D0, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_RandomInteger_ReturnValue) == 0x0000E0, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_BreakTransform_Location) == 0x0000E4, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_BreakTransform_Rotation) == 0x0000F0, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_BreakTransform_Scale) == 0x0000FC, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000108, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000110, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_GetActorAimViewPoint_OutLocation) == 0x000118, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_GetActorAimViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_GetActorAimViewPoint_OutRotation) == 0x000124, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_GetActorAimViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_GetForwardVector_ReturnValue1) == 0x000130, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_GetForwardVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_Add_VectorVector_ReturnValue1) == 0x00013C, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_RunEnvQueryForBestActor_ResultActor) == 0x000148, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_RunEnvQueryForBestActor_ResultActor' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_RunEnvQueryForBestActor_ReturnValue) == 0x000150, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_RunEnvQueryForBestActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, K2Node_MakeStruct_LightProjectileInitializationData) == 0x000158, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, K2Node_CreateDelegate_OutputDelegate3) == 0x000298, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots, CallFunc_K2_SetTimerDelegate_ReturnValue1) == 0x0002A8, "Member 'Ability_Artifact_RocketBoots_C_ExecuteUbergraph_Ability_Artifact_RocketBoots::CallFunc_K2_SetTimerDelegate_ReturnValue1' has a wrong offset!");

// Function Ability_Artifact_RocketBoots.Ability_Artifact_RocketBoots_C.StoppedSliding
// 0x0018 (0x0018 - 0x0000)
struct Ability_Artifact_RocketBoots_C_StoppedSliding final
{
public:
	struct FSlideEndedDetails                     Details;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Ability_Artifact_RocketBoots_C_StoppedSliding) == 0x000008, "Wrong alignment on Ability_Artifact_RocketBoots_C_StoppedSliding");
static_assert(sizeof(Ability_Artifact_RocketBoots_C_StoppedSliding) == 0x000018, "Wrong size on Ability_Artifact_RocketBoots_C_StoppedSliding");
static_assert(offsetof(Ability_Artifact_RocketBoots_C_StoppedSliding, Details) == 0x000000, "Member 'Ability_Artifact_RocketBoots_C_StoppedSliding::Details' has a wrong offset!");

}

