#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_TrashGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Ability_TrashGun.Ability_TrashGun_C.ExecuteUbergraph_Ability_TrashGun
// 0x02B0 (0x02B0 - 0x0000)
struct Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue1;         // 0x0038(0x0008)(NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ConditionalDamageModifier K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier; // 0x0068(0x0028)(NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue2;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec;          // 0x00A8(0x0010)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec1;         // 0x00C8(0x0010)(NoDestructor)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x00D8(0x0038)(NoDestructor)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue1;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0118(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec1;               // 0x0130(0x0038)(NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue3;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue1;             // 0x0170(0x0018)(NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue4;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec2;         // 0x0198(0x0010)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue4;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue2;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec3;         // 0x01B8(0x0010)(NoDestructor)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec2;               // 0x01C8(0x0038)(NoDestructor)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue3;          // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue2;             // 0x0208(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec3;               // 0x0220(0x0038)(NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue2;        // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue3;             // 0x0260(0x0018)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue3;        // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue5;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ConditionalDamageModifier K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier1; // 0x0288(0x0028)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun) == 0x000008, "Wrong alignment on Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun");
static_assert(sizeof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun) == 0x0002B0, "Wrong size on Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, EntryPoint) == 0x000000, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000020, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_K2_SetTimerDelegate_ReturnValue1) == 0x000038, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_K2_SetTimerDelegate_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_RandomBoolWithWeight_ReturnValue1) == 0x000040, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_RandomBoolWithWeight_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetAbilityOwner_ReturnValue) == 0x000048, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_DynamicCast_AsOak_Character) == 0x000058, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier) == 0x000068, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetAbilityOwner_ReturnValue1) == 0x000090, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetOwner_ReturnValue1) == 0x000098, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetAbilityOwner_ReturnValue2) == 0x0000A0, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetAbilityOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_StatusEffectRemoveSpec) == 0x0000A8, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_StatusEffectRemoveSpec' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetOwner_ReturnValue2) == 0x0000B8, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_RemoveStatusEffect_ReturnValue) == 0x0000C0, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_RemoveStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_StatusEffectRemoveSpec1) == 0x0000C8, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_StatusEffectRemoveSpec1' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_StatusEffectSpec) == 0x0000D8, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_RemoveStatusEffect_ReturnValue1) == 0x000110, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_RemoveStatusEffect_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_AddStatusEffect_ReturnValue) == 0x000118, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_StatusEffectSpec1) == 0x000130, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_StatusEffectSpec1' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetAbilityOwner_ReturnValue3) == 0x000168, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetAbilityOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_AddStatusEffect_ReturnValue1) == 0x000170, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_AddStatusEffect_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetOwner_ReturnValue3) == 0x000188, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetAbilityOwner_ReturnValue4) == 0x000190, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetAbilityOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_StatusEffectRemoveSpec2) == 0x000198, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_StatusEffectRemoveSpec2' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetOwner_ReturnValue4) == 0x0001A8, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_RemoveStatusEffect_ReturnValue2) == 0x0001B0, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_RemoveStatusEffect_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_StatusEffectRemoveSpec3) == 0x0001B8, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_StatusEffectRemoveSpec3' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_StatusEffectSpec2) == 0x0001C8, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_StatusEffectSpec2' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_RemoveStatusEffect_ReturnValue3) == 0x000200, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_RemoveStatusEffect_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_AddStatusEffect_ReturnValue2) == 0x000208, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_AddStatusEffect_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_StatusEffectSpec3) == 0x000220, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_StatusEffectSpec3' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_RandomBoolWithWeight_ReturnValue2) == 0x000258, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_RandomBoolWithWeight_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_AddStatusEffect_ReturnValue3) == 0x000260, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_AddStatusEffect_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_RandomBoolWithWeight_ReturnValue3) == 0x000278, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_RandomBoolWithWeight_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, CallFunc_GetAbilityOwner_ReturnValue5) == 0x000280, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::CallFunc_GetAbilityOwner_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun, K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier1) == 0x000288, "Member 'Ability_TrashGun_C_ExecuteUbergraph_Ability_TrashGun::K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier1' has a wrong offset!");

}

