#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_SparkPlug

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_SparkPlug.Ability_Artifact_SparkPlug_C.ExecuteUbergraph_Ability_Artifact_SparkPlug
// 0x05D0 (0x05D0 - 0x0000)
struct Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGroundSlamEndedDetails                K2Node_CustomEvent_Details;                        // 0x0004(0x0008)(ConstParm, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGroundSlamEndedDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0030(0x0028)(NoDestructor)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x00B0(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x02E8(0x0018)()
	class ABPChar_Player_C*                       K2Node_DynamicCast_AsBPChar_Player;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x030C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue1;       // 0x0318(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x0324(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0330(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue1;         // 0x0340(0x0018)()
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0360(0x0030)(IsPlainOldData, NoDestructor)
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest1;      // 0x0390(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue1;             // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug) == 0x000010, "Wrong alignment on Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug");
static_assert(sizeof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug) == 0x0005D0, "Wrong size on Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, EntryPoint) == 0x000000, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, K2Node_CustomEvent_Details) == 0x000004, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000030, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_GetActorForwardVector_ReturnValue) == 0x000058, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000064, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_Add_VectorVector_ReturnValue) == 0x000074, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x0000B0, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_SpawnActorAsync_ReturnValue) == 0x0002E0, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_PostEventAtLocation_ReturnValue) == 0x0002E8, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, K2Node_DynamicCast_AsBPChar_Player) == 0x000300, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::K2Node_DynamicCast_AsBPChar_Player' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x00030C, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_GetActorForwardVector_ReturnValue1) == 0x000318, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_GetActorForwardVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x000324, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_Add_VectorVector_ReturnValue1) == 0x000330, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_PostEventAtLocation_ReturnValue1) == 0x000340, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_PostEventAtLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_MakeTransform_ReturnValue1) == 0x000360, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, K2Node_MakeStruct_GbxSpawnActorAsyncRequest1) == 0x000390, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::K2Node_MakeStruct_GbxSpawnActorAsyncRequest1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug, CallFunc_SpawnActorAsync_ReturnValue1) == 0x0005C0, "Member 'Ability_Artifact_SparkPlug_C_ExecuteUbergraph_Ability_Artifact_SparkPlug::CallFunc_SpawnActorAsync_ReturnValue1' has a wrong offset!");

// Function Ability_Artifact_SparkPlug.Ability_Artifact_SparkPlug_C.SlamEnd
// 0x0008 (0x0008 - 0x0000)
struct Ability_Artifact_SparkPlug_C_SlamEnd final
{
public:
	struct FGroundSlamEndedDetails                Details;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Ability_Artifact_SparkPlug_C_SlamEnd) == 0x000004, "Wrong alignment on Ability_Artifact_SparkPlug_C_SlamEnd");
static_assert(sizeof(Ability_Artifact_SparkPlug_C_SlamEnd) == 0x000008, "Wrong size on Ability_Artifact_SparkPlug_C_SlamEnd");
static_assert(offsetof(Ability_Artifact_SparkPlug_C_SlamEnd, Details) == 0x000000, "Member 'Ability_Artifact_SparkPlug_C_SlamEnd::Details' has a wrong offset!");

}

