#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Hydrafrost

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Hydrafrost.Ability_Hydrafrost_C
// 0x0060 (0x0158 - 0x00F8)
class UAbility_Hydrafrost_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	class UOakDamageCauserComponent*              OakDamageCauser;                                   // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakAbilityResourceController_WeaponShotModifier RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Ability_Frostbite; // 0x0108(0x0028)()
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Frostbite; // 0x0130(0x0028)()

public:
	void ExecuteUbergraph_Ability_Hydrafrost(int32 EntryPoint);
	void AmpBuff_CE();
	void OnActivated();
	void OnCauseDeath_CE(const class UDamageComponent* Damaged, const struct FCausedDeathDetails& Details);
	void OnDeactivated();
	void OnPaused();
	void OnUnregistered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Hydrafrost_C">();
	}
	static class UAbility_Hydrafrost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Hydrafrost_C>();
	}
};
static_assert(alignof(UAbility_Hydrafrost_C) == 0x000008, "Wrong alignment on UAbility_Hydrafrost_C");
static_assert(sizeof(UAbility_Hydrafrost_C) == 0x000158, "Wrong size on UAbility_Hydrafrost_C");
static_assert(offsetof(UAbility_Hydrafrost_C, UberGraphFrame) == 0x0000F8, "Member 'UAbility_Hydrafrost_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbility_Hydrafrost_C, OakDamageCauser) == 0x000100, "Member 'UAbility_Hydrafrost_C::OakDamageCauser' has a wrong offset!");
static_assert(offsetof(UAbility_Hydrafrost_C, RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Ability_Frostbite) == 0x000108, "Member 'UAbility_Hydrafrost_C::RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Ability_Frostbite' has a wrong offset!");
static_assert(offsetof(UAbility_Hydrafrost_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Frostbite) == 0x000130, "Member 'UAbility_Hydrafrost_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Frostbite' has a wrong offset!");

}

