#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_BloodFrenzy

#include "Basic.hpp"

#include "BP_InventoryAbility_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Artifact_BloodFrenzy.Ability_Artifact_BloodFrenzy_C
// 0x0038 (0x0158 - 0x0120)
class UAbility_Artifact_BloodFrenzy_C final : public UBP_InventoryAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Ability_Artifact_BloodFrenzy_C;     // 0x0120(0x0008)(Transient, DuplicateTransient)
	float                                         StatusDuration;                                    // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Artifact_BloodFrenzy; // 0x0130(0x0028)()

public:
	void ExecuteUbergraph_Ability_Artifact_BloodFrenzy(int32 EntryPoint);
	void OnHitEnemy_BloodFrenzy(class AActor* DamageInstigator, float Damage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);
	void OnActivated();
	void Ammo_Return(class AOakCharacter* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Artifact_BloodFrenzy_C">();
	}
	static class UAbility_Artifact_BloodFrenzy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Artifact_BloodFrenzy_C>();
	}
};
static_assert(alignof(UAbility_Artifact_BloodFrenzy_C) == 0x000008, "Wrong alignment on UAbility_Artifact_BloodFrenzy_C");
static_assert(sizeof(UAbility_Artifact_BloodFrenzy_C) == 0x000158, "Wrong size on UAbility_Artifact_BloodFrenzy_C");
static_assert(offsetof(UAbility_Artifact_BloodFrenzy_C, UberGraphFrame_Ability_Artifact_BloodFrenzy_C) == 0x000120, "Member 'UAbility_Artifact_BloodFrenzy_C::UberGraphFrame_Ability_Artifact_BloodFrenzy_C' has a wrong offset!");
static_assert(offsetof(UAbility_Artifact_BloodFrenzy_C, StatusDuration) == 0x000128, "Member 'UAbility_Artifact_BloodFrenzy_C::StatusDuration' has a wrong offset!");
static_assert(offsetof(UAbility_Artifact_BloodFrenzy_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Artifact_BloodFrenzy) == 0x000130, "Member 'UAbility_Artifact_BloodFrenzy_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Artifact_BloodFrenzy' has a wrong offset!");

}

