#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_LastStand

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_LastStand.Ability_Artifact_LastStand_C.ExecuteUbergraph_Ability_Artifact_LastStand
// 0x0110 (0x0110 - 0x0000)
struct Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UDamageComponent* DamageReceiver, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, const struct FReceivedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UDamageComponent*                       K2Node_CustomEvent_DamageReceiver;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_CustomEvent_DamageCauser;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_CustomEvent_Details;                        // 0x0048(0x0058)(ContainsInstancedReference)
	struct FOakAbilityTimerSpec                   K2Node_Event_Spec1;                                // 0x00A0(0x0018)(ConstParm, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x00B8(0x0028)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_Event_Spec;                                 // 0x00E8(0x0018)(ConstParm, NoDestructor)
	struct FOakAbilityTimerResult                 K2Node_Event_Result;                               // 0x0100(0x000C)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand) == 0x000008, "Wrong alignment on Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand");
static_assert(sizeof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand) == 0x000110, "Wrong size on Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, EntryPoint) == 0x000000, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_CustomEvent_DamageReceiver) == 0x000018, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_CustomEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_CustomEvent_Damage) == 0x000020, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_CustomEvent_DamageType) == 0x000028, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_CustomEvent_DamageSource) == 0x000030, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_CustomEvent_InstigatedBy) == 0x000038, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_CustomEvent_DamageCauser) == 0x000040, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_CustomEvent_Details) == 0x000048, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_Event_Spec1) == 0x0000A0, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_Event_Spec1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x0000B8, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E0, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_Event_Spec) == 0x0000E8, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_Event_Spec' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, K2Node_Event_Result) == 0x000100, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x00010C, "Member 'Ability_Artifact_LastStand_C_ExecuteUbergraph_Ability_Artifact_LastStand::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");

// Function Ability_Artifact_LastStand.Ability_Artifact_LastStand_C.OnAbilityTimerEnded
// 0x0028 (0x0028 - 0x0000)
struct Ability_Artifact_LastStand_C_OnAbilityTimerEnded final
{
public:
	struct FOakAbilityTimerSpec                   Spec;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FOakAbilityTimerResult                 Result;                                            // 0x0018(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Ability_Artifact_LastStand_C_OnAbilityTimerEnded) == 0x000008, "Wrong alignment on Ability_Artifact_LastStand_C_OnAbilityTimerEnded");
static_assert(sizeof(Ability_Artifact_LastStand_C_OnAbilityTimerEnded) == 0x000028, "Wrong size on Ability_Artifact_LastStand_C_OnAbilityTimerEnded");
static_assert(offsetof(Ability_Artifact_LastStand_C_OnAbilityTimerEnded, Spec) == 0x000000, "Member 'Ability_Artifact_LastStand_C_OnAbilityTimerEnded::Spec' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_OnAbilityTimerEnded, Result) == 0x000018, "Member 'Ability_Artifact_LastStand_C_OnAbilityTimerEnded::Result' has a wrong offset!");

// Function Ability_Artifact_LastStand.Ability_Artifact_LastStand_C.OnAbilityTimerStarted
// 0x0018 (0x0018 - 0x0000)
struct Ability_Artifact_LastStand_C_OnAbilityTimerStarted final
{
public:
	struct FOakAbilityTimerSpec                   Spec;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Ability_Artifact_LastStand_C_OnAbilityTimerStarted) == 0x000008, "Wrong alignment on Ability_Artifact_LastStand_C_OnAbilityTimerStarted");
static_assert(sizeof(Ability_Artifact_LastStand_C_OnAbilityTimerStarted) == 0x000018, "Wrong size on Ability_Artifact_LastStand_C_OnAbilityTimerStarted");
static_assert(offsetof(Ability_Artifact_LastStand_C_OnAbilityTimerStarted, Spec) == 0x000000, "Member 'Ability_Artifact_LastStand_C_OnAbilityTimerStarted::Spec' has a wrong offset!");

// Function Ability_Artifact_LastStand.Ability_Artifact_LastStand_C.TakeDamage_LastStand
// 0x0088 (0x0088 - 0x0000)
struct Ability_Artifact_LastStand_C_TakeDamage_LastStand final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0030(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Ability_Artifact_LastStand_C_TakeDamage_LastStand) == 0x000008, "Wrong alignment on Ability_Artifact_LastStand_C_TakeDamage_LastStand");
static_assert(sizeof(Ability_Artifact_LastStand_C_TakeDamage_LastStand) == 0x000088, "Wrong size on Ability_Artifact_LastStand_C_TakeDamage_LastStand");
static_assert(offsetof(Ability_Artifact_LastStand_C_TakeDamage_LastStand, DamageReceiver) == 0x000000, "Member 'Ability_Artifact_LastStand_C_TakeDamage_LastStand::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_TakeDamage_LastStand, Damage) == 0x000008, "Member 'Ability_Artifact_LastStand_C_TakeDamage_LastStand::Damage' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_TakeDamage_LastStand, DamageType) == 0x000010, "Member 'Ability_Artifact_LastStand_C_TakeDamage_LastStand::DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_TakeDamage_LastStand, DamageSource) == 0x000018, "Member 'Ability_Artifact_LastStand_C_TakeDamage_LastStand::DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_TakeDamage_LastStand, InstigatedBy) == 0x000020, "Member 'Ability_Artifact_LastStand_C_TakeDamage_LastStand::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_TakeDamage_LastStand, DamageCauser) == 0x000028, "Member 'Ability_Artifact_LastStand_C_TakeDamage_LastStand::DamageCauser' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_TakeDamage_LastStand, Details) == 0x000030, "Member 'Ability_Artifact_LastStand_C_TakeDamage_LastStand::Details' has a wrong offset!");

// Function Ability_Artifact_LastStand.Ability_Artifact_LastStand_C.SetVariables
// 0x0010 (0x0010 - 0x0000)
struct Ability_Artifact_LastStand_C_SetVariables final
{
public:
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue2;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue3;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_Artifact_LastStand_C_SetVariables) == 0x000004, "Wrong alignment on Ability_Artifact_LastStand_C_SetVariables");
static_assert(sizeof(Ability_Artifact_LastStand_C_SetVariables) == 0x000010, "Wrong size on Ability_Artifact_LastStand_C_SetVariables");
static_assert(offsetof(Ability_Artifact_LastStand_C_SetVariables, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000000, "Member 'Ability_Artifact_LastStand_C_SetVariables::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_SetVariables, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000004, "Member 'Ability_Artifact_LastStand_C_SetVariables::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_SetVariables, CallFunc_GetValueOfAttribute_ReturnValue2) == 0x000008, "Member 'Ability_Artifact_LastStand_C_SetVariables::CallFunc_GetValueOfAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_SetVariables, CallFunc_GetValueOfAttribute_ReturnValue3) == 0x00000C, "Member 'Ability_Artifact_LastStand_C_SetVariables::CallFunc_GetValueOfAttribute_ReturnValue3' has a wrong offset!");

// Function Ability_Artifact_LastStand.Ability_Artifact_LastStand_C.LastStandArtifactAbility
// 0x00B8 (0x00B8 - 0x0000)
struct Ability_Artifact_LastStand_C_LastStandArtifactAbility final
{
public:
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec;             // 0x0000(0x0018)(NoDestructor)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec1;            // 0x0020(0x0018)(NoDestructor)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec2;            // 0x0040(0x0018)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue2;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0060(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0098(0x0018)(NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_Artifact_LastStand_C_LastStandArtifactAbility) == 0x000008, "Wrong alignment on Ability_Artifact_LastStand_C_LastStandArtifactAbility");
static_assert(sizeof(Ability_Artifact_LastStand_C_LastStandArtifactAbility) == 0x0000B8, "Wrong size on Ability_Artifact_LastStand_C_LastStandArtifactAbility");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, K2Node_MakeStruct_OakAbilityTimerSpec) == 0x000000, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::K2Node_MakeStruct_OakAbilityTimerSpec' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000018, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, K2Node_MakeStruct_OakAbilityTimerSpec1) == 0x000020, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::K2Node_MakeStruct_OakAbilityTimerSpec1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000038, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, K2Node_MakeStruct_OakAbilityTimerSpec2) == 0x000040, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::K2Node_MakeStruct_OakAbilityTimerSpec2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, CallFunc_GetValueOfAttribute_ReturnValue2) == 0x00005C, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::CallFunc_GetValueOfAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, K2Node_MakeStruct_StatusEffectSpec) == 0x000060, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, CallFunc_AddStatusEffect_ReturnValue) == 0x000098, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_LastStand_C_LastStandArtifactAbility, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000B4, "Member 'Ability_Artifact_LastStand_C_LastStandArtifactAbility::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

