#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Siren_Cast_ElementalChance

#include "Basic.hpp"

#include "EPhasetranceAttackAction_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Ability_Siren_Cast_ElementalChance.Ability_Siren_Cast_ElementalChance_C.ExecuteUbergraph_Ability_Siren_Cast_ElementalChance
// 0x00F0 (0x00F0 - 0x0000)
struct Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPhaseTranceAttackFamilyType FamilyType, EPhasetranceAttackAction PhaseTranceAction, bool Success)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec;          // 0x0030(0x0010)(NoDestructor)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0040(0x0038)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0088(0x0018)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhaseTranceAttackFamilyType                  K2Node_CustomEvent_FamilyType;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhasetranceAttackAction                      K2Node_CustomEvent_PhaseTranceAction;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPEventHub_Siren_C*                    K2Node_DynamicCast_AsBPEvent_Hub_Siren;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x00C8(0x0028)(NoDestructor)
};
static_assert(alignof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance) == 0x000008, "Wrong alignment on Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance");
static_assert(sizeof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance) == 0x0000F0, "Wrong size on Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, EntryPoint) == 0x000000, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_GetDataTableValue_OutValue) == 0x000004, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_GetDataTableValue_ReturnValue) == 0x000008, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_GetAbilityOwner_ReturnValue) == 0x000020, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_GetAbilityOwner_ReturnValue1) == 0x000028, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, K2Node_MakeStruct_StatusEffectRemoveSpec) == 0x000030, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::K2Node_MakeStruct_StatusEffectRemoveSpec' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, K2Node_MakeStruct_StatusEffectSpec) == 0x000040, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_GetOwner_ReturnValue) == 0x000078, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_GetOwner_ReturnValue1) == 0x000080, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_AddStatusEffect_ReturnValue) == 0x000088, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_RemoveStatusEffect_ReturnValue) == 0x0000A0, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_RemoveStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_GetComponentByClass_ReturnValue) == 0x0000A8, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, K2Node_CustomEvent_FamilyType) == 0x0000B0, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::K2Node_CustomEvent_FamilyType' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, K2Node_CustomEvent_PhaseTranceAction) == 0x0000B1, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::K2Node_CustomEvent_PhaseTranceAction' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, K2Node_CustomEvent_Success) == 0x0000B2, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, K2Node_DynamicCast_AsBPEvent_Hub_Siren) == 0x0000B8, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::K2Node_DynamicCast_AsBPEvent_Hub_Siren' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C1, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x0000C8, "Member 'Ability_Siren_Cast_ElementalChance_C_ExecuteUbergraph_Ability_Siren_Cast_ElementalChance::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

// Function Ability_Siren_Cast_ElementalChance.Ability_Siren_Cast_ElementalChance_C.CastUsed
// 0x0003 (0x0003 - 0x0000)
struct Ability_Siren_Cast_ElementalChance_C_CastUsed final
{
public:
	EPhaseTranceAttackFamilyType                  FamilyType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhasetranceAttackAction                      PhaseTranceAction;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_Siren_Cast_ElementalChance_C_CastUsed) == 0x000001, "Wrong alignment on Ability_Siren_Cast_ElementalChance_C_CastUsed");
static_assert(sizeof(Ability_Siren_Cast_ElementalChance_C_CastUsed) == 0x000003, "Wrong size on Ability_Siren_Cast_ElementalChance_C_CastUsed");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_CastUsed, FamilyType) == 0x000000, "Member 'Ability_Siren_Cast_ElementalChance_C_CastUsed::FamilyType' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_CastUsed, PhaseTranceAction) == 0x000001, "Member 'Ability_Siren_Cast_ElementalChance_C_CastUsed::PhaseTranceAction' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Cast_ElementalChance_C_CastUsed, Success) == 0x000002, "Member 'Ability_Siren_Cast_ElementalChance_C_CastUsed::Success' has a wrong offset!");

}

