#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_PhoenixTears

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_PhoenixTears.Ability_Artifact_PhoenixTears_C.ExecuteUbergraph_Ability_Artifact_PhoenixTears
// 0x0060 (0x0060 - 0x0000)
struct Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPFightForYourLifeComponent_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0020(0x0028)(NoDestructor)
	class UBPFightForYourLifeComponent_C*         CallFunc_GetComponentByClass_ReturnValue1;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPFightForYourLifeComponent_C*         CallFunc_GetComponentByClass_ReturnValue2;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears) == 0x000008, "Wrong alignment on Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears");
static_assert(sizeof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears) == 0x000060, "Wrong size on Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears");
static_assert(offsetof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears, EntryPoint) == 0x000000, "Member 'Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000004, "Member 'Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000020, "Member 'Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears, CallFunc_GetComponentByClass_ReturnValue1) == 0x000048, "Member 'Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears, CallFunc_GetComponentByClass_ReturnValue2) == 0x000050, "Member 'Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'Ability_Artifact_PhoenixTears_C_ExecuteUbergraph_Ability_Artifact_PhoenixTears::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

