#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_RocketBoots

#include "Basic.hpp"

#include "BP_InventoryAbility_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Artifact_RocketBoots.Ability_Artifact_RocketBoots_C
// 0x0108 (0x0228 - 0x0120)
class UAbility_Artifact_RocketBoots_C final : public UBP_InventoryAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Ability_Artifact_RocketBoots_C;     // 0x0120(0x0008)(Transient, DuplicateTransient)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Artifact_Cauterizer; // 0x0128(0x0028)()
	struct FTimerHandle                           ProjectileTimer;                                   // 0x0150(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class ABPChar_Player_C*                       BPChar_Player;                                     // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEnvQueryParams                        Query;                                             // 0x0160(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           QueryTimer;                                        // 0x0218(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class AActor*                                 HomingTarget;                                      // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Ability_Artifact_RocketBoots(int32 EntryPoint);
	void ExecuteQuery();
	void FireRocket();
	void OnActivated();
	void OnDeactivated();
	void StartSlide();
	void StoppedSliding(const struct FSlideEndedDetails& Details);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Artifact_RocketBoots_C">();
	}
	static class UAbility_Artifact_RocketBoots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Artifact_RocketBoots_C>();
	}
};
static_assert(alignof(UAbility_Artifact_RocketBoots_C) == 0x000008, "Wrong alignment on UAbility_Artifact_RocketBoots_C");
static_assert(sizeof(UAbility_Artifact_RocketBoots_C) == 0x000228, "Wrong size on UAbility_Artifact_RocketBoots_C");
static_assert(offsetof(UAbility_Artifact_RocketBoots_C, UberGraphFrame_Ability_Artifact_RocketBoots_C) == 0x000120, "Member 'UAbility_Artifact_RocketBoots_C::UberGraphFrame_Ability_Artifact_RocketBoots_C' has a wrong offset!");
static_assert(offsetof(UAbility_Artifact_RocketBoots_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Artifact_Cauterizer) == 0x000128, "Member 'UAbility_Artifact_RocketBoots_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Artifact_Cauterizer' has a wrong offset!");
static_assert(offsetof(UAbility_Artifact_RocketBoots_C, ProjectileTimer) == 0x000150, "Member 'UAbility_Artifact_RocketBoots_C::ProjectileTimer' has a wrong offset!");
static_assert(offsetof(UAbility_Artifact_RocketBoots_C, BPChar_Player) == 0x000158, "Member 'UAbility_Artifact_RocketBoots_C::BPChar_Player' has a wrong offset!");
static_assert(offsetof(UAbility_Artifact_RocketBoots_C, Query) == 0x000160, "Member 'UAbility_Artifact_RocketBoots_C::Query' has a wrong offset!");
static_assert(offsetof(UAbility_Artifact_RocketBoots_C, QueryTimer) == 0x000218, "Member 'UAbility_Artifact_RocketBoots_C::QueryTimer' has a wrong offset!");
static_assert(offsetof(UAbility_Artifact_RocketBoots_C, HomingTarget) == 0x000220, "Member 'UAbility_Artifact_RocketBoots_C::HomingTarget' has a wrong offset!");

}

