#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_BloodFrenzy

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_BloodFrenzy.Ability_Artifact_BloodFrenzy_C.ExecuteUbergraph_Ability_Artifact_BloodFrenzy
// 0x0220 (0x0220 - 0x0000)
struct Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0020(0x0028)(NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageInstigator;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   K2Node_CustomEvent_Details;                        // 0x0070(0x0060)(ContainsInstancedReference)
	bool                                          CallFunc_Compare_Damage_Source_Equal;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Not_Equal;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Equal1;             // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Not_Equal1;         // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Equal2;             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Not_Equal2;         // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x00E0(0x0038)(NoDestructor)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec1;               // 0x0118(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0150(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue1;             // 0x0168(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec2;               // 0x0180(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue2;             // 0x01B8(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec3;               // 0x01D0(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue3;             // 0x0208(0x0018)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy) == 0x000008, "Wrong alignment on Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy");
static_assert(sizeof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy) == 0x000220, "Wrong size on Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, EntryPoint) == 0x000000, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000004, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000020, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_CustomEvent_DamageInstigator) == 0x000048, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_CustomEvent_DamageInstigator' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_CustomEvent_Damage) == 0x000050, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_CustomEvent_DamageType) == 0x000058, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_CustomEvent_DamageSource) == 0x000060, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_CustomEvent_DamagedActor) == 0x000068, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_CustomEvent_Details) == 0x000070, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_Compare_Damage_Source_Equal) == 0x0000D0, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_Compare_Damage_Source_Equal' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_Compare_Damage_Source_Not_Equal) == 0x0000D1, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_Compare_Damage_Source_Not_Equal' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_Compare_Damage_Source_Equal1) == 0x0000D2, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_Compare_Damage_Source_Equal1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_Compare_Damage_Source_Not_Equal1) == 0x0000D3, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_Compare_Damage_Source_Not_Equal1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_Compare_Damage_Source_Equal2) == 0x0000D4, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_Compare_Damage_Source_Equal2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_Compare_Damage_Source_Not_Equal2) == 0x0000D5, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_Compare_Damage_Source_Not_Equal2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_BooleanOR_ReturnValue) == 0x0000D6, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_BooleanOR_ReturnValue1) == 0x0000D7, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x0000D8, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_MakeStruct_StatusEffectSpec) == 0x0000E0, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_MakeStruct_StatusEffectSpec1) == 0x000118, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_MakeStruct_StatusEffectSpec1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_AddStatusEffect_ReturnValue) == 0x000150, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_AddStatusEffect_ReturnValue1) == 0x000168, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_AddStatusEffect_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_MakeStruct_StatusEffectSpec2) == 0x000180, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_MakeStruct_StatusEffectSpec2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_AddStatusEffect_ReturnValue2) == 0x0001B8, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_AddStatusEffect_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, K2Node_MakeStruct_StatusEffectSpec3) == 0x0001D0, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::K2Node_MakeStruct_StatusEffectSpec3' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy, CallFunc_AddStatusEffect_ReturnValue3) == 0x000208, "Member 'Ability_Artifact_BloodFrenzy_C_ExecuteUbergraph_Ability_Artifact_BloodFrenzy::CallFunc_AddStatusEffect_ReturnValue3' has a wrong offset!");

// Function Ability_Artifact_BloodFrenzy.Ability_Artifact_BloodFrenzy_C.OnHitEnemy_BloodFrenzy
// 0x0088 (0x0088 - 0x0000)
struct Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0028(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy) == 0x000008, "Wrong alignment on Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy");
static_assert(sizeof(Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy) == 0x000088, "Wrong size on Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy, DamageInstigator) == 0x000000, "Member 'Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy::DamageInstigator' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy, Damage) == 0x000008, "Member 'Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy::Damage' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy, DamageType) == 0x000010, "Member 'Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy::DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy, DamageSource) == 0x000018, "Member 'Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy::DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy, DamagedActor) == 0x000020, "Member 'Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy::DamagedActor' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy, Details) == 0x000028, "Member 'Ability_Artifact_BloodFrenzy_C_OnHitEnemy_BloodFrenzy::Details' has a wrong offset!");

// Function Ability_Artifact_BloodFrenzy.Ability_Artifact_BloodFrenzy_C.Ammo Return
// 0x0020 (0x0020 - 0x0000)
struct Ability_Artifact_BloodFrenzy_C_Ammo_Return final
{
public:
	class AOakCharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_Artifact_BloodFrenzy_C_Ammo_Return) == 0x000008, "Wrong alignment on Ability_Artifact_BloodFrenzy_C_Ammo_Return");
static_assert(sizeof(Ability_Artifact_BloodFrenzy_C_Ammo_Return) == 0x000020, "Wrong size on Ability_Artifact_BloodFrenzy_C_Ammo_Return");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_Ammo_Return, Character) == 0x000000, "Member 'Ability_Artifact_BloodFrenzy_C_Ammo_Return::Character' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_Ammo_Return, CallFunc_GetWeapon_ReturnValue) == 0x000008, "Member 'Ability_Artifact_BloodFrenzy_C_Ammo_Return::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_Ammo_Return, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000010, "Member 'Ability_Artifact_BloodFrenzy_C_Ammo_Return::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_Ammo_Return, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'Ability_Artifact_BloodFrenzy_C_Ammo_Return::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_BloodFrenzy_C_Ammo_Return, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'Ability_Artifact_BloodFrenzy_C_Ammo_Return::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

}

