#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_ElectricSlide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxWeapon_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_ElectricSlide.Ability_Artifact_ElectricSlide_C.ExecuteUbergraph_Ability_Artifact_ElectricSlide
// 0x0140 (0x0140 - 0x0000)
struct Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment;             // 0x0020(0x0028)(NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FSlideEndedDetails                     K2Node_CustomEvent_Details;                        // 0x0058(0x0018)(ConstParm, NoDestructor)
	TDelegate<void(struct FSlideEndedDetails& Details)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0080(0x0028)(NoDestructor)
	TArray<class AActor*>                         CallFunc_RunEnvQueryForAllActors_ResultActors;     // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_RunEnvQueryForAllActors_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D0(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment1;            // 0x00E0(0x0028)(NoDestructor, ContainsInstancedReference)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x0108(0x0028)(NoDestructor)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide) == 0x000008, "Wrong alignment on Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide");
static_assert(sizeof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide) == 0x000140, "Wrong size on Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, EntryPoint) == 0x000000, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_Array_Get_Item) == 0x000018, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, K2Node_MakeStruct_LightBeamAttachment) == 0x000020, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::K2Node_MakeStruct_LightBeamAttachment' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, K2Node_CustomEvent_Details) == 0x000058, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, K2Node_CreateDelegate_OutputDelegate1) == 0x000070, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000080, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_RunEnvQueryForAllActors_ResultActors) == 0x0000A8, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_RunEnvQueryForAllActors_ResultActors' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_RunEnvQueryForAllActors_ReturnValue) == 0x0000B8, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_RunEnvQueryForAllActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, K2Node_CreateDelegate_OutputDelegate2) == 0x0000C0, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D0, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_Array_AddUnique_ReturnValue) == 0x0000D8, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, K2Node_MakeStruct_LightBeamAttachment1) == 0x0000E0, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::K2Node_MakeStruct_LightBeamAttachment1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x000108, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000130, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000134, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, K2Node_SwitchEnum_CmpSuccess) == 0x000138, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00013C, "Member 'Ability_Artifact_ElectricSlide_C_ExecuteUbergraph_Ability_Artifact_ElectricSlide::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function Ability_Artifact_ElectricSlide.Ability_Artifact_ElectricSlide_C.StopSlide
// 0x0018 (0x0018 - 0x0000)
struct Ability_Artifact_ElectricSlide_C_StopSlide final
{
public:
	struct FSlideEndedDetails                     Details;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Ability_Artifact_ElectricSlide_C_StopSlide) == 0x000008, "Wrong alignment on Ability_Artifact_ElectricSlide_C_StopSlide");
static_assert(sizeof(Ability_Artifact_ElectricSlide_C_StopSlide) == 0x000018, "Wrong size on Ability_Artifact_ElectricSlide_C_StopSlide");
static_assert(offsetof(Ability_Artifact_ElectricSlide_C_StopSlide, Details) == 0x000000, "Member 'Ability_Artifact_ElectricSlide_C_StopSlide::Details' has a wrong offset!");

}

