#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Gunner_IBGrenadeChance

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Ability_AnointParent_Gunner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Gunner_IBGrenadeChance.Ability_Gunner_IBGrenadeChance_C
// 0x00B8 (0x02C8 - 0x0210)
class UAbility_Gunner_IBGrenadeChance_C final : public UAbility_AnointParent_Gunner_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Ability_Gunner_IBGrenadeChance_C;   // 0x0210(0x0008)(Transient, DuplicateTransient)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_TestEndGame; // 0x0218(0x0028)()
	bool                                          OnCooldown;                                        // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttributeInitializationData           GrenadeChance;                                     // 0x0248(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class AOakCharacter*                          GrenadeSource;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_Player*                   OakCharacterOwner;                                 // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttributeInitializationData           CooldownTime;                                      // 0x0290(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_Ability_Gunner_IBGrenadeChance(int32 EntryPoint);
	void OnActivated();
	void OnTookDamage(class UDamageComponent* DamageReceiver, float Damage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, const struct FReceivedDamageDetails& Details);
	void AnointIronBearEnded();
	void AnointIronIronBearStarted(class AOakCharacter_IronBear* IronBear);
	void GrenadeCooldown();
	void AnointRemoveEffect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Gunner_IBGrenadeChance_C">();
	}
	static class UAbility_Gunner_IBGrenadeChance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Gunner_IBGrenadeChance_C>();
	}
};
static_assert(alignof(UAbility_Gunner_IBGrenadeChance_C) == 0x000008, "Wrong alignment on UAbility_Gunner_IBGrenadeChance_C");
static_assert(sizeof(UAbility_Gunner_IBGrenadeChance_C) == 0x0002C8, "Wrong size on UAbility_Gunner_IBGrenadeChance_C");
static_assert(offsetof(UAbility_Gunner_IBGrenadeChance_C, UberGraphFrame_Ability_Gunner_IBGrenadeChance_C) == 0x000210, "Member 'UAbility_Gunner_IBGrenadeChance_C::UberGraphFrame_Ability_Gunner_IBGrenadeChance_C' has a wrong offset!");
static_assert(offsetof(UAbility_Gunner_IBGrenadeChance_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_TestEndGame) == 0x000218, "Member 'UAbility_Gunner_IBGrenadeChance_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_TestEndGame' has a wrong offset!");
static_assert(offsetof(UAbility_Gunner_IBGrenadeChance_C, OnCooldown) == 0x000240, "Member 'UAbility_Gunner_IBGrenadeChance_C::OnCooldown' has a wrong offset!");
static_assert(offsetof(UAbility_Gunner_IBGrenadeChance_C, GrenadeChance) == 0x000248, "Member 'UAbility_Gunner_IBGrenadeChance_C::GrenadeChance' has a wrong offset!");
static_assert(offsetof(UAbility_Gunner_IBGrenadeChance_C, GrenadeSource) == 0x000280, "Member 'UAbility_Gunner_IBGrenadeChance_C::GrenadeSource' has a wrong offset!");
static_assert(offsetof(UAbility_Gunner_IBGrenadeChance_C, OakCharacterOwner) == 0x000288, "Member 'UAbility_Gunner_IBGrenadeChance_C::OakCharacterOwner' has a wrong offset!");
static_assert(offsetof(UAbility_Gunner_IBGrenadeChance_C, CooldownTime) == 0x000290, "Member 'UAbility_Gunner_IBGrenadeChance_C::CooldownTime' has a wrong offset!");

}

