#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_AnointParent_Beastmaster

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Enum_BeastmasterActionSkill_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Ability_AnointParent_Beastmaster.Ability_AnointParent_Beastmaster_C.ExecuteUbergraph_Ability_AnointParent_Beastmaster
// 0x01F8 (0x01F8 - 0x0000)
struct Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Res)>                     K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EOakActionAbilityPetEvolutionType PetEvolution, EOakActionAbilityPetType PetType)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UBPEventHub_Beastmaster_C*              K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(Enum_BeastmasterActionSkill ActionSkill)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0068(0x0028)(NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x00A8(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2; // 0x00D0(0x0028)(NoDestructor)
	bool                                          K2Node_CustomEvent_Res;                            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate3; // 0x0110(0x0028)(NoDestructor)
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate4; // 0x0148(0x0028)(NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue1;         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue2;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate5; // 0x0190(0x0028)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Beastmaster_C*                  K2Node_DynamicCast_AsBPChar_Beastmaster;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility*                      CallFunc_GetPrimaryActionAbility_ReturnValue;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue1;       // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue2;       // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointTriggerEffect_Res;                  // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x01EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster) == 0x000008, "Wrong alignment on Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster");
static_assert(sizeof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster) == 0x0001F8, "Wrong size on Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, EntryPoint) == 0x000000, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetAbilityOwner_ReturnValue) == 0x000018, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_CreateDelegate_OutputDelegate1) == 0x000030, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster) == 0x000040, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_CreateDelegate_OutputDelegate2) == 0x000050, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_BooleanOR_ReturnValue) == 0x000060, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000068, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_BooleanOR_ReturnValue1) == 0x000090, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_BooleanOR_ReturnValue2) == 0x000091, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_CreateDelegate_OutputDelegate3) == 0x000098, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x0000A8, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2) == 0x0000D0, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_CustomEvent_Res) == 0x0000F8, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_CustomEvent_Res' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_CreateDelegate_OutputDelegate4) == 0x000100, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate3) == 0x000110, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_CreateDelegate_OutputDelegate5) == 0x000138, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate4) == 0x000148, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate4' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetAbilityOwner_ReturnValue1) == 0x000170, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetOwner_ReturnValue1) == 0x000178, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetComponentByClass_ReturnValue1) == 0x000180, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetAbilityOwner_ReturnValue2) == 0x000188, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetAbilityOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate5) == 0x000190, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate5' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetOwner_ReturnValue2) == 0x0001B8, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_DynamicCast_AsBPChar_Beastmaster) == 0x0001C0, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_DynamicCast_AsBPChar_Beastmaster' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, K2Node_DynamicCast_bSuccess1) == 0x0001C8, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetPrimaryActionAbility_ReturnValue) == 0x0001D0, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetPrimaryActionAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_IsActive_ReturnValue) == 0x0001D8, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_GetObjectClass_ReturnValue) == 0x0001E0, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0001E8, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_EqualEqual_ClassClass_ReturnValue1) == 0x0001E9, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_EqualEqual_ClassClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_BooleanAND_ReturnValue) == 0x0001EA, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_BooleanAND_ReturnValue1) == 0x0001EB, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_EqualEqual_ClassClass_ReturnValue2) == 0x0001EC, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_EqualEqual_ClassClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_AnointTriggerEffect_Res) == 0x0001ED, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_AnointTriggerEffect_Res' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_BooleanAND_ReturnValue2) == 0x0001EE, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_BooleanOR_ReturnValue3) == 0x0001EF, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_BooleanOR_ReturnValue4) == 0x0001F0, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster, CallFunc_BooleanAND_ReturnValue3) == 0x0001F1, "Member 'Ability_AnointParent_Beastmaster_C_ExecuteUbergraph_Ability_AnointParent_Beastmaster::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");

// Function Ability_AnointParent_Beastmaster.Ability_AnointParent_Beastmaster_C.AnointBeastmasterFindLocation
// 0x0001 (0x0001 - 0x0000)
struct Ability_AnointParent_Beastmaster_C_AnointBeastmasterFindLocation final
{
public:
	bool                                          Res;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_Beastmaster_C_AnointBeastmasterFindLocation) == 0x000001, "Wrong alignment on Ability_AnointParent_Beastmaster_C_AnointBeastmasterFindLocation");
static_assert(sizeof(Ability_AnointParent_Beastmaster_C_AnointBeastmasterFindLocation) == 0x000001, "Wrong size on Ability_AnointParent_Beastmaster_C_AnointBeastmasterFindLocation");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointBeastmasterFindLocation, Res) == 0x000000, "Member 'Ability_AnointParent_Beastmaster_C_AnointBeastmasterFindLocation::Res' has a wrong offset!");

// Function Ability_AnointParent_Beastmaster.Ability_AnointParent_Beastmaster_C.AnointUsedAttackCommand
// 0x0003 (0x0003 - 0x0000)
struct Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand final
{
public:
	EOakActionAbilityPetEvolutionType             PetEvolution;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakActionAbilityPetType                      PetType;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AnointTriggerEffect_Res;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand) == 0x000001, "Wrong alignment on Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand");
static_assert(sizeof(Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand) == 0x000003, "Wrong size on Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand, PetEvolution) == 0x000000, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand::PetEvolution' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand, PetType) == 0x000001, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand::PetType' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand, CallFunc_AnointTriggerEffect_Res) == 0x000002, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedAttackCommand::CallFunc_AnointTriggerEffect_Res' has a wrong offset!");

// Function Ability_AnointParent_Beastmaster.Ability_AnointParent_Beastmaster_C.AnointUsedBeastmasterSkill
// 0x000D (0x000D - 0x0000)
struct Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill final
{
public:
	Enum_BeastmasterActionSkill                   ActionSkill;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointTriggerEffect_Res;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill) == 0x000001, "Wrong alignment on Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill");
static_assert(sizeof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill) == 0x00000D, "Wrong size on Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, ActionSkill) == 0x000000, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::ActionSkill' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000002, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000004, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000005, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_BooleanAND_ReturnValue1) == 0x000006, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_BooleanAND_ReturnValue2) == 0x000007, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_BooleanAND_ReturnValue3) == 0x000008, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_BooleanOR_ReturnValue) == 0x000009, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_BooleanOR_ReturnValue1) == 0x00000A, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_BooleanOR_ReturnValue2) == 0x00000B, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill, CallFunc_AnointTriggerEffect_Res) == 0x00000C, "Member 'Ability_AnointParent_Beastmaster_C_AnointUsedBeastmasterSkill::CallFunc_AnointTriggerEffect_Res' has a wrong offset!");

// Function Ability_AnointParent_Beastmaster.Ability_AnointParent_Beastmaster_C.AnointEndFadeAway
// 0x0001 (0x0001 - 0x0000)
struct Ability_AnointParent_Beastmaster_C_AnointEndFadeAway final
{
public:
	bool                                          CallFunc_AnointTriggerEffect_Res;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_Beastmaster_C_AnointEndFadeAway) == 0x000001, "Wrong alignment on Ability_AnointParent_Beastmaster_C_AnointEndFadeAway");
static_assert(sizeof(Ability_AnointParent_Beastmaster_C_AnointEndFadeAway) == 0x000001, "Wrong size on Ability_AnointParent_Beastmaster_C_AnointEndFadeAway");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointEndFadeAway, CallFunc_AnointTriggerEffect_Res) == 0x000000, "Member 'Ability_AnointParent_Beastmaster_C_AnointEndFadeAway::CallFunc_AnointTriggerEffect_Res' has a wrong offset!");

// Function Ability_AnointParent_Beastmaster.Ability_AnointParent_Beastmaster_C.AnointEndGammaBurst
// 0x0001 (0x0001 - 0x0000)
struct Ability_AnointParent_Beastmaster_C_AnointEndGammaBurst final
{
public:
	bool                                          CallFunc_AnointTriggerEffect_Res;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_Beastmaster_C_AnointEndGammaBurst) == 0x000001, "Wrong alignment on Ability_AnointParent_Beastmaster_C_AnointEndGammaBurst");
static_assert(sizeof(Ability_AnointParent_Beastmaster_C_AnointEndGammaBurst) == 0x000001, "Wrong size on Ability_AnointParent_Beastmaster_C_AnointEndGammaBurst");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointEndGammaBurst, CallFunc_AnointTriggerEffect_Res) == 0x000000, "Member 'Ability_AnointParent_Beastmaster_C_AnointEndGammaBurst::CallFunc_AnointTriggerEffect_Res' has a wrong offset!");

// Function Ability_AnointParent_Beastmaster.Ability_AnointParent_Beastmaster_C.AnointEndHulkOut
// 0x0002 (0x0002 - 0x0000)
struct Ability_AnointParent_Beastmaster_C_AnointEndHulkOut final
{
public:
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointTriggerEffect_Res;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_Beastmaster_C_AnointEndHulkOut) == 0x000001, "Wrong alignment on Ability_AnointParent_Beastmaster_C_AnointEndHulkOut");
static_assert(sizeof(Ability_AnointParent_Beastmaster_C_AnointEndHulkOut) == 0x000002, "Wrong size on Ability_AnointParent_Beastmaster_C_AnointEndHulkOut");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointEndHulkOut, CallFunc_BooleanOR_ReturnValue) == 0x000000, "Member 'Ability_AnointParent_Beastmaster_C_AnointEndHulkOut::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointEndHulkOut, CallFunc_AnointTriggerEffect_Res) == 0x000001, "Member 'Ability_AnointParent_Beastmaster_C_AnointEndHulkOut::CallFunc_AnointTriggerEffect_Res' has a wrong offset!");

// Function Ability_AnointParent_Beastmaster.Ability_AnointParent_Beastmaster_C.AnointOnActionSkillCoolingDown
// 0x0010 (0x0010 - 0x0000)
struct Ability_AnointParent_Beastmaster_C_AnointOnActionSkillCoolingDown final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Res;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointOnActionSkillCoolingDown_Res;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_Beastmaster_C_AnointOnActionSkillCoolingDown) == 0x000008, "Wrong alignment on Ability_AnointParent_Beastmaster_C_AnointOnActionSkillCoolingDown");
static_assert(sizeof(Ability_AnointParent_Beastmaster_C_AnointOnActionSkillCoolingDown) == 0x000010, "Wrong size on Ability_AnointParent_Beastmaster_C_AnointOnActionSkillCoolingDown");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointOnActionSkillCoolingDown, ActionAbility) == 0x000000, "Member 'Ability_AnointParent_Beastmaster_C_AnointOnActionSkillCoolingDown::ActionAbility' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_Beastmaster_C_AnointOnActionSkillCoolingDown, Res) == 0x000008, "Member 'Ability_AnointParent_Beastmaster_C_AnointOnActionSkillCoolingDown::Res' has a wrong offset!");
