#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_RearEnder

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_RearEnder.Ability_Artifact_RearEnder_C.ExecuteUbergraph_Ability_Artifact_RearEnder
// 0x0078 (0x0078 - 0x0000)
struct Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0008(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0040(0x0018)(NoDestructor, ContainsInstancedReference)
	class ABPChar_Player_C*                       K2Node_DynamicCast_AsBPChar_Player;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Player_C*                       K2Node_DynamicCast_AsBPChar_Player1;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveStatusEffectInstance_ReturnValue;   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder) == 0x000008, "Wrong alignment on Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder");
static_assert(sizeof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder) == 0x000078, "Wrong size on Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder");
static_assert(offsetof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder, EntryPoint) == 0x000000, "Member 'Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder, K2Node_MakeStruct_StatusEffectSpec) == 0x000008, "Member 'Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder, CallFunc_AddStatusEffect_ReturnValue) == 0x000040, "Member 'Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder, K2Node_DynamicCast_AsBPChar_Player) == 0x000058, "Member 'Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder::K2Node_DynamicCast_AsBPChar_Player' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder, K2Node_DynamicCast_AsBPChar_Player1) == 0x000068, "Member 'Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder::K2Node_DynamicCast_AsBPChar_Player1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder, K2Node_DynamicCast_bSuccess1) == 0x000070, "Member 'Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder, CallFunc_RemoveStatusEffectInstance_ReturnValue) == 0x000071, "Member 'Ability_Artifact_RearEnder_C_ExecuteUbergraph_Ability_Artifact_RearEnder::CallFunc_RemoveStatusEffectInstance_ReturnValue' has a wrong offset!");

}

