#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_ElDragonJr

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_ElDragonJr.Ability_Artifact_ElDragonJr_C.ExecuteUbergraph_Ability_Artifact_ElDragonJr
// 0x0130 (0x0130 - 0x0000)
struct Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageInstigator;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   K2Node_CustomEvent_Details;                        // 0x0030(0x0060)(ContainsInstancedReference)
	bool                                          CallFunc_Compare_Damage_Source_Equal;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Not_Equal;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Equal1;             // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Not_Equal1;         // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Equal2;             // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Not_Equal2;         // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttributeInitializationData           CallFunc_GetDataTableValue_OutValue;               // 0x00B0(0x0038)(NoDestructor)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectInstanceReference         CallFunc_TriggerElementalEffect_ReturnValue;       // 0x00F0(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0108(0x0028)(NoDestructor)
};
static_assert(alignof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr) == 0x000008, "Wrong alignment on Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr");
static_assert(sizeof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr) == 0x000130, "Wrong size on Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, EntryPoint) == 0x000000, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, K2Node_CustomEvent_DamageInstigator) == 0x000008, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::K2Node_CustomEvent_DamageInstigator' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, K2Node_CustomEvent_Damage) == 0x000010, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, K2Node_CustomEvent_DamageType) == 0x000018, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, K2Node_CustomEvent_DamageSource) == 0x000020, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, K2Node_CustomEvent_DamagedActor) == 0x000028, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, K2Node_CustomEvent_Details) == 0x000030, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_Compare_Damage_Source_Equal) == 0x000090, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_Compare_Damage_Source_Equal' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_Compare_Damage_Source_Not_Equal) == 0x000091, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_Compare_Damage_Source_Not_Equal' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_Compare_Damage_Source_Equal1) == 0x000092, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_Compare_Damage_Source_Equal1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_Compare_Damage_Source_Not_Equal1) == 0x000093, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_Compare_Damage_Source_Not_Equal1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_Compare_Damage_Source_Equal2) == 0x000094, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_Compare_Damage_Source_Equal2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_Compare_Damage_Source_Not_Equal2) == 0x000095, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_Compare_Damage_Source_Not_Equal2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_BooleanOR_ReturnValue) == 0x0000A8, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_BooleanOR_ReturnValue1) == 0x0000A9, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_GetDataTableValue_OutValue) == 0x0000B0, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_GetDataTableValue_ReturnValue) == 0x0000E8, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000EC, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, CallFunc_TriggerElementalEffect_ReturnValue) == 0x0000F0, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::CallFunc_TriggerElementalEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000108, "Member 'Ability_Artifact_ElDragonJr_C_ExecuteUbergraph_Ability_Artifact_ElDragonJr::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

// Function Ability_Artifact_ElDragonJr.Ability_Artifact_ElDragonJr_C.Caused Damage
// 0x0088 (0x0088 - 0x0000)
struct Ability_Artifact_ElDragonJr_C_Caused_Damage final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0028(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Ability_Artifact_ElDragonJr_C_Caused_Damage) == 0x000008, "Wrong alignment on Ability_Artifact_ElDragonJr_C_Caused_Damage");
static_assert(sizeof(Ability_Artifact_ElDragonJr_C_Caused_Damage) == 0x000088, "Wrong size on Ability_Artifact_ElDragonJr_C_Caused_Damage");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_Caused_Damage, DamageInstigator) == 0x000000, "Member 'Ability_Artifact_ElDragonJr_C_Caused_Damage::DamageInstigator' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_Caused_Damage, Damage) == 0x000008, "Member 'Ability_Artifact_ElDragonJr_C_Caused_Damage::Damage' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_Caused_Damage, DamageType) == 0x000010, "Member 'Ability_Artifact_ElDragonJr_C_Caused_Damage::DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_Caused_Damage, DamageSource) == 0x000018, "Member 'Ability_Artifact_ElDragonJr_C_Caused_Damage::DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_Caused_Damage, DamagedActor) == 0x000020, "Member 'Ability_Artifact_ElDragonJr_C_Caused_Damage::DamagedActor' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_ElDragonJr_C_Caused_Damage, Details) == 0x000028, "Member 'Ability_Artifact_ElDragonJr_C_Caused_Damage::Details' has a wrong offset!");

}

