#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_GuardianRank_Resilient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Ability_GuardianRank_Resilient.Ability_GuardianRank_Resilient_C.ExecuteUbergraph_Ability_GuardianRank_Resilient
// 0x0188 (0x0188 - 0x0000)
struct Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             Temp_struct_Variable1;                             // 0x00A8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPFightForYourLifeComponent_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0160(0x0028)(NoDestructor)
};
static_assert(alignof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient) == 0x000008, "Wrong alignment on Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient");
static_assert(sizeof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient) == 0x000188, "Wrong size on Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, EntryPoint) == 0x000000, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, Temp_struct_Variable) == 0x000008, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, Temp_struct_Variable1) == 0x0000A8, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, CallFunc_GetAbilityOwner_ReturnValue) == 0x000138, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, K2Node_DynamicCast_AsOak_Character) == 0x000140, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, CallFunc_GetValueOfAttribute_ReturnValue) == 0x00014C, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000150, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, CallFunc_GetComponentByClass_ReturnValue) == 0x000158, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000160, "Member 'Ability_GuardianRank_Resilient_C_ExecuteUbergraph_Ability_GuardianRank_Resilient::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

}

