#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_TrashGun

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_TrashGun.Ability_TrashGun_C
// 0x00A8 (0x01A0 - 0x00F8)
class UAbility_TrashGun_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	struct FStatusEffectSpec                      FireRateStatus;                                    // 0x0100(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FStatusEffectSpec                      HeatPerShotStatus;                                 // 0x0138(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGbxAbilityResourceController_ConditionalDamageModifier RsrcCntrlr_GbxAbilityResourceController_ConditionalDamageModifier_Ability_TrashGun; // 0x0170(0x0028)()
	class AOakCharacter*                          OakCharacter;                                      // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Ability_TrashGun(int32 EntryPoint);
	void KillCDM();
	void OnActivated();
	void RandomRandomness();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_TrashGun_C">();
	}
	static class UAbility_TrashGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_TrashGun_C>();
	}
};
static_assert(alignof(UAbility_TrashGun_C) == 0x000008, "Wrong alignment on UAbility_TrashGun_C");
static_assert(sizeof(UAbility_TrashGun_C) == 0x0001A0, "Wrong size on UAbility_TrashGun_C");
static_assert(offsetof(UAbility_TrashGun_C, UberGraphFrame) == 0x0000F8, "Member 'UAbility_TrashGun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbility_TrashGun_C, FireRateStatus) == 0x000100, "Member 'UAbility_TrashGun_C::FireRateStatus' has a wrong offset!");
static_assert(offsetof(UAbility_TrashGun_C, HeatPerShotStatus) == 0x000138, "Member 'UAbility_TrashGun_C::HeatPerShotStatus' has a wrong offset!");
static_assert(offsetof(UAbility_TrashGun_C, RsrcCntrlr_GbxAbilityResourceController_ConditionalDamageModifier_Ability_TrashGun) == 0x000170, "Member 'UAbility_TrashGun_C::RsrcCntrlr_GbxAbilityResourceController_ConditionalDamageModifier_Ability_TrashGun' has a wrong offset!");
static_assert(offsetof(UAbility_TrashGun_C, OakCharacter) == 0x000198, "Member 'UAbility_TrashGun_C::OakCharacter' has a wrong offset!");

}

