#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_AnointParent

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "OakGame_structs.hpp"
#include "Enum_BeastmasterActionSkill_structs.hpp"
#include "Engine_structs.hpp"
#include "EOperativeGadgets_structs.hpp"


namespace SDK::Params
{

// Function Ability_AnointParent.Ability_AnointParent_C.ExecuteUbergraph_Ability_AnointParent
// 0x0330 (0x0330 - 0x0000)
struct Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EOperativeGadgets ActionSkill)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* Enemy, EPhaseTranceElementalType Element)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Killed)>                  K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Res)>                     K2Node_CreateDelegate_OutputDelegate3;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UOakPlayerAbilitySlotData*              K2Node_CustomEvent_SlotData;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UOakPlayerAbilitySlotData* SlotData)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0080(0x0028)(NoDestructor)
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility2;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AnointOnActionSkillCoolingDown_Res;       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility1;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AnointOnActionSkillActivated_Res;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AnointOnActionSkillReadied_Res;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_BeastmasterActionSkill                   K2Node_CustomEvent_ActionSkill1;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPEventHub_Beastmaster_C*              K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x00E8(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2; // 0x0110(0x0028)(NoDestructor)
	bool                                          CallFunc_AnointOnActionSkillCoolingDown_Res1;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOperativeGadgets                             K2Node_CustomEvent_ActionSkill;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPEventHub_Operative_C*                K2Node_DynamicCast_AsBPEvent_Hub_Operative;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointOnActionSkillCoolingDown_Res2;      // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPEventHub_Siren_C*                    K2Node_DynamicCast_AsBPEvent_Hub_Siren;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate3; // 0x0178(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate4; // 0x01A0(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate5; // 0x01C8(0x0028)(NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Enemy;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhaseTranceElementalType                     K2Node_CustomEvent_Element;                        // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointOnActionSkillActivated_Res1;        // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate6; // 0x0200(0x0028)(NoDestructor)
	bool                                          K2Node_CustomEvent_Killed;                         // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointOnActionSkillCoolingDown_Res3;      // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(Enum_BeastmasterActionSkill ActionSkill)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Res;                            // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointOnActionSkillActivated_Res2;        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointOnActionSkillCoolingDown_Res4;      // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate7; // 0x0248(0x0028)(NoDestructor)
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate8;             // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate8; // 0x0288(0x0028)(NoDestructor)
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate9;             // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	class UBPEventHub_Siren_C*                    K2Node_DynamicCast_AsBPEvent_Hub_Siren1;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPEventHub_Operative_C*                K2Node_DynamicCast_AsBPEvent_Hub_Operative1;       // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPEventHub_Gunner_C*                   K2Node_DynamicCast_AsBPEvent_Hub_Gunner;           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPEventHub_Beastmaster_C*              K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster1;     // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate9; // 0x0300(0x0028)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent) == 0x000008, "Wrong alignment on Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent");
static_assert(sizeof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent) == 0x000330, "Wrong size on Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, EntryPoint) == 0x000000, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate1) == 0x000018, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate3) == 0x000038, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate4) == 0x000048, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate5) == 0x000058, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_SlotData) == 0x000068, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_SlotData' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate6) == 0x000070, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000080, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_ActionAbility2) == 0x0000A8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_ActionAbility2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_AnointOnActionSkillCoolingDown_Res) == 0x0000B0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_AnointOnActionSkillCoolingDown_Res' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_ActionAbility1) == 0x0000B8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_ActionAbility1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_AnointOnActionSkillActivated_Res) == 0x0000C0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_AnointOnActionSkillActivated_Res' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_ActionAbility) == 0x0000C8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_ActionAbility' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_AnointOnActionSkillReadied_Res) == 0x0000D0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_AnointOnActionSkillReadied_Res' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_ActionSkill1) == 0x0000D1, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_ActionSkill1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster) == 0x0000D8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E1, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x0000E8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2) == 0x000110, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_AnointOnActionSkillCoolingDown_Res1) == 0x000138, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_AnointOnActionSkillCoolingDown_Res1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_ActionSkill) == 0x000139, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_ActionSkill' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_AsBPEvent_Hub_Operative) == 0x000140, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_AsBPEvent_Hub_Operative' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_bSuccess1) == 0x000148, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000149, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_AnointOnActionSkillCoolingDown_Res2) == 0x00014A, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_AnointOnActionSkillCoolingDown_Res2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_GetAbilityOwner_ReturnValue) == 0x000150, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_GetOwner_ReturnValue) == 0x000158, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_GetComponentByClass_ReturnValue) == 0x000160, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_AsBPEvent_Hub_Siren) == 0x000168, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_AsBPEvent_Hub_Siren' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_bSuccess2) == 0x000170, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate3) == 0x000178, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate4) == 0x0001A0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate4' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate5) == 0x0001C8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate5' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_Enemy) == 0x0001F0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_Enemy' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_Element) == 0x0001F8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_Element' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_IsValid_ReturnValue) == 0x0001F9, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_AnointOnActionSkillActivated_Res1) == 0x0001FA, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_AnointOnActionSkillActivated_Res1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate6) == 0x000200, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate6' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_Killed) == 0x000228, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_Killed' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_AnointOnActionSkillCoolingDown_Res3) == 0x000229, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_AnointOnActionSkillCoolingDown_Res3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate7) == 0x000230, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CustomEvent_Res) == 0x000240, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CustomEvent_Res' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_AnointOnActionSkillActivated_Res2) == 0x000241, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_AnointOnActionSkillActivated_Res2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_AnointOnActionSkillCoolingDown_Res4) == 0x000242, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_AnointOnActionSkillCoolingDown_Res4' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_BooleanAND_ReturnValue) == 0x000243, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_BooleanAND_ReturnValue1) == 0x000244, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate7) == 0x000248, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate7' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate8) == 0x000270, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_BooleanOR_ReturnValue) == 0x000280, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_BooleanOR_ReturnValue1) == 0x000281, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate8) == 0x000288, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate8' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_CreateDelegate_OutputDelegate9) == 0x0002B0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_AsBPEvent_Hub_Siren1) == 0x0002C0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_AsBPEvent_Hub_Siren1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_bSuccess3) == 0x0002C8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_AsBPEvent_Hub_Operative1) == 0x0002D0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_AsBPEvent_Hub_Operative1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_bSuccess4) == 0x0002D8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_AsBPEvent_Hub_Gunner) == 0x0002E0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_AsBPEvent_Hub_Gunner' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_bSuccess5) == 0x0002E8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster1) == 0x0002F0, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_DynamicCast_bSuccess6) == 0x0002F8, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate9) == 0x000300, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate9' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_BooleanAND_ReturnValue2) == 0x000328, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_BooleanAND_ReturnValue3) == 0x000329, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent, CallFunc_BooleanAND_ReturnValue4) == 0x00032A, "Member 'Ability_AnointParent_C_ExecuteUbergraph_Ability_AnointParent::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointParent_HulkedOutStarted
// 0x0001 (0x0001 - 0x0000)
struct Ability_AnointParent_C_AnointParent_HulkedOutStarted final
{
public:
	bool                                          Res;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_C_AnointParent_HulkedOutStarted) == 0x000001, "Wrong alignment on Ability_AnointParent_C_AnointParent_HulkedOutStarted");
static_assert(sizeof(Ability_AnointParent_C_AnointParent_HulkedOutStarted) == 0x000001, "Wrong size on Ability_AnointParent_C_AnointParent_HulkedOutStarted");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_HulkedOutStarted, Res) == 0x000000, "Member 'Ability_AnointParent_C_AnointParent_HulkedOutStarted::Res' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointParent_PhaseGraspEnded
// 0x0001 (0x0001 - 0x0000)
struct Ability_AnointParent_C_AnointParent_PhaseGraspEnded final
{
public:
	bool                                          Killed;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_C_AnointParent_PhaseGraspEnded) == 0x000001, "Wrong alignment on Ability_AnointParent_C_AnointParent_PhaseGraspEnded");
static_assert(sizeof(Ability_AnointParent_C_AnointParent_PhaseGraspEnded) == 0x000001, "Wrong size on Ability_AnointParent_C_AnointParent_PhaseGraspEnded");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_PhaseGraspEnded, Killed) == 0x000000, "Member 'Ability_AnointParent_C_AnointParent_PhaseGraspEnded::Killed' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointParent_SirenPhaseGraspedEnemy
// 0x0010 (0x0010 - 0x0000)
struct Ability_AnointParent_C_AnointParent_SirenPhaseGraspedEnemy final
{
public:
	class AActor*                                 Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhaseTranceElementalType                     Element;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_AnointParent_C_AnointParent_SirenPhaseGraspedEnemy) == 0x000008, "Wrong alignment on Ability_AnointParent_C_AnointParent_SirenPhaseGraspedEnemy");
static_assert(sizeof(Ability_AnointParent_C_AnointParent_SirenPhaseGraspedEnemy) == 0x000010, "Wrong size on Ability_AnointParent_C_AnointParent_SirenPhaseGraspedEnemy");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_SirenPhaseGraspedEnemy, Enemy) == 0x000000, "Member 'Ability_AnointParent_C_AnointParent_SirenPhaseGraspedEnemy::Enemy' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_SirenPhaseGraspedEnemy, Element) == 0x000008, "Member 'Ability_AnointParent_C_AnointParent_SirenPhaseGraspedEnemy::Element' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointParent_OperativeActionSkillActivated
// 0x0001 (0x0001 - 0x0000)
struct Ability_AnointParent_C_AnointParent_OperativeActionSkillActivated final
{
public:
	EOperativeGadgets                             ActionSkill;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_AnointParent_C_AnointParent_OperativeActionSkillActivated) == 0x000001, "Wrong alignment on Ability_AnointParent_C_AnointParent_OperativeActionSkillActivated");
static_assert(sizeof(Ability_AnointParent_C_AnointParent_OperativeActionSkillActivated) == 0x000001, "Wrong size on Ability_AnointParent_C_AnointParent_OperativeActionSkillActivated");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_OperativeActionSkillActivated, ActionSkill) == 0x000000, "Member 'Ability_AnointParent_C_AnointParent_OperativeActionSkillActivated::ActionSkill' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointParent_BeastmasterActionSkillActivated
// 0x0001 (0x0001 - 0x0000)
struct Ability_AnointParent_C_AnointParent_BeastmasterActionSkillActivated final
{
public:
	Enum_BeastmasterActionSkill                   ActionSkill;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_AnointParent_C_AnointParent_BeastmasterActionSkillActivated) == 0x000001, "Wrong alignment on Ability_AnointParent_C_AnointParent_BeastmasterActionSkillActivated");
static_assert(sizeof(Ability_AnointParent_C_AnointParent_BeastmasterActionSkillActivated) == 0x000001, "Wrong size on Ability_AnointParent_C_AnointParent_BeastmasterActionSkillActivated");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_BeastmasterActionSkillActivated, ActionSkill) == 0x000000, "Member 'Ability_AnointParent_C_AnointParent_BeastmasterActionSkillActivated::ActionSkill' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointParent_OnActionSkillReadied
// 0x0008 (0x0008 - 0x0000)
struct Ability_AnointParent_C_AnointParent_OnActionSkillReadied final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_AnointParent_C_AnointParent_OnActionSkillReadied) == 0x000008, "Wrong alignment on Ability_AnointParent_C_AnointParent_OnActionSkillReadied");
static_assert(sizeof(Ability_AnointParent_C_AnointParent_OnActionSkillReadied) == 0x000008, "Wrong size on Ability_AnointParent_C_AnointParent_OnActionSkillReadied");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_OnActionSkillReadied, ActionAbility) == 0x000000, "Member 'Ability_AnointParent_C_AnointParent_OnActionSkillReadied::ActionAbility' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointParent_OnActionSkillActivated
// 0x0008 (0x0008 - 0x0000)
struct Ability_AnointParent_C_AnointParent_OnActionSkillActivated final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_AnointParent_C_AnointParent_OnActionSkillActivated) == 0x000008, "Wrong alignment on Ability_AnointParent_C_AnointParent_OnActionSkillActivated");
static_assert(sizeof(Ability_AnointParent_C_AnointParent_OnActionSkillActivated) == 0x000008, "Wrong size on Ability_AnointParent_C_AnointParent_OnActionSkillActivated");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_OnActionSkillActivated, ActionAbility) == 0x000000, "Member 'Ability_AnointParent_C_AnointParent_OnActionSkillActivated::ActionAbility' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointParent_OnActionSkillCoolingDown
// 0x0008 (0x0008 - 0x0000)
struct Ability_AnointParent_C_AnointParent_OnActionSkillCoolingDown final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_AnointParent_C_AnointParent_OnActionSkillCoolingDown) == 0x000008, "Wrong alignment on Ability_AnointParent_C_AnointParent_OnActionSkillCoolingDown");
static_assert(sizeof(Ability_AnointParent_C_AnointParent_OnActionSkillCoolingDown) == 0x000008, "Wrong size on Ability_AnointParent_C_AnointParent_OnActionSkillCoolingDown");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_OnActionSkillCoolingDown, ActionAbility) == 0x000000, "Member 'Ability_AnointParent_C_AnointParent_OnActionSkillCoolingDown::ActionAbility' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointParent_OnPlayerAbilitySlotChanged
// 0x0008 (0x0008 - 0x0000)
struct Ability_AnointParent_C_AnointParent_OnPlayerAbilitySlotChanged final
{
public:
	class UOakPlayerAbilitySlotData*              SlotData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_AnointParent_C_AnointParent_OnPlayerAbilitySlotChanged) == 0x000008, "Wrong alignment on Ability_AnointParent_C_AnointParent_OnPlayerAbilitySlotChanged");
static_assert(sizeof(Ability_AnointParent_C_AnointParent_OnPlayerAbilitySlotChanged) == 0x000008, "Wrong size on Ability_AnointParent_C_AnointParent_OnPlayerAbilitySlotChanged");
static_assert(offsetof(Ability_AnointParent_C_AnointParent_OnPlayerAbilitySlotChanged, SlotData) == 0x000000, "Member 'Ability_AnointParent_C_AnointParent_OnPlayerAbilitySlotChanged::SlotData' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointOnActionSkillCoolingDown
// 0x0048 (0x0048 - 0x0000)
struct Ability_AnointParent_C_AnointOnActionSkillCoolingDown final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Res;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility*                      LocalActionAbility;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue1;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility_HulkOut*              K2Node_DynamicCast_AsOak_Action_Ability_Hulk_Out;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility_PhaseTrance*          K2Node_DynamicCast_AsOak_Action_Ability_Phase_Trance; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown) == 0x000008, "Wrong alignment on Ability_AnointParent_C_AnointOnActionSkillCoolingDown");
static_assert(sizeof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown) == 0x000048, "Wrong size on Ability_AnointParent_C_AnointOnActionSkillCoolingDown");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, ActionAbility) == 0x000000, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::ActionAbility' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, Res) == 0x000008, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::Res' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, LocalActionAbility) == 0x000010, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::LocalActionAbility' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, CallFunc_ClassIsChildOf_ReturnValue) == 0x000020, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, CallFunc_ClassIsChildOf_ReturnValue1) == 0x000021, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::CallFunc_ClassIsChildOf_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, K2Node_DynamicCast_AsOak_Action_Ability_Hulk_Out) == 0x000028, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::K2Node_DynamicCast_AsOak_Action_Ability_Hulk_Out' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, K2Node_DynamicCast_AsOak_Action_Ability_Phase_Trance) == 0x000038, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::K2Node_DynamicCast_AsOak_Action_Ability_Phase_Trance' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, K2Node_DynamicCast_bSuccess1) == 0x000040, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillCoolingDown, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'Ability_AnointParent_C_AnointOnActionSkillCoolingDown::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointOnActionSkillActivated
// 0x0038 (0x0038 - 0x0000)
struct Ability_AnointParent_C_AnointOnActionSkillActivated final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Res;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility*                      LocalActionAbility;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbility_HulkOut*              K2Node_DynamicCast_AsOak_Action_Ability_Hulk_Out;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility_PhaseTrance*          K2Node_DynamicCast_AsOak_Action_Ability_Phase_Trance; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_C_AnointOnActionSkillActivated) == 0x000008, "Wrong alignment on Ability_AnointParent_C_AnointOnActionSkillActivated");
static_assert(sizeof(Ability_AnointParent_C_AnointOnActionSkillActivated) == 0x000038, "Wrong size on Ability_AnointParent_C_AnointOnActionSkillActivated");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillActivated, ActionAbility) == 0x000000, "Member 'Ability_AnointParent_C_AnointOnActionSkillActivated::ActionAbility' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillActivated, Res) == 0x000008, "Member 'Ability_AnointParent_C_AnointOnActionSkillActivated::Res' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillActivated, LocalActionAbility) == 0x000010, "Member 'Ability_AnointParent_C_AnointOnActionSkillActivated::LocalActionAbility' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillActivated, K2Node_DynamicCast_AsOak_Action_Ability_Hulk_Out) == 0x000018, "Member 'Ability_AnointParent_C_AnointOnActionSkillActivated::K2Node_DynamicCast_AsOak_Action_Ability_Hulk_Out' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillActivated, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Ability_AnointParent_C_AnointOnActionSkillActivated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillActivated, K2Node_DynamicCast_AsOak_Action_Ability_Phase_Trance) == 0x000028, "Member 'Ability_AnointParent_C_AnointOnActionSkillActivated::K2Node_DynamicCast_AsOak_Action_Ability_Phase_Trance' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillActivated, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'Ability_AnointParent_C_AnointOnActionSkillActivated::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillActivated, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'Ability_AnointParent_C_AnointOnActionSkillActivated::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointOnActionSkillReadied
// 0x0010 (0x0010 - 0x0000)
struct Ability_AnointParent_C_AnointOnActionSkillReadied final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Res;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_AnointParent_C_AnointOnActionSkillReadied) == 0x000008, "Wrong alignment on Ability_AnointParent_C_AnointOnActionSkillReadied");
static_assert(sizeof(Ability_AnointParent_C_AnointOnActionSkillReadied) == 0x000010, "Wrong size on Ability_AnointParent_C_AnointOnActionSkillReadied");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillReadied, ActionAbility) == 0x000000, "Member 'Ability_AnointParent_C_AnointOnActionSkillReadied::ActionAbility' has a wrong offset!");
static_assert(offsetof(Ability_AnointParent_C_AnointOnActionSkillReadied, Res) == 0x000008, "Member 'Ability_AnointParent_C_AnointOnActionSkillReadied::Res' has a wrong offset!");

// Function Ability_AnointParent.Ability_AnointParent_C.AnointTriggerEffect
// 0x0148 (0x0148 - 0x0000)
struct Ability_AnointParent_C_AnointTriggerEffect final
{
public:
	bool                                          TriggerEffect;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Res;                                               // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EStatusEffectDurationType                     Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatusEffectDurationType                     Temp_byte_Variable1;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue1;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_EvaluateAttributeInitializationData_ReturnValue; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnointRegisterCDM_Res;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateAttributeInitializationData_ReturnValue1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EStatusEffectDurationType                     K2Node_Select_Default;                             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x00B8(0x0038)(NoDestructor)
	class FString                                 K2Node_Select1_Default;                            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
