#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Krakatoa

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Krakatoa.Ability_Krakatoa_C
// 0x0038 (0x0130 - 0x00F8)
class UAbility_Krakatoa_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	class AActor*                                 Killed;                                            // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_BOTD; // 0x0108(0x0028)()

public:
	void ExecuteUbergraph_Ability_Krakatoa(int32 EntryPoint);
	void OnActivated();
	void OnCausedDeath_Event(class UDamageComponent* Damaged, const struct FCausedDeathDetails& Details);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Krakatoa_C">();
	}
	static class UAbility_Krakatoa_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Krakatoa_C>();
	}
};
static_assert(alignof(UAbility_Krakatoa_C) == 0x000008, "Wrong alignment on UAbility_Krakatoa_C");
static_assert(sizeof(UAbility_Krakatoa_C) == 0x000130, "Wrong size on UAbility_Krakatoa_C");
static_assert(offsetof(UAbility_Krakatoa_C, UberGraphFrame) == 0x0000F8, "Member 'UAbility_Krakatoa_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbility_Krakatoa_C, Killed) == 0x000100, "Member 'UAbility_Krakatoa_C::Killed' has a wrong offset!");
static_assert(offsetof(UAbility_Krakatoa_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_BOTD) == 0x000108, "Member 'UAbility_Krakatoa_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_BOTD' has a wrong offset!");

}

