#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_MindMelt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_MindMelt.Ability_Artifact_MindMelt_C.ExecuteUbergraph_Ability_Artifact_MindMelt
// 0x02A8 (0x02A8 - 0x0000)
struct Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             Temp_struct_Variable1;                             // 0x0098(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable2;                             // 0x0138(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGroundSlamEndedDetails                K2Node_CustomEvent_Details;                        // 0x0148(0x0008)(ConstParm, NoDestructor)
	TDelegate<void(struct FGroundSlamEndedDetails& Details)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0168(0x0028)(NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue2;         // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue3;         // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x01A8(0x0018)()
	float                                         CallFunc_GetValueOfAttribute_ReturnValue4;         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01C8(0x0008)(NoDestructor)
	class ABPChar_Player_C*                       K2Node_DynamicCast_AsBPChar_Player;                // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue5;         // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x01E0(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0218(0x0018)(NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue6;         // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec1;               // 0x0238(0x0038)(NoDestructor)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue1;           // 0x0270(0x0018)()
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue1;             // 0x0288(0x0018)(NoDestructor, ContainsInstancedReference)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt) == 0x000008, "Wrong alignment on Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt");
static_assert(sizeof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt) == 0x0002A8, "Wrong size on Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, EntryPoint) == 0x000000, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, Temp_struct_Variable) == 0x000008, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, Temp_struct_Variable1) == 0x000098, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, K2Node_CreateDelegate_OutputDelegate) == 0x000128, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, Temp_struct_Variable2) == 0x000138, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, K2Node_CustomEvent_Details) == 0x000148, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, K2Node_CreateDelegate_OutputDelegate1) == 0x000150, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000160, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000168, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000190, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000194, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, K2Node_SwitchEnum_CmpSuccess) == 0x000198, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_GetValueOfAttribute_ReturnValue2) == 0x00019C, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_GetValueOfAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0001A0, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_GetValueOfAttribute_ReturnValue3) == 0x0001A4, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_GetValueOfAttribute_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_PostAttachedEvent_ReturnValue) == 0x0001A8, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_GetValueOfAttribute_ReturnValue4) == 0x0001C0, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_GetValueOfAttribute_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001C8, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, K2Node_DynamicCast_AsBPChar_Player) == 0x0001D0, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::K2Node_DynamicCast_AsBPChar_Player' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_GetValueOfAttribute_ReturnValue5) == 0x0001DC, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_GetValueOfAttribute_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, K2Node_MakeStruct_StatusEffectSpec) == 0x0001E0, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_AddStatusEffect_ReturnValue) == 0x000218, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_GetValueOfAttribute_ReturnValue6) == 0x000230, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_GetValueOfAttribute_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, K2Node_MakeStruct_StatusEffectSpec1) == 0x000238, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::K2Node_MakeStruct_StatusEffectSpec1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_PostAttachedEvent_ReturnValue1) == 0x000270, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_PostAttachedEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_AddStatusEffect_ReturnValue1) == 0x000288, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_AddStatusEffect_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt, CallFunc_K2Play_ReturnValue) == 0x0002A0, "Member 'Ability_Artifact_MindMelt_C_ExecuteUbergraph_Ability_Artifact_MindMelt::CallFunc_K2Play_ReturnValue' has a wrong offset!");

// Function Ability_Artifact_MindMelt.Ability_Artifact_MindMelt_C.SlamEnd
// 0x0008 (0x0008 - 0x0000)
struct Ability_Artifact_MindMelt_C_SlamEnd final
{
public:
	struct FGroundSlamEndedDetails                Details;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Ability_Artifact_MindMelt_C_SlamEnd) == 0x000004, "Wrong alignment on Ability_Artifact_MindMelt_C_SlamEnd");
static_assert(sizeof(Ability_Artifact_MindMelt_C_SlamEnd) == 0x000008, "Wrong size on Ability_Artifact_MindMelt_C_SlamEnd");
static_assert(offsetof(Ability_Artifact_MindMelt_C_SlamEnd, Details) == 0x000000, "Member 'Ability_Artifact_MindMelt_C_SlamEnd::Details' has a wrong offset!");

}

