#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Siren_Grasp_ConstantNova

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Ability_AnointParent_Siren_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Siren_Grasp_ConstantNova.Ability_Siren_Grasp_ConstantNova_C
// 0x0018 (0x0228 - 0x0210)
class UAbility_Siren_Grasp_ConstantNova_C final : public UAbility_AnointParent_Siren_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Ability_Siren_Grasp_ConstantNova_C; // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 ActionSkillElement;                                // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NovaTimer;                                         // 0x0220(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_Ability_Siren_Grasp_ConstantNova(int32 EntryPoint);
	void AnointGraspEnded(bool Killed);
	void StartTriggeringNovas();
	void TriggerNova();
	void AnointRemoveEffect();
	void AnointTriggerEffect(bool TriggerEffect, bool* Res);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Siren_Grasp_ConstantNova_C">();
	}
	static class UAbility_Siren_Grasp_ConstantNova_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Siren_Grasp_ConstantNova_C>();
	}
};
static_assert(alignof(UAbility_Siren_Grasp_ConstantNova_C) == 0x000008, "Wrong alignment on UAbility_Siren_Grasp_ConstantNova_C");
static_assert(sizeof(UAbility_Siren_Grasp_ConstantNova_C) == 0x000228, "Wrong size on UAbility_Siren_Grasp_ConstantNova_C");
static_assert(offsetof(UAbility_Siren_Grasp_ConstantNova_C, UberGraphFrame_Ability_Siren_Grasp_ConstantNova_C) == 0x000210, "Member 'UAbility_Siren_Grasp_ConstantNova_C::UberGraphFrame_Ability_Siren_Grasp_ConstantNova_C' has a wrong offset!");
static_assert(offsetof(UAbility_Siren_Grasp_ConstantNova_C, ActionSkillElement) == 0x000218, "Member 'UAbility_Siren_Grasp_ConstantNova_C::ActionSkillElement' has a wrong offset!");
static_assert(offsetof(UAbility_Siren_Grasp_ConstantNova_C, NovaTimer) == 0x000220, "Member 'UAbility_Siren_Grasp_ConstantNova_C::NovaTimer' has a wrong offset!");

}

