#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Tizzy

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Tizzy.Ability_Tizzy_C
// 0x0080 (0x0178 - 0x00F8)
class UAbility_Tizzy_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_BinaryOperator; // 0x0100(0x0028)()
	class UBPHeatComponent_CoV_C*                 HeatComponent;                                     // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakDamageCauserComponent*              DamageCauserComponent;                             // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakAbilityResourceController_WeaponShotModifier RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Ability_Tizzy; // 0x0140(0x0028)()
	int32                                         Count;                                             // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                Weapon;                                            // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Ability_Tizzy(int32 EntryPoint);
	void WeaponUsed(class AWeapon* EventWeapon);
	void OnDeactivated();
	void NotifyHeatChange();
	void OnActivated();
	void StartTizzy();
	void StopTizzy();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Tizzy_C">();
	}
	static class UAbility_Tizzy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Tizzy_C>();
	}
};
static_assert(alignof(UAbility_Tizzy_C) == 0x000008, "Wrong alignment on UAbility_Tizzy_C");
static_assert(sizeof(UAbility_Tizzy_C) == 0x000178, "Wrong size on UAbility_Tizzy_C");
static_assert(offsetof(UAbility_Tizzy_C, UberGraphFrame) == 0x0000F8, "Member 'UAbility_Tizzy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbility_Tizzy_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_BinaryOperator) == 0x000100, "Member 'UAbility_Tizzy_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_BinaryOperator' has a wrong offset!");
static_assert(offsetof(UAbility_Tizzy_C, HeatComponent) == 0x000128, "Member 'UAbility_Tizzy_C::HeatComponent' has a wrong offset!");
static_assert(offsetof(UAbility_Tizzy_C, Player) == 0x000130, "Member 'UAbility_Tizzy_C::Player' has a wrong offset!");
static_assert(offsetof(UAbility_Tizzy_C, DamageCauserComponent) == 0x000138, "Member 'UAbility_Tizzy_C::DamageCauserComponent' has a wrong offset!");
static_assert(offsetof(UAbility_Tizzy_C, RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Ability_Tizzy) == 0x000140, "Member 'UAbility_Tizzy_C::RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Ability_Tizzy' has a wrong offset!");
static_assert(offsetof(UAbility_Tizzy_C, Count) == 0x000168, "Member 'UAbility_Tizzy_C::Count' has a wrong offset!");
static_assert(offsetof(UAbility_Tizzy_C, Weapon) == 0x000170, "Member 'UAbility_Tizzy_C::Weapon' has a wrong offset!");

}

