#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Contained

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_Contained.Ability_Contained_C
// 0x0048 (0x0140 - 0x00F8)
class UAbility_Contained_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	class UOakDamageCauserComponent*              OakDamageCauser;                                   // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Quickdraw; // 0x0108(0x0028)()
	class AOakCharacter*                          OakChar;                                           // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEffectApplied;                                   // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Ability_Contained(int32 EntryPoint);
	void OnCauseAnyDamage_Event(class AActor* DamageInstigator, float Damage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);
	void OnActivated();
	void OnDeactivated();
	void OnPaused();
	void OnUnregistered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_Contained_C">();
	}
	static class UAbility_Contained_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_Contained_C>();
	}
};
static_assert(alignof(UAbility_Contained_C) == 0x000008, "Wrong alignment on UAbility_Contained_C");
static_assert(sizeof(UAbility_Contained_C) == 0x000140, "Wrong size on UAbility_Contained_C");
static_assert(offsetof(UAbility_Contained_C, UberGraphFrame) == 0x0000F8, "Member 'UAbility_Contained_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbility_Contained_C, OakDamageCauser) == 0x000100, "Member 'UAbility_Contained_C::OakDamageCauser' has a wrong offset!");
static_assert(offsetof(UAbility_Contained_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Quickdraw) == 0x000108, "Member 'UAbility_Contained_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Quickdraw' has a wrong offset!");
static_assert(offsetof(UAbility_Contained_C, OakChar) == 0x000130, "Member 'UAbility_Contained_C::OakChar' has a wrong offset!");
static_assert(offsetof(UAbility_Contained_C, IsEffectApplied) == 0x000138, "Member 'UAbility_Contained_C::IsEffectApplied' has a wrong offset!");

}

