#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_EG_Generic_ConsecutiveHitsDmgStack

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function Ability_EG_Generic_ConsecutiveHitsDmgStack.Ability_EG_Generic_ConsecutiveHitsDmgStack_C.ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack
// 0x01A8 (0x01A8 - 0x0000)
struct Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue1;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec;             // 0x0018(0x0018)(NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Player_C*                       K2Node_DynamicCast_AsBPChar_Player;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageInstigator;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0070(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   K2Node_CustomEvent_Details;                        // 0x0088(0x0060)(ContainsInstancedReference)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x00E8(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0120(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0138(0x0028)(NoDestructor)
	bool                                          CallFunc_IsAbilityTimerActive_ReturnValue;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_Event_Spec;                                 // 0x0168(0x0018)(ConstParm, NoDestructor)
	struct FOakAbilityTimerResult                 K2Node_Event_Result;                               // 0x0180(0x000C)(ConstParm, NoDestructor)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec;          // 0x0190(0x0010)(NoDestructor)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue;           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack) == 0x000008, "Wrong alignment on Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack");
static_assert(sizeof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack) == 0x0001A8, "Wrong size on Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, EntryPoint) == 0x000000, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, CallFunc_GetDataTableValue_OutValue) == 0x000004, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, CallFunc_GetDataTableValue_ReturnValue) == 0x000008, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, CallFunc_GetDataTableValue_OutValue1) == 0x00000C, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::CallFunc_GetDataTableValue_OutValue1' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, CallFunc_GetDataTableValue_ReturnValue1) == 0x000010, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::CallFunc_GetDataTableValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_MakeStruct_OakAbilityTimerSpec) == 0x000018, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_MakeStruct_OakAbilityTimerSpec' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, CallFunc_GetAbilityOwner_ReturnValue) == 0x000030, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_DynamicCast_AsBPChar_Player) == 0x000040, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_DynamicCast_AsBPChar_Player' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_CustomEvent_DamageInstigator) == 0x000060, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_CustomEvent_DamageInstigator' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_CustomEvent_Damage) == 0x000068, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_CustomEvent_DamageType) == 0x000070, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_CustomEvent_DamageSource) == 0x000078, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_CustomEvent_DamagedActor) == 0x000080, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_CustomEvent_Details) == 0x000088, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_MakeStruct_StatusEffectSpec) == 0x0000E8, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, CallFunc_AddStatusEffect_ReturnValue) == 0x000120, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000138, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, CallFunc_IsAbilityTimerActive_ReturnValue) == 0x000160, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::CallFunc_IsAbilityTimerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_Event_Spec) == 0x000168, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_Event_Spec' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_Event_Result) == 0x000180, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, K2Node_MakeStruct_StatusEffectRemoveSpec) == 0x000190, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::K2Node_MakeStruct_StatusEffectRemoveSpec' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack, CallFunc_RemoveStatusEffect_ReturnValue) == 0x0001A0, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_ExecuteUbergraph_Ability_EG_Generic_ConsecutiveHitsDmgStack::CallFunc_RemoveStatusEffect_ReturnValue' has a wrong offset!");

// Function Ability_EG_Generic_ConsecutiveHitsDmgStack.Ability_EG_Generic_ConsecutiveHitsDmgStack_C.OnAbilityTimerEnded
// 0x0028 (0x0028 - 0x0000)
struct Ability_EG_Generic_ConsecutiveHitsDmgStack_C_OnAbilityTimerEnded final
{
public:
	struct FOakAbilityTimerSpec                   Spec;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FOakAbilityTimerResult                 Result;                                            // 0x0018(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_OnAbilityTimerEnded) == 0x000008, "Wrong alignment on Ability_EG_Generic_ConsecutiveHitsDmgStack_C_OnAbilityTimerEnded");
static_assert(sizeof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_OnAbilityTimerEnded) == 0x000028, "Wrong size on Ability_EG_Generic_ConsecutiveHitsDmgStack_C_OnAbilityTimerEnded");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_OnAbilityTimerEnded, Spec) == 0x000000, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_OnAbilityTimerEnded::Spec' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_OnAbilityTimerEnded, Result) == 0x000018, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_OnAbilityTimerEnded::Result' has a wrong offset!");

// Function Ability_EG_Generic_ConsecutiveHitsDmgStack.Ability_EG_Generic_ConsecutiveHitsDmgStack_C.CausedDamage
// 0x0088 (0x0088 - 0x0000)
struct Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0028(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage) == 0x000008, "Wrong alignment on Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage");
static_assert(sizeof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage) == 0x000088, "Wrong size on Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage, DamageInstigator) == 0x000000, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage::DamageInstigator' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage, Damage) == 0x000008, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage::Damage' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage, DamageType) == 0x000010, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage::DamageType' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage, DamageSource) == 0x000018, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage::DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage, DamagedActor) == 0x000020, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage::DamagedActor' has a wrong offset!");
static_assert(offsetof(Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage, Details) == 0x000028, "Member 'Ability_EG_Generic_ConsecutiveHitsDmgStack_C_CausedDamage::Details' has a wrong offset!");

}

