#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_All_SkillEnd_AddGrenade

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Ability_All_SkillEnd_AddGrenade.Ability_All_SkillEnd_AddGrenade_C.ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade
// 0x00C0 (0x00C0 - 0x0000)
struct Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameResourcePoolReference             CallFunc_GetResourcePoolByResource_ReturnValue;    // 0x0038(0x0018)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakResourcePoolReference_bValid;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakResourcePoolReference_CurrentValue;  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakResourcePoolReference_MinValue;      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakResourcePoolReference_MaxValue;      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0098(0x0028)(NoDestructor)
};
static_assert(alignof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade) == 0x000008, "Wrong alignment on Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade");
static_assert(sizeof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade) == 0x0000C0, "Wrong size on Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, EntryPoint) == 0x000000, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, K2Node_DynamicCast_AsOak_Character) == 0x000018, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_GetResourcePoolByResource_ReturnValue) == 0x000038, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_GetResourcePoolByResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_BreakResourcePoolReference_bValid) == 0x000050, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_BreakResourcePoolReference_bValid' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_BreakResourcePoolReference_CurrentValue) == 0x000054, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_BreakResourcePoolReference_CurrentValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_BreakResourcePoolReference_MinValue) == 0x000058, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_BreakResourcePoolReference_MinValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_BreakResourcePoolReference_MaxValue) == 0x00005C, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_BreakResourcePoolReference_MaxValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, Temp_bool_Variable) == 0x000060, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000061, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, Temp_float_Variable) == 0x000064, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_GetDataTableValue_OutValue) == 0x00006C, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_GetDataTableValue_ReturnValue) == 0x000070, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, K2Node_Select_Default) == 0x000074, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_GetAbilityOwner_ReturnValue1) == 0x000078, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, K2Node_CustomEvent_ActionAbility) == 0x000080, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::K2Node_CustomEvent_ActionAbility' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_GetOwner_ReturnValue1) == 0x000088, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, CallFunc_GetComponentByClass_ReturnValue) == 0x000090, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000098, "Member 'Ability_All_SkillEnd_AddGrenade_C_ExecuteUbergraph_Ability_All_SkillEnd_AddGrenade::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

// Function Ability_All_SkillEnd_AddGrenade.Ability_All_SkillEnd_AddGrenade_C.SkillCoolingDown
// 0x0008 (0x0008 - 0x0000)
struct Ability_All_SkillEnd_AddGrenade_C_SkillCoolingDown final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_All_SkillEnd_AddGrenade_C_SkillCoolingDown) == 0x000008, "Wrong alignment on Ability_All_SkillEnd_AddGrenade_C_SkillCoolingDown");
static_assert(sizeof(Ability_All_SkillEnd_AddGrenade_C_SkillCoolingDown) == 0x000008, "Wrong size on Ability_All_SkillEnd_AddGrenade_C_SkillCoolingDown");
static_assert(offsetof(Ability_All_SkillEnd_AddGrenade_C_SkillCoolingDown, ActionAbility) == 0x000000, "Member 'Ability_All_SkillEnd_AddGrenade_C_SkillCoolingDown::ActionAbility' has a wrong offset!");

}

