#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Gunner_IBGrenadeChance

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Ability_Gunner_IBGrenadeChance.Ability_Gunner_IBGrenadeChance_C.ExecuteUbergraph_Ability_Gunner_IBGrenadeChance
// 0x0160 (0x0160 - 0x0000)
struct Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateAttributeInitializationData_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateAttributeInitializationData_ReturnValue1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter_IronBear*                 K2Node_Event_IronBear;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_IronCub*                  K2Node_DynamicCast_AsOak_Character_Iron_Cub;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_Player*                   K2Node_DynamicCast_AsOak_Character_Player;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor)
	TDelegate<void(class UDamageComponent* DamageReceiver, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, const struct FReceivedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0070(0x0028)(NoDestructor)
	TDelegate<void(class UDamageComponent* DamageReceiver, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, const struct FReceivedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class AGrenade*                               CallFunc_SpawnAmmoOptionalGrenade_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x00B0(0x0028)(NoDestructor)
	class UDamageComponent*                       K2Node_CustomEvent_DamageReceiver;                 // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x00E8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x00F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_CustomEvent_DamageCauser;                   // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_CustomEvent_Details;                        // 0x0108(0x0058)(ContainsInstancedReference)
};
static_assert(alignof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance) == 0x000008, "Wrong alignment on Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance");
static_assert(sizeof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance) == 0x000160, "Wrong size on Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, EntryPoint) == 0x000000, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, CallFunc_EvaluateAttributeInitializationData_ReturnValue) == 0x000004, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::CallFunc_EvaluateAttributeInitializationData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, CallFunc_EvaluateAttributeInitializationData_ReturnValue1) == 0x000008, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::CallFunc_EvaluateAttributeInitializationData_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00000C, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_Event_IronBear) == 0x000010, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_Event_IronBear' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_DynamicCast_AsOak_Character_Iron_Cub) == 0x000018, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_DynamicCast_AsOak_Character_Iron_Cub' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, CallFunc_GetAbilityOwner_ReturnValue) == 0x000028, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_DynamicCast_AsOak_Character_Player) == 0x000038, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_DynamicCast_AsOak_Character_Player' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_DynamicCast_bSuccess1) == 0x000040, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CreateDelegate_OutputDelegate1) == 0x000060, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000070, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CreateDelegate_OutputDelegate2) == 0x000098, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, CallFunc_SpawnAmmoOptionalGrenade_ReturnValue) == 0x0000A8, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::CallFunc_SpawnAmmoOptionalGrenade_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x0000B0, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CustomEvent_DamageReceiver) == 0x0000D8, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CustomEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CustomEvent_Damage) == 0x0000E0, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CustomEvent_DamageType) == 0x0000E8, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CustomEvent_DamageSource) == 0x0000F0, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CustomEvent_InstigatedBy) == 0x0000F8, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CustomEvent_DamageCauser) == 0x000100, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance, K2Node_CustomEvent_Details) == 0x000108, "Member 'Ability_Gunner_IBGrenadeChance_C_ExecuteUbergraph_Ability_Gunner_IBGrenadeChance::K2Node_CustomEvent_Details' has a wrong offset!");

// Function Ability_Gunner_IBGrenadeChance.Ability_Gunner_IBGrenadeChance_C.OnTookDamage
// 0x0088 (0x0088 - 0x0000)
struct Ability_Gunner_IBGrenadeChance_C_OnTookDamage final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0030(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Ability_Gunner_IBGrenadeChance_C_OnTookDamage) == 0x000008, "Wrong alignment on Ability_Gunner_IBGrenadeChance_C_OnTookDamage");
static_assert(sizeof(Ability_Gunner_IBGrenadeChance_C_OnTookDamage) == 0x000088, "Wrong size on Ability_Gunner_IBGrenadeChance_C_OnTookDamage");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_OnTookDamage, DamageReceiver) == 0x000000, "Member 'Ability_Gunner_IBGrenadeChance_C_OnTookDamage::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_OnTookDamage, Damage) == 0x000008, "Member 'Ability_Gunner_IBGrenadeChance_C_OnTookDamage::Damage' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_OnTookDamage, DamageType) == 0x000010, "Member 'Ability_Gunner_IBGrenadeChance_C_OnTookDamage::DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_OnTookDamage, DamageSource) == 0x000018, "Member 'Ability_Gunner_IBGrenadeChance_C_OnTookDamage::DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_OnTookDamage, InstigatedBy) == 0x000020, "Member 'Ability_Gunner_IBGrenadeChance_C_OnTookDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_OnTookDamage, DamageCauser) == 0x000028, "Member 'Ability_Gunner_IBGrenadeChance_C_OnTookDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_OnTookDamage, Details) == 0x000030, "Member 'Ability_Gunner_IBGrenadeChance_C_OnTookDamage::Details' has a wrong offset!");

// Function Ability_Gunner_IBGrenadeChance.Ability_Gunner_IBGrenadeChance_C.AnointIronIronBearStarted
// 0x0008 (0x0008 - 0x0000)
struct Ability_Gunner_IBGrenadeChance_C_AnointIronIronBearStarted final
{
public:
	class AOakCharacter_IronBear*                 IronBear;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_Gunner_IBGrenadeChance_C_AnointIronIronBearStarted) == 0x000008, "Wrong alignment on Ability_Gunner_IBGrenadeChance_C_AnointIronIronBearStarted");
static_assert(sizeof(Ability_Gunner_IBGrenadeChance_C_AnointIronIronBearStarted) == 0x000008, "Wrong size on Ability_Gunner_IBGrenadeChance_C_AnointIronIronBearStarted");
static_assert(offsetof(Ability_Gunner_IBGrenadeChance_C_AnointIronIronBearStarted, IronBear) == 0x000000, "Member 'Ability_Gunner_IBGrenadeChance_C_AnointIronIronBearStarted::IronBear' has a wrong offset!");

}

