#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Artifact_StaticTouch

#include "Basic.hpp"

#include "GbxWeapon_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Ability_Artifact_StaticTouch.Ability_Artifact_StaticTouch_C.ExecuteUbergraph_Ability_Artifact_StaticTouch
// 0x01E8 (0x01E8 - 0x0000)
struct Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FSlideEndedDetails                     K2Node_CustomEvent_Details1;                       // 0x0020(0x0018)(ConstParm, NoDestructor)
	TDelegate<void(struct FSlideEndedDetails& Details)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0054(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceBetweenVectors_Distance;       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageInstigator;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0080(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   K2Node_CustomEvent_Details;                        // 0x0090(0x0060)(ContainsInstancedReference)
	TDelegate<void(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment;             // 0x0100(0x0028)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Compare_Damage_Source_Equal;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Not_Equal;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0130(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x0158(0x0028)(NoDestructor)
	class AActor*                                 CallFunc_RunEnvQueryForBestActor_ResultActor;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunEnvQueryForBestActor_ReturnValue;      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment1;            // 0x0190(0x0028)(NoDestructor, ContainsInstancedReference)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2; // 0x01B8(0x0028)(NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch) == 0x000008, "Wrong alignment on Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch");
static_assert(sizeof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch) == 0x0001E8, "Wrong size on Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, EntryPoint) == 0x000000, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CustomEvent_Details1) == 0x000020, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CustomEvent_Details1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CreateDelegate_OutputDelegate1) == 0x000038, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000054, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_GetDistanceBetweenVectors_Distance) == 0x000060, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_GetDistanceBetweenVectors_Distance' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_Add_FloatFloat_ReturnValue) == 0x000064, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CustomEvent_DamageInstigator) == 0x000068, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CustomEvent_DamageInstigator' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CustomEvent_Damage) == 0x000070, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CustomEvent_DamageType) == 0x000078, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CustomEvent_DamageSource) == 0x000080, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CustomEvent_DamagedActor) == 0x000088, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CustomEvent_Details) == 0x000090, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_CreateDelegate_OutputDelegate2) == 0x0000F0, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_MakeStruct_LightBeamAttachment) == 0x000100, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_MakeStruct_LightBeamAttachment' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_Compare_Damage_Source_Equal) == 0x000128, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_Compare_Damage_Source_Equal' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_Compare_Damage_Source_Not_Equal) == 0x000129, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_Compare_Damage_Source_Not_Equal' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000130, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x000158, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_RunEnvQueryForBestActor_ResultActor) == 0x000180, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_RunEnvQueryForBestActor_ResultActor' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_RunEnvQueryForBestActor_ReturnValue) == 0x000188, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_RunEnvQueryForBestActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_MakeStruct_LightBeamAttachment1) == 0x000190, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_MakeStruct_LightBeamAttachment1' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2) == 0x0001B8, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0001E0, "Member 'Ability_Artifact_StaticTouch_C_ExecuteUbergraph_Ability_Artifact_StaticTouch::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");

// Function Ability_Artifact_StaticTouch.Ability_Artifact_StaticTouch_C.CausedDamage
// 0x0088 (0x0088 - 0x0000)
struct Ability_Artifact_StaticTouch_C_CausedDamage final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0028(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Ability_Artifact_StaticTouch_C_CausedDamage) == 0x000008, "Wrong alignment on Ability_Artifact_StaticTouch_C_CausedDamage");
static_assert(sizeof(Ability_Artifact_StaticTouch_C_CausedDamage) == 0x000088, "Wrong size on Ability_Artifact_StaticTouch_C_CausedDamage");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_CausedDamage, DamageInstigator) == 0x000000, "Member 'Ability_Artifact_StaticTouch_C_CausedDamage::DamageInstigator' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_CausedDamage, Damage) == 0x000008, "Member 'Ability_Artifact_StaticTouch_C_CausedDamage::Damage' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_CausedDamage, DamageType) == 0x000010, "Member 'Ability_Artifact_StaticTouch_C_CausedDamage::DamageType' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_CausedDamage, DamageSource) == 0x000018, "Member 'Ability_Artifact_StaticTouch_C_CausedDamage::DamageSource' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_CausedDamage, DamagedActor) == 0x000020, "Member 'Ability_Artifact_StaticTouch_C_CausedDamage::DamagedActor' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_CausedDamage, Details) == 0x000028, "Member 'Ability_Artifact_StaticTouch_C_CausedDamage::Details' has a wrong offset!");

// Function Ability_Artifact_StaticTouch.Ability_Artifact_StaticTouch_C.EndSlide
// 0x0018 (0x0018 - 0x0000)
struct Ability_Artifact_StaticTouch_C_EndSlide final
{
public:
	struct FSlideEndedDetails                     Details;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Ability_Artifact_StaticTouch_C_EndSlide) == 0x000008, "Wrong alignment on Ability_Artifact_StaticTouch_C_EndSlide");
static_assert(sizeof(Ability_Artifact_StaticTouch_C_EndSlide) == 0x000018, "Wrong size on Ability_Artifact_StaticTouch_C_EndSlide");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_EndSlide, Details) == 0x000000, "Member 'Ability_Artifact_StaticTouch_C_EndSlide::Details' has a wrong offset!");

// Function Ability_Artifact_StaticTouch.Ability_Artifact_StaticTouch_C.Ammo Return
// 0x0020 (0x0020 - 0x0000)
struct Ability_Artifact_StaticTouch_C_Ammo_Return final
{
public:
	class AOakCharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_Artifact_StaticTouch_C_Ammo_Return) == 0x000008, "Wrong alignment on Ability_Artifact_StaticTouch_C_Ammo_Return");
static_assert(sizeof(Ability_Artifact_StaticTouch_C_Ammo_Return) == 0x000020, "Wrong size on Ability_Artifact_StaticTouch_C_Ammo_Return");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_Ammo_Return, Character) == 0x000000, "Member 'Ability_Artifact_StaticTouch_C_Ammo_Return::Character' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_Ammo_Return, CallFunc_GetWeapon_ReturnValue) == 0x000008, "Member 'Ability_Artifact_StaticTouch_C_Ammo_Return::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_Ammo_Return, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000010, "Member 'Ability_Artifact_StaticTouch_C_Ammo_Return::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_Ammo_Return, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'Ability_Artifact_StaticTouch_C_Ammo_Return::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Artifact_StaticTouch_C_Ammo_Return, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'Ability_Artifact_StaticTouch_C_Ammo_Return::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

}

