#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_SparkyBoom

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ability_SparkyBoom.Ability_SparkyBoom_v2_C
// 0x0088 (0x0180 - 0x00F8)
class UAbility_SparkyBoom_v2_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	struct FOakAbilityResourceController_WeaponShotModifier RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Ability_Malevolent; // 0x0100(0x0028)()
	class UOakDamageCauserComponent*              OakDamageCauser;                                   // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Quickdraw; // 0x0130(0x0028)()
	class AOakCharacter*                          OakChar;                                           // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                MyWeapon;                                          // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectInstanceReference         FireStatus;                                        // 0x0168(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)

public:
	void ExecuteUbergraph_Ability_SparkyBoom_v2(int32 EntryPoint);
	void Event_EnteredDownState();
	void Event_ReloadEnded(class AWeapon* EventWeapon, bool bCompleted);
	void OnActivated();
	void Event_ReloadStarted(class AWeapon* EventWeapon, bool bAutoReload);
	void OnDeactivated();
	void OnPaused();
	void OnUnregistered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ability_SparkyBoom_v2_C">();
	}
	static class UAbility_SparkyBoom_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_SparkyBoom_v2_C>();
	}
};
static_assert(alignof(UAbility_SparkyBoom_v2_C) == 0x000008, "Wrong alignment on UAbility_SparkyBoom_v2_C");
static_assert(sizeof(UAbility_SparkyBoom_v2_C) == 0x000180, "Wrong size on UAbility_SparkyBoom_v2_C");
static_assert(offsetof(UAbility_SparkyBoom_v2_C, UberGraphFrame) == 0x0000F8, "Member 'UAbility_SparkyBoom_v2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbility_SparkyBoom_v2_C, RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Ability_Malevolent) == 0x000100, "Member 'UAbility_SparkyBoom_v2_C::RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Ability_Malevolent' has a wrong offset!");
static_assert(offsetof(UAbility_SparkyBoom_v2_C, OakDamageCauser) == 0x000128, "Member 'UAbility_SparkyBoom_v2_C::OakDamageCauser' has a wrong offset!");
static_assert(offsetof(UAbility_SparkyBoom_v2_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Quickdraw) == 0x000130, "Member 'UAbility_SparkyBoom_v2_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Ability_Quickdraw' has a wrong offset!");
static_assert(offsetof(UAbility_SparkyBoom_v2_C, OakChar) == 0x000158, "Member 'UAbility_SparkyBoom_v2_C::OakChar' has a wrong offset!");
static_assert(offsetof(UAbility_SparkyBoom_v2_C, MyWeapon) == 0x000160, "Member 'UAbility_SparkyBoom_v2_C::MyWeapon' has a wrong offset!");
static_assert(offsetof(UAbility_SparkyBoom_v2_C, FireStatus) == 0x000168, "Member 'UAbility_SparkyBoom_v2_C::FireStatus' has a wrong offset!");

}

