#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_Siren_Grasp_TerrorSkulls

#include "Basic.hpp"

#include "GbxWeapon_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Ability_Siren_Grasp_TerrorSkulls.Ability_Siren_Grasp_TerrorSkulls_C.ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls
// 0x02B0 (0x02B0 - 0x0000)
struct Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0014(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAbility_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Enemy;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhaseTranceElementalType                     K2Node_CustomEvent_Element;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Enemy, EPhaseTranceElementalType Element)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UBPEventHub_Siren_C*                    K2Node_DynamicCast_AsBPEvent_Hub_Siren;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0080(0x0028)(NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Player_C*                       K2Node_DynamicCast_AsBPChar_Player;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilitySpec                        K2Node_MakeStruct_GbxAbilitySpec;                  // 0x00D0(0x0010)(NoDestructor)
	class UGbxAbility*                            CallFunc_AddAbility_ReturnValue;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnCone_ReturnValue;         // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0140(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x014C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0158(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x0168(0x0140)(ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls) == 0x000010, "Wrong alignment on Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls");
static_assert(sizeof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls) == 0x0002B0, "Wrong size on Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, EntryPoint) == 0x000000, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GetActorForwardVector_ReturnValue) == 0x000004, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GetSocketLocation_ReturnValue) == 0x000014, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_HasAbility_ReturnValue) == 0x000020, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_HasAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GetAbilityOwner_ReturnValue) == 0x000028, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_CustomEvent_Enemy) == 0x000038, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_CustomEvent_Enemy' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_CustomEvent_Element) == 0x000040, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_CustomEvent_Element' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_DynamicCast_AsBPEvent_Hub_Siren) == 0x000070, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_DynamicCast_AsBPEvent_Hub_Siren' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000080, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GetAbilityOwner_ReturnValue1) == 0x0000A8, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, Temp_int_Loop_Counter_Variable) == 0x0000B0, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GetOwner_ReturnValue1) == 0x0000B8, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_DynamicCast_AsBPChar_Player) == 0x0000C0, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_DynamicCast_AsBPChar_Player' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_DynamicCast_bSuccess1) == 0x0000C8, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_MakeStruct_GbxAbilitySpec) == 0x0000D0, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_MakeStruct_GbxAbilitySpec' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_AddAbility_ReturnValue) == 0x0000E0, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_AddAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GetValueOfAttribute_ReturnValue) == 0x0000E8, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_FTrunc_ReturnValue) == 0x0000EC, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x0000F0, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_GeneratePointsOnCone_ReturnValue) == 0x0000F8, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_GeneratePointsOnCone_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_Less_FloatFloat_ReturnValue) == 0x000108, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_Array_Get_Item) == 0x000110, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_BreakTransform_Location) == 0x000140, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_BreakTransform_Rotation) == 0x00014C, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_BreakTransform_Scale) == 0x000158, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_Array_Length_ReturnValue) == 0x000164, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, K2Node_MakeStruct_LightProjectileInitializationData) == 0x000168, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls, CallFunc_Less_IntInt_ReturnValue) == 0x0002A8, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_ExecuteUbergraph_Ability_Siren_Grasp_TerrorSkulls::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Ability_Siren_Grasp_TerrorSkulls.Ability_Siren_Grasp_TerrorSkulls_C.GraspedTarget
// 0x0010 (0x0010 - 0x0000)
struct Ability_Siren_Grasp_TerrorSkulls_C_GraspedTarget final
{
public:
	class AActor*                                 Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhaseTranceElementalType                     Element;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ability_Siren_Grasp_TerrorSkulls_C_GraspedTarget) == 0x000008, "Wrong alignment on Ability_Siren_Grasp_TerrorSkulls_C_GraspedTarget");
static_assert(sizeof(Ability_Siren_Grasp_TerrorSkulls_C_GraspedTarget) == 0x000010, "Wrong size on Ability_Siren_Grasp_TerrorSkulls_C_GraspedTarget");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_GraspedTarget, Enemy) == 0x000000, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_GraspedTarget::Enemy' has a wrong offset!");
static_assert(offsetof(Ability_Siren_Grasp_TerrorSkulls_C_GraspedTarget, Element) == 0x000008, "Member 'Ability_Siren_Grasp_TerrorSkulls_C_GraspedTarget::Element' has a wrong offset!");

}

