#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ability_KybsWorth

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Ability_KybsWorth.Ability_KybsWorth_C.ExecuteUbergraph_Ability_KybsWorth
// 0x0390 (0x0390 - 0x0000)
struct Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_EvaluateConditionType_ReturnValue;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageComponent*                       K2Node_CustomEvent_Damaged;                        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x0068(0x0068)(ConstParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue2;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0118(0x0028)(NoDestructor)
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0140(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0378(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0388(0x0008)(NoDestructor)
};
static_assert(alignof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth) == 0x000010, "Wrong alignment on Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth");
static_assert(sizeof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth) == 0x000390, "Wrong size on Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, EntryPoint) == 0x000000, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000010, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_K2_EvaluateConditionType_ReturnValue) == 0x000050, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_K2_EvaluateConditionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, Temp_bool_Has_Been_Initd_Variable) == 0x000051, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, Temp_bool_IsClosed_Variable) == 0x000052, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_GetAbilityOwner_ReturnValue1) == 0x000058, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, K2Node_CustomEvent_Damaged) == 0x000060, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, K2Node_CustomEvent_Details) == 0x000068, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_GetOwner_ReturnValue) == 0x0000D0, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, K2Node_DynamicCast_AsOak_Character) == 0x0000D8, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_GetObjectClass_ReturnValue) == 0x0000E8, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000F0, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_GetOwner_ReturnValue1) == 0x0000F8, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_GetAbilityOwner_ReturnValue2) == 0x000110, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_GetAbilityOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000118, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000140, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_SpawnActorAsync_ReturnValue) == 0x000370, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, K2Node_CreateDelegate_OutputDelegate1) == 0x000378, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000388, "Member 'Ability_KybsWorth_C_ExecuteUbergraph_Ability_KybsWorth::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function Ability_KybsWorth.Ability_KybsWorth_C.OnCausedDeath_Event
// 0x0070 (0x0070 - 0x0000)
struct Ability_KybsWorth_C_OnCausedDeath_Event final
{
public:
	class UDamageComponent*                       Damaged;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Ability_KybsWorth_C_OnCausedDeath_Event) == 0x000008, "Wrong alignment on Ability_KybsWorth_C_OnCausedDeath_Event");
static_assert(sizeof(Ability_KybsWorth_C_OnCausedDeath_Event) == 0x000070, "Wrong size on Ability_KybsWorth_C_OnCausedDeath_Event");
static_assert(offsetof(Ability_KybsWorth_C_OnCausedDeath_Event, Damaged) == 0x000000, "Member 'Ability_KybsWorth_C_OnCausedDeath_Event::Damaged' has a wrong offset!");
static_assert(offsetof(Ability_KybsWorth_C_OnCausedDeath_Event, Details) == 0x000008, "Member 'Ability_KybsWorth_C_OnCausedDeath_Event::Details' has a wrong offset!");

}

