#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Ava_Loop_DomeShield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGameSystemCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Action_Ava_Loop_DomeShield.Action_Ava_Loop_DomeShield_C
// 0x0018 (0x03D0 - 0x03B8)
class UAction_Ava_Loop_DomeShield_C final : public UGbxAction_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               LHandGlow;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RHandGlow;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShieldStop();
	void ShieldStart();
	void OnStop(class AActor* Actor);
	void OnBegin(class AActor* Actor);
	void ExecuteUbergraph_Action_Ava_Loop_DomeShield(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Action_Ava_Loop_DomeShield_C">();
	}
	static class UAction_Ava_Loop_DomeShield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAction_Ava_Loop_DomeShield_C>();
	}
};
static_assert(alignof(UAction_Ava_Loop_DomeShield_C) == 0x000008, "Wrong alignment on UAction_Ava_Loop_DomeShield_C");
static_assert(sizeof(UAction_Ava_Loop_DomeShield_C) == 0x0003D0, "Wrong size on UAction_Ava_Loop_DomeShield_C");
static_assert(offsetof(UAction_Ava_Loop_DomeShield_C, UberGraphFrame) == 0x0003B8, "Member 'UAction_Ava_Loop_DomeShield_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAction_Ava_Loop_DomeShield_C, LHandGlow) == 0x0003C0, "Member 'UAction_Ava_Loop_DomeShield_C::LHandGlow' has a wrong offset!");
static_assert(offsetof(UAction_Ava_Loop_DomeShield_C, RHandGlow) == 0x0003C8, "Member 'UAction_Ava_Loop_DomeShield_C::RHandGlow' has a wrong offset!");

}

