#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Phasetrance_Common

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Action_Phasetrance_Common.Action_Phasetrance_Common_C.ExecuteUbergraph_Action_Phasetrance_Common
// 0x00E0 (0x00E0 - 0x0000)
struct Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState1;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor3;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor2;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakPhaseTranceEffectSpec              K2Node_MakeStruct_OakPhaseTranceEffectSpec;        // 0x0038(0x0030)(NoDestructor)
	bool                                          CallFunc_TryEffect_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue2;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakPhaseTranceEffectSpec              K2Node_MakeStruct_OakPhaseTranceEffectSpec1;       // 0x0070(0x0030)(NoDestructor)
	bool                                          CallFunc_TryEffect_ReturnValue1;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakPhaseTranceEffectSpec              K2Node_MakeStruct_OakPhaseTranceEffectSpec2;       // 0x00A8(0x0030)(NoDestructor)
	bool                                          CallFunc_TryEffect_ReturnValue2;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common) == 0x000008, "Wrong alignment on Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common");
static_assert(sizeof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common) == 0x0000E0, "Wrong size on Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, EntryPoint) == 0x000000, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, K2Node_Event_ActionEndState1) == 0x000004, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::K2Node_Event_ActionEndState1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, K2Node_Event_Actor3) == 0x000008, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::K2Node_Event_Actor3' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, K2Node_Event_ActionEndState) == 0x000010, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, K2Node_Event_Actor2) == 0x000018, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::K2Node_Event_Actor2' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, K2Node_Event_Actor1) == 0x000020, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, K2Node_Event_Actor) == 0x000028, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, CallFunc_IsServer_ReturnValue) == 0x000030, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, K2Node_MakeStruct_OakPhaseTranceEffectSpec) == 0x000038, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::K2Node_MakeStruct_OakPhaseTranceEffectSpec' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, CallFunc_TryEffect_ReturnValue) == 0x000068, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::CallFunc_TryEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, CallFunc_IsServer_ReturnValue1) == 0x000069, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, CallFunc_IsServer_ReturnValue2) == 0x00006A, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::CallFunc_IsServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, K2Node_MakeStruct_OakPhaseTranceEffectSpec1) == 0x000070, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::K2Node_MakeStruct_OakPhaseTranceEffectSpec1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, CallFunc_TryEffect_ReturnValue1) == 0x0000A0, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::CallFunc_TryEffect_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, K2Node_MakeStruct_OakPhaseTranceEffectSpec2) == 0x0000A8, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::K2Node_MakeStruct_OakPhaseTranceEffectSpec2' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common, CallFunc_TryEffect_ReturnValue2) == 0x0000D8, "Member 'Action_Phasetrance_Common_C_ExecuteUbergraph_Action_Phasetrance_Common::CallFunc_TryEffect_ReturnValue2' has a wrong offset!");

// Function Action_Phasetrance_Common.Action_Phasetrance_Common_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Phasetrance_Common_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_Common_C_OnBegin) == 0x000008, "Wrong alignment on Action_Phasetrance_Common_C_OnBegin");
static_assert(sizeof(Action_Phasetrance_Common_C_OnBegin) == 0x000008, "Wrong size on Action_Phasetrance_Common_C_OnBegin");
static_assert(offsetof(Action_Phasetrance_Common_C_OnBegin, Actor) == 0x000000, "Member 'Action_Phasetrance_Common_C_OnBegin::Actor' has a wrong offset!");

// Function Action_Phasetrance_Common.Action_Phasetrance_Common_C.OnServerBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Phasetrance_Common_C_OnServerBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_Common_C_OnServerBegin) == 0x000008, "Wrong alignment on Action_Phasetrance_Common_C_OnServerBegin");
static_assert(sizeof(Action_Phasetrance_Common_C_OnServerBegin) == 0x000008, "Wrong size on Action_Phasetrance_Common_C_OnServerBegin");
static_assert(offsetof(Action_Phasetrance_Common_C_OnServerBegin, Actor) == 0x000000, "Member 'Action_Phasetrance_Common_C_OnServerBegin::Actor' has a wrong offset!");

// Function Action_Phasetrance_Common.Action_Phasetrance_Common_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_Phasetrance_Common_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_Common_C_OnServerEnd) == 0x000008, "Wrong alignment on Action_Phasetrance_Common_C_OnServerEnd");
static_assert(sizeof(Action_Phasetrance_Common_C_OnServerEnd) == 0x000010, "Wrong size on Action_Phasetrance_Common_C_OnServerEnd");
static_assert(offsetof(Action_Phasetrance_Common_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'Action_Phasetrance_Common_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_OnServerEnd, Actor) == 0x000008, "Member 'Action_Phasetrance_Common_C_OnServerEnd::Actor' has a wrong offset!");

// Function Action_Phasetrance_Common.Action_Phasetrance_Common_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_Phasetrance_Common_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_Common_C_OnEnd) == 0x000008, "Wrong alignment on Action_Phasetrance_Common_C_OnEnd");
static_assert(sizeof(Action_Phasetrance_Common_C_OnEnd) == 0x000010, "Wrong size on Action_Phasetrance_Common_C_OnEnd");
static_assert(offsetof(Action_Phasetrance_Common_C_OnEnd, ActionEndState) == 0x000000, "Member 'Action_Phasetrance_Common_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_OnEnd, Actor) == 0x000008, "Member 'Action_Phasetrance_Common_C_OnEnd::Actor' has a wrong offset!");

// Function Action_Phasetrance_Common.Action_Phasetrance_Common_C.AssembleActivationCombo
// 0x0090 (0x0090 - 0x0000)
struct Action_Phasetrance_Common_C_AssembleActivationCombo final
{
public:
	struct FPhaseTranceActivationComboData        ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor)
	class UObject*                                CallFunc_K2_GetObjectRegisterValue_OutObject;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetObjectRegisterValue_ReturnValue;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_K2_GetObjectRegisterValue_OutObject1;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetObjectRegisterValue_ReturnValue1;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbilityAugmentData_PhaseTrance_Element* K2Node_DynamicCast_AsOak_Action_Ability_Augment_Data_Phase_Trance_Element; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbilityAugmentData_PhaseTrance_Effect* K2Node_DynamicCast_AsOak_Action_Ability_Augment_Data_Phase_Trance_Effect; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_K2_GetObjectRegisterValue_OutObject2;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetObjectRegisterValue_ReturnValue2;   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbilityAugmentData_PhaseTrance_Attack* K2Node_DynamicCast_AsOak_Action_Ability_Augment_Data_Phase_Trance_Attack; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhaseTranceActivationComboData        K2Node_MakeStruct_PhaseTranceActivationComboData;  // 0x0078(0x0018)(NoDestructor)
};
static_assert(alignof(Action_Phasetrance_Common_C_AssembleActivationCombo) == 0x000008, "Wrong alignment on Action_Phasetrance_Common_C_AssembleActivationCombo");
static_assert(sizeof(Action_Phasetrance_Common_C_AssembleActivationCombo) == 0x000090, "Wrong size on Action_Phasetrance_Common_C_AssembleActivationCombo");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, ReturnValue) == 0x000000, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, CallFunc_K2_GetObjectRegisterValue_OutObject) == 0x000018, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::CallFunc_K2_GetObjectRegisterValue_OutObject' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, CallFunc_K2_GetObjectRegisterValue_ReturnValue) == 0x000020, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::CallFunc_K2_GetObjectRegisterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, CallFunc_K2_GetObjectRegisterValue_OutObject1) == 0x000028, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::CallFunc_K2_GetObjectRegisterValue_OutObject1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, CallFunc_K2_GetObjectRegisterValue_ReturnValue1) == 0x000030, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::CallFunc_K2_GetObjectRegisterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, K2Node_DynamicCast_AsOak_Action_Ability_Augment_Data_Phase_Trance_Element) == 0x000038, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::K2Node_DynamicCast_AsOak_Action_Ability_Augment_Data_Phase_Trance_Element' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, K2Node_DynamicCast_AsOak_Action_Ability_Augment_Data_Phase_Trance_Effect) == 0x000048, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::K2Node_DynamicCast_AsOak_Action_Ability_Augment_Data_Phase_Trance_Effect' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, CallFunc_K2_GetObjectRegisterValue_OutObject2) == 0x000058, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::CallFunc_K2_GetObjectRegisterValue_OutObject2' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, CallFunc_K2_GetObjectRegisterValue_ReturnValue2) == 0x000060, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::CallFunc_K2_GetObjectRegisterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, K2Node_DynamicCast_AsOak_Action_Ability_Augment_Data_Phase_Trance_Attack) == 0x000068, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::K2Node_DynamicCast_AsOak_Action_Ability_Augment_Data_Phase_Trance_Attack' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Common_C_AssembleActivationCombo, K2Node_MakeStruct_PhaseTranceActivationComboData) == 0x000078, "Member 'Action_Phasetrance_Common_C_AssembleActivationCombo::K2Node_MakeStruct_PhaseTranceActivationComboData' has a wrong offset!");

}

