#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_PhaseTrance_Slam_Barrage

#include "Basic.hpp"

#include "GbxWeapon_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Action_PhaseTrance_Slam_Barrage.Action_PhaseTrance_Slam_Barrage_C.ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage
// 0x0148 (0x0148 - 0x0000)
struct Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize100                 K2Node_MakeStruct_Vector_NetQuantize100;           // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor2;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue1;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue2;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue3;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxSkeletalMeshComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment;             // 0x0098(0x0028)(NoDestructor, ContainsInstancedReference)
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment1;            // 0x00C0(0x0028)(NoDestructor, ContainsInstancedReference)
	EPhaseTranceElementalType                     CallFunc_BreakPhaseTranceElementData_ElementType;  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_BreakPhaseTranceElementData_DamageType;   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttributeInitializationData           CallFunc_BreakPhaseTranceElementData_DamageCoefficientData; // 0x00F8(0x0038)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_137[0x1];                                      // 0x0137(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartControlledMove_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage) == 0x000008, "Wrong alignment on Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage");
static_assert(sizeof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage) == 0x000148, "Wrong size on Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, EntryPoint) == 0x000000, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, Temp_class_Variable) == 0x000008, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, K2Node_MakeStruct_Vector_NetQuantize100) == 0x000010, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::K2Node_MakeStruct_Vector_NetQuantize100' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, K2Node_Event_Actor2) == 0x000020, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::K2Node_Event_Actor2' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, K2Node_Event_ActionEndState) == 0x000028, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, K2Node_Event_Actor1) == 0x000030, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_K2_GetActor_ReturnValue) == 0x000040, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_K2_GetActor_ReturnValue1) == 0x000048, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_K2_GetActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_K2_GetActor_ReturnValue2) == 0x000050, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_K2_GetActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, K2Node_Event_Actor) == 0x000058, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, Temp_class_Variable1) == 0x000060, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_K2_GetActor_ReturnValue3) == 0x000068, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_K2_GetActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_GetVelocity_ReturnValue) == 0x000070, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_BreakVector_X) == 0x00007C, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_BreakVector_Y) == 0x000080, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_BreakVector_Z) == 0x000084, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000088, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_GetComponentByClass_ReturnValue) == 0x000090, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, K2Node_MakeStruct_LightBeamAttachment) == 0x000098, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::K2Node_MakeStruct_LightBeamAttachment' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, K2Node_MakeStruct_LightBeamAttachment1) == 0x0000C0, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::K2Node_MakeStruct_LightBeamAttachment1' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_BreakPhaseTranceElementData_ElementType) == 0x0000E8, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_BreakPhaseTranceElementData_ElementType' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_BreakPhaseTranceElementData_DamageType) == 0x0000F0, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_BreakPhaseTranceElementData_DamageType' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_BreakPhaseTranceElementData_DamageCoefficientData) == 0x0000F8, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_BreakPhaseTranceElementData_DamageCoefficientData' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000130, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_IsValid_ReturnValue) == 0x000134, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, Temp_bool_Variable) == 0x000135, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_IsValid_ReturnValue1) == 0x000136, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, K2Node_Select_Default) == 0x000138, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage, CallFunc_StartControlledMove_ReturnValue) == 0x000140, "Member 'Action_PhaseTrance_Slam_Barrage_C_ExecuteUbergraph_Action_PhaseTrance_Slam_Barrage::CallFunc_StartControlledMove_ReturnValue' has a wrong offset!");

// Function Action_PhaseTrance_Slam_Barrage.Action_PhaseTrance_Slam_Barrage_C.OnBeginBringUpWeapon
// 0x0008 (0x0008 - 0x0000)
struct Action_PhaseTrance_Slam_Barrage_C_OnBeginBringUpWeapon final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_PhaseTrance_Slam_Barrage_C_OnBeginBringUpWeapon) == 0x000008, "Wrong alignment on Action_PhaseTrance_Slam_Barrage_C_OnBeginBringUpWeapon");
static_assert(sizeof(Action_PhaseTrance_Slam_Barrage_C_OnBeginBringUpWeapon) == 0x000008, "Wrong size on Action_PhaseTrance_Slam_Barrage_C_OnBeginBringUpWeapon");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_OnBeginBringUpWeapon, Actor) == 0x000000, "Member 'Action_PhaseTrance_Slam_Barrage_C_OnBeginBringUpWeapon::Actor' has a wrong offset!");

// Function Action_PhaseTrance_Slam_Barrage.Action_PhaseTrance_Slam_Barrage_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_PhaseTrance_Slam_Barrage_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_PhaseTrance_Slam_Barrage_C_OnServerEnd) == 0x000008, "Wrong alignment on Action_PhaseTrance_Slam_Barrage_C_OnServerEnd");
static_assert(sizeof(Action_PhaseTrance_Slam_Barrage_C_OnServerEnd) == 0x000010, "Wrong size on Action_PhaseTrance_Slam_Barrage_C_OnServerEnd");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'Action_PhaseTrance_Slam_Barrage_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_OnServerEnd, Actor) == 0x000008, "Member 'Action_PhaseTrance_Slam_Barrage_C_OnServerEnd::Actor' has a wrong offset!");

// Function Action_PhaseTrance_Slam_Barrage.Action_PhaseTrance_Slam_Barrage_C.OnServerBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_PhaseTrance_Slam_Barrage_C_OnServerBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_PhaseTrance_Slam_Barrage_C_OnServerBegin) == 0x000008, "Wrong alignment on Action_PhaseTrance_Slam_Barrage_C_OnServerBegin");
static_assert(sizeof(Action_PhaseTrance_Slam_Barrage_C_OnServerBegin) == 0x000008, "Wrong size on Action_PhaseTrance_Slam_Barrage_C_OnServerBegin");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_OnServerBegin, Actor) == 0x000000, "Member 'Action_PhaseTrance_Slam_Barrage_C_OnServerBegin::Actor' has a wrong offset!");

// Function Action_PhaseTrance_Slam_Barrage.Action_PhaseTrance_Slam_Barrage_C.InnerStartBeam
// 0x0040 (0x0040 - 0x0000)
struct Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam final
{
public:
	class UParticleSystem*                        Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable1;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable3;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable4;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhaseTranceElementalType                     CallFunc_GetPhaseTranceElementType_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhaseTranceElementalType                     Temp_byte_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam) == 0x000008, "Wrong alignment on Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam");
static_assert(sizeof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam) == 0x000040, "Wrong size on Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, Temp_object_Variable) == 0x000000, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, Temp_object_Variable1) == 0x000008, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, Temp_object_Variable2) == 0x000010, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, Temp_object_Variable3) == 0x000018, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, Temp_object_Variable4) == 0x000020, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, CallFunc_GetPhaseTranceElementType_ReturnValue) == 0x000028, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::CallFunc_GetPhaseTranceElementType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, CallFunc_IsServer_ReturnValue) == 0x000029, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, Temp_byte_Variable) == 0x00002A, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, K2Node_Select_Default) == 0x000030, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000038, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStartBeam::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function Action_PhaseTrance_Slam_Barrage.Action_PhaseTrance_Slam_Barrage_C.InnerStopBeam
// 0x0002 (0x0002 - 0x0000)
struct Action_PhaseTrance_Slam_Barrage_C_InnerStopBeam final
{
public:
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_PhaseTrance_Slam_Barrage_C_InnerStopBeam) == 0x000001, "Wrong alignment on Action_PhaseTrance_Slam_Barrage_C_InnerStopBeam");
static_assert(sizeof(Action_PhaseTrance_Slam_Barrage_C_InnerStopBeam) == 0x000002, "Wrong size on Action_PhaseTrance_Slam_Barrage_C_InnerStopBeam");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStopBeam, Temp_bool_IsClosed_Variable) == 0x000000, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStopBeam::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_InnerStopBeam, Temp_bool_Has_Been_Initd_Variable) == 0x000001, "Member 'Action_PhaseTrance_Slam_Barrage_C_InnerStopBeam::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function Action_PhaseTrance_Slam_Barrage.Action_PhaseTrance_Slam_Barrage_C.StopSlamLoopFeedback
// 0x0001 (0x0001 - 0x0000)
struct Action_PhaseTrance_Slam_Barrage_C_StopSlamLoopFeedback final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_PhaseTrance_Slam_Barrage_C_StopSlamLoopFeedback) == 0x000001, "Wrong alignment on Action_PhaseTrance_Slam_Barrage_C_StopSlamLoopFeedback");
static_assert(sizeof(Action_PhaseTrance_Slam_Barrage_C_StopSlamLoopFeedback) == 0x000001, "Wrong size on Action_PhaseTrance_Slam_Barrage_C_StopSlamLoopFeedback");
static_assert(offsetof(Action_PhaseTrance_Slam_Barrage_C_StopSlamLoopFeedback, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Action_PhaseTrance_Slam_Barrage_C_StopSlamLoopFeedback::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

