#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionSkill_Operative_ShoulderCannon

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "EShoulderCannonMods_structs.hpp"
#include "EOperativeShoulderCannon_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ActionSkill_Operative_ShoulderCannon.ActionSkill_Operative_ShoulderCannon_C
// 0x0028 (0x0298 - 0x0270)
class UActionSkill_Operative_ShoulderCannon_C final : public UOakActionAbility_ShoulderCannon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(Transient, DuplicateTransient)
	class AIO_Operative_ShoulderCannon_C*         ShoulderCannon;                                    // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableValueHandle                  Mod3Cooldown;                                      // 0x0280(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon(int32 EntryPoint);
	void OnUnregistered();
	void OnRegistered();
	void OnDeactivated();
	void OnStartActionAbility();
	void SpawnShoulderCannon();
	void OnActivated();
	void OnChargeCountChanged(int32 OldCharge);
	void OnResumed();
	void OnPaused();
	bool IsActionSkillValid();
	class AInteractiveObject* TrySpawnCannon();
	void GetCannonRef(class AActor** Ref);
	void IsShouldCannonModSlotted(EShoulderCannonMods Mod, bool* Res);
	void StartShoulderCannonMod3Timer(bool* Res);

	bool ShouldAbortActivation(uint8* OutAbortCode) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActionSkill_Operative_ShoulderCannon_C">();
	}
	static class UActionSkill_Operative_ShoulderCannon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionSkill_Operative_ShoulderCannon_C>();
	}
};
static_assert(alignof(UActionSkill_Operative_ShoulderCannon_C) == 0x000008, "Wrong alignment on UActionSkill_Operative_ShoulderCannon_C");
static_assert(sizeof(UActionSkill_Operative_ShoulderCannon_C) == 0x000298, "Wrong size on UActionSkill_Operative_ShoulderCannon_C");
static_assert(offsetof(UActionSkill_Operative_ShoulderCannon_C, UberGraphFrame) == 0x000270, "Member 'UActionSkill_Operative_ShoulderCannon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActionSkill_Operative_ShoulderCannon_C, ShoulderCannon) == 0x000278, "Member 'UActionSkill_Operative_ShoulderCannon_C::ShoulderCannon' has a wrong offset!");
static_assert(offsetof(UActionSkill_Operative_ShoulderCannon_C, Mod3Cooldown) == 0x000280, "Member 'UActionSkill_Operative_ShoulderCannon_C::Mod3Cooldown' has a wrong offset!");

}

