#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Ava_Loop_DomeShield

#include "Basic.hpp"


namespace SDK::Params
{

// Function Action_Ava_Loop_DomeShield.Action_Ava_Loop_DomeShield_C.OnStop
// 0x0008 (0x0008 - 0x0000)
struct Action_Ava_Loop_DomeShield_C_OnStop final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Ava_Loop_DomeShield_C_OnStop) == 0x000008, "Wrong alignment on Action_Ava_Loop_DomeShield_C_OnStop");
static_assert(sizeof(Action_Ava_Loop_DomeShield_C_OnStop) == 0x000008, "Wrong size on Action_Ava_Loop_DomeShield_C_OnStop");
static_assert(offsetof(Action_Ava_Loop_DomeShield_C_OnStop, Actor) == 0x000000, "Member 'Action_Ava_Loop_DomeShield_C_OnStop::Actor' has a wrong offset!");

// Function Action_Ava_Loop_DomeShield.Action_Ava_Loop_DomeShield_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Ava_Loop_DomeShield_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Ava_Loop_DomeShield_C_OnBegin) == 0x000008, "Wrong alignment on Action_Ava_Loop_DomeShield_C_OnBegin");
static_assert(sizeof(Action_Ava_Loop_DomeShield_C_OnBegin) == 0x000008, "Wrong size on Action_Ava_Loop_DomeShield_C_OnBegin");
static_assert(offsetof(Action_Ava_Loop_DomeShield_C_OnBegin, Actor) == 0x000000, "Member 'Action_Ava_Loop_DomeShield_C_OnBegin::Actor' has a wrong offset!");

// Function Action_Ava_Loop_DomeShield.Action_Ava_Loop_DomeShield_C.ExecuteUbergraph_Action_Ava_Loop_DomeShield
// 0x0030 (0x0030 - 0x0000)
struct Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield) == 0x000008, "Wrong alignment on Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield");
static_assert(sizeof(Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield) == 0x000030, "Wrong size on Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield");
static_assert(offsetof(Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield, EntryPoint) == 0x000000, "Member 'Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield, K2Node_Event_Actor) == 0x000008, "Member 'Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield, K2Node_Event_Actor1) == 0x000010, "Member 'Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000020, "Member 'Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield, CallFunc_SpawnEmitterAttached_ReturnValue1) == 0x000028, "Member 'Action_Ava_Loop_DomeShield_C_ExecuteUbergraph_Action_Ava_Loop_DomeShield::CallFunc_SpawnEmitterAttached_ReturnValue1' has a wrong offset!");

}

