#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Maya_PhaseVehicleBoom

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Action_Maya_PhaseVehicleBoom.Action_Maya_PhaseVehicleBoom_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Maya_PhaseVehicleBoom_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Maya_PhaseVehicleBoom_C_OnBegin) == 0x000008, "Wrong alignment on Action_Maya_PhaseVehicleBoom_C_OnBegin");
static_assert(sizeof(Action_Maya_PhaseVehicleBoom_C_OnBegin) == 0x000008, "Wrong size on Action_Maya_PhaseVehicleBoom_C_OnBegin");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_OnBegin, Actor) == 0x000000, "Member 'Action_Maya_PhaseVehicleBoom_C_OnBegin::Actor' has a wrong offset!");

// Function Action_Maya_PhaseVehicleBoom.Action_Maya_PhaseVehicleBoom_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_Maya_PhaseVehicleBoom_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Maya_PhaseVehicleBoom_C_OnEnd) == 0x000008, "Wrong alignment on Action_Maya_PhaseVehicleBoom_C_OnEnd");
static_assert(sizeof(Action_Maya_PhaseVehicleBoom_C_OnEnd) == 0x000010, "Wrong size on Action_Maya_PhaseVehicleBoom_C_OnEnd");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_OnEnd, ActionEndState) == 0x000000, "Member 'Action_Maya_PhaseVehicleBoom_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_OnEnd, Actor) == 0x000008, "Member 'Action_Maya_PhaseVehicleBoom_C_OnEnd::Actor' has a wrong offset!");

// Function Action_Maya_PhaseVehicleBoom.Action_Maya_PhaseVehicleBoom_C.ExecuteUbergraph_Action_Maya_PhaseVehicleBoom
// 0x00C0 (0x00C0 - 0x0000)
struct Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTargetingComponent*                    CallFunc_GetTargetingComponent_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBestTargetActor_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakVehicle*                            CallFunc_FindAssociatedOakVehicle_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProj_Maya_Helios_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBestKnownLocation_ReturnValue;         // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom) == 0x000010, "Wrong alignment on Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom");
static_assert(sizeof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom) == 0x0000C0, "Wrong size on Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, EntryPoint) == 0x000000, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000008, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_GetTargetingComponent_ReturnValue) == 0x000018, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_GetTargetingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_GetBestTargetActor_ReturnValue) == 0x000020, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_GetBestTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_FindAssociatedOakVehicle_ReturnValue) == 0x000028, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_FindAssociatedOakVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, K2Node_Event_Actor1) == 0x000030, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_GetAssociatedCharacter_ReturnValue) == 0x000038, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_GetAssociatedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, K2Node_DynamicCast_AsOak_Character) == 0x000040, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_GetActorSocket_ReturnValue) == 0x000050, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_HasAuthority_ReturnValue) == 0x000088, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_FinishSpawningActor_ReturnValue) == 0x000090, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, K2Node_Event_ActionEndState) == 0x000098, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, K2Node_Event_Actor) == 0x0000A0, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_GetBestKnownLocation_ReturnValue) == 0x0000A8, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_GetBestKnownLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom, CallFunc_GetVelocity_ReturnValue) == 0x0000B4, "Member 'Action_Maya_PhaseVehicleBoom_C_ExecuteUbergraph_Action_Maya_PhaseVehicleBoom::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");

}

