#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Lilith_React_Come_Over

#include "Basic.hpp"


namespace SDK::Params
{

// Function Action_Lilith_React_Come_Over.Action_Lilith_React_Come_Over_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Lilith_React_Come_Over_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Lilith_React_Come_Over_C_OnBegin) == 0x000008, "Wrong alignment on Action_Lilith_React_Come_Over_C_OnBegin");
static_assert(sizeof(Action_Lilith_React_Come_Over_C_OnBegin) == 0x000008, "Wrong size on Action_Lilith_React_Come_Over_C_OnBegin");
static_assert(offsetof(Action_Lilith_React_Come_Over_C_OnBegin, Actor) == 0x000000, "Member 'Action_Lilith_React_Come_Over_C_OnBegin::Actor' has a wrong offset!");

// Function Action_Lilith_React_Come_Over.Action_Lilith_React_Come_Over_C.ExecuteUbergraph_Action_Lilith_React_Come_Over
// 0x0010 (0x0010 - 0x0000)
struct Action_Lilith_React_Come_Over_C_ExecuteUbergraph_Action_Lilith_React_Come_Over final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Lilith_React_Come_Over_C_ExecuteUbergraph_Action_Lilith_React_Come_Over) == 0x000008, "Wrong alignment on Action_Lilith_React_Come_Over_C_ExecuteUbergraph_Action_Lilith_React_Come_Over");
static_assert(sizeof(Action_Lilith_React_Come_Over_C_ExecuteUbergraph_Action_Lilith_React_Come_Over) == 0x000010, "Wrong size on Action_Lilith_React_Come_Over_C_ExecuteUbergraph_Action_Lilith_React_Come_Over");
static_assert(offsetof(Action_Lilith_React_Come_Over_C_ExecuteUbergraph_Action_Lilith_React_Come_Over, EntryPoint) == 0x000000, "Member 'Action_Lilith_React_Come_Over_C_ExecuteUbergraph_Action_Lilith_React_Come_Over::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Lilith_React_Come_Over_C_ExecuteUbergraph_Action_Lilith_React_Come_Over, K2Node_Event_Actor) == 0x000008, "Member 'Action_Lilith_React_Come_Over_C_ExecuteUbergraph_Action_Lilith_React_Come_Over::K2Node_Event_Actor' has a wrong offset!");

}

