#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_HeavyShared_ReceivingHeal

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Action_HeavyShared_ReceivingHeal.Action_HeavyShared_ReceivingHeal_C.ExecuteUbergraph_Action_HeavyShared_ReceivingHeal
// 0x0030 (0x0030 - 0x0000)
struct Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared;             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal) == 0x000008, "Wrong alignment on Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal");
static_assert(sizeof(Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal) == 0x000030, "Wrong size on Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal");
static_assert(offsetof(Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal, EntryPoint) == 0x000000, "Member 'Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal, K2Node_Event_ActionEndState) == 0x000004, "Member 'Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal, K2Node_Event_Actor) == 0x000008, "Member 'Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal, K2Node_Event_Actor1) == 0x000010, "Member 'Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal, K2Node_DynamicCast_AsBPI_Heavy_Shared) == 0x000018, "Member 'Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal::K2Node_DynamicCast_AsBPI_Heavy_Shared' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Action_HeavyShared_ReceivingHeal_C_ExecuteUbergraph_Action_HeavyShared_ReceivingHeal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Action_HeavyShared_ReceivingHeal.Action_HeavyShared_ReceivingHeal_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_HeavyShared_ReceivingHeal_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_HeavyShared_ReceivingHeal_C_OnEnd) == 0x000008, "Wrong alignment on Action_HeavyShared_ReceivingHeal_C_OnEnd");
static_assert(sizeof(Action_HeavyShared_ReceivingHeal_C_OnEnd) == 0x000010, "Wrong size on Action_HeavyShared_ReceivingHeal_C_OnEnd");
static_assert(offsetof(Action_HeavyShared_ReceivingHeal_C_OnEnd, ActionEndState) == 0x000000, "Member 'Action_HeavyShared_ReceivingHeal_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_ReceivingHeal_C_OnEnd, Actor) == 0x000008, "Member 'Action_HeavyShared_ReceivingHeal_C_OnEnd::Actor' has a wrong offset!");

// Function Action_HeavyShared_ReceivingHeal.Action_HeavyShared_ReceivingHeal_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_HeavyShared_ReceivingHeal_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_HeavyShared_ReceivingHeal_C_OnBegin) == 0x000008, "Wrong alignment on Action_HeavyShared_ReceivingHeal_C_OnBegin");
static_assert(sizeof(Action_HeavyShared_ReceivingHeal_C_OnBegin) == 0x000008, "Wrong size on Action_HeavyShared_ReceivingHeal_C_OnBegin");
static_assert(offsetof(Action_HeavyShared_ReceivingHeal_C_OnBegin, Actor) == 0x000000, "Member 'Action_HeavyShared_ReceivingHeal_C_OnBegin::Actor' has a wrong offset!");

}

