#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionSkill_Cloak

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function ActionSkill_Cloak.ActionSkill_Cloak_C.ExecuteUbergraph_ActionSkill_Cloak
// 0x0490 (0x0490 - 0x0000)
struct ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPEventHub_Beastmaster_C*              K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster;      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0234(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0248(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x0464(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0475(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_476[0x2];                                      // 0x0476(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActionRegister>             CallFunc_GetOwnedGbxActionRegisters_ReturnValue;   // 0x0478(0x0010)(ZeroConstructor, ReferenceParm)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak) == 0x000008, "Wrong alignment on ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak");
static_assert(sizeof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak) == 0x000490, "Wrong size on ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, EntryPoint) == 0x000000, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_GetComponentByClass_ReturnValue) == 0x000220, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster) == 0x000228, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, K2Node_DynamicCast_bSuccess) == 0x000230, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_FinishTriggerDialog_Conversation) == 0x000234, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_FinishTriggerDialog_SequenceID) == 0x000240, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000244, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_NewDialogContext_ReturnValue1) == 0x000248, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_Conv_IntToBool_ReturnValue) == 0x000460, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_FinishTriggerDialog_Conversation1) == 0x000464, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_FinishTriggerDialog_SequenceID1) == 0x000470, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x000474, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000475, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_GetOwnedGbxActionRegisters_ReturnValue) == 0x000478, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_GetOwnedGbxActionRegisters_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak, CallFunc_K2Play_ReturnValue) == 0x000488, "Member 'ActionSkill_Cloak_C_ExecuteUbergraph_ActionSkill_Cloak::CallFunc_K2Play_ReturnValue' has a wrong offset!");

// Function ActionSkill_Cloak.ActionSkill_Cloak_C.TryMod1Effect
// 0x0030 (0x0030 - 0x0000)
struct ActionSkill_Cloak_C_TryMod1Effect final
{
public:
	bool                                          CallFunc_HasRuntimeMod_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Beastmaster_C> K2Node_DynamicCast_AsIBPChar_Beastmaster;          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CallFunc_GetCurrentPet_Res;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_Cloak_C_TryMod1Effect) == 0x000008, "Wrong alignment on ActionSkill_Cloak_C_TryMod1Effect");
static_assert(sizeof(ActionSkill_Cloak_C_TryMod1Effect) == 0x000030, "Wrong size on ActionSkill_Cloak_C_TryMod1Effect");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod1Effect, CallFunc_HasRuntimeMod_ReturnValue) == 0x000000, "Member 'ActionSkill_Cloak_C_TryMod1Effect::CallFunc_HasRuntimeMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod1Effect, K2Node_DynamicCast_AsIBPChar_Beastmaster) == 0x000008, "Member 'ActionSkill_Cloak_C_TryMod1Effect::K2Node_DynamicCast_AsIBPChar_Beastmaster' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod1Effect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ActionSkill_Cloak_C_TryMod1Effect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod1Effect, CallFunc_GetCurrentPet_Res) == 0x000020, "Member 'ActionSkill_Cloak_C_TryMod1Effect::CallFunc_GetCurrentPet_Res' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod1Effect, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ActionSkill_Cloak_C_TryMod1Effect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ActionSkill_Cloak.ActionSkill_Cloak_C.TryMod4Effect
// 0x0070 (0x0070 - 0x0000)
struct ActionSkill_Cloak_C_TryMod4Effect final
{
public:
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0000(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRuntimeMod_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0020(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0058(0x0018)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ActionSkill_Cloak_C_TryMod4Effect) == 0x000008, "Wrong alignment on ActionSkill_Cloak_C_TryMod4Effect");
static_assert(sizeof(ActionSkill_Cloak_C_TryMod4Effect) == 0x000070, "Wrong size on ActionSkill_Cloak_C_TryMod4Effect");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod4Effect, K2Node_MakeStruct_DataTableValueHandle) == 0x000000, "Member 'ActionSkill_Cloak_C_TryMod4Effect::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod4Effect, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000018, "Member 'ActionSkill_Cloak_C_TryMod4Effect::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod4Effect, CallFunc_HasRuntimeMod_ReturnValue) == 0x00001C, "Member 'ActionSkill_Cloak_C_TryMod4Effect::CallFunc_HasRuntimeMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod4Effect, K2Node_MakeStruct_StatusEffectSpec) == 0x000020, "Member 'ActionSkill_Cloak_C_TryMod4Effect::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_TryMod4Effect, CallFunc_AddStatusEffect_ReturnValue) == 0x000058, "Member 'ActionSkill_Cloak_C_TryMod4Effect::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");

// Function ActionSkill_Cloak.ActionSkill_Cloak_C.GetMaxDurationModifier
// 0x0014 (0x0014 - 0x0000)
struct ActionSkill_Cloak_C_GetMaxDurationModifier final
{
public:
	EGbxAttributeModifierType                     ModifierType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasRuntimeMod_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_Cloak_C_GetMaxDurationModifier) == 0x000004, "Wrong alignment on ActionSkill_Cloak_C_GetMaxDurationModifier");
static_assert(sizeof(ActionSkill_Cloak_C_GetMaxDurationModifier) == 0x000014, "Wrong size on ActionSkill_Cloak_C_GetMaxDurationModifier");
static_assert(offsetof(ActionSkill_Cloak_C_GetMaxDurationModifier, ModifierType) == 0x000000, "Member 'ActionSkill_Cloak_C_GetMaxDurationModifier::ModifierType' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_GetMaxDurationModifier, Value) == 0x000004, "Member 'ActionSkill_Cloak_C_GetMaxDurationModifier::Value' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_GetMaxDurationModifier, ReturnValue) == 0x000008, "Member 'ActionSkill_Cloak_C_GetMaxDurationModifier::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_GetMaxDurationModifier, CallFunc_GetDataTableValue_OutValue) == 0x00000C, "Member 'ActionSkill_Cloak_C_GetMaxDurationModifier::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_GetMaxDurationModifier, CallFunc_GetDataTableValue_ReturnValue) == 0x000010, "Member 'ActionSkill_Cloak_C_GetMaxDurationModifier::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Cloak_C_GetMaxDurationModifier, CallFunc_HasRuntimeMod_ReturnValue) == 0x000011, "Member 'ActionSkill_Cloak_C_GetMaxDurationModifier::CallFunc_HasRuntimeMod_ReturnValue' has a wrong offset!");

}

