#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_PetLoader_ShockOrb

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Action_PetLoader_ShockOrb.Action_PetLoader_ShockOrb_C.ExecuteUbergraph_Action_PetLoader_ShockOrb
// 0x0130 (0x0130 - 0x0000)
struct Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0068(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetBlackboardObject_Value;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue2;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue3;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              CallFunc_GetComponentByClass_ReturnValue1;         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue4;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character1;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProj_PetLoader_ShockOrb_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb) == 0x000010, "Wrong alignment on Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb");
static_assert(sizeof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb) == 0x000130, "Wrong size on Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, EntryPoint) == 0x000000, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_K2_GetActor_ReturnValue) == 0x000008, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_K2_GetActor_ReturnValue1) == 0x000010, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_K2_GetActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_GetActorSocket_ReturnValue) == 0x000020, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, K2Node_DynamicCast_AsOak_Character) == 0x000050, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_BreakTransform_Location) == 0x00005C, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_BreakTransform_Rotation) == 0x000068, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_BreakTransform_Scale) == 0x000074, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_GetController_ReturnValue) == 0x000080, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_GetBlackboardObject_Value) == 0x0000C0, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_GetBlackboardObject_Value' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, K2Node_DynamicCast_AsActor) == 0x0000C8, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, K2Node_DynamicCast_bSuccess1) == 0x0000D0, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_K2_GetActor_ReturnValue2) == 0x0000D8, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_K2_GetActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_K2_GetActor_ReturnValue3) == 0x0000E0, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_K2_GetActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_GetComponentByClass_ReturnValue) == 0x0000E8, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_GetComponentByClass_ReturnValue1) == 0x0000F0, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000F8, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_SpawnEmitterAttached_ReturnValue1) == 0x000100, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_SpawnEmitterAttached_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_K2_GetActor_ReturnValue4) == 0x000108, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_K2_GetActor_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, K2Node_DynamicCast_AsOak_Character1) == 0x000110, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::K2Node_DynamicCast_AsOak_Character1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, K2Node_DynamicCast_bSuccess2) == 0x000118, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb, CallFunc_FinishSpawningActor_ReturnValue) == 0x000128, "Member 'Action_PetLoader_ShockOrb_C_ExecuteUbergraph_Action_PetLoader_ShockOrb::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

