#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Phasetrance_DLCSkill_Base

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base
// 0x04D0 (0x04D0 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0220(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0438(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x044C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x045E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x045F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Actor2;                               // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SummonActionSkillOrb_Res;                 // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProj_Siren_DLCSkill_WalkingPotato_Base_C* CallFunc_SummonActionSkillOrb_Orb;                 // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPEventHub_Siren_C*                    K2Node_DynamicCast_AsBPEvent_Hub_Siren;            // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActionSkill_Siren_Phasetrance_C*       K2Node_DynamicCast_AsAction_Skill_Siren_Phasetrance; // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue1;                 // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterDLCSkillOrb_Res;                  // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base) == 0x000008, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base) == 0x0004D0, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, EntryPoint) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_NewDialogContext_ReturnValue1) == 0x000220, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_FinishTriggerDialog_Conversation) == 0x000438, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_FinishTriggerDialog_SequenceID) == 0x000444, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000448, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_FinishTriggerDialog_Conversation1) == 0x00044C, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_FinishTriggerDialog_SequenceID1) == 0x000458, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x00045C, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_Conv_IntToBool_ReturnValue) == 0x00045D, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_Conv_IntToBool_ReturnValue1) == 0x00045E, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, Temp_bool_Has_Been_Initd_Variable) == 0x00045F, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, K2Node_Event_Actor2) == 0x000460, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::K2Node_Event_Actor2' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, K2Node_Event_ActionEndState) == 0x000468, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, K2Node_Event_Actor1) == 0x000470, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, Temp_bool_Has_Been_Initd_Variable1) == 0x000478, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, Temp_bool_IsClosed_Variable) == 0x000479, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, K2Node_Event_Actor) == 0x000480, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_SummonActionSkillOrb_Res) == 0x000488, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_SummonActionSkillOrb_Res' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_SummonActionSkillOrb_Orb) == 0x000490, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_SummonActionSkillOrb_Orb' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, K2Node_DynamicCast_AsBPEvent_Hub_Siren) == 0x000498, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::K2Node_DynamicCast_AsBPEvent_Hub_Siren' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, K2Node_DynamicCast_bSuccess) == 0x0004A0, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, K2Node_DynamicCast_AsAction_Skill_Siren_Phasetrance) == 0x0004A8, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::K2Node_DynamicCast_AsAction_Skill_Siren_Phasetrance' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, K2Node_DynamicCast_bSuccess1) == 0x0004B0, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_K2_GetActor_ReturnValue) == 0x0004B8, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_K2_GetActor_ReturnValue1) == 0x0004C0, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_K2_GetActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, CallFunc_RegisterDLCSkillOrb_Res) == 0x0004C8, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::CallFunc_RegisterDLCSkillOrb_Res' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base, Temp_bool_IsClosed_Variable1) == 0x0004C9, "Member 'Action_Phasetrance_DLCSkill_Base_C_ExecuteUbergraph_Action_Phasetrance_DLCSkill_Base::Temp_bool_IsClosed_Variable1' has a wrong offset!");

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_OnBegin) == 0x000008, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_OnBegin");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_OnBegin) == 0x000008, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_OnBegin");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_OnBegin, Actor) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_OnBegin::Actor' has a wrong offset!");

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.SummonActionSkillOrb
// 0x0150 (0x0150 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb final
{
public:
	bool                                          Res;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProj_Siren_DLCSkill_WalkingPotato_Base_C* Orb;                                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEnvQueryParams                        EQSFindSpawnLocation;                              // 0x0010(0x00B8)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FVector                                CallFunc_GetPhaseFlareSpawnLocation_Res;           // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RunEnvQueryForBestLocation_ResultLocation; // 0x0110(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunEnvQueryForBestLocation_ReturnValue;   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetPhaseFlareSpawnLocation_Res;           // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RunEnvQueryForBestLocation_ResultLocation1; // 0x0120(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunEnvQueryForBestLocation_ReturnValue1;  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProj_Siren_DLCSkill_WalkingPotato_Base_C* CallFunc_FinishSpawningActor_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPhaseFlareSpawnLocation_Res1;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterDLCSkillOrb_Res;                  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb) == 0x000010, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb) == 0x000150, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, Res) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::Res' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, Orb) == 0x000008, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::Orb' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, EQSFindSpawnLocation) == 0x000010, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::EQSFindSpawnLocation' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_GetPhaseFlareSpawnLocation_Res) == 0x0000C8, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_GetPhaseFlareSpawnLocation_Res' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_RunEnvQueryForBestLocation_ResultLocation) == 0x000110, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_RunEnvQueryForBestLocation_ResultLocation' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_RunEnvQueryForBestLocation_ReturnValue) == 0x00011C, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_RunEnvQueryForBestLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_SetPhaseFlareSpawnLocation_Res) == 0x00011D, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_SetPhaseFlareSpawnLocation_Res' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_RunEnvQueryForBestLocation_ResultLocation1) == 0x000120, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_RunEnvQueryForBestLocation_ResultLocation1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_RunEnvQueryForBestLocation_ReturnValue1) == 0x00012C, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_RunEnvQueryForBestLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000130, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_FinishSpawningActor_ReturnValue) == 0x000138, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_SetPhaseFlareSpawnLocation_Res1) == 0x000140, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_SetPhaseFlareSpawnLocation_Res1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb, CallFunc_RegisterDLCSkillOrb_Res) == 0x000141, "Member 'Action_Phasetrance_DLCSkill_Base_C_SummonActionSkillOrb::CallFunc_RegisterDLCSkillOrb_Res' has a wrong offset!");

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.CacheSummonMeshes
// 0x0030 (0x0030 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes final
{
public:
	TScriptInterface<class IIBPChar_Siren_C>      K2Node_DynamicCast_AsIBPChar_Siren;                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPhaseCastProjectileComponents_Body;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              CallFunc_GetPhaseCastProjectileComponents_Head;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPhaseCastProjectileComponents_GhostArms; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes) == 0x000008, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes) == 0x000030, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes, K2Node_DynamicCast_AsIBPChar_Siren) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes::K2Node_DynamicCast_AsIBPChar_Siren' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes, CallFunc_GetPhaseCastProjectileComponents_Body) == 0x000018, "Member 'Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes::CallFunc_GetPhaseCastProjectileComponents_Body' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes, CallFunc_GetPhaseCastProjectileComponents_Head) == 0x000020, "Member 'Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes::CallFunc_GetPhaseCastProjectileComponents_Head' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes, CallFunc_GetPhaseCastProjectileComponents_GhostArms) == 0x000028, "Member 'Action_Phasetrance_DLCSkill_Base_C_CacheSummonMeshes::CallFunc_GetPhaseCastProjectileComponents_GhostArms' has a wrong offset!");

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.ResetArmsMesh
// 0x0168 (0x0168 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x001C(0x000C)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue1;                 // 0x0028(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetPhaseFlareSpawnLocation_Res;           // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0040(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00D0(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh) == 0x000008, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh) == 0x000168, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_MakeRotator_ReturnValue) == 0x00001C, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_MakeRotator_ReturnValue1) == 0x000028, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_MakeRotator_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_GetPhaseFlareSpawnLocation_Res) == 0x000034, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_GetPhaseFlareSpawnLocation_Res' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000040, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000D0, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000160, "Member 'Action_Phasetrance_DLCSkill_Base_C_ResetArmsMesh::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.StartSummonAnimation
// 0x0020 (0x0020 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation final
{
public:
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation) == 0x000008, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation) == 0x000020, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation, Temp_struct_Variable) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation, CallFunc_K2_GetActor_ReturnValue) == 0x000010, "Member 'Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation, CallFunc_K2Play_ReturnValue) == 0x000018, "Member 'Action_Phasetrance_DLCSkill_Base_C_StartSummonAnimation::CallFunc_K2Play_ReturnValue' has a wrong offset!");

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.SetPhaseFlareSpawnLocation
// 0x0070 (0x0070 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Res;                                               // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Siren_C*                        K2Node_DynamicCast_AsBPChar_Siren;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPhaseFlareSpawnLocation_Res;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation) == 0x000008, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation) == 0x000070, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, Loc) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::Loc' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, Res) == 0x00000C, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::Res' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000010, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, CallFunc_GetActorUpVector_ReturnValue) == 0x00001C, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000028, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x000034, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, K2Node_DynamicCast_AsBPChar_Siren) == 0x000050, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::K2Node_DynamicCast_AsBPChar_Siren' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, CallFunc_Add_VectorVector_ReturnValue1) == 0x00005C, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation, CallFunc_SetPhaseFlareSpawnLocation_Res) == 0x000068, "Member 'Action_Phasetrance_DLCSkill_Base_C_SetPhaseFlareSpawnLocation::CallFunc_SetPhaseFlareSpawnLocation_Res' has a wrong offset!");

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.GetPhaseFlareSpawnLocation
// 0x0028 (0x0028 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation final
{
public:
	struct FVector                                Res;                                               // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Siren_C*                        K2Node_DynamicCast_AsBPChar_Siren;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPhaseFlareSpawnLocation_Res;           // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation) == 0x000008, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation) == 0x000028, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation, Res) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation::Res' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation, K2Node_DynamicCast_AsBPChar_Siren) == 0x000010, "Member 'Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation::K2Node_DynamicCast_AsBPChar_Siren' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation, CallFunc_GetPhaseFlareSpawnLocation_Res) == 0x00001C, "Member 'Action_Phasetrance_DLCSkill_Base_C_GetPhaseFlareSpawnLocation::CallFunc_GetPhaseFlareSpawnLocation_Res' has a wrong offset!");

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_OnServerEnd) == 0x000008, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_OnServerEnd");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_OnServerEnd) == 0x000010, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_OnServerEnd");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_OnServerEnd, Actor) == 0x000008, "Member 'Action_Phasetrance_DLCSkill_Base_C_OnServerEnd::Actor' has a wrong offset!");

// Function Action_Phasetrance_DLCSkill_Base.Action_Phasetrance_DLCSkill_Base_C.OnServerBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Phasetrance_DLCSkill_Base_C_OnServerBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_DLCSkill_Base_C_OnServerBegin) == 0x000008, "Wrong alignment on Action_Phasetrance_DLCSkill_Base_C_OnServerBegin");
static_assert(sizeof(Action_Phasetrance_DLCSkill_Base_C_OnServerBegin) == 0x000008, "Wrong size on Action_Phasetrance_DLCSkill_Base_C_OnServerBegin");
static_assert(offsetof(Action_Phasetrance_DLCSkill_Base_C_OnServerBegin, Actor) == 0x000000, "Member 'Action_Phasetrance_DLCSkill_Base_C_OnServerBegin::Actor' has a wrong offset!");

}

