#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Nog_Melee_Surfing_F_v2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Action_Nog_Melee_Surfing_F_v2.Action_Nog_Melee_Surfing_F_v2_C.ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2
// 0x0090 (0x0090 - 0x0000)
struct Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Nog_C>            K2Node_DynamicCast_AsBPI_Nog;                      // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakNogDroneContainerComponent*         CallFunc_Nog_GetDroneContainer_DroneContainer;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDroneTransform_ReturnValue;            // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2) == 0x000010, "Wrong alignment on Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2");
static_assert(sizeof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2) == 0x000090, "Wrong size on Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2");
static_assert(offsetof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2, EntryPoint) == 0x000000, "Member 'Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2, K2Node_DynamicCast_AsBPI_Nog) == 0x000008, "Member 'Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2::K2Node_DynamicCast_AsBPI_Nog' has a wrong offset!");
static_assert(offsetof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2, CallFunc_Nog_GetDroneContainer_DroneContainer) == 0x000020, "Member 'Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2::CallFunc_Nog_GetDroneContainer_DroneContainer' has a wrong offset!");
static_assert(offsetof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2, CallFunc_GetDroneTransform_ReturnValue) == 0x000030, "Member 'Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2::CallFunc_GetDroneTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2, CallFunc_BreakTransform_Location) == 0x000060, "Member 'Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'Action_Nog_Melee_Surfing_F_v2_C_ExecuteUbergraph_Action_Nog_Melee_Surfing_F_v2::CallFunc_BreakTransform_Scale' has a wrong offset!");

}

