#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionDodge_AtlasSoldier_R

#include "Basic.hpp"

#include "OakGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ActionDodge_AtlasSoldier_R.ActionDodge_AtlasSoldier_R_C
// 0x0018 (0x0230 - 0x0218)
class UActionDodge_AtlasSoldier_R_C final : public UOakAction_Anim
{
public:
	class AActor*                                 MySelf;                                            // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 MyTarget;                                          // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 MyDamageCausingComponent;                          // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActionDodge_AtlasSoldier_R_C">();
	}
	static class UActionDodge_AtlasSoldier_R_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionDodge_AtlasSoldier_R_C>();
	}
};
static_assert(alignof(UActionDodge_AtlasSoldier_R_C) == 0x000008, "Wrong alignment on UActionDodge_AtlasSoldier_R_C");
static_assert(sizeof(UActionDodge_AtlasSoldier_R_C) == 0x000230, "Wrong size on UActionDodge_AtlasSoldier_R_C");
static_assert(offsetof(UActionDodge_AtlasSoldier_R_C, MySelf) == 0x000218, "Member 'UActionDodge_AtlasSoldier_R_C::MySelf' has a wrong offset!");
static_assert(offsetof(UActionDodge_AtlasSoldier_R_C, MyTarget) == 0x000220, "Member 'UActionDodge_AtlasSoldier_R_C::MyTarget' has a wrong offset!");
static_assert(offsetof(UActionDodge_AtlasSoldier_R_C, MyDamageCausingComponent) == 0x000228, "Member 'UActionDodge_AtlasSoldier_R_C::MyDamageCausingComponent' has a wrong offset!");

}

