#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_SkillScreen_Unlocked_Beastmaster

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Action_SkillScreen_Unlocked_Beastmaster.Action_SkillScreen_Unlocked_Beastmaster_C.ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster
// 0x0018 (0x0018 - 0x0000)
struct Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBeastmasterStandInComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster) == 0x000008, "Wrong alignment on Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster");
static_assert(sizeof(Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster) == 0x000018, "Wrong size on Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster");
static_assert(offsetof(Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster, EntryPoint) == 0x000000, "Member 'Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster, K2Node_Event_ActionEndState) == 0x000004, "Member 'Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster, K2Node_Event_Actor) == 0x000008, "Member 'Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'Action_SkillScreen_Unlocked_Beastmaster_C_ExecuteUbergraph_Action_SkillScreen_Unlocked_Beastmaster::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function Action_SkillScreen_Unlocked_Beastmaster.Action_SkillScreen_Unlocked_Beastmaster_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_SkillScreen_Unlocked_Beastmaster_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_SkillScreen_Unlocked_Beastmaster_C_OnEnd) == 0x000008, "Wrong alignment on Action_SkillScreen_Unlocked_Beastmaster_C_OnEnd");
static_assert(sizeof(Action_SkillScreen_Unlocked_Beastmaster_C_OnEnd) == 0x000010, "Wrong size on Action_SkillScreen_Unlocked_Beastmaster_C_OnEnd");
static_assert(offsetof(Action_SkillScreen_Unlocked_Beastmaster_C_OnEnd, ActionEndState) == 0x000000, "Member 'Action_SkillScreen_Unlocked_Beastmaster_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_SkillScreen_Unlocked_Beastmaster_C_OnEnd, Actor) == 0x000008, "Member 'Action_SkillScreen_Unlocked_Beastmaster_C_OnEnd::Actor' has a wrong offset!");

}

