#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_AnimTechDeath_InTechnicalTurret

#include "Basic.hpp"


namespace SDK::Params
{

// Function Action_AnimTechDeath_InTechnicalTurret.Action_AnimTechDeath_InTechnicalTurret_C.ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret
// 0x0018 (0x0018 - 0x0000)
struct Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakCharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret) == 0x000008, "Wrong alignment on Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret");
static_assert(sizeof(Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret) == 0x000018, "Wrong size on Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret");
static_assert(offsetof(Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret, EntryPoint) == 0x000000, "Member 'Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret, K2Node_Event_Actor) == 0x000008, "Member 'Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'Action_AnimTechDeath_InTechnicalTurret_C_ExecuteUbergraph_Action_AnimTechDeath_InTechnicalTurret::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function Action_AnimTechDeath_InTechnicalTurret.Action_AnimTechDeath_InTechnicalTurret_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_AnimTechDeath_InTechnicalTurret_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_AnimTechDeath_InTechnicalTurret_C_OnBegin) == 0x000008, "Wrong alignment on Action_AnimTechDeath_InTechnicalTurret_C_OnBegin");
static_assert(sizeof(Action_AnimTechDeath_InTechnicalTurret_C_OnBegin) == 0x000008, "Wrong size on Action_AnimTechDeath_InTechnicalTurret_C_OnBegin");
static_assert(offsetof(Action_AnimTechDeath_InTechnicalTurret_C_OnBegin, Actor) == 0x000000, "Member 'Action_AnimTechDeath_InTechnicalTurret_C_OnBegin::Actor' has a wrong offset!");

}

