#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Operative_SummonDigiClone

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function Action_Operative_SummonDigiClone.Action_Operative_SummonDigiClone_C.ExecuteUbergraph_Action_Operative_SummonDigiClone
// 0x05F0 (0x05F0 - 0x0000)
struct Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0220(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0238(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x0450(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FEnvQueryResult& QueryResult, const struct FVector& Location, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0468(0x0010)(ZeroConstructor, NoDestructor)
	struct FEnvQueryResult                        K2Node_CustomEvent_QueryResult1;                   // 0x0478(0x0040)(ConstParm)
	struct FVector                                K2Node_CustomEvent_Location1;                      // 0x04B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor1;                         // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEnvQueryResult                        K2Node_CustomEvent_QueryResult;                    // 0x04D0(0x0040)(ConstParm)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0510(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FEnvQueryResult& QueryResult, const struct FVector& Location, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0528(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0540(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEnvQueryResult                        Temp_struct_Variable1;                             // 0x0550(0x0040)()
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue;     // 0x0598(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x05A0(0x0018)()
	class AActor*                                 K2Node_Event_Actor;                                // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue1;                 // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPEventHub_Operative_C*                K2Node_DynamicCast_AsBPEvent_Hub_Operative;        // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTask_RunEnvQuery*              CallFunc_RunEnvQuery_ReturnValue;                  // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone) == 0x000008, "Wrong alignment on Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone");
static_assert(sizeof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone) == 0x0005F0, "Wrong size on Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, EntryPoint) == 0x000000, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_FinishTriggerDialog_Conversation) == 0x000220, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_FinishTriggerDialog_SequenceID) == 0x00022C, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000230, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_Conv_IntToBool_ReturnValue) == 0x000231, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_NewDialogContext_ReturnValue1) == 0x000238, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_FinishTriggerDialog_Conversation1) == 0x000450, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_FinishTriggerDialog_SequenceID1) == 0x00045C, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x000460, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000461, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_CreateDelegate_OutputDelegate) == 0x000468, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_CustomEvent_QueryResult1) == 0x000478, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_CustomEvent_QueryResult1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_CustomEvent_Location1) == 0x0004B8, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_CustomEvent_Location1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_CustomEvent_Actor1) == 0x0004C8, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_CustomEvent_Actor1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_CustomEvent_QueryResult) == 0x0004D0, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_CustomEvent_QueryResult' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_CustomEvent_Location) == 0x000510, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_CustomEvent_Actor) == 0x000520, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_CreateDelegate_OutputDelegate1) == 0x000528, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, Temp_object_Variable) == 0x000538, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, Temp_struct_Variable) == 0x000540, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, Temp_struct_Variable1) == 0x000550, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_K2_GetActor_ReturnValue) == 0x000590, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_GetDefaultWwiseComponent_ReturnValue) == 0x000598, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_GetDefaultWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_PostWwiseEvent_ReturnValue) == 0x0005A0, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_Event_Actor) == 0x0005B8, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_K2_GetActor_ReturnValue1) == 0x0005C0, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_K2_GetActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_GetComponentByClass_ReturnValue) == 0x0005C8, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_DynamicCast_AsBPEvent_Hub_Operative) == 0x0005D0, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_DynamicCast_AsBPEvent_Hub_Operative' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, K2Node_DynamicCast_bSuccess) == 0x0005D8, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_RunEnvQuery_ReturnValue) == 0x0005E0, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_RunEnvQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_IsValid_ReturnValue) == 0x0005E8, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone, CallFunc_IsValid_ReturnValue1) == 0x0005E9, "Member 'Action_Operative_SummonDigiClone_C_ExecuteUbergraph_Action_Operative_SummonDigiClone::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function Action_Operative_SummonDigiClone.Action_Operative_SummonDigiClone_C.Failure_264F849F461DE8AE8A8C7B98070E4B60
// 0x0058 (0x0058 - 0x0000)
struct Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60 final
{
public:
	struct FEnvQueryResult                        QueryResult;                                       // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Location;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60) == 0x000008, "Wrong alignment on Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60");
static_assert(sizeof(Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60) == 0x000058, "Wrong size on Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60, QueryResult) == 0x000000, "Member 'Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60::QueryResult' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60, Location) == 0x000040, "Member 'Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60::Location' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60, Actor) == 0x000050, "Member 'Action_Operative_SummonDigiClone_C_Failure_264F849F461DE8AE8A8C7B98070E4B60::Actor' has a wrong offset!");

// Function Action_Operative_SummonDigiClone.Action_Operative_SummonDigiClone_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Operative_SummonDigiClone_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Operative_SummonDigiClone_C_OnBegin) == 0x000008, "Wrong alignment on Action_Operative_SummonDigiClone_C_OnBegin");
static_assert(sizeof(Action_Operative_SummonDigiClone_C_OnBegin) == 0x000008, "Wrong size on Action_Operative_SummonDigiClone_C_OnBegin");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_OnBegin, Actor) == 0x000000, "Member 'Action_Operative_SummonDigiClone_C_OnBegin::Actor' has a wrong offset!");

// Function Action_Operative_SummonDigiClone.Action_Operative_SummonDigiClone_C.Success_264F849F461DE8AE8A8C7B98070E4B60
// 0x0058 (0x0058 - 0x0000)
struct Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60 final
{
public:
	struct FEnvQueryResult                        QueryResult;                                       // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Location;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60) == 0x000008, "Wrong alignment on Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60");
static_assert(sizeof(Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60) == 0x000058, "Wrong size on Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60, QueryResult) == 0x000000, "Member 'Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60::QueryResult' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60, Location) == 0x000040, "Member 'Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60::Location' has a wrong offset!");
static_assert(offsetof(Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60, Actor) == 0x000050, "Member 'Action_Operative_SummonDigiClone_C_Success_264F849F461DE8AE8A8C7B98070E4B60::Actor' has a wrong offset!");

}

