#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_TeleportEffects

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Action_TeleportEffects.Action_TeleportEffects_C.ExecuteUbergraph_Action_TeleportEffects
// 0x0098 (0x0098 - 0x0000)
struct Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_K2_GetIntRegisterValue_OutInt;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetIntRegisterValue_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_K2_GetIntRegisterValue_OutInt1;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetIntRegisterValue_ReturnValue1;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_Player*                   K2Node_DynamicCast_AsOak_Character_Player;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UScreenParticleManagerComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScreenParticleManagerComponent*        CallFunc_GetComponentByClass_ReturnValue1;         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseAudioComponent*                   CallFunc_GetComponentByClass_ReturnValue2;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0080(0x0018)()
};
static_assert(alignof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects) == 0x000008, "Wrong alignment on Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects");
static_assert(sizeof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects) == 0x000098, "Wrong size on Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, EntryPoint) == 0x000000, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_GetAssociatedPlayerController_ReturnValue) == 0x000008, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_GetAssociatedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000010, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_K2_GetIntRegisterValue_OutInt) == 0x00001C, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_K2_GetIntRegisterValue_OutInt' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_K2_GetIntRegisterValue_ReturnValue) == 0x000020, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_K2_GetIntRegisterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_K2_GetIntRegisterValue_OutInt1) == 0x000024, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_K2_GetIntRegisterValue_OutInt1' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_K2_GetIntRegisterValue_ReturnValue1) == 0x000028, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_K2_GetIntRegisterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_Greater_IntInt_ReturnValue) == 0x000029, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_Greater_IntInt_ReturnValue1) == 0x00002A, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, K2Node_Event_Actor1) == 0x000030, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, K2Node_Event_ActionEndState) == 0x000038, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, K2Node_Event_Actor) == 0x000040, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, K2Node_DynamicCast_AsOak_Character_Player) == 0x000048, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::K2Node_DynamicCast_AsOak_Character_Player' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000051, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_GetComponentByClass_ReturnValue1) == 0x000068, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_IsValid_ReturnValue1) == 0x000070, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_GetComponentByClass_ReturnValue2) == 0x000078, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects, CallFunc_PostWwiseEvent_ReturnValue) == 0x000080, "Member 'Action_TeleportEffects_C_ExecuteUbergraph_Action_TeleportEffects::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");

// Function Action_TeleportEffects.Action_TeleportEffects_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_TeleportEffects_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_TeleportEffects_C_OnEnd) == 0x000008, "Wrong alignment on Action_TeleportEffects_C_OnEnd");
static_assert(sizeof(Action_TeleportEffects_C_OnEnd) == 0x000010, "Wrong size on Action_TeleportEffects_C_OnEnd");
static_assert(offsetof(Action_TeleportEffects_C_OnEnd, ActionEndState) == 0x000000, "Member 'Action_TeleportEffects_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_TeleportEffects_C_OnEnd, Actor) == 0x000008, "Member 'Action_TeleportEffects_C_OnEnd::Actor' has a wrong offset!");

// Function Action_TeleportEffects.Action_TeleportEffects_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_TeleportEffects_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_TeleportEffects_C_OnBegin) == 0x000008, "Wrong alignment on Action_TeleportEffects_C_OnBegin");
static_assert(sizeof(Action_TeleportEffects_C_OnBegin) == 0x000008, "Wrong size on Action_TeleportEffects_C_OnBegin");
static_assert(offsetof(Action_TeleportEffects_C_OnBegin, Actor) == 0x000000, "Member 'Action_TeleportEffects_C_OnBegin::Actor' has a wrong offset!");

}

