#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_HeavyBadass_LeapSmash_R

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_Heavy_WeaponSocket_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function Action_HeavyBadass_LeapSmash_R.Action_HeavyBadass_LeapSmash_R_C.ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R
// 0x0780 (0x0780 - 0x0000)
struct Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOakElementalType                             Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable1;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_Heavy_WeaponSocket                       Temp_byte_Variable1;                               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Heavy_WeaponSocket                       Temp_byte_Variable2;                               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_HeavyBadass_C>    K2Node_DynamicCast_AsBPI_Heavy_Badass;             // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_HeavyBadass_GetLeapLandFX_LandFX;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared;             // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x00B0(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared1;            // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared2;            // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0170(0x0218)()
	EOakElementalType                             CallFunc_Heavy_GetElementalMode_ElementalMode;     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x038C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select1_Default;                            // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x03C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x03F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x03FC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0408(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_HeavyBadass_C>    K2Node_DynamicCast_AsBPI_Heavy_Badass1;            // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared3;            // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_Heavy_WeaponSocket                       K2Node_Select2_Default;                            // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             CallFunc_Heavy_GetElementalMode_ElementalMode1;    // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_443[0x5];                                      // 0x0443(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseEvent*                            CallFunc_Map_Find_Value;                           // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue;     // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0460(0x0018)()
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue1;    // 0x0478(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x0480(0x0018)()
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue2;    // 0x0498(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared4;            // 0x04A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOakElementalType                             CallFunc_Heavy_GetElementalMode_ElementalMode2;    // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x6];                                      // 0x04B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x04B8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x06D0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseEvent*                            CallFunc_Map_Find_Value1;                          // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue1;                    // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F2[0x6];                                      // 0x06F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue2;              // 0x06F8(0x0018)()
	class FName                                   K2Node_Select3_Default;                            // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_718[0x8];                                      // 0x0718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue1;              // 0x0720(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location1;                 // 0x0750(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation1;                 // 0x075C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale1;                    // 0x0768(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R) == 0x000010, "Wrong alignment on Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R");
static_assert(sizeof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R) == 0x000780, "Wrong size on Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, EntryPoint) == 0x000000, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_byte_Variable) == 0x000005, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_class_Variable) == 0x000008, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_class_Variable1) == 0x000010, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_class_Variable2) == 0x000018, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_class_Variable3) == 0x000020, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_class_Variable4) == 0x000028, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_class_Variable5) == 0x000030, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_class_Variable5' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_bool_Variable) == 0x000038, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_name_Variable) == 0x000040, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_name_Variable1) == 0x000048, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_bool_Variable1) == 0x000050, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_byte_Variable1) == 0x000051, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_byte_Variable2) == 0x000052, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_bool_Variable2) == 0x000053, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_name_Variable2) == 0x000058, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_name_Variable3) == 0x000060, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_AsBPI_Heavy_Badass) == 0x000068, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_AsBPI_Heavy_Badass' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_HeavyBadass_GetLeapLandFX_LandFX) == 0x000080, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_HeavyBadass_GetLeapLandFX_LandFX' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_AsBPI_Heavy_Shared) == 0x000088, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_AsBPI_Heavy_Shared' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_bSuccess1) == 0x000098, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_Event_ActionEndState) == 0x000099, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_Event_Actor1) == 0x0000A0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_bool_IsClosed_Variable) == 0x0000A8, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, Temp_struct_Variable) == 0x0000B0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_AsBPI_Heavy_Shared1) == 0x000140, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_AsBPI_Heavy_Shared1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_bSuccess2) == 0x000150, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_AsBPI_Heavy_Shared2) == 0x000158, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_AsBPI_Heavy_Shared2' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_bSuccess3) == 0x000168, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_NewDialogContext_ReturnValue) == 0x000170, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_Heavy_GetElementalMode_ElementalMode) == 0x000388, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_Heavy_GetElementalMode_ElementalMode' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_FinishTriggerDialog_Conversation) == 0x00038C, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_FinishTriggerDialog_SequenceID) == 0x000398, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_FinishTriggerDialog_ReturnValue) == 0x00039C, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_Select_Default) == 0x0003A0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_Conv_IntToBool_ReturnValue) == 0x0003A8, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_Event_Actor) == 0x0003B0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_Select1_Default) == 0x0003B8, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_GetActorSocket_ReturnValue) == 0x0003C0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_BreakTransform_Location) == 0x0003F0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_BreakTransform_Rotation) == 0x0003FC, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_BreakTransform_Scale) == 0x000408, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_AsBPI_Heavy_Badass1) == 0x000418, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_AsBPI_Heavy_Badass1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_bSuccess4) == 0x000428, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_AsBPI_Heavy_Shared3) == 0x000430, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_AsBPI_Heavy_Shared3' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_bSuccess5) == 0x000440, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_Select2_Default) == 0x000441, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_Heavy_GetElementalMode_ElementalMode1) == 0x000442, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_Heavy_GetElementalMode_ElementalMode1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_Map_Find_Value) == 0x000448, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_Map_Find_ReturnValue) == 0x000450, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_GetDefaultWwiseComponent_ReturnValue) == 0x000458, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_GetDefaultWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_PostWwiseEvent_ReturnValue) == 0x000460, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_GetDefaultWwiseComponent_ReturnValue1) == 0x000478, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_GetDefaultWwiseComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_PostWwiseEvent_ReturnValue1) == 0x000480, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_GetDefaultWwiseComponent_ReturnValue2) == 0x000498, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_GetDefaultWwiseComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_AsBPI_Heavy_Shared4) == 0x0004A0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_AsBPI_Heavy_Shared4' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_DynamicCast_bSuccess6) == 0x0004B0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_Heavy_GetElementalMode_ElementalMode2) == 0x0004B1, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_Heavy_GetElementalMode_ElementalMode2' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_NewDialogContext_ReturnValue1) == 0x0004B8, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_FinishTriggerDialog_Conversation1) == 0x0006D0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_FinishTriggerDialog_SequenceID1) == 0x0006DC, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x0006E0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_Map_Find_Value1) == 0x0006E8, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_Map_Find_Value1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_Map_Find_ReturnValue1) == 0x0006F0, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_Map_Find_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_Conv_IntToBool_ReturnValue1) == 0x0006F1, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_PostWwiseEvent_ReturnValue2) == 0x0006F8, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_PostWwiseEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, K2Node_Select3_Default) == 0x000710, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_GetActorSocket_ReturnValue1) == 0x000720, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_GetActorSocket_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_BreakTransform_Location1) == 0x000750, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_BreakTransform_Location1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_BreakTransform_Rotation1) == 0x00075C, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_BreakTransform_Rotation1' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R, CallFunc_BreakTransform_Scale1) == 0x000768, "Member 'Action_HeavyBadass_LeapSmash_R_C_ExecuteUbergraph_Action_HeavyBadass_LeapSmash_R::CallFunc_BreakTransform_Scale1' has a wrong offset!");

// Function Action_HeavyBadass_LeapSmash_R.Action_HeavyBadass_LeapSmash_R_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_HeavyBadass_LeapSmash_R_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_HeavyBadass_LeapSmash_R_C_OnBegin) == 0x000008, "Wrong alignment on Action_HeavyBadass_LeapSmash_R_C_OnBegin");
static_assert(sizeof(Action_HeavyBadass_LeapSmash_R_C_OnBegin) == 0x000008, "Wrong size on Action_HeavyBadass_LeapSmash_R_C_OnBegin");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_OnBegin, Actor) == 0x000000, "Member 'Action_HeavyBadass_LeapSmash_R_C_OnBegin::Actor' has a wrong offset!");

// Function Action_HeavyBadass_LeapSmash_R.Action_HeavyBadass_LeapSmash_R_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_HeavyBadass_LeapSmash_R_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_HeavyBadass_LeapSmash_R_C_OnEnd) == 0x000008, "Wrong alignment on Action_HeavyBadass_LeapSmash_R_C_OnEnd");
static_assert(sizeof(Action_HeavyBadass_LeapSmash_R_C_OnEnd) == 0x000010, "Wrong size on Action_HeavyBadass_LeapSmash_R_C_OnEnd");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_OnEnd, ActionEndState) == 0x000000, "Member 'Action_HeavyBadass_LeapSmash_R_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_HeavyBadass_LeapSmash_R_C_OnEnd, Actor) == 0x000008, "Member 'Action_HeavyBadass_LeapSmash_R_C_OnEnd::Actor' has a wrong offset!");

}

