#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Nog_HitReaction_Flinches

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Action_Nog_HitReaction_Flinches.Action_Nog_HitReaction_Flinches_C.ExecuteUbergraph_Action_Nog_HitReaction_Flinches
// 0x0050 (0x0050 - 0x0000)
struct Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardBool_Value;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Nog_C>            K2Node_DynamicCast_AsBPI_Nog;                      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBlackboardBool_Value1;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Nog_C>            K2Node_DynamicCast_AsBPI_Nog1;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches) == 0x000008, "Wrong alignment on Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches");
static_assert(sizeof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches) == 0x000050, "Wrong size on Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, EntryPoint) == 0x000000, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, K2Node_Event_ActionEndState) == 0x000004, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, K2Node_Event_Actor) == 0x000008, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, CallFunc_GetBlackboardBool_Value) == 0x000010, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::CallFunc_GetBlackboardBool_Value' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, K2Node_DynamicCast_AsBPI_Nog) == 0x000018, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::K2Node_DynamicCast_AsBPI_Nog' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, CallFunc_GetBlackboardBool_Value1) == 0x000029, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::CallFunc_GetBlackboardBool_Value1' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, K2Node_DynamicCast_AsBPI_Nog1) == 0x000030, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::K2Node_DynamicCast_AsBPI_Nog1' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, K2Node_DynamicCast_bSuccess1) == 0x000040, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches, K2Node_Event_Actor1) == 0x000048, "Member 'Action_Nog_HitReaction_Flinches_C_ExecuteUbergraph_Action_Nog_HitReaction_Flinches::K2Node_Event_Actor1' has a wrong offset!");

// Function Action_Nog_HitReaction_Flinches.Action_Nog_HitReaction_Flinches_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_Nog_HitReaction_Flinches_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Nog_HitReaction_Flinches_C_OnServerEnd) == 0x000008, "Wrong alignment on Action_Nog_HitReaction_Flinches_C_OnServerEnd");
static_assert(sizeof(Action_Nog_HitReaction_Flinches_C_OnServerEnd) == 0x000010, "Wrong size on Action_Nog_HitReaction_Flinches_C_OnServerEnd");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'Action_Nog_HitReaction_Flinches_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_OnServerEnd, Actor) == 0x000008, "Member 'Action_Nog_HitReaction_Flinches_C_OnServerEnd::Actor' has a wrong offset!");

// Function Action_Nog_HitReaction_Flinches.Action_Nog_HitReaction_Flinches_C.OnServerBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Nog_HitReaction_Flinches_C_OnServerBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Nog_HitReaction_Flinches_C_OnServerBegin) == 0x000008, "Wrong alignment on Action_Nog_HitReaction_Flinches_C_OnServerBegin");
static_assert(sizeof(Action_Nog_HitReaction_Flinches_C_OnServerBegin) == 0x000008, "Wrong size on Action_Nog_HitReaction_Flinches_C_OnServerBegin");
static_assert(offsetof(Action_Nog_HitReaction_Flinches_C_OnServerBegin, Actor) == 0x000000, "Member 'Action_Nog_HitReaction_Flinches_C_OnServerBegin::Actor' has a wrong offset!");

}

