#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionSkill_IronBear

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function ActionSkill_IronBear.ActionSkill_IronBear_C.ExecuteUbergraph_ActionSkill_IronBear
// 0x0028 (0x0028 - 0x0000)
struct ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear) == 0x000008, "Wrong alignment on ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear");
static_assert(sizeof(ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear) == 0x000028, "Wrong size on ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear");
static_assert(offsetof(ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear, EntryPoint) == 0x000000, "Member 'ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear, Temp_struct_Variable) == 0x000010, "Member 'ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear, CallFunc_K2Play_ReturnValue) == 0x000020, "Member 'ActionSkill_IronBear_C_ExecuteUbergraph_ActionSkill_IronBear::CallFunc_K2Play_ReturnValue' has a wrong offset!");

// Function ActionSkill_IronBear.ActionSkill_IronBear_C.CalculateAbilityState
// 0x0006 (0x0006 - 0x0000)
struct ActionSkill_IronBear_C_CalculateAbilityState final
{
public:
	EGbxAbilityState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAugmentInSlot_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnyAugmentInSlot_ReturnValue1;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              CallFunc_CalculateAbilityState_ReturnValue;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_IronBear_C_CalculateAbilityState) == 0x000001, "Wrong alignment on ActionSkill_IronBear_C_CalculateAbilityState");
static_assert(sizeof(ActionSkill_IronBear_C_CalculateAbilityState) == 0x000006, "Wrong size on ActionSkill_IronBear_C_CalculateAbilityState");
static_assert(offsetof(ActionSkill_IronBear_C_CalculateAbilityState, ReturnValue) == 0x000000, "Member 'ActionSkill_IronBear_C_CalculateAbilityState::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_CalculateAbilityState, CallFunc_IsAnyAugmentInSlot_ReturnValue) == 0x000001, "Member 'ActionSkill_IronBear_C_CalculateAbilityState::CallFunc_IsAnyAugmentInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_CalculateAbilityState, CallFunc_IsAnyAugmentInSlot_ReturnValue1) == 0x000002, "Member 'ActionSkill_IronBear_C_CalculateAbilityState::CallFunc_IsAnyAugmentInSlot_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_CalculateAbilityState, CallFunc_CalculateAbilityState_ReturnValue) == 0x000003, "Member 'ActionSkill_IronBear_C_CalculateAbilityState::CallFunc_CalculateAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_CalculateAbilityState, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'ActionSkill_IronBear_C_CalculateAbilityState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_CalculateAbilityState, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'ActionSkill_IronBear_C_CalculateAbilityState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ActionSkill_IronBear.ActionSkill_IronBear_C.GetCameraYaw
// 0x0050 (0x0050 - 0x0000)
struct ActionSkill_IronBear_C_GetCameraYaw final
{
public:
	float                                         Res;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0034(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_IronBear_C_GetCameraYaw) == 0x000008, "Wrong alignment on ActionSkill_IronBear_C_GetCameraYaw");
static_assert(sizeof(ActionSkill_IronBear_C_GetCameraYaw) == 0x000050, "Wrong size on ActionSkill_IronBear_C_GetCameraYaw");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, Res) == 0x000000, "Member 'ActionSkill_IronBear_C_GetCameraYaw::Res' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'ActionSkill_IronBear_C_GetCameraYaw::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, K2Node_DynamicCast_AsOak_Character) == 0x000010, "Member 'ActionSkill_IronBear_C_GetCameraYaw::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ActionSkill_IronBear_C_GetCameraYaw::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, CallFunc_GetController_ReturnValue) == 0x000020, "Member 'ActionSkill_IronBear_C_GetCameraYaw::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000028, "Member 'ActionSkill_IronBear_C_GetCameraYaw::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'ActionSkill_IronBear_C_GetCameraYaw::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, CallFunc_GetCameraRotation_ReturnValue) == 0x000034, "Member 'ActionSkill_IronBear_C_GetCameraYaw::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, CallFunc_BreakRotator_Roll) == 0x000040, "Member 'ActionSkill_IronBear_C_GetCameraYaw::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, CallFunc_BreakRotator_Pitch) == 0x000044, "Member 'ActionSkill_IronBear_C_GetCameraYaw::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCameraYaw, CallFunc_BreakRotator_Yaw) == 0x000048, "Member 'ActionSkill_IronBear_C_GetCameraYaw::CallFunc_BreakRotator_Yaw' has a wrong offset!");

// Function ActionSkill_IronBear.ActionSkill_IronBear_C.ShouldAbortActivation
// 0x0004 (0x0004 - 0x0000)
struct ActionSkill_IronBear_C_ShouldAbortActivation final
{
public:
	uint8                                         OutAbortCode;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_ShouldAbortActivation_OutAbortCode;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAbortActivation_ReturnValue;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_IronBear_C_ShouldAbortActivation) == 0x000001, "Wrong alignment on ActionSkill_IronBear_C_ShouldAbortActivation");
static_assert(sizeof(ActionSkill_IronBear_C_ShouldAbortActivation) == 0x000004, "Wrong size on ActionSkill_IronBear_C_ShouldAbortActivation");
static_assert(offsetof(ActionSkill_IronBear_C_ShouldAbortActivation, OutAbortCode) == 0x000000, "Member 'ActionSkill_IronBear_C_ShouldAbortActivation::OutAbortCode' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_ShouldAbortActivation, ReturnValue) == 0x000001, "Member 'ActionSkill_IronBear_C_ShouldAbortActivation::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_ShouldAbortActivation, CallFunc_ShouldAbortActivation_OutAbortCode) == 0x000002, "Member 'ActionSkill_IronBear_C_ShouldAbortActivation::CallFunc_ShouldAbortActivation_OutAbortCode' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_ShouldAbortActivation, CallFunc_ShouldAbortActivation_ReturnValue) == 0x000003, "Member 'ActionSkill_IronBear_C_ShouldAbortActivation::CallFunc_ShouldAbortActivation_ReturnValue' has a wrong offset!");

// Function ActionSkill_IronBear.ActionSkill_IronBear_C.GetCooldownRestartPercent
// 0x0050 (0x0050 - 0x0000)
struct ActionSkill_IronBear_C_GetCooldownRestartPercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakResourcePoolReference_bValid;        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakResourcePoolReference_CurrentValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakResourcePoolReference_MinValue;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakResourcePoolReference_MaxValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0020(0x0018)(NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_IronBear_C_GetCooldownRestartPercent) == 0x000008, "Wrong alignment on ActionSkill_IronBear_C_GetCooldownRestartPercent");
static_assert(sizeof(ActionSkill_IronBear_C_GetCooldownRestartPercent) == 0x000050, "Wrong size on ActionSkill_IronBear_C_GetCooldownRestartPercent");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, ReturnValue) == 0x000000, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000008, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, K2Node_SwitchEnum_CmpSuccess) == 0x00000E, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_BreakResourcePoolReference_bValid) == 0x00000F, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_BreakResourcePoolReference_bValid' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_BreakResourcePoolReference_CurrentValue) == 0x000010, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_BreakResourcePoolReference_CurrentValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_BreakResourcePoolReference_MinValue) == 0x000014, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_BreakResourcePoolReference_MinValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_BreakResourcePoolReference_MaxValue) == 0x000018, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_BreakResourcePoolReference_MaxValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, K2Node_MakeStruct_DataTableValueHandle) == 0x000020, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_Less_FloatFloat_ReturnValue) == 0x000038, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x00003C, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000040, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000044, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetCooldownRestartPercent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'ActionSkill_IronBear_C_GetCooldownRestartPercent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function ActionSkill_IronBear.ActionSkill_IronBear_C.GetIronBearSpawnLocation
// 0x00C0 (0x00C0 - 0x0000)
struct ActionSkill_IronBear_C_GetIronBearSpawnLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCameraYaw_Res;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0078(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0084(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCrouchLocationOffset_ReturnValue;      // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_IronBear_C_GetIronBearSpawnLocation) == 0x000010, "Wrong alignment on ActionSkill_IronBear_C_GetIronBearSpawnLocation");
static_assert(sizeof(ActionSkill_IronBear_C_GetIronBearSpawnLocation) == 0x0000C0, "Wrong size on ActionSkill_IronBear_C_GetIronBearSpawnLocation");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, ReturnValue) == 0x000000, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_GetCameraYaw_Res) == 0x00000C, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_GetCameraYaw_Res' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_GetAbilityOwner_ReturnValue) == 0x000010, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000060, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_BreakTransform_Location) == 0x00006C, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_BreakTransform_Rotation) == 0x000078, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_BreakTransform_Scale) == 0x000084, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_GetCrouchLocationOffset_ReturnValue) == 0x000090, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_GetCrouchLocationOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x00009C, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnLocation, CallFunc_Add_VectorVector_ReturnValue1) == 0x0000A8, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnLocation::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");

// Function ActionSkill_IronBear.ActionSkill_IronBear_C.GetIronBearSpawnRotation
// 0x001C (0x001C - 0x0000)
struct ActionSkill_IronBear_C_GetIronBearSpawnRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCameraYaw_Res;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x000C)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_IronBear_C_GetIronBearSpawnRotation) == 0x000004, "Wrong alignment on ActionSkill_IronBear_C_GetIronBearSpawnRotation");
static_assert(sizeof(ActionSkill_IronBear_C_GetIronBearSpawnRotation) == 0x00001C, "Wrong size on ActionSkill_IronBear_C_GetIronBearSpawnRotation");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnRotation, ReturnValue) == 0x000000, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnRotation::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnRotation, CallFunc_GetCameraYaw_Res) == 0x00000C, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnRotation::CallFunc_GetCameraYaw_Res' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearSpawnRotation, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'ActionSkill_IronBear_C_GetIronBearSpawnRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function ActionSkill_IronBear.ActionSkill_IronBear_C.GetIronBearClass
// 0x0040 (0x0040 - 0x0000)
struct ActionSkill_IronBear_C_GetIronBearClass final
{
public:
	TSubclassOf<class AOakCharacter_IronBear>     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAugmentBeUsed_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAbilityAugmentSlotted_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_IronBear_C_GetIronBearClass) == 0x000008, "Wrong alignment on ActionSkill_IronBear_C_GetIronBearClass");
static_assert(sizeof(ActionSkill_IronBear_C_GetIronBearClass) == 0x000040, "Wrong size on ActionSkill_IronBear_C_GetIronBearClass");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearClass, ReturnValue) == 0x000000, "Member 'ActionSkill_IronBear_C_GetIronBearClass::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearClass, Temp_bool_Variable) == 0x000008, "Member 'ActionSkill_IronBear_C_GetIronBearClass::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearClass, Temp_class_Variable) == 0x000010, "Member 'ActionSkill_IronBear_C_GetIronBearClass::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearClass, Temp_class_Variable1) == 0x000018, "Member 'ActionSkill_IronBear_C_GetIronBearClass::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearClass, CallFunc_GetAbilityOwner_ReturnValue) == 0x000020, "Member 'ActionSkill_IronBear_C_GetIronBearClass::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearClass, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'ActionSkill_IronBear_C_GetIronBearClass::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearClass, CallFunc_CanAugmentBeUsed_ReturnValue) == 0x000030, "Member 'ActionSkill_IronBear_C_GetIronBearClass::CallFunc_CanAugmentBeUsed_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearClass, CallFunc_IsAbilityAugmentSlotted_ReturnValue) == 0x000031, "Member 'ActionSkill_IronBear_C_GetIronBearClass::CallFunc_IsAbilityAugmentSlotted_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetIronBearClass, K2Node_Select_Default) == 0x000038, "Member 'ActionSkill_IronBear_C_GetIronBearClass::K2Node_Select_Default' has a wrong offset!");

// Function ActionSkill_IronBear.ActionSkill_IronBear_C.GetActionSkillWidgetKeyframe
// 0x0060 (0x0060 - 0x0000)
struct ActionSkill_IronBear_C_GetActionSkillWidgetKeyframe final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable1;                             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityAugmentSlotted_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_IronBear_C_GetActionSkillWidgetKeyframe) == 0x000008, "Wrong alignment on ActionSkill_IronBear_C_GetActionSkillWidgetKeyframe");
static_assert(sizeof(ActionSkill_IronBear_C_GetActionSkillWidgetKeyframe) == 0x000060, "Wrong size on ActionSkill_IronBear_C_GetActionSkillWidgetKeyframe");
static_assert(offsetof(ActionSkill_IronBear_C_GetActionSkillWidgetKeyframe, ReturnValue) == 0x000000, "Member 'ActionSkill_IronBear_C_GetActionSkillWidgetKeyframe::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_IronBear_C_GetActionSkillWidgetKeyframe, Temp_bool_Variable) == 0x000010, "Member 'ActionSkill_IronBear_C_GetActionSkillWidgetKeyframe::Temp_bool_Variable' has a wrong offset!");
