#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_DigiClone_Summoned

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"


namespace SDK::Params
{

// Function Action_DigiClone_Summoned.Action_DigiClone_Summoned_C.ExecuteUbergraph_Action_DigiClone_Summoned
// 0x0038 (0x0038 - 0x0000)
struct Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   CallFunc_SpawnAttachedWwiseComponent_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned) == 0x000008, "Wrong alignment on Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned");
static_assert(sizeof(Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned) == 0x000038, "Wrong size on Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned");
static_assert(offsetof(Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned, EntryPoint) == 0x000000, "Member 'Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned, CallFunc_K2_GetActor_ReturnValue) == 0x000008, "Member 'Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned, K2Node_Event_Actor) == 0x000010, "Member 'Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned, CallFunc_SpawnAttachedWwiseComponent_ReturnValue) == 0x000018, "Member 'Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned::CallFunc_SpawnAttachedWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned, CallFunc_PostWwiseEvent_ReturnValue) == 0x000020, "Member 'Action_DigiClone_Summoned_C_ExecuteUbergraph_Action_DigiClone_Summoned::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");

// Function Action_DigiClone_Summoned.Action_DigiClone_Summoned_C.OnServerBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_DigiClone_Summoned_C_OnServerBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_DigiClone_Summoned_C_OnServerBegin) == 0x000008, "Wrong alignment on Action_DigiClone_Summoned_C_OnServerBegin");
static_assert(sizeof(Action_DigiClone_Summoned_C_OnServerBegin) == 0x000008, "Wrong size on Action_DigiClone_Summoned_C_OnServerBegin");
static_assert(offsetof(Action_DigiClone_Summoned_C_OnServerBegin, Actor) == 0x000000, "Member 'Action_DigiClone_Summoned_C_OnServerBegin::Actor' has a wrong offset!");

}

