#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_HeavyShared_Melee

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function Action_HeavyShared_Melee.Action_HeavyShared_Melee_C.ExecuteUbergraph_Action_HeavyShared_Melee
// 0x0108 (0x0108 - 0x0000)
struct Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared;             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0068(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EOakElementalType                             CallFunc_Heavy_GetElementalMode_ElementalMode;     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee) == 0x000008, "Wrong alignment on Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee");
static_assert(sizeof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee) == 0x000108, "Wrong size on Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, EntryPoint) == 0x000000, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, Temp_byte_Variable) == 0x000004, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, Temp_class_Variable) == 0x000008, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, Temp_class_Variable1) == 0x000010, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, Temp_class_Variable2) == 0x000018, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, Temp_class_Variable3) == 0x000020, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, Temp_class_Variable4) == 0x000028, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, Temp_class_Variable5) == 0x000030, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::Temp_class_Variable5' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, K2Node_Event_Actor1) == 0x000038, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, K2Node_Event_ActionEndState) == 0x000040, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, K2Node_Event_Actor) == 0x000048, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, K2Node_DynamicCast_AsBPI_Heavy_Shared) == 0x000050, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::K2Node_DynamicCast_AsBPI_Heavy_Shared' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, Temp_struct_Variable) == 0x000068, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, CallFunc_Heavy_GetElementalMode_ElementalMode) == 0x0000F8, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::CallFunc_Heavy_GetElementalMode_ElementalMode' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee, K2Node_Select_Default) == 0x000100, "Member 'Action_HeavyShared_Melee_C_ExecuteUbergraph_Action_HeavyShared_Melee::K2Node_Select_Default' has a wrong offset!");

// Function Action_HeavyShared_Melee.Action_HeavyShared_Melee_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_HeavyShared_Melee_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_HeavyShared_Melee_C_OnEnd) == 0x000008, "Wrong alignment on Action_HeavyShared_Melee_C_OnEnd");
static_assert(sizeof(Action_HeavyShared_Melee_C_OnEnd) == 0x000010, "Wrong size on Action_HeavyShared_Melee_C_OnEnd");
static_assert(offsetof(Action_HeavyShared_Melee_C_OnEnd, ActionEndState) == 0x000000, "Member 'Action_HeavyShared_Melee_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_HeavyShared_Melee_C_OnEnd, Actor) == 0x000008, "Member 'Action_HeavyShared_Melee_C_OnEnd::Actor' has a wrong offset!");

// Function Action_HeavyShared_Melee.Action_HeavyShared_Melee_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_HeavyShared_Melee_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_HeavyShared_Melee_C_OnBegin) == 0x000008, "Wrong alignment on Action_HeavyShared_Melee_C_OnBegin");
static_assert(sizeof(Action_HeavyShared_Melee_C_OnBegin) == 0x000008, "Wrong size on Action_HeavyShared_Melee_C_OnBegin");
static_assert(offsetof(Action_HeavyShared_Melee_C_OnBegin, Actor) == 0x000000, "Member 'Action_HeavyShared_Melee_C_OnBegin::Actor' has a wrong offset!");

}

