#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Beastmaster_AttackCommand

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Action_Beastmaster_AttackCommand.Action_Beastmaster_AttackCommand_C.ExecuteUbergraph_Action_Beastmaster_AttackCommand
// 0x00C8 (0x00C8 - 0x0000)
struct Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor2;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIBPChar_Beastmaster_C> K2Node_DynamicCast_AsIBPChar_Beastmaster;          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Beastmaster_C> K2Node_DynamicCast_AsIBPChar_Beastmaster1;         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CallFunc_GetCurrentPet_Res;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIBPChar_Pet_C>        K2Node_DynamicCast_AsIBPChar_Pet;                  // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_K2_GetObjectRegisterValue_OutObject;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetObjectRegisterValue_ReturnValue;    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue1;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue2;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand) == 0x000008, "Wrong alignment on Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand");
static_assert(sizeof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand) == 0x0000C8, "Wrong size on Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, EntryPoint) == 0x000000, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_Event_ActionEndState) == 0x000004, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_Event_Actor) == 0x000008, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_Event_Actor2) == 0x000010, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_Event_Actor2' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_Event_Actor1) == 0x000018, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_K2_GetActor_ReturnValue) == 0x000020, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_DynamicCast_AsIBPChar_Beastmaster) == 0x000028, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_DynamicCast_AsIBPChar_Beastmaster' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_DynamicCast_AsIBPChar_Beastmaster1) == 0x000040, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_DynamicCast_AsIBPChar_Beastmaster1' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_GetCurrentPet_Res) == 0x000058, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_GetCurrentPet_Res' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_DynamicCast_AsIBPChar_Pet) == 0x000060, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_DynamicCast_AsIBPChar_Pet' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_K2_GetObjectRegisterValue_OutObject) == 0x000078, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_K2_GetObjectRegisterValue_OutObject' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_K2_GetObjectRegisterValue_ReturnValue) == 0x000080, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_K2_GetObjectRegisterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_K2_GetActor_ReturnValue1) == 0x000088, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_K2_GetActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_K2_GetActor_ReturnValue2) == 0x000090, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_K2_GetActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_GetAssociatedPlayerController_ReturnValue) == 0x000098, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_GetAssociatedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_DynamicCast_AsOak_Character) == 0x0000A0, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, K2Node_DynamicCast_bSuccess3) == 0x0000A8, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_GetWeapon_ReturnValue) == 0x0000B0, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_GetValueOfAttribute_ReturnValue) == 0x0000BC, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000C0, "Member 'Action_Beastmaster_AttackCommand_C_ExecuteUbergraph_Action_Beastmaster_AttackCommand::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function Action_Beastmaster_AttackCommand.Action_Beastmaster_AttackCommand_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_Beastmaster_AttackCommand_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Beastmaster_AttackCommand_C_OnServerEnd) == 0x000008, "Wrong alignment on Action_Beastmaster_AttackCommand_C_OnServerEnd");
static_assert(sizeof(Action_Beastmaster_AttackCommand_C_OnServerEnd) == 0x000010, "Wrong size on Action_Beastmaster_AttackCommand_C_OnServerEnd");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'Action_Beastmaster_AttackCommand_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_OnServerEnd, Actor) == 0x000008, "Member 'Action_Beastmaster_AttackCommand_C_OnServerEnd::Actor' has a wrong offset!");

// Function Action_Beastmaster_AttackCommand.Action_Beastmaster_AttackCommand_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Beastmaster_AttackCommand_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Beastmaster_AttackCommand_C_OnBegin) == 0x000008, "Wrong alignment on Action_Beastmaster_AttackCommand_C_OnBegin");
static_assert(sizeof(Action_Beastmaster_AttackCommand_C_OnBegin) == 0x000008, "Wrong size on Action_Beastmaster_AttackCommand_C_OnBegin");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_OnBegin, Actor) == 0x000000, "Member 'Action_Beastmaster_AttackCommand_C_OnBegin::Actor' has a wrong offset!");

// Function Action_Beastmaster_AttackCommand.Action_Beastmaster_AttackCommand_C.OnBeginBringUpWeapon
// 0x0008 (0x0008 - 0x0000)
struct Action_Beastmaster_AttackCommand_C_OnBeginBringUpWeapon final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Beastmaster_AttackCommand_C_OnBeginBringUpWeapon) == 0x000008, "Wrong alignment on Action_Beastmaster_AttackCommand_C_OnBeginBringUpWeapon");
static_assert(sizeof(Action_Beastmaster_AttackCommand_C_OnBeginBringUpWeapon) == 0x000008, "Wrong size on Action_Beastmaster_AttackCommand_C_OnBeginBringUpWeapon");
static_assert(offsetof(Action_Beastmaster_AttackCommand_C_OnBeginBringUpWeapon, Actor) == 0x000000, "Member 'Action_Beastmaster_AttackCommand_C_OnBeginBringUpWeapon::Actor' has a wrong offset!");

}

