#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Gunner_SpawnIronCub

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function Action_Gunner_SpawnIronCub.Action_Gunner_SpawnIronCub_C.ExecuteUbergraph_Action_Gunner_SpawnIronCub
// 0x0328 (0x0328 - 0x0000)
struct Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter_Player*                   K2Node_DynamicCast_AsOak_Character_Player;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility*                      CallFunc_GetPrimaryActionAbility_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbility_IronBear*             K2Node_DynamicCast_AsOak_Action_Ability_Iron_Bear; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Ixora_Gunner_C> K2Node_DynamicCast_AsIBPChar_Ixora_Gunner;         // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Ixora_Gunner_C> K2Node_DynamicCast_AsIBPChar_Ixora_Gunner1;        // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0090(0x0218)()
	class AActor*                                 K2Node_Event_Actor;                                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIBPChar_Ixora_Gunner_C> K2Node_DynamicCast_AsIBPChar_Ixora_Gunner2;        // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x02C8(0x0018)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x02E0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Ixora_Gunner_C> K2Node_DynamicCast_AsIBPChar_Ixora_Gunner3;        // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Ixora_Gunner_C> K2Node_DynamicCast_AsIBPChar_Ixora_Gunner4;        // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub) == 0x000008, "Wrong alignment on Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub");
static_assert(sizeof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub) == 0x000328, "Wrong size on Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, EntryPoint) == 0x000000, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_K2_GetActor_ReturnValue) == 0x000008, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_K2_GetActor_ReturnValue1) == 0x000018, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_K2_GetActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_IsServer_ReturnValue) == 0x000020, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_AsOak_Character_Player) == 0x000028, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_AsOak_Character_Player' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_GetPrimaryActionAbility_ReturnValue) == 0x000038, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_GetPrimaryActionAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_Event_ActionEndState) == 0x000040, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_Event_Actor1) == 0x000048, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_AsOak_Action_Ability_Iron_Bear) == 0x000050, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_AsOak_Action_Ability_Iron_Bear' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_bSuccess1) == 0x000058, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_AsIBPChar_Ixora_Gunner) == 0x000060, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_AsIBPChar_Ixora_Gunner' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_AsIBPChar_Ixora_Gunner1) == 0x000078, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_AsIBPChar_Ixora_Gunner1' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_bSuccess3) == 0x000088, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_NewDialogContext_ReturnValue) == 0x000090, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_Event_Actor) == 0x0002A8, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_AsIBPChar_Ixora_Gunner2) == 0x0002B0, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_AsIBPChar_Ixora_Gunner2' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_bSuccess4) == 0x0002C0, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_PostAttachedEvent_ReturnValue) == 0x0002C8, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_FinishTriggerDialog_Conversation) == 0x0002E0, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_FinishTriggerDialog_SequenceID) == 0x0002EC, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_FinishTriggerDialog_ReturnValue) == 0x0002F0, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, CallFunc_Conv_IntToBool_ReturnValue) == 0x0002F1, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_AsIBPChar_Ixora_Gunner3) == 0x0002F8, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_AsIBPChar_Ixora_Gunner3' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_bSuccess5) == 0x000308, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_AsIBPChar_Ixora_Gunner4) == 0x000310, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_AsIBPChar_Ixora_Gunner4' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub, K2Node_DynamicCast_bSuccess6) == 0x000320, "Member 'Action_Gunner_SpawnIronCub_C_ExecuteUbergraph_Action_Gunner_SpawnIronCub::K2Node_DynamicCast_bSuccess6' has a wrong offset!");

// Function Action_Gunner_SpawnIronCub.Action_Gunner_SpawnIronCub_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Gunner_SpawnIronCub_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Gunner_SpawnIronCub_C_OnBegin) == 0x000008, "Wrong alignment on Action_Gunner_SpawnIronCub_C_OnBegin");
static_assert(sizeof(Action_Gunner_SpawnIronCub_C_OnBegin) == 0x000008, "Wrong size on Action_Gunner_SpawnIronCub_C_OnBegin");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_OnBegin, Actor) == 0x000000, "Member 'Action_Gunner_SpawnIronCub_C_OnBegin::Actor' has a wrong offset!");

// Function Action_Gunner_SpawnIronCub.Action_Gunner_SpawnIronCub_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_Gunner_SpawnIronCub_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Gunner_SpawnIronCub_C_OnServerEnd) == 0x000008, "Wrong alignment on Action_Gunner_SpawnIronCub_C_OnServerEnd");
static_assert(sizeof(Action_Gunner_SpawnIronCub_C_OnServerEnd) == 0x000010, "Wrong size on Action_Gunner_SpawnIronCub_C_OnServerEnd");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'Action_Gunner_SpawnIronCub_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Gunner_SpawnIronCub_C_OnServerEnd, Actor) == 0x000008, "Member 'Action_Gunner_SpawnIronCub_C_OnServerEnd::Actor' has a wrong offset!");

}

