#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Pet_KilledEnemy

#include "Basic.hpp"


namespace SDK::Params
{

// Function Action_Pet_KilledEnemy.Action_Pet_KilledEnemy_C.ExecuteUbergraph_Action_Pet_KilledEnemy
// 0x0048 (0x0048 - 0x0000)
struct Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIBPChar_Pet_C>        K2Node_DynamicCast_AsIBPChar_Pet;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter_Player*                   CallFunc_GetBeastmasterOwner_Beastmaster;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIBPChar_Beastmaster_C> K2Node_DynamicCast_AsIBPChar_Beastmaster;          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy) == 0x000008, "Wrong alignment on Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy");
static_assert(sizeof(Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy) == 0x000048, "Wrong size on Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy");
static_assert(offsetof(Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy, EntryPoint) == 0x000000, "Member 'Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy, CallFunc_K2_GetActor_ReturnValue) == 0x000008, "Member 'Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy, K2Node_DynamicCast_AsIBPChar_Pet) == 0x000010, "Member 'Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy::K2Node_DynamicCast_AsIBPChar_Pet' has a wrong offset!");
static_assert(offsetof(Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy, CallFunc_GetBeastmasterOwner_Beastmaster) == 0x000028, "Member 'Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy::CallFunc_GetBeastmasterOwner_Beastmaster' has a wrong offset!");
static_assert(offsetof(Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy, K2Node_DynamicCast_AsIBPChar_Beastmaster) == 0x000030, "Member 'Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy::K2Node_DynamicCast_AsIBPChar_Beastmaster' has a wrong offset!");
static_assert(offsetof(Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy, K2Node_DynamicCast_bSuccess1) == 0x000040, "Member 'Action_Pet_KilledEnemy_C_ExecuteUbergraph_Action_Pet_KilledEnemy::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

}

