#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Melee_Resonator_Success

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Action_Melee_Base_classes.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Action_Melee_Resonator_Success.Action_Melee_Resonator_Success_C
// 0x0018 (0x0250 - 0x0238)
class UAction_Melee_Resonator_Success_C final : public UAction_Melee_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Action_Melee_Resonator_Success_C;   // 0x0238(0x0008)(Transient, DuplicateTransient)
	class ABP_Eridian_Resonator_C*                ResonatorMesh;                                     // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Eridian_Resonator_C*                ResonatorMesh3;                                    // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Action_Melee_Resonator_Success(int32 EntryPoint);
	void Resonator_Stop();
	void Resonator_Start();
	void OnEnd(EGbxActionEndState ActionEndState, class AActor* Actor);
	void OnBeginBringUpWeapon(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Action_Melee_Resonator_Success_C">();
	}
	static class UAction_Melee_Resonator_Success_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAction_Melee_Resonator_Success_C>();
	}
};
static_assert(alignof(UAction_Melee_Resonator_Success_C) == 0x000008, "Wrong alignment on UAction_Melee_Resonator_Success_C");
static_assert(sizeof(UAction_Melee_Resonator_Success_C) == 0x000250, "Wrong size on UAction_Melee_Resonator_Success_C");
static_assert(offsetof(UAction_Melee_Resonator_Success_C, UberGraphFrame_Action_Melee_Resonator_Success_C) == 0x000238, "Member 'UAction_Melee_Resonator_Success_C::UberGraphFrame_Action_Melee_Resonator_Success_C' has a wrong offset!");
static_assert(offsetof(UAction_Melee_Resonator_Success_C, ResonatorMesh) == 0x000240, "Member 'UAction_Melee_Resonator_Success_C::ResonatorMesh' has a wrong offset!");
static_assert(offsetof(UAction_Melee_Resonator_Success_C, ResonatorMesh3) == 0x000248, "Member 'UAction_Melee_Resonator_Success_C::ResonatorMesh3' has a wrong offset!");

}

