#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Phasetrance_Slam_Fracture

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Action_Phasetrance_Slam_Fracture.Action_Phasetrance_Slam_Fracture_C.ExecuteUbergraph_Action_Phasetrance_Slam_Fracture
// 0x0260 (0x0260 - 0x0000)
struct Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPEventHub_Siren_C*                    K2Node_DynamicCast_AsBPEvent_Hub_Siren;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0020(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture) == 0x000010, "Wrong alignment on Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture");
static_assert(sizeof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture) == 0x000260, "Wrong size on Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, EntryPoint) == 0x000000, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, K2Node_DynamicCast_AsBPEvent_Hub_Siren) == 0x000008, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::K2Node_DynamicCast_AsBPEvent_Hub_Siren' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, Temp_bool_IsClosed_Variable) == 0x000011, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, K2Node_Event_ActionEndState) == 0x000012, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, K2Node_Event_Actor1) == 0x000018, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000020, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, CallFunc_SpawnActorAsync_ReturnValue) == 0x000250, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture, K2Node_Event_Actor) == 0x000258, "Member 'Action_Phasetrance_Slam_Fracture_C_ExecuteUbergraph_Action_Phasetrance_Slam_Fracture::K2Node_Event_Actor' has a wrong offset!");

// Function Action_Phasetrance_Slam_Fracture.Action_Phasetrance_Slam_Fracture_C.OnBeginBringUpWeapon
// 0x0008 (0x0008 - 0x0000)
struct Action_Phasetrance_Slam_Fracture_C_OnBeginBringUpWeapon final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_Slam_Fracture_C_OnBeginBringUpWeapon) == 0x000008, "Wrong alignment on Action_Phasetrance_Slam_Fracture_C_OnBeginBringUpWeapon");
static_assert(sizeof(Action_Phasetrance_Slam_Fracture_C_OnBeginBringUpWeapon) == 0x000008, "Wrong size on Action_Phasetrance_Slam_Fracture_C_OnBeginBringUpWeapon");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_OnBeginBringUpWeapon, Actor) == 0x000000, "Member 'Action_Phasetrance_Slam_Fracture_C_OnBeginBringUpWeapon::Actor' has a wrong offset!");

// Function Action_Phasetrance_Slam_Fracture.Action_Phasetrance_Slam_Fracture_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_Phasetrance_Slam_Fracture_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Phasetrance_Slam_Fracture_C_OnServerEnd) == 0x000008, "Wrong alignment on Action_Phasetrance_Slam_Fracture_C_OnServerEnd");
static_assert(sizeof(Action_Phasetrance_Slam_Fracture_C_OnServerEnd) == 0x000010, "Wrong size on Action_Phasetrance_Slam_Fracture_C_OnServerEnd");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'Action_Phasetrance_Slam_Fracture_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Phasetrance_Slam_Fracture_C_OnServerEnd, Actor) == 0x000008, "Member 'Action_Phasetrance_Slam_Fracture_C_OnServerEnd::Actor' has a wrong offset!");

}

