#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_HeavyShared_FireWeapon_Spray

#include "Basic.hpp"

#include "Enum_Heavy_WeaponSocket_structs.hpp"
#include "Engine_structs.hpp"
#include "GBXAction_EnemyVariableParent_classes.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Action_HeavyShared_FireWeapon_Spray.Action_HeavyShared_FireWeapon_Spray_C
// 0x0028 (0x0270 - 0x0248)
class UAction_HeavyShared_FireWeapon_Spray_C final : public UGBXAction_EnemyVariableParent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Action_HeavyShared_FireWeapon_Spray_C; // 0x0248(0x0008)(Transient, DuplicateTransient)
	Enum_Heavy_WeaponSocket                       FireSocket;                                        // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TempSelf;                                          // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IDialogEnumValueInterface> DialogElementalType;                               // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Action_HeavyShared_FireWeapon_Spray(int32 EntryPoint);
	void NotifyStopSpray();
	void NotifyStartSpray();
	void OnEnd(EGbxActionEndState ActionEndState, class AActor* Actor);
	void OnBegin(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Action_HeavyShared_FireWeapon_Spray_C">();
	}
	static class UAction_HeavyShared_FireWeapon_Spray_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAction_HeavyShared_FireWeapon_Spray_C>();
	}
};
static_assert(alignof(UAction_HeavyShared_FireWeapon_Spray_C) == 0x000008, "Wrong alignment on UAction_HeavyShared_FireWeapon_Spray_C");
static_assert(sizeof(UAction_HeavyShared_FireWeapon_Spray_C) == 0x000270, "Wrong size on UAction_HeavyShared_FireWeapon_Spray_C");
static_assert(offsetof(UAction_HeavyShared_FireWeapon_Spray_C, UberGraphFrame_Action_HeavyShared_FireWeapon_Spray_C) == 0x000248, "Member 'UAction_HeavyShared_FireWeapon_Spray_C::UberGraphFrame_Action_HeavyShared_FireWeapon_Spray_C' has a wrong offset!");
static_assert(offsetof(UAction_HeavyShared_FireWeapon_Spray_C, FireSocket) == 0x000250, "Member 'UAction_HeavyShared_FireWeapon_Spray_C::FireSocket' has a wrong offset!");
static_assert(offsetof(UAction_HeavyShared_FireWeapon_Spray_C, TempSelf) == 0x000258, "Member 'UAction_HeavyShared_FireWeapon_Spray_C::TempSelf' has a wrong offset!");
static_assert(offsetof(UAction_HeavyShared_FireWeapon_Spray_C, DialogElementalType) == 0x000260, "Member 'UAction_HeavyShared_FireWeapon_Spray_C::DialogElementalType' has a wrong offset!");

}

