#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_HeavyShared_FireWeapon_Sweep_Parent

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Enum_Heavy_WeaponSocket_structs.hpp"
#include "Engine_structs.hpp"
#include "GBXAction_EnemyVariableParent_classes.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Action_HeavyShared_FireWeapon_Sweep_Parent.Action_HeavyShared_FireWeapon_Sweep_Parent_C
// 0x0010 (0x0258 - 0x0248)
class UAction_HeavyShared_FireWeapon_Sweep_Parent_C : public UGBXAction_EnemyVariableParent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Action_HeavyShared_FireWeapon_Sweep_Parent_C; // 0x0248(0x0008)(Transient, DuplicateTransient)
	Enum_Heavy_WeaponSocket                       FireSocket;                                        // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeftHand;                                        // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Action_HeavyShared_FireWeapon_Sweep_Parent(int32 EntryPoint);
	void Event_StopFire();
	void Event_StartFire();
	void OnEnd(EGbxActionEndState ActionEndState, class AActor* Actor);
	void OnBegin(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Action_HeavyShared_FireWeapon_Sweep_Parent_C">();
	}
	static class UAction_HeavyShared_FireWeapon_Sweep_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAction_HeavyShared_FireWeapon_Sweep_Parent_C>();
	}
};
static_assert(alignof(UAction_HeavyShared_FireWeapon_Sweep_Parent_C) == 0x000008, "Wrong alignment on UAction_HeavyShared_FireWeapon_Sweep_Parent_C");
static_assert(sizeof(UAction_HeavyShared_FireWeapon_Sweep_Parent_C) == 0x000258, "Wrong size on UAction_HeavyShared_FireWeapon_Sweep_Parent_C");
static_assert(offsetof(UAction_HeavyShared_FireWeapon_Sweep_Parent_C, UberGraphFrame_Action_HeavyShared_FireWeapon_Sweep_Parent_C) == 0x000248, "Member 'UAction_HeavyShared_FireWeapon_Sweep_Parent_C::UberGraphFrame_Action_HeavyShared_FireWeapon_Sweep_Parent_C' has a wrong offset!");
static_assert(offsetof(UAction_HeavyShared_FireWeapon_Sweep_Parent_C, FireSocket) == 0x000250, "Member 'UAction_HeavyShared_FireWeapon_Sweep_Parent_C::FireSocket' has a wrong offset!");
static_assert(offsetof(UAction_HeavyShared_FireWeapon_Sweep_Parent_C, IsLeftHand) == 0x000251, "Member 'UAction_HeavyShared_FireWeapon_Sweep_Parent_C::IsLeftHand' has a wrong offset!");

}

