#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionSkill_PhaseTrance_FunctionLibrary

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function ActionSkill_PhaseTrance_FunctionLibrary.ActionSkill_PhaseTrance_FunctionLibrary_C.GetSirenStatusEffectInfo
// 0x0098 (0x0098 - 0x0000)
struct ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCauseDamageStatusEffectOverrides      StatusEffectOverride;                              // 0x0008(0x001C)(Parm, OutParm, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  StatusEffectDamage;                                // 0x0028(0x0018)(Edit, BlueprintVisible, NoDestructor)
	struct FDataTableValueHandle                  StatusEffectDuration;                              // 0x0040(0x0018)(Edit, BlueprintVisible, NoDestructor)
	struct FDataTableValueHandle                  StatusEffectChance;                                // 0x0058(0x0018)(Edit, BlueprintVisible, NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue1; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue2; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCauseDamageStatusEffectOverrides      K2Node_MakeStruct_CauseDamageStatusEffectOverrides; // 0x007C(0x001C)(NoDestructor)
};
static_assert(alignof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo) == 0x000008, "Wrong alignment on ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo");
static_assert(sizeof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo) == 0x000098, "Wrong size on ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo, __WorldContext) == 0x000000, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo::__WorldContext' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo, StatusEffectOverride) == 0x000008, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo::StatusEffectOverride' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo, StatusEffectDamage) == 0x000028, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo::StatusEffectDamage' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo, StatusEffectDuration) == 0x000040, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo::StatusEffectDuration' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo, StatusEffectChance) == 0x000058, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo::StatusEffectChance' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000070, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo, CallFunc_GetDataTableValueFromHandle_ReturnValue1) == 0x000074, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo::CallFunc_GetDataTableValueFromHandle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo, CallFunc_GetDataTableValueFromHandle_ReturnValue2) == 0x000078, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo::CallFunc_GetDataTableValueFromHandle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo, K2Node_MakeStruct_CauseDamageStatusEffectOverrides) == 0x00007C, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_GetSirenStatusEffectInfo::K2Node_MakeStruct_CauseDamageStatusEffectOverrides' has a wrong offset!");

// Function ActionSkill_PhaseTrance_FunctionLibrary.ActionSkill_PhaseTrance_FunctionLibrary_C.CalculatePhaseTranceDamage
// 0x0158 (0x0158 - 0x0000)
struct ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage final
{
public:
	class AOakCharacter_Player*                   ContextSource;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPhaseTranceActivationComboData        ComboData;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Res;                                               // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhaseTranceElementalType                     CallFunc_BreakPhaseTranceElementData_ElementType;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_BreakPhaseTranceElementData_DamageType;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttributeInitializationData           CallFunc_BreakPhaseTranceElementData_DamageCoefficientData; // 0x0040(0x0038)(NoDestructor)
	EPhaseTranceEffectType                        CallFunc_BreakPhaseTranceEffectData_EffectType;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttributeInitializationData           CallFunc_BreakPhaseTranceEffectData_DamageCoefficientData; // 0x0080(0x0038)(NoDestructor)
	float                                         CallFunc_EvaluateAttributeInitializationData_ReturnValue; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateAttributeInitializationData_ReturnValue1; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhaseTranceAttackFamilyType                  CallFunc_BreakPhaseTranceAttackData_AttackFamilyType; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_BreakPhaseTranceAttackData_AttackClass;   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttributeInitializationData           CallFunc_BreakPhaseTranceAttackData_DamageCoefficientData; // 0x00D0(0x0038)(NoDestructor)
	struct FAttributeInitializationData           CallFunc_BreakPhaseTranceAttackData_CooldownCoefficientData; // 0x0108(0x0038)(NoDestructor)
	float                                         CallFunc_EvaluateAttributeInitializationData_ReturnValue2; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage) == 0x000008, "Wrong alignment on ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage");
static_assert(sizeof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage) == 0x000158, "Wrong size on ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, ContextSource) == 0x000000, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::ContextSource' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, ComboData) == 0x000008, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::ComboData' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, __WorldContext) == 0x000020, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::__WorldContext' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, Res) == 0x000028, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::Res' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_GetValueOfAttribute_ReturnValue) == 0x00002C, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_BreakPhaseTranceElementData_ElementType) == 0x000030, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_BreakPhaseTranceElementData_ElementType' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_BreakPhaseTranceElementData_DamageType) == 0x000038, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_BreakPhaseTranceElementData_DamageType' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_BreakPhaseTranceElementData_DamageCoefficientData) == 0x000040, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_BreakPhaseTranceElementData_DamageCoefficientData' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_BreakPhaseTranceEffectData_EffectType) == 0x000078, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_BreakPhaseTranceEffectData_EffectType' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_BreakPhaseTranceEffectData_DamageCoefficientData) == 0x000080, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_BreakPhaseTranceEffectData_DamageCoefficientData' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_EvaluateAttributeInitializationData_ReturnValue) == 0x0000B8, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_EvaluateAttributeInitializationData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_EvaluateAttributeInitializationData_ReturnValue1) == 0x0000BC, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_EvaluateAttributeInitializationData_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_BreakPhaseTranceAttackData_AttackFamilyType) == 0x0000C0, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_BreakPhaseTranceAttackData_AttackFamilyType' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_BreakPhaseTranceAttackData_AttackClass) == 0x0000C8, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_BreakPhaseTranceAttackData_AttackClass' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_BreakPhaseTranceAttackData_DamageCoefficientData) == 0x0000D0, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_BreakPhaseTranceAttackData_DamageCoefficientData' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_BreakPhaseTranceAttackData_CooldownCoefficientData) == 0x000108, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_BreakPhaseTranceAttackData_CooldownCoefficientData' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_EvaluateAttributeInitializationData_ReturnValue2) == 0x000140, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_EvaluateAttributeInitializationData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_Add_FloatFloat_ReturnValue) == 0x000144, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000148, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_FClamp_ReturnValue) == 0x00014C, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000150, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CalculatePhaseTranceDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function ActionSkill_PhaseTrance_FunctionLibrary.ActionSkill_PhaseTrance_FunctionLibrary_C.IsImmuneToPhaseLock
// 0x0058 (0x0058 - 0x0000)
struct ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock final
{
public:
	class AActor*                                 GraspTarget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRes;                                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0018(0x0020)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock) == 0x000008, "Wrong alignment on ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock");
static_assert(sizeof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock) == 0x000058, "Wrong size on ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock, GraspTarget) == 0x000000, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock::GraspTarget' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock, __WorldContext) == 0x000008, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock::__WorldContext' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock, bRes) == 0x000010, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock::bRes' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock, TagContainer) == 0x000018, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock::TagContainer' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock, Temp_bool_Variable) == 0x000038, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000040, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000051, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_IsImmuneToPhaseLock::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function ActionSkill_PhaseTrance_FunctionLibrary.ActionSkill_PhaseTrance_FunctionLibrary_C.TriggerPhaseTrancePassives
// 0x0010 (0x0010 - 0x0000)
struct ActionSkill_PhaseTrance_FunctionLibrary_C_TriggerPhaseTrancePassives final
{
public:
	class AOakCharacter_Player*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_PhaseTrance_FunctionLibrary_C_TriggerPhaseTrancePassives) == 0x000008, "Wrong alignment on ActionSkill_PhaseTrance_FunctionLibrary_C_TriggerPhaseTrancePassives");
static_assert(sizeof(ActionSkill_PhaseTrance_FunctionLibrary_C_TriggerPhaseTrancePassives) == 0x000010, "Wrong size on ActionSkill_PhaseTrance_FunctionLibrary_C_TriggerPhaseTrancePassives");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_TriggerPhaseTrancePassives, Player) == 0x000000, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_TriggerPhaseTrancePassives::Player' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_TriggerPhaseTrancePassives, __WorldContext) == 0x000008, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_TriggerPhaseTrancePassives::__WorldContext' has a wrong offset!");

// Function ActionSkill_PhaseTrance_FunctionLibrary.ActionSkill_PhaseTrance_FunctionLibrary_C.CanPerformPassiveGhostArmAction
// 0x0028 (0x0028 - 0x0000)
struct ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction final
{
public:
	class AOakCharacter_Player*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRes;                                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USirenCharacterComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayPassiveGhostArmAction_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction) == 0x000008, "Wrong alignment on ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction");
static_assert(sizeof(ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction) == 0x000028, "Wrong size on ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction, Player) == 0x000000, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction::Player' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction, __WorldContext) == 0x000008, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction::__WorldContext' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction, bRes) == 0x000010, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction::bRes' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction, CallFunc_CanPlayPassiveGhostArmAction_ReturnValue) == 0x000020, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction::CallFunc_CanPlayPassiveGhostArmAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'ActionSkill_PhaseTrance_FunctionLibrary_C_CanPerformPassiveGhostArmAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

