#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionSkill_Operative_ShoulderCannon

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "EShoulderCannonMods_structs.hpp"
#include "EOperativeShoulderCannon_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function ActionSkill_Operative_ShoulderCannon.ActionSkill_Operative_ShoulderCannon_C.ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon
// 0x02B0 (0x02B0 - 0x0000)
struct ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxActionRegister>             K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FGbxActionRegister>             CallFunc_SetObjectGbxActionRegister_ReturnValue;   // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInterface_IO_Operative_ShoulderCannon_C> K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_OldCharge;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0058(0x0218)()
	TScriptInterface<class IInterface_IO_Operative_ShoulderCannon_C> K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon1; // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0284(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterface_IO_Operative_ShoulderCannon_C> K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon2; // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionSkillValid_ReturnValue;           // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon) == 0x000008, "Wrong alignment on ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon");
static_assert(sizeof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon) == 0x0002B0, "Wrong size on ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, EntryPoint) == 0x000000, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, K2Node_MakeArray_Array) == 0x000010, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_SetObjectGbxActionRegister_ReturnValue) == 0x000020, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_SetObjectGbxActionRegister_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_K2Play_ReturnValue) == 0x000030, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_K2Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon) == 0x000038, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, K2Node_Event_OldCharge) == 0x00004C, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::K2Node_Event_OldCharge' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, K2Node_SwitchInteger_CmpSuccess) == 0x000050, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_NewDialogContext_ReturnValue) == 0x000058, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon1) == 0x000270, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon1' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, K2Node_DynamicCast_bSuccess1) == 0x000280, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_FinishTriggerDialog_Conversation) == 0x000284, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_FinishTriggerDialog_SequenceID) == 0x000290, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000294, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon2) == 0x000298, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon2' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, K2Node_DynamicCast_bSuccess2) == 0x0002A8, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_Conv_IntToBool_ReturnValue) == 0x0002A9, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon, CallFunc_IsActionSkillValid_ReturnValue) == 0x0002AA, "Member 'ActionSkill_Operative_ShoulderCannon_C_ExecuteUbergraph_ActionSkill_Operative_ShoulderCannon::CallFunc_IsActionSkillValid_ReturnValue' has a wrong offset!");

// Function ActionSkill_Operative_ShoulderCannon.ActionSkill_Operative_ShoulderCannon_C.OnChargeCountChanged
// 0x0004 (0x0004 - 0x0000)
struct ActionSkill_Operative_ShoulderCannon_C_OnChargeCountChanged final
{
public:
	int32                                         OldCharge;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_Operative_ShoulderCannon_C_OnChargeCountChanged) == 0x000004, "Wrong alignment on ActionSkill_Operative_ShoulderCannon_C_OnChargeCountChanged");
static_assert(sizeof(ActionSkill_Operative_ShoulderCannon_C_OnChargeCountChanged) == 0x000004, "Wrong size on ActionSkill_Operative_ShoulderCannon_C_OnChargeCountChanged");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_OnChargeCountChanged, OldCharge) == 0x000000, "Member 'ActionSkill_Operative_ShoulderCannon_C_OnChargeCountChanged::OldCharge' has a wrong offset!");

// Function ActionSkill_Operative_ShoulderCannon.ActionSkill_Operative_ShoulderCannon_C.IsActionSkillValid
// 0x0008 (0x0008 - 0x0000)
struct ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              CallFunc_CalculateAbilityState_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid) == 0x000001, "Wrong alignment on ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid");
static_assert(sizeof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid) == 0x000008, "Wrong size on ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid, ReturnValue) == 0x000000, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid, CallFunc_CalculateAbilityState_ReturnValue) == 0x000001, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid::CallFunc_CalculateAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid, CallFunc_IsServer_ReturnValue) == 0x000005, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid, CallFunc_BooleanAND_ReturnValue1) == 0x000007, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsActionSkillValid::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function ActionSkill_Operative_ShoulderCannon.ActionSkill_Operative_ShoulderCannon_C.TrySpawnCannon
// 0x0050 (0x0050 - 0x0000)
struct ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon final
{
public:
	class AInteractiveObject*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIO_Operative_ShoulderCannon_C*         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon) == 0x000010, "Wrong alignment on ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon");
static_assert(sizeof(ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon) == 0x000050, "Wrong size on ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon, ReturnValue) == 0x000000, "Member 'ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon::ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon, CallFunc_GetActorSocket_ReturnValue) == 0x000010, "Member 'ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'ActionSkill_Operative_ShoulderCannon_C_TrySpawnCannon::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function ActionSkill_Operative_ShoulderCannon.ActionSkill_Operative_ShoulderCannon_C.GetCannonRef
// 0x0008 (0x0008 - 0x0000)
struct ActionSkill_Operative_ShoulderCannon_C_GetCannonRef final
{
public:
	class AActor*                                 Ref;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionSkill_Operative_ShoulderCannon_C_GetCannonRef) == 0x000008, "Wrong alignment on ActionSkill_Operative_ShoulderCannon_C_GetCannonRef");
static_assert(sizeof(ActionSkill_Operative_ShoulderCannon_C_GetCannonRef) == 0x000008, "Wrong size on ActionSkill_Operative_ShoulderCannon_C_GetCannonRef");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_GetCannonRef, Ref) == 0x000000, "Member 'ActionSkill_Operative_ShoulderCannon_C_GetCannonRef::Ref' has a wrong offset!");

// Function ActionSkill_Operative_ShoulderCannon.ActionSkill_Operative_ShoulderCannon_C.IsShouldCannonModSlotted
// 0x0040 (0x0040 - 0x0000)
struct ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted final
{
public:
	EShoulderCannonMods                           Mod;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Res;                                               // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EShoulderCannonMods                           Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbilityAugmentData*           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbilityAugmentData*           Temp_object_Variable1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbilityAugmentData*           Temp_object_Variable2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbilityAugmentData*           Temp_object_Variable3;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbilityAugmentData*           Temp_object_Variable4;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbilityAugmentData*           K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAugmentSlotted_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted) == 0x000008, "Wrong alignment on ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted");
static_assert(sizeof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted) == 0x000040, "Wrong size on ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Mod) == 0x000000, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Mod' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Res) == 0x000001, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Res' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Temp_byte_Variable) == 0x000002, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Temp_object_Variable) == 0x000008, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Temp_object_Variable1) == 0x000010, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Temp_object_Variable2) == 0x000018, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Temp_object_Variable3) == 0x000020, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Temp_object_Variable4) == 0x000028, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, K2Node_Select_Default) == 0x000030, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, CallFunc_IsAugmentSlotted_ReturnValue) == 0x000038, "Member 'ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::CallFunc_IsAugmentSlotted_ReturnValue' has a wrong offset!");

// Function ActionSkill_Operative_ShoulderCannon.ActionSkill_Operative_ShoulderCannon_C.StartShoulderCannonMod3Timer
// 0x0020 (0x0020 - 0x0000)
struct ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer final
{
public:
	bool                                          Res;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec;             // 0x0008(0x0018)(NoDestructor)
};
static_assert(alignof(ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer) == 0x000008, "Wrong alignment on ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer");
static_assert(sizeof(ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer) == 0x000020, "Wrong size on ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer, Res) == 0x000000, "Member 'ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer::Res' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000004, "Member 'ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer, K2Node_MakeStruct_OakAbilityTimerSpec) == 0x000008, "Member 'ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer::K2Node_MakeStruct_OakAbilityTimerSpec' has a wrong offset!");

// Function ActionSkill_Operative_ShoulderCannon.ActionSkill_Operative_ShoulderCannon_C.ShouldAbortActivation
// 0x000D (0x000D - 0x0000)
struct ActionSkill_Operative_ShoulderCannon_C_ShouldAbortActivation final
{
public:
	uint8                                         OutAbortCode;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	EOperativeShoulderCannon                      Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionSkill_Operative_ShoulderCannon_C_ShouldAbortActivation) == 0x000001, "Wrong alignment on ActionSkill_Operative_ShoulderCannon_C_ShouldAbortActivation");
static_assert(sizeof(ActionSkill_Operative_ShoulderCannon_C_ShouldAbortActivation) == 0x00000D, "Wrong size on ActionSkill_Operative_ShoulderCannon_C_ShouldAbortActivation");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ShouldAbortActivation, OutAbortCode) == 0x000000, "Member 'ActionSkill_Operative_ShoulderCannon_C_ShouldAbortActivation::OutAbortCode' has a wrong offset!");
static_assert(offsetof(ActionSkill_Operative_ShoulderCannon_C_ShouldAbortActivation, ReturnValue) == 0x000001, "Member 'ActionSkill_Operative_ShoulderCannon_C_ShouldAbortActivation::ReturnValue' has a wrong offset!");
