#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Operative_ToggleBarrier

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"


namespace SDK::Params
{

// Function Action_Operative_ToggleBarrier.Action_Operative_ToggleBarrier_C.ExecuteUbergraph_Action_Operative_ToggleBarrier
// 0x0080 (0x0080 - 0x0000)
struct Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ToggleBarrierState_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPEventHub_Operative_C*                K2Node_DynamicCast_AsBPEvent_Hub_Operative;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0038(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x0050(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue2;              // 0x0068(0x0018)()
};
static_assert(alignof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier) == 0x000008, "Wrong alignment on Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier");
static_assert(sizeof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier) == 0x000080, "Wrong size on Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, EntryPoint) == 0x000000, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, CallFunc_K2_GetActor_ReturnValue) == 0x000008, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, CallFunc_ToggleBarrierState_ReturnValue) == 0x000018, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::CallFunc_ToggleBarrierState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, K2Node_DynamicCast_AsBPEvent_Hub_Operative) == 0x000020, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::K2Node_DynamicCast_AsBPEvent_Hub_Operative' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, CallFunc_IsValid_ReturnValue) == 0x00002A, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, CallFunc_GetDefaultWwiseComponent_ReturnValue) == 0x000030, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::CallFunc_GetDefaultWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, CallFunc_PostWwiseEvent_ReturnValue) == 0x000038, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, CallFunc_PostWwiseEvent_ReturnValue1) == 0x000050, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier, CallFunc_PostWwiseEvent_ReturnValue2) == 0x000068, "Member 'Action_Operative_ToggleBarrier_C_ExecuteUbergraph_Action_Operative_ToggleBarrier::CallFunc_PostWwiseEvent_ReturnValue2' has a wrong offset!");

}

