#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Heavy_Shared_BackpackDamageStagger_F2

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Action_Heavy_Shared_BackpackDamageStagger_F2.Action_Heavy_Shared_BackpackDamageStagger_F2_C.ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2
// 0x0018 (0x0018 - 0x0000)
struct Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2) == 0x000008, "Wrong alignment on Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2");
static_assert(sizeof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2) == 0x000018, "Wrong size on Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2");
static_assert(offsetof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2, EntryPoint) == 0x000000, "Member 'Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2, K2Node_Event_ActionEndState) == 0x000004, "Member 'Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2, K2Node_Event_Actor) == 0x000008, "Member 'Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2, K2Node_Event_Actor1) == 0x000010, "Member 'Action_Heavy_Shared_BackpackDamageStagger_F2_C_ExecuteUbergraph_Action_Heavy_Shared_BackpackDamageStagger_F2::K2Node_Event_Actor1' has a wrong offset!");

// Function Action_Heavy_Shared_BackpackDamageStagger_F2.Action_Heavy_Shared_BackpackDamageStagger_F2_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnServerEnd) == 0x000008, "Wrong alignment on Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnServerEnd");
static_assert(sizeof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnServerEnd) == 0x000010, "Wrong size on Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnServerEnd");
static_assert(offsetof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnServerEnd, Actor) == 0x000008, "Member 'Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnServerEnd::Actor' has a wrong offset!");

// Function Action_Heavy_Shared_BackpackDamageStagger_F2.Action_Heavy_Shared_BackpackDamageStagger_F2_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnBegin) == 0x000008, "Wrong alignment on Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnBegin");
static_assert(sizeof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnBegin) == 0x000008, "Wrong size on Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnBegin");
static_assert(offsetof(Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnBegin, Actor) == 0x000000, "Member 'Action_Heavy_Shared_BackpackDamageStagger_F2_C_OnBegin::Actor' has a wrong offset!");

}

