#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_PetLoader_MissileBarrage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxWeapon_structs.hpp"


namespace SDK::Params
{

// Function Action_PetLoader_MissileBarrage.Action_PetLoader_MissileBarrage_C.ExecuteUbergraph_Action_PetLoader_MissileBarrage
// 0x0250 (0x0250 - 0x0000)
struct Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBlackboardObject_Value;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveFloatValue_ReturnValue;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00D8(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x00E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x0110(0x0140)(ContainsInstancedReference)
};
static_assert(alignof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage) == 0x000010, "Wrong alignment on Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage");
static_assert(sizeof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage) == 0x000250, "Wrong size on Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, EntryPoint) == 0x000000, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, K2Node_Event_Actor) == 0x000008, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, K2Node_DynamicCast_AsOak_Character) == 0x000010, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_GetActorForwardVector_ReturnValue) == 0x00001C, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_GetActorSocket_ReturnValue) == 0x000030, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_BreakTransform_Location) == 0x000060, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000084, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_GetBlackboardObject_Value) == 0x000088, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_GetBlackboardObject_Value' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, K2Node_DynamicCast_AsActor) == 0x000090, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, K2Node_DynamicCast_bSuccess1) == 0x000098, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_GetActorRightVector_ReturnValue) == 0x00009C, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_GetDistanceTo_ReturnValue) == 0x0000B4, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, Temp_bool_IsClosed_Variable) == 0x0000B8, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000BC, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_IsServer_ReturnValue) == 0x0000C0, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_IsServer_ReturnValue1) == 0x0000C1, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000C4, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_GetCurveFloatValue_ReturnValue) == 0x0000C8, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_GetCurveFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000CC, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_MakeRotator_ReturnValue) == 0x0000D8, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_RandomFloatInRange_ReturnValue1) == 0x0000E4, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_RandomFloatInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x0000E8, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F4, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, CallFunc_Add_VectorVector_ReturnValue1) == 0x000100, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage, K2Node_MakeStruct_LightProjectileInitializationData) == 0x000110, "Member 'Action_PetLoader_MissileBarrage_C_ExecuteUbergraph_Action_PetLoader_MissileBarrage::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");

// Function Action_PetLoader_MissileBarrage.Action_PetLoader_MissileBarrage_C.OnServerBegin
// 0x0008 (0x0008 - 0x0000)
struct Action_PetLoader_MissileBarrage_C_OnServerBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_PetLoader_MissileBarrage_C_OnServerBegin) == 0x000008, "Wrong alignment on Action_PetLoader_MissileBarrage_C_OnServerBegin");
static_assert(sizeof(Action_PetLoader_MissileBarrage_C_OnServerBegin) == 0x000008, "Wrong size on Action_PetLoader_MissileBarrage_C_OnServerBegin");
static_assert(offsetof(Action_PetLoader_MissileBarrage_C_OnServerBegin, Actor) == 0x000000, "Member 'Action_PetLoader_MissileBarrage_C_OnServerBegin::Actor' has a wrong offset!");

}

