#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ADodge_TrooperFlash_Bullet_Idle_Stationary

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ADodge_TrooperFlash_Bullet_Idle_Stationary.ADodge_TrooperFlash_Bullet_Idle_Stationary_C.ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary
// 0x0078 (0x0078 - 0x0000)
struct ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_Array_Get_Item;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_Array_Get_Item1;                          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Trooper_C>        K2Node_DynamicCast_AsBPI_Trooper;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Trooper_C>        K2Node_DynamicCast_AsBPI_Trooper1;                 // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxSkeletalMeshComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary) == 0x000008, "Wrong alignment on ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary");
static_assert(sizeof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary) == 0x000078, "Wrong size on ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, EntryPoint) == 0x000000, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::EntryPoint' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, CallFunc_Array_Get_Item) == 0x00000C, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, CallFunc_Array_Length_ReturnValue1) == 0x000010, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, Temp_int_Array_Index_Variable1) == 0x000020, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, CallFunc_Array_Get_Item1) == 0x000024, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, K2Node_Event_ActionEndState) == 0x000025, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, K2Node_Event_Actor1) == 0x000028, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, K2Node_Event_Actor) == 0x000030, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, Temp_int_Loop_Counter_Variable1) == 0x000038, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, K2Node_DynamicCast_AsBPI_Trooper) == 0x000040, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::K2Node_DynamicCast_AsBPI_Trooper' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, CallFunc_Less_IntInt_ReturnValue1) == 0x000051, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, CallFunc_Add_IntInt_ReturnValue1) == 0x000054, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, K2Node_DynamicCast_AsBPI_Trooper1) == 0x000058, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::K2Node_DynamicCast_AsBPI_Trooper1' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, K2Node_DynamicCast_bSuccess1) == 0x000068, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary, CallFunc_GetComponentByClass_ReturnValue) == 0x000070, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_ExecuteUbergraph_ADodge_TrooperFlash_Bullet_Idle_Stationary::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function ADodge_TrooperFlash_Bullet_Idle_Stationary.ADodge_TrooperFlash_Bullet_Idle_Stationary_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnBegin) == 0x000008, "Wrong alignment on ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnBegin");
static_assert(sizeof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnBegin) == 0x000008, "Wrong size on ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnBegin");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnBegin, Actor) == 0x000000, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnBegin::Actor' has a wrong offset!");

// Function ADodge_TrooperFlash_Bullet_Idle_Stationary.ADodge_TrooperFlash_Bullet_Idle_Stationary_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnEnd) == 0x000008, "Wrong alignment on ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnEnd");
static_assert(sizeof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnEnd) == 0x000010, "Wrong size on ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnEnd");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnEnd, ActionEndState) == 0x000000, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnEnd, Actor) == 0x000008, "Member 'ADodge_TrooperFlash_Bullet_Idle_Stationary_C_OnEnd::Actor' has a wrong offset!");

}

