#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AHitReact_Spiderant_Flinch_B

#include "Basic.hpp"

#include "OakGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AHitReact_Spiderant_Flinch_B.AHitReact_Spiderant_Flinch_B_C
// 0x0018 (0x0230 - 0x0218)
class UAHitReact_Spiderant_Flinch_B_C final : public UOakAction_Anim
{
public:
	class AActor*                                 MySelf;                                            // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 MyTarget;                                          // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 MyDamageCausingComponent;                          // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AHitReact_Spiderant_Flinch_B_C">();
	}
	static class UAHitReact_Spiderant_Flinch_B_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAHitReact_Spiderant_Flinch_B_C>();
	}
};
static_assert(alignof(UAHitReact_Spiderant_Flinch_B_C) == 0x000008, "Wrong alignment on UAHitReact_Spiderant_Flinch_B_C");
static_assert(sizeof(UAHitReact_Spiderant_Flinch_B_C) == 0x000230, "Wrong size on UAHitReact_Spiderant_Flinch_B_C");
static_assert(offsetof(UAHitReact_Spiderant_Flinch_B_C, MySelf) == 0x000218, "Member 'UAHitReact_Spiderant_Flinch_B_C::MySelf' has a wrong offset!");
static_assert(offsetof(UAHitReact_Spiderant_Flinch_B_C, MyTarget) == 0x000220, "Member 'UAHitReact_Spiderant_Flinch_B_C::MyTarget' has a wrong offset!");
static_assert(offsetof(UAHitReact_Spiderant_Flinch_B_C, MyDamageCausingComponent) == 0x000228, "Member 'UAHitReact_Spiderant_Flinch_B_C::MyDamageCausingComponent' has a wrong offset!");

}

