#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_PetJabbermon_Ingenuity

#include "Basic.hpp"

#include "GbxAI_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function AIAction_PetJabbermon_Ingenuity.AIAction_PetJabbermon_Ingenuity_C.ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity
// 0x0070 (0x0070 - 0x0000)
struct AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context;                      // 0x0028(0x0018)(ConstParm, NoDestructor)
	EAIActionResult                               K2Node_GbxBoundEvent_Result;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Pet_C>        K2Node_DynamicCast_AsIBPChar_Pet;                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity) == 0x000008, "Wrong alignment on AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity");
static_assert(sizeof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity) == 0x000070, "Wrong size on AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, EntryPoint) == 0x000000, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, Temp_struct_Variable) == 0x000008, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, K2Node_GbxBoundEvent_AIController) == 0x000018, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::K2Node_GbxBoundEvent_AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, K2Node_GbxBoundEvent_Character) == 0x000020, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::K2Node_GbxBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, K2Node_GbxBoundEvent_Context) == 0x000028, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::K2Node_GbxBoundEvent_Context' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, K2Node_GbxBoundEvent_Result) == 0x000040, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::K2Node_GbxBoundEvent_Result' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, CallFunc_K2Play_ReturnValue) == 0x000048, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::CallFunc_K2Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, K2Node_DynamicCast_AsIBPChar_Pet) == 0x000058, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::K2Node_DynamicCast_AsIBPChar_Pet' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'AIAction_PetJabbermon_Ingenuity_C_ExecuteUbergraph_AIAction_PetJabbermon_Ingenuity::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AIAction_PetJabbermon_Ingenuity.AIAction_PetJabbermon_Ingenuity_C.BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity
// 0x0030 (0x0030 - 0x0000)
struct AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAIActionResult                               Result;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity) == 0x000008, "Wrong alignment on AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity");
static_assert(sizeof(AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity) == 0x000030, "Wrong size on AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity, AIController) == 0x000000, "Member 'AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity, Character) == 0x000008, "Member 'AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity::Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity, Context) == 0x000010, "Member 'AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity::Context' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity, Result) == 0x000028, "Member 'AIAction_PetJabbermon_Ingenuity_C_BndEvt__IngenuityBarrelToss_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon_Ingenuity::Result' has a wrong offset!");

}

