#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_Patrol

#include "Basic.hpp"

#include "GbxAI_structs.hpp"


namespace SDK::Params
{

// Function AIAction_Patrol.AIAction_Patrol_C.BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol
// 0x0028 (0x0028 - 0x0000)
struct AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol) == 0x000008, "Wrong alignment on AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol");
static_assert(sizeof(AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol) == 0x000028, "Wrong size on AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol");
static_assert(offsetof(AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol, AIController) == 0x000000, "Member 'AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol, Character) == 0x000008, "Member 'AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol::Character' has a wrong offset!");
static_assert(offsetof(AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol, Context) == 0x000010, "Member 'AIAction_Patrol_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_Patrol::Context' has a wrong offset!");

// Function AIAction_Patrol.AIAction_Patrol_C.ExecuteUbergraph_AIAction_Patrol
// 0x0038 (0x0038 - 0x0000)
struct AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context;                      // 0x0018(0x0018)(ConstParm, NoDestructor)
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol) == 0x000008, "Wrong alignment on AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol");
static_assert(sizeof(AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol) == 0x000038, "Wrong size on AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol");
static_assert(offsetof(AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol, EntryPoint) == 0x000000, "Member 'AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol, K2Node_GbxBoundEvent_AIController) == 0x000008, "Member 'AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol::K2Node_GbxBoundEvent_AIController' has a wrong offset!");
static_assert(offsetof(AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol, K2Node_GbxBoundEvent_Character) == 0x000010, "Member 'AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol::K2Node_GbxBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol, K2Node_GbxBoundEvent_Context) == 0x000018, "Member 'AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol::K2Node_GbxBoundEvent_Context' has a wrong offset!");
static_assert(offsetof(AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000030, "Member 'AIAction_Patrol_C_ExecuteUbergraph_AIAction_Patrol::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");

}

