#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_PetJabbermon

#include "Basic.hpp"

#include "GbxAI_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function AIAction_PetJabbermon.AIAction_PetJabbermon_C.ExecuteUbergraph_AIAction_PetJabbermon
// 0x0090 (0x0090 - 0x0000)
struct AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController1;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character1;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context1;                     // 0x0018(0x0018)(ConstParm, NoDestructor)
	EAIActionResult                               K2Node_GbxBoundEvent_Result;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBlackboardBool_Value;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context;                      // 0x0048(0x0018)(ConstParm, NoDestructor)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0060(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TScriptInterface<class IIBPChar_Pet_C>        K2Node_DynamicCast_AsIBPChar_Pet;                  // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon) == 0x000008, "Wrong alignment on AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon");
static_assert(sizeof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon) == 0x000090, "Wrong size on AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, EntryPoint) == 0x000000, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, K2Node_GbxBoundEvent_AIController1) == 0x000008, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::K2Node_GbxBoundEvent_AIController1' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, K2Node_GbxBoundEvent_Character1) == 0x000010, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::K2Node_GbxBoundEvent_Character1' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, K2Node_GbxBoundEvent_Context1) == 0x000018, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::K2Node_GbxBoundEvent_Context1' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, K2Node_GbxBoundEvent_Result) == 0x000030, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::K2Node_GbxBoundEvent_Result' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, CallFunc_GetBlackboardBool_Value) == 0x000031, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::CallFunc_GetBlackboardBool_Value' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, K2Node_GbxBoundEvent_AIController) == 0x000038, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::K2Node_GbxBoundEvent_AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, K2Node_GbxBoundEvent_Character) == 0x000040, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::K2Node_GbxBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, K2Node_GbxBoundEvent_Context) == 0x000048, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::K2Node_GbxBoundEvent_Context' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, Temp_struct_Variable) == 0x000060, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, K2Node_DynamicCast_AsIBPChar_Pet) == 0x000070, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::K2Node_DynamicCast_AsIBPChar_Pet' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon, CallFunc_K2Play_ReturnValue) == 0x000088, "Member 'AIAction_PetJabbermon_C_ExecuteUbergraph_AIAction_PetJabbermon::CallFunc_K2Play_ReturnValue' has a wrong offset!");

// Function AIAction_PetJabbermon.AIAction_PetJabbermon_C.BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon
// 0x0028 (0x0028 - 0x0000)
struct AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon) == 0x000008, "Wrong alignment on AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon");
static_assert(sizeof(AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon) == 0x000028, "Wrong size on AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon");
static_assert(offsetof(AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon, AIController) == 0x000000, "Member 'AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon, Character) == 0x000008, "Member 'AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon::Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon, Context) == 0x000010, "Member 'AIAction_PetJabbermon_C_BndEvt__SimpleWeapon_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon::Context' has a wrong offset!");

// Function AIAction_PetJabbermon.AIAction_PetJabbermon_C.BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon
// 0x0030 (0x0030 - 0x0000)
struct AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAIActionResult                               Result;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon) == 0x000008, "Wrong alignment on AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon");
static_assert(sizeof(AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon) == 0x000030, "Wrong size on AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon");
static_assert(offsetof(AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon, AIController) == 0x000000, "Member 'AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon, Character) == 0x000008, "Member 'AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon::Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon, Context) == 0x000010, "Member 'AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon::Context' has a wrong offset!");
static_assert(offsetof(AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon, Result) == 0x000028, "Member 'AIAction_PetJabbermon_C_BndEvt__SimpleRangedAttack_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon::Result' has a wrong offset!");

}

