#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_PetShared_Commands

#include "Basic.hpp"

#include "GbxAI_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function AIAction_PetShared_Commands.AIAction_PetShared_Commands_C.ExecuteUbergraph_AIAction_PetShared_Commands
// 0x0170 (0x0170 - 0x0000)
struct AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxBlackboardKeySelector              K2Node_MakeStruct_GbxBlackboardKeySelector;        // 0x0008(0x0010)(NoDestructor)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController4;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character4;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context4;                     // 0x0038(0x0018)(ConstParm, NoDestructor)
	EAIActionResult                               K2Node_GbxBoundEvent_Result3;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController3;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character3;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context3;                     // 0x0070(0x0018)(ConstParm, NoDestructor)
	EAIActionResult                               K2Node_GbxBoundEvent_Result2;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue1;               // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController2;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character2;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context2;                     // 0x00B0(0x0018)(ConstParm, NoDestructor)
	EAIActionResult                               K2Node_GbxBoundEvent_Result1;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController1;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character1;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context1;                     // 0x00E0(0x0018)(ConstParm, NoDestructor)
	EAIActionResult                               K2Node_GbxBoundEvent_Result;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Pet_C>        K2Node_DynamicCast_AsIBPChar_Pet;                  // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOakActionAbilityPetType                      CallFunc_GetPetType_PetType;                       // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Pet_C>        K2Node_DynamicCast_AsIBPChar_Pet1;                 // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context;                      // 0x0148(0x0018)(ConstParm, NoDestructor)
	struct FGbxBlackboardKeySelector              K2Node_MakeStruct_GbxBlackboardKeySelector1;       // 0x0160(0x0010)(NoDestructor)
};
static_assert(alignof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands) == 0x000008, "Wrong alignment on AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands");
static_assert(sizeof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands) == 0x000170, "Wrong size on AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, EntryPoint) == 0x000000, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_MakeStruct_GbxBlackboardKeySelector) == 0x000008, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_MakeStruct_GbxBlackboardKeySelector' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, Temp_struct_Variable) == 0x000018, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_AIController4) == 0x000028, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_AIController4' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Character4) == 0x000030, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Character4' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Context4) == 0x000038, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Context4' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Result3) == 0x000050, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Result3' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, CallFunc_GetBlackboard_ReturnValue) == 0x000058, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_AIController3) == 0x000060, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_AIController3' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Character3) == 0x000068, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Character3' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Context3) == 0x000070, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Context3' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Result2) == 0x000088, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Result2' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_CustomEvent_Actor) == 0x000090, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, CallFunc_GetBlackboard_ReturnValue1) == 0x000098, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::CallFunc_GetBlackboard_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_AIController2) == 0x0000A0, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_AIController2' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Character2) == 0x0000A8, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Character2' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Context2) == 0x0000B0, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Context2' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Result1) == 0x0000C8, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Result1' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_AIController1) == 0x0000D0, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_AIController1' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Character1) == 0x0000D8, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Character1' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Context1) == 0x0000E0, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Context1' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Result) == 0x0000F8, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Result' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F9, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_DynamicCast_AsIBPChar_Pet) == 0x000100, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_DynamicCast_AsIBPChar_Pet' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, CallFunc_GetPetType_PetType) == 0x000111, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::CallFunc_GetPetType_PetType' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_DynamicCast_AsIBPChar_Pet1) == 0x000118, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_DynamicCast_AsIBPChar_Pet1' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_DynamicCast_bSuccess1) == 0x000128, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_SwitchEnum_CmpSuccess) == 0x000129, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, CallFunc_K2Play_ReturnValue) == 0x000130, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::CallFunc_K2Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_AIController) == 0x000138, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Character) == 0x000140, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_GbxBoundEvent_Context) == 0x000148, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_GbxBoundEvent_Context' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands, K2Node_MakeStruct_GbxBlackboardKeySelector1) == 0x000160, "Member 'AIAction_PetShared_Commands_C_ExecuteUbergraph_AIAction_PetShared_Commands::K2Node_MakeStruct_GbxBlackboardKeySelector1' has a wrong offset!");

// Function AIAction_PetShared_Commands.AIAction_PetShared_Commands_C.BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon
// 0x0028 (0x0028 - 0x0000)
struct AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon) == 0x000008, "Wrong alignment on AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon");
static_assert(sizeof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon) == 0x000028, "Wrong size on AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon, AIController) == 0x000000, "Member 'AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon, Character) == 0x000008, "Member 'AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon::Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon, Context) == 0x000010, "Member 'AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_PetJabbermon::Context' has a wrong offset!");

// Function AIAction_PetShared_Commands.AIAction_PetShared_Commands_C.BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon
// 0x0030 (0x0030 - 0x0000)
struct AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAIActionResult                               Result;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon) == 0x000008, "Wrong alignment on AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon");
static_assert(sizeof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon) == 0x000030, "Wrong size on AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon, AIController) == 0x000000, "Member 'AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon, Character) == 0x000008, "Member 'AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon::Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon, Context) == 0x000010, "Member 'AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon::Context' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon, Result) == 0x000028, "Member 'AIAction_PetShared_Commands_C_BndEvt__ReviveAlly_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetJabbermon::Result' has a wrong offset!");

// Function AIAction_PetShared_Commands.AIAction_PetShared_Commands_C.BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands
// 0x0030 (0x0030 - 0x0000)
struct AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAIActionResult                               Result;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands) == 0x000008, "Wrong alignment on AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands");
static_assert(sizeof(AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands) == 0x000030, "Wrong size on AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands, AIController) == 0x000000, "Member 'AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands, Character) == 0x000008, "Member 'AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands::Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands, Context) == 0x000010, "Member 'AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands::Context' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands, Result) == 0x000028, "Member 'AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_0_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands::Result' has a wrong offset!");

// Function AIAction_PetShared_Commands.AIAction_PetShared_Commands_C.CleanupFadeAwayTaunt
// 0x0008 (0x0008 - 0x0000)
struct AIAction_PetShared_Commands_C_CleanupFadeAwayTaunt final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_PetShared_Commands_C_CleanupFadeAwayTaunt) == 0x000008, "Wrong alignment on AIAction_PetShared_Commands_C_CleanupFadeAwayTaunt");
static_assert(sizeof(AIAction_PetShared_Commands_C_CleanupFadeAwayTaunt) == 0x000008, "Wrong size on AIAction_PetShared_Commands_C_CleanupFadeAwayTaunt");
static_assert(offsetof(AIAction_PetShared_Commands_C_CleanupFadeAwayTaunt, Actor) == 0x000000, "Member 'AIAction_PetShared_Commands_C_CleanupFadeAwayTaunt::Actor' has a wrong offset!");

// Function AIAction_PetShared_Commands.AIAction_PetShared_Commands_C.BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant
// 0x0030 (0x0030 - 0x0000)
struct AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAIActionResult                               Result;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant) == 0x000008, "Wrong alignment on AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant");
static_assert(sizeof(AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant) == 0x000030, "Wrong size on AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant, AIController) == 0x000000, "Member 'AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant, Character) == 0x000008, "Member 'AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant::Character' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant, Context) == 0x000010, "Member 'AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant::Context' has a wrong offset!");
static_assert(offsetof(AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant, Result) == 0x000028, "Member 'AIAction_PetShared_Commands_C_BndEvt__Mod1_TauntOverride_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetSpiderant::Result' has a wrong offset!");

// Function AIAction_PetShared_Commands.AIAction_PetShared_Commands_C.BndEvt__PlayGbxAction_1_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands
// 0x0030 (0x0030 - 0x0000)
struct AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_1_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAIActionResult                               Result;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_1_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands) == 0x000008, "Wrong alignment on AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_1_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands");
static_assert(sizeof(AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_1_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands) == 0x000030, "Wrong size on AIAction_PetShared_Commands_C_BndEvt__PlayGbxAction_1_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_PetShared_Commands");
