#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_VehicleCombat_Outrunner

#include "Basic.hpp"

#include "GbxAI_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function AIAction_VehicleCombat_Outrunner.AIAction_VehicleCombat_Outrunner_C.ExecuteUbergraph_AIAction_VehicleCombat_Outrunner
// 0x0568 (0x0568 - 0x0000)
struct AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0220(0x0218)()
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController5;                // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character5;                   // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context5;                     // 0x0448(0x0018)(ConstParm, NoDestructor)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController4;                // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character4;                   // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context4;                     // 0x0470(0x0018)(ConstParm, NoDestructor)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController3;                // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character3;                   // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context3;                     // 0x0498(0x0018)(ConstParm, NoDestructor)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController2;                // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character2;                   // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context2;                     // 0x04C0(0x0018)(ConstParm, NoDestructor)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController1;                // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character1;                   // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context1;                     // 0x04E8(0x0018)(ConstParm, NoDestructor)
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0500(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x0514(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0525(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0526(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_527[0x1];                                      // 0x0527(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController;                 // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character;                    // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context;                      // 0x0538(0x0018)(ConstParm, NoDestructor)
	EAIActionResult                               K2Node_GbxBoundEvent_Result;                       // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_552[0x6];                                      // 0x0552(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner) == 0x000008, "Wrong alignment on AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner");
static_assert(sizeof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner) == 0x000568, "Wrong size on AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, EntryPoint) == 0x000000, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_NewDialogContext_ReturnValue1) == 0x000220, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_AIController5) == 0x000438, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_AIController5' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Character5) == 0x000440, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Character5' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Context5) == 0x000448, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Context5' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_AIController4) == 0x000460, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_AIController4' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Character4) == 0x000468, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Character4' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Context4) == 0x000470, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Context4' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_AIController3) == 0x000488, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_AIController3' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Character3) == 0x000490, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Character3' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Context3) == 0x000498, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Context3' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_AIController2) == 0x0004B0, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_AIController2' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Character2) == 0x0004B8, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Character2' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Context2) == 0x0004C0, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Context2' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_AIController1) == 0x0004D8, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_AIController1' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Character1) == 0x0004E0, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Character1' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Context1) == 0x0004E8, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Context1' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_FinishTriggerDialog_Conversation) == 0x000500, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_FinishTriggerDialog_SequenceID) == 0x00050C, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000510, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_FinishTriggerDialog_Conversation1) == 0x000514, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_FinishTriggerDialog_SequenceID1) == 0x000520, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x000524, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_Conv_IntToBool_ReturnValue) == 0x000525, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000526, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_AIController) == 0x000528, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_AIController' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Character) == 0x000530, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Context) == 0x000538, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Context' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, K2Node_GbxBoundEvent_Result) == 0x000550, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::K2Node_GbxBoundEvent_Result' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000551, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000558, "Member 'AIAction_VehicleCombat_Outrunner_C_ExecuteUbergraph_AIAction_VehicleCombat_Outrunner::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");

// Function AIAction_VehicleCombat_Outrunner.AIAction_VehicleCombat_Outrunner_C.BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner
// 0x0030 (0x0030 - 0x0000)
struct AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAIActionResult                               Result;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000008, "Wrong alignment on AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
static_assert(sizeof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000030, "Wrong size on AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, AIController) == 0x000000, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, Character) == 0x000008, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::Character' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, Context) == 0x000010, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::Context' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, Result) == 0x000028, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_14_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::Result' has a wrong offset!");

// Function AIAction_VehicleCombat_Outrunner.AIAction_VehicleCombat_Outrunner_C.BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner
// 0x0028 (0x0028 - 0x0000)
struct AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000008, "Wrong alignment on AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
static_assert(sizeof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000028, "Wrong size on AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, AIController) == 0x000000, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, Character) == 0x000008, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::Character' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, Context) == 0x000010, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_15_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::Context' has a wrong offset!");

// Function AIAction_VehicleCombat_Outrunner.AIAction_VehicleCombat_Outrunner_C.BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner
// 0x0028 (0x0028 - 0x0000)
struct AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000008, "Wrong alignment on AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
static_assert(sizeof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000028, "Wrong size on AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, AIController) == 0x000000, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, Character) == 0x000008, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::Character' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, Context) == 0x000010, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__Priority_6_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::Context' has a wrong offset!");

// Function AIAction_VehicleCombat_Outrunner.AIAction_VehicleCombat_Outrunner_C.BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner
// 0x0028 (0x0028 - 0x0000)
struct AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000008, "Wrong alignment on AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
static_assert(sizeof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000028, "Wrong size on AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, AIController) == 0x000000, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, Character) == 0x000008, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::Character' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner, Context) == 0x000010, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleApproachAndHalt_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner::Context' has a wrong offset!");

// Function AIAction_VehicleCombat_Outrunner.AIAction_VehicleCombat_Outrunner_C.BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr
// 0x0028 (0x0028 - 0x0000)
struct AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr) == 0x000008, "Wrong alignment on AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr");
static_assert(sizeof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr) == 0x000028, "Wrong size on AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr, AIController) == 0x000000, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr, Character) == 0x000008, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr::Character' has a wrong offset!");
static_assert(offsetof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr, Context) == 0x000010, "Member 'AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleEscortTarget_Multiple_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_TechOutr::Context' has a wrong offset!");

// Function AIAction_VehicleCombat_Outrunner.AIAction_VehicleCombat_Outrunner_C.BndEvt__VehicleGiveChase_Outrunner_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner
// 0x0028 (0x0028 - 0x0000)
struct AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleGiveChase_Outrunner_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleGiveChase_Outrunner_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000008, "Wrong alignment on AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleGiveChase_Outrunner_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
static_assert(sizeof(AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleGiveChase_Outrunner_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner) == 0x000028, "Wrong size on AIAction_VehicleCombat_Outrunner_C_BndEvt__VehicleGiveChase_Outrunner_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_VehicleCombat_Outrunner");
