#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIAction_SimpleFFYLTaunt

#include "Basic.hpp"

#include "GbxAI_structs.hpp"


namespace SDK::Params
{

// Function AIAction_SimpleFFYLTaunt.AIAction_SimpleFFYLTaunt_C.ExecuteUbergraph_AIAction_SimpleFFYLTaunt
// 0x0068 (0x0068 - 0x0000)
struct AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController1;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character1;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context1;                     // 0x0018(0x0018)(ConstParm, NoDestructor)
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context;                      // 0x0048(0x0018)(ConstParm, NoDestructor)
	EAIActionResult                               K2Node_GbxBoundEvent_Result;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt) == 0x000008, "Wrong alignment on AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt");
static_assert(sizeof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt) == 0x000068, "Wrong size on AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt, EntryPoint) == 0x000000, "Member 'AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt, K2Node_GbxBoundEvent_AIController1) == 0x000008, "Member 'AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt::K2Node_GbxBoundEvent_AIController1' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt, K2Node_GbxBoundEvent_Character1) == 0x000010, "Member 'AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt::K2Node_GbxBoundEvent_Character1' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt, K2Node_GbxBoundEvent_Context1) == 0x000018, "Member 'AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt::K2Node_GbxBoundEvent_Context1' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000030, "Member 'AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt, K2Node_GbxBoundEvent_AIController) == 0x000038, "Member 'AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt::K2Node_GbxBoundEvent_AIController' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt, K2Node_GbxBoundEvent_Character) == 0x000040, "Member 'AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt::K2Node_GbxBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt, K2Node_GbxBoundEvent_Context) == 0x000048, "Member 'AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt::K2Node_GbxBoundEvent_Context' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt, K2Node_GbxBoundEvent_Result) == 0x000060, "Member 'AIAction_SimpleFFYLTaunt_C_ExecuteUbergraph_AIAction_SimpleFFYLTaunt::K2Node_GbxBoundEvent_Result' has a wrong offset!");

// Function AIAction_SimpleFFYLTaunt.AIAction_SimpleFFYLTaunt_C.BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt
// 0x0030 (0x0030 - 0x0000)
struct AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAIActionResult                               Result;                                            // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt) == 0x000008, "Wrong alignment on AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt");
static_assert(sizeof(AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt) == 0x000030, "Wrong size on AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt, AIController) == 0x000000, "Member 'AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt, Character) == 0x000008, "Member 'AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt::Character' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt, Context) == 0x000010, "Member 'AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt::Context' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt, Result) == 0x000028, "Member 'AIAction_SimpleFFYLTaunt_C_BndEvt__Sequence_OnStoppedEventBP_AIActionBlueprintResultDelegate__DelegateSignature_AIAction_FFYLTaunt::Result' has a wrong offset!");

// Function AIAction_SimpleFFYLTaunt.AIAction_SimpleFFYLTaunt_C.BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt
// 0x0028 (0x0028 - 0x0000)
struct AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt) == 0x000008, "Wrong alignment on AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt");
static_assert(sizeof(AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt) == 0x000028, "Wrong size on AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt, AIController) == 0x000000, "Member 'AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt::AIController' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt, Character) == 0x000008, "Member 'AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt::Character' has a wrong offset!");
static_assert(offsetof(AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt, Context) == 0x000010, "Member 'AIAction_SimpleFFYLTaunt_C_BndEvt__OnInitializeInstanceEventBP_AIActionBlueprintDelegate__DelegateSignature_AIAction_FFYLTaunt::Context' has a wrong offset!");

}

