#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AITree_VehicleScriptedLeadCombat

#include "Basic.hpp"

#include "GbxAI_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function AITree_VehicleScriptedLeadCombat.AITree_VehicleScriptedLeadCombat_C.ExecuteUbergraph_AITree_VehicleScriptedLeadCombat
// 0x0050 (0x0050 - 0x0000)
struct AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxAIController*                       K2Node_GbxBoundEvent_AIController;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_GbxBoundEvent_Character;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              K2Node_GbxBoundEvent_Context;                      // 0x0018(0x0018)(ConstParm, NoDestructor)
	struct FStuckTeleport                         K2Node_MakeStruct_StuckTeleport;                   // 0x0030(0x0020)(NoDestructor)
};
static_assert(alignof(AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat) == 0x000008, "Wrong alignment on AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat");
static_assert(sizeof(AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat) == 0x000050, "Wrong size on AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat");
static_assert(offsetof(AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat, EntryPoint) == 0x000000, "Member 'AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat::EntryPoint' has a wrong offset!");
static_assert(offsetof(AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat, K2Node_GbxBoundEvent_AIController) == 0x000008, "Member 'AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat::K2Node_GbxBoundEvent_AIController' has a wrong offset!");
static_assert(offsetof(AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat, K2Node_GbxBoundEvent_Character) == 0x000010, "Member 'AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat::K2Node_GbxBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat, K2Node_GbxBoundEvent_Context) == 0x000018, "Member 'AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat::K2Node_GbxBoundEvent_Context' has a wrong offset!");
static_assert(offsetof(AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat, K2Node_MakeStruct_StuckTeleport) == 0x000030, "Member 'AITree_VehicleScriptedLeadCombat_C_ExecuteUbergraph_AITree_VehicleScriptedLeadCombat::K2Node_MakeStruct_StuckTeleport' has a wrong offset!");

// Function AITree_VehicleScriptedLeadCombat.AITree_VehicleScriptedLeadCombat_C.BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat
// 0x0028 (0x0028 - 0x0000)
struct AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat final
{
public:
	class AGbxAIController*                       AIController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIActionBlueprintContext              Context;                                           // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat) == 0x000008, "Wrong alignment on AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat");
static_assert(sizeof(AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat) == 0x000028, "Wrong size on AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat");
static_assert(offsetof(AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat, AIController) == 0x000000, "Member 'AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat::AIController' has a wrong offset!");
static_assert(offsetof(AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat, Character) == 0x000008, "Member 'AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat::Character' has a wrong offset!");
static_assert(offsetof(AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat, Context) == 0x000010, "Member 'AITree_VehicleScriptedLeadCombat_C_BndEvt__LeadVehicle_OnStartedEventBP_AIActionBlueprintDelegate__DelegateSignature_AITree_VehicleScriptedLeadCombat::Context' has a wrong offset!");

}

