#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALI_SM_ThatRingsABell

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function ALI_SM_ThatRingsABell.ALI_SM_ThatRingsABell_C.ExecuteUbergraph_ALI_SM_ThatRingsABell
// 0x0D50 (0x0D50 - 0x0000)
struct ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0230(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0248(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0460(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0478(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x0690(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A2[0x6];                                      // 0x06A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x06A8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x08C0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AD8(0x0218)()
	class UObject*                                MissionK2Node_MissionCustomEvent_Context;          // 0x0CF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x0CF8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x0D04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x0D08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent;       // 0x0D09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D0A[0x2];                                      // 0x0D0A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount;       // 0x0D0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x0D10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0D11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D12[0x2];                                      // 0x0D12(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x0D14(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x0D20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x0D24(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent; // 0x0D25(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0D26(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D27[0x1];                                      // 0x0D27(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x0D28(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x0D34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x0D38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0D39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3A[0x6];                                      // 0x0D3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0D40(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell) == 0x000008, "Wrong alignment on ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell");
static_assert(sizeof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell) == 0x000D50, "Wrong size on ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, EntryPoint) == 0x000000, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::EntryPoint' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, K2Node_CreateDelegate_OutputDelegate) == 0x000220, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_Conversation) == 0x000230, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_SequenceID) == 0x00023C, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_ReturnValue) == 0x000240, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_Conv_IntToBool_ReturnValue) == 0x000241, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_NewDialogContext_ReturnValue1) == 0x000248, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_Conversation1) == 0x000460, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_Conversation1' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_SequenceID1) == 0x00046C, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_SequenceID1' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_ReturnValue1) == 0x000470, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000471, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_NewDialogContext_ReturnValue2) == 0x000478, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_Conversation2) == 0x000690, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_Conversation2' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_SequenceID2) == 0x00069C, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_SequenceID2' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_ReturnValue2) == 0x0006A0, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_Conv_IntToBool_ReturnValue2) == 0x0006A1, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_NewDialogContext_ReturnValue3) == 0x0006A8, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_NewDialogContext_ReturnValue4) == 0x0008C0, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_NewDialogContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_NewDialogContext_ReturnValue5) == 0x000AD8, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_NewDialogContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, MissionK2Node_MissionCustomEvent_Context) == 0x000CF0, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::MissionK2Node_MissionCustomEvent_Context' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_Conversation3) == 0x000CF8, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_Conversation3' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_SequenceID3) == 0x000D04, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_SequenceID3' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_ReturnValue3) == 0x000D08, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, MissionK2Node_ObjectiveEvent_ObjectiveEvent) == 0x000D09, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::MissionK2Node_ObjectiveEvent_ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, MissionK2Node_ObjectiveEvent_ObjectiveCount) == 0x000D0C, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::MissionK2Node_ObjectiveEvent_ObjectiveCount' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_Conv_IntToBool_ReturnValue3) == 0x000D10, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, K2Node_SwitchEnum_CmpSuccess) == 0x000D11, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_Conversation4) == 0x000D14, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_Conversation4' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_SequenceID4) == 0x000D20, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_SequenceID4' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_ReturnValue4) == 0x000D24, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent) == 0x000D25, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_Conv_IntToBool_ReturnValue4) == 0x000D26, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_Conversation5) == 0x000D28, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_Conversation5' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_SequenceID5) == 0x000D34, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_SequenceID5' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_FinishSpeak_ReturnValue5) == 0x000D38, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_FinishSpeak_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, CallFunc_Conv_IntToBool_ReturnValue5) == 0x000D39, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell, K2Node_CreateDelegate_OutputDelegate1) == 0x000D40, "Member 'ALI_SM_ThatRingsABell_C_ExecuteUbergraph_ALI_SM_ThatRingsABell::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");

// Function ALI_SM_ThatRingsABell.ALI_SM_ThatRingsABell_C.SET_RingABell
// 0x0001 (0x0001 - 0x0000)
struct ALI_SM_ThatRingsABell_C_SET_RingABell final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALI_SM_ThatRingsABell_C_SET_RingABell) == 0x000001, "Wrong alignment on ALI_SM_ThatRingsABell_C_SET_RingABell");
static_assert(sizeof(ALI_SM_ThatRingsABell_C_SET_RingABell) == 0x000001, "Wrong size on ALI_SM_ThatRingsABell_C_SET_RingABell");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_SET_RingABell, ObjectiveSetEvent) == 0x000000, "Member 'ALI_SM_ThatRingsABell_C_SET_RingABell::ObjectiveSetEvent' has a wrong offset!");

// Function ALI_SM_ThatRingsABell.ALI_SM_ThatRingsABell_C.Obj_RingABell
// 0x0008 (0x0008 - 0x0000)
struct ALI_SM_ThatRingsABell_C_Obj_RingABell final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALI_SM_ThatRingsABell_C_Obj_RingABell) == 0x000004, "Wrong alignment on ALI_SM_ThatRingsABell_C_Obj_RingABell");
static_assert(sizeof(ALI_SM_ThatRingsABell_C_Obj_RingABell) == 0x000008, "Wrong size on ALI_SM_ThatRingsABell_C_Obj_RingABell");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_Obj_RingABell, ObjectiveEvent) == 0x000000, "Member 'ALI_SM_ThatRingsABell_C_Obj_RingABell::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_Obj_RingABell, ObjectiveCount) == 0x000004, "Member 'ALI_SM_ThatRingsABell_C_Obj_RingABell::ObjectiveCount' has a wrong offset!");

// Function ALI_SM_ThatRingsABell.ALI_SM_ThatRingsABell_C.MCE_RingABell
// 0x0008 (0x0008 - 0x0000)
struct ALI_SM_ThatRingsABell_C_MCE_RingABell final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALI_SM_ThatRingsABell_C_MCE_RingABell) == 0x000008, "Wrong alignment on ALI_SM_ThatRingsABell_C_MCE_RingABell");
static_assert(sizeof(ALI_SM_ThatRingsABell_C_MCE_RingABell) == 0x000008, "Wrong size on ALI_SM_ThatRingsABell_C_MCE_RingABell");
static_assert(offsetof(ALI_SM_ThatRingsABell_C_MCE_RingABell, Context) == 0x000000, "Member 'ALI_SM_ThatRingsABell_C_MCE_RingABell::Context' has a wrong offset!");

}

