#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALI_SM_WhenItRains

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function ALI_SM_WhenItRains.ALI_SM_WhenItRains_C.ExecuteUbergraph_ALI_SM_WhenItRains
// 0x0F90 (0x0F90 - 0x0000)
struct ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0230(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0448(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0460(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x067C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x068D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68E[0x2];                                      // 0x068E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0690(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x08A8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x08B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BA[0x6];                                      // 0x08BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x08C0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AD8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0CF0(0x0218)()
	class UObject*                                MissionK2Node_MissionCustomEvent_Context1;         // 0x0F08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x0F10(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x0F1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x0F20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent1;      // 0x0F21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F22[0x2];                                      // 0x0F22(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount1;      // 0x0F24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x0F28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0F29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2A[0x2];                                      // 0x0F2A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x0F2C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x0F38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x0F3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0F3D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F3E[0x2];                                      // 0x0F3E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x0F40(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x0F4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x0F50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0F51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F52[0x2];                                      // 0x0F52(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x0F54(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x0F60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x0F64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x0F65(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1; // 0x0F66(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent;       // 0x0F67(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount;       // 0x0F68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6C[0x4];                                      // 0x0F6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context;          // 0x0F70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0F78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent; // 0x0F79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F7A[0x6];                                      // 0x0F7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0F80(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains) == 0x000008, "Wrong alignment on ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains");
static_assert(sizeof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains) == 0x000F90, "Wrong size on ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, EntryPoint) == 0x000000, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::EntryPoint' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, K2Node_CreateDelegate_OutputDelegate) == 0x000220, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_NewDialogContext_ReturnValue1) == 0x000230, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_Conversation) == 0x000448, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_SequenceID) == 0x000454, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_ReturnValue) == 0x000458, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_NewDialogContext_ReturnValue2) == 0x000460, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_Conv_IntToBool_ReturnValue) == 0x000678, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_Conversation1) == 0x00067C, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_Conversation1' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_SequenceID1) == 0x000688, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_SequenceID1' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_ReturnValue1) == 0x00068C, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_Conv_IntToBool_ReturnValue1) == 0x00068D, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_NewDialogContext_ReturnValue3) == 0x000690, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_Conversation2) == 0x0008A8, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_Conversation2' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_SequenceID2) == 0x0008B4, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_SequenceID2' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_ReturnValue2) == 0x0008B8, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_Conv_IntToBool_ReturnValue2) == 0x0008B9, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_NewDialogContext_ReturnValue4) == 0x0008C0, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_NewDialogContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_NewDialogContext_ReturnValue5) == 0x000AD8, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_NewDialogContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_NewDialogContext_ReturnValue6) == 0x000CF0, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_NewDialogContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, MissionK2Node_MissionCustomEvent_Context1) == 0x000F08, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::MissionK2Node_MissionCustomEvent_Context1' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_Conversation3) == 0x000F10, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_Conversation3' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_SequenceID3) == 0x000F1C, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_SequenceID3' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_ReturnValue3) == 0x000F20, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, MissionK2Node_ObjectiveEvent_ObjectiveEvent1) == 0x000F21, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::MissionK2Node_ObjectiveEvent_ObjectiveEvent1' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, MissionK2Node_ObjectiveEvent_ObjectiveCount1) == 0x000F24, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::MissionK2Node_ObjectiveEvent_ObjectiveCount1' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_Conv_IntToBool_ReturnValue3) == 0x000F28, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, K2Node_SwitchEnum_CmpSuccess) == 0x000F29, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_Conversation4) == 0x000F2C, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_Conversation4' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_SequenceID4) == 0x000F38, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_SequenceID4' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_ReturnValue4) == 0x000F3C, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_Conv_IntToBool_ReturnValue4) == 0x000F3D, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_Conversation5) == 0x000F40, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_Conversation5' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_SequenceID5) == 0x000F4C, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_SequenceID5' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_ReturnValue5) == 0x000F50, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_Conv_IntToBool_ReturnValue5) == 0x000F51, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_Conversation6) == 0x000F54, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_Conversation6' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_SequenceID6) == 0x000F60, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_SequenceID6' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_FinishSpeak_ReturnValue6) == 0x000F64, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_FinishSpeak_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, CallFunc_Conv_IntToBool_ReturnValue6) == 0x000F65, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::CallFunc_Conv_IntToBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1) == 0x000F66, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, MissionK2Node_ObjectiveEvent_ObjectiveEvent) == 0x000F67, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::MissionK2Node_ObjectiveEvent_ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, MissionK2Node_ObjectiveEvent_ObjectiveCount) == 0x000F68, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::MissionK2Node_ObjectiveEvent_ObjectiveCount' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, MissionK2Node_MissionCustomEvent_Context) == 0x000F70, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::MissionK2Node_MissionCustomEvent_Context' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, K2Node_SwitchEnum1_CmpSuccess) == 0x000F78, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent) == 0x000F79, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains, K2Node_CreateDelegate_OutputDelegate1) == 0x000F80, "Member 'ALI_SM_WhenItRains_C_ExecuteUbergraph_ALI_SM_WhenItRains::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");

// Function ALI_SM_WhenItRains.ALI_SM_WhenItRains_C.SET_FindUmbrella
// 0x0001 (0x0001 - 0x0000)
struct ALI_SM_WhenItRains_C_SET_FindUmbrella final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALI_SM_WhenItRains_C_SET_FindUmbrella) == 0x000001, "Wrong alignment on ALI_SM_WhenItRains_C_SET_FindUmbrella");
static_assert(sizeof(ALI_SM_WhenItRains_C_SET_FindUmbrella) == 0x000001, "Wrong size on ALI_SM_WhenItRains_C_SET_FindUmbrella");
static_assert(offsetof(ALI_SM_WhenItRains_C_SET_FindUmbrella, ObjectiveSetEvent) == 0x000000, "Member 'ALI_SM_WhenItRains_C_SET_FindUmbrella::ObjectiveSetEvent' has a wrong offset!");

// Function ALI_SM_WhenItRains.ALI_SM_WhenItRains_C.MCE_GiveUmbrella
// 0x0008 (0x0008 - 0x0000)
struct ALI_SM_WhenItRains_C_MCE_GiveUmbrella final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALI_SM_WhenItRains_C_MCE_GiveUmbrella) == 0x000008, "Wrong alignment on ALI_SM_WhenItRains_C_MCE_GiveUmbrella");
static_assert(sizeof(ALI_SM_WhenItRains_C_MCE_GiveUmbrella) == 0x000008, "Wrong size on ALI_SM_WhenItRains_C_MCE_GiveUmbrella");
static_assert(offsetof(ALI_SM_WhenItRains_C_MCE_GiveUmbrella, Context) == 0x000000, "Member 'ALI_SM_WhenItRains_C_MCE_GiveUmbrella::Context' has a wrong offset!");

// Function ALI_SM_WhenItRains.ALI_SM_WhenItRains_C.Obj_GiveUmbrella
// 0x0008 (0x0008 - 0x0000)
struct ALI_SM_WhenItRains_C_Obj_GiveUmbrella final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALI_SM_WhenItRains_C_Obj_GiveUmbrella) == 0x000004, "Wrong alignment on ALI_SM_WhenItRains_C_Obj_GiveUmbrella");
static_assert(sizeof(ALI_SM_WhenItRains_C_Obj_GiveUmbrella) == 0x000008, "Wrong size on ALI_SM_WhenItRains_C_Obj_GiveUmbrella");
static_assert(offsetof(ALI_SM_WhenItRains_C_Obj_GiveUmbrella, ObjectiveEvent) == 0x000000, "Member 'ALI_SM_WhenItRains_C_Obj_GiveUmbrella::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_Obj_GiveUmbrella, ObjectiveCount) == 0x000004, "Member 'ALI_SM_WhenItRains_C_Obj_GiveUmbrella::ObjectiveCount' has a wrong offset!");

// Function ALI_SM_WhenItRains.ALI_SM_WhenItRains_C.SET_GiveUmbrella
// 0x0001 (0x0001 - 0x0000)
struct ALI_SM_WhenItRains_C_SET_GiveUmbrella final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALI_SM_WhenItRains_C_SET_GiveUmbrella) == 0x000001, "Wrong alignment on ALI_SM_WhenItRains_C_SET_GiveUmbrella");
static_assert(sizeof(ALI_SM_WhenItRains_C_SET_GiveUmbrella) == 0x000001, "Wrong size on ALI_SM_WhenItRains_C_SET_GiveUmbrella");
static_assert(offsetof(ALI_SM_WhenItRains_C_SET_GiveUmbrella, ObjectiveSetEvent) == 0x000000, "Member 'ALI_SM_WhenItRains_C_SET_GiveUmbrella::ObjectiveSetEvent' has a wrong offset!");

// Function ALI_SM_WhenItRains.ALI_SM_WhenItRains_C.Obj_FindUmbrella
// 0x0008 (0x0008 - 0x0000)
struct ALI_SM_WhenItRains_C_Obj_FindUmbrella final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALI_SM_WhenItRains_C_Obj_FindUmbrella) == 0x000004, "Wrong alignment on ALI_SM_WhenItRains_C_Obj_FindUmbrella");
static_assert(sizeof(ALI_SM_WhenItRains_C_Obj_FindUmbrella) == 0x000008, "Wrong size on ALI_SM_WhenItRains_C_Obj_FindUmbrella");
static_assert(offsetof(ALI_SM_WhenItRains_C_Obj_FindUmbrella, ObjectiveEvent) == 0x000000, "Member 'ALI_SM_WhenItRains_C_Obj_FindUmbrella::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(ALI_SM_WhenItRains_C_Obj_FindUmbrella, ObjectiveCount) == 0x000004, "Member 'ALI_SM_WhenItRains_C_Obj_FindUmbrella::ObjectiveCount' has a wrong offset!");

// Function ALI_SM_WhenItRains.ALI_SM_WhenItRains_C.MCE_FindUmbrella
// 0x0008 (0x0008 - 0x0000)
struct ALI_SM_WhenItRains_C_MCE_FindUmbrella final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ALI_SM_WhenItRains_C_MCE_FindUmbrella) == 0x000008, "Wrong alignment on ALI_SM_WhenItRains_C_MCE_FindUmbrella");
static_assert(sizeof(ALI_SM_WhenItRains_C_MCE_FindUmbrella) == 0x000008, "Wrong size on ALI_SM_WhenItRains_C_MCE_FindUmbrella");
static_assert(offsetof(ALI_SM_WhenItRains_C_MCE_FindUmbrella, Context) == 0x000000, "Member 'ALI_SM_WhenItRains_C_MCE_FindUmbrella::Context' has a wrong offset!");

}

