#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALI_SM_HotNBothered

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ALI_SM_HotNBothered.ALI_SM_HotNBothered_C
// 0x0018 (0x0510 - 0x04F8)
class UALI_SM_HotNBothered_C final : public UOakMission
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   SET_TurnHeatOn_ObjSetVar;                          // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TurnHeatOn_ObjVar;                             // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ALI_SM_HotNBothered(int32 EntryPoint);
	void SET_TurnHeatOn(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_TurnedHeatOn(class UObject* Context);
	void Obj_TurnHeatOn(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MissionKickoff();
	void OnDialogSequenceFinished_4();
	void OnDialogSequenceFinished_5();
	void OnDialogSequenceFinished_6();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ALI_SM_HotNBothered_C">();
	}
	static class UALI_SM_HotNBothered_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UALI_SM_HotNBothered_C>();
	}
};
static_assert(alignof(UALI_SM_HotNBothered_C) == 0x000008, "Wrong alignment on UALI_SM_HotNBothered_C");
static_assert(sizeof(UALI_SM_HotNBothered_C) == 0x000510, "Wrong size on UALI_SM_HotNBothered_C");
static_assert(offsetof(UALI_SM_HotNBothered_C, UberGraphFrame) == 0x0004F8, "Member 'UALI_SM_HotNBothered_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UALI_SM_HotNBothered_C, SET_TurnHeatOn_ObjSetVar) == 0x000500, "Member 'UALI_SM_HotNBothered_C::SET_TurnHeatOn_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_HotNBothered_C, Obj_TurnHeatOn_ObjVar) == 0x000508, "Member 'UALI_SM_HotNBothered_C::Obj_TurnHeatOn_ObjVar' has a wrong offset!");

}

