#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALI_SM_SpineTingler

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ALI_SM_SpineTingler.ALI_SM_SpineTingler_C
// 0x0078 (0x0570 - 0x04F8)
class UALI_SM_SpineTingler_C final : public UOakMission
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   SET_GetTheItch_ObjSetVar;                          // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTheItch_1_ObjVar;                           // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTheItch_2_ObjVar;                           // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GetTheItch_2_ObjSetVar;                        // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GetTheItch_3_ObjSetVar;                        // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTheItch_3_ObjVar;                           // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GetTheItch_4_ObjSetVar;                        // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTheItch_4_ObjVar;                           // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GetTheItch_5_ObjSetVar;                        // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTheItch_5_ObjVar;                           // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GetTheItch_6_ObjSetVar;                        // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTheItch_6_ObjVar;                           // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GetTheItch_7_ObjSetVar;                        // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTheItch_7_ObjVar;                           // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ALI_SM_SpineTingler(int32 EntryPoint);
	void SET_GetTheItch_7(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_GetTheItch_6(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_GetTheItch_5(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_GetTheItch_4(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_GetTheItch_3(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_GetTheItch_2(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_GetTheItch_7(class UObject* Context);
	void Obj_GetTheItch_7(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_GetTheItch_6(class UObject* Context);
	void Obj_GetTheItch_6(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_GetTheItch_5(class UObject* Context);
	void Obj_GetTheItch_5(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_GetTheItch_4(class UObject* Context);
	void Obj_GetTheItch_4(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_GetTheItch_3(class UObject* Context);
	void Obj_GetTheItch_3(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_GetTheItch_2(class UObject* Context);
	void Obj_GetTheItch_2(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MissionKickoff();
	void SET_GetTheItch(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GetTheItch_1(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_GetTheItch_1(class UObject* Context);
	void OnDialogSequenceFinished_10();
	void OnDialogSequenceFinished_11();
	void OnDialogSequenceFinished_12();
	void OnDialogSequenceFinished_13();
	void OnDialogSequenceFinished_14();
	void OnDialogSequenceFinished_15();
	void OnDialogSequenceFinished_16();
	void OnDialogSequenceFinished_9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ALI_SM_SpineTingler_C">();
	}
	static class UALI_SM_SpineTingler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UALI_SM_SpineTingler_C>();
	}
};
static_assert(alignof(UALI_SM_SpineTingler_C) == 0x000008, "Wrong alignment on UALI_SM_SpineTingler_C");
static_assert(sizeof(UALI_SM_SpineTingler_C) == 0x000570, "Wrong size on UALI_SM_SpineTingler_C");
static_assert(offsetof(UALI_SM_SpineTingler_C, UberGraphFrame) == 0x0004F8, "Member 'UALI_SM_SpineTingler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, SET_GetTheItch_ObjSetVar) == 0x000500, "Member 'UALI_SM_SpineTingler_C::SET_GetTheItch_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, Obj_GetTheItch_1_ObjVar) == 0x000508, "Member 'UALI_SM_SpineTingler_C::Obj_GetTheItch_1_ObjVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, Obj_GetTheItch_2_ObjVar) == 0x000510, "Member 'UALI_SM_SpineTingler_C::Obj_GetTheItch_2_ObjVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, SET_GetTheItch_2_ObjSetVar) == 0x000518, "Member 'UALI_SM_SpineTingler_C::SET_GetTheItch_2_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, SET_GetTheItch_3_ObjSetVar) == 0x000520, "Member 'UALI_SM_SpineTingler_C::SET_GetTheItch_3_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, Obj_GetTheItch_3_ObjVar) == 0x000528, "Member 'UALI_SM_SpineTingler_C::Obj_GetTheItch_3_ObjVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, SET_GetTheItch_4_ObjSetVar) == 0x000530, "Member 'UALI_SM_SpineTingler_C::SET_GetTheItch_4_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, Obj_GetTheItch_4_ObjVar) == 0x000538, "Member 'UALI_SM_SpineTingler_C::Obj_GetTheItch_4_ObjVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, SET_GetTheItch_5_ObjSetVar) == 0x000540, "Member 'UALI_SM_SpineTingler_C::SET_GetTheItch_5_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, Obj_GetTheItch_5_ObjVar) == 0x000548, "Member 'UALI_SM_SpineTingler_C::Obj_GetTheItch_5_ObjVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, SET_GetTheItch_6_ObjSetVar) == 0x000550, "Member 'UALI_SM_SpineTingler_C::SET_GetTheItch_6_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, Obj_GetTheItch_6_ObjVar) == 0x000558, "Member 'UALI_SM_SpineTingler_C::Obj_GetTheItch_6_ObjVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, SET_GetTheItch_7_ObjSetVar) == 0x000560, "Member 'UALI_SM_SpineTingler_C::SET_GetTheItch_7_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UALI_SM_SpineTingler_C, Obj_GetTheItch_7_ObjVar) == 0x000568, "Member 'UALI_SM_SpineTingler_C::Obj_GetTheItch_7_ObjVar' has a wrong offset!");

}

