#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ARandom_TrooperMelee_Fidget

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ARandom_TrooperMelee_Fidget.ARandom_TrooperMelee_Fidget_C
// 0x0018 (0x0250 - 0x0238)
class UARandom_TrooperMelee_Fidget_C final : public UOakAction_RandomAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 DamageType;                                        // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 MySelf;                                            // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ARandom_TrooperMelee_Fidget(int32 EntryPoint);
	void Notify_BoneMod_Disable_Abort();
	void Notify_BoneMod_Disable_Begin();
	void Notify_BoneMod_Disable_End();
	void OnBegin(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ARandom_TrooperMelee_Fidget_C">();
	}
	static class UARandom_TrooperMelee_Fidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARandom_TrooperMelee_Fidget_C>();
	}
};
static_assert(alignof(UARandom_TrooperMelee_Fidget_C) == 0x000008, "Wrong alignment on UARandom_TrooperMelee_Fidget_C");
static_assert(sizeof(UARandom_TrooperMelee_Fidget_C) == 0x000250, "Wrong size on UARandom_TrooperMelee_Fidget_C");
static_assert(offsetof(UARandom_TrooperMelee_Fidget_C, UberGraphFrame) == 0x000238, "Member 'UARandom_TrooperMelee_Fidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UARandom_TrooperMelee_Fidget_C, DamageType) == 0x000240, "Member 'UARandom_TrooperMelee_Fidget_C::DamageType' has a wrong offset!");
static_assert(offsetof(UARandom_TrooperMelee_Fidget_C, MySelf) == 0x000248, "Member 'UARandom_TrooperMelee_Fidget_C::MySelf' has a wrong offset!");

}

