#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASpawn_Nog_WallDropDown

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function ASpawn_Nog_WallDropDown.ASpawn_Nog_WallDropDown_C.ExecuteUbergraph_ASpawn_Nog_WallDropDown
// 0x0088 (0x0088 - 0x0000)
struct ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Nog_C>            K2Node_DynamicCast_AsBPI_Nog;                      // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array1;                           // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	class UOakNogDroneContainerComponent*         CallFunc_Nog_GetDroneContainer_DroneContainer;     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item1;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown) == 0x000008, "Wrong alignment on ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown");
static_assert(sizeof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown) == 0x000088, "Wrong size on ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, EntryPoint) == 0x000000, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, K2Node_MakeArray_Array) == 0x000008, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, Temp_int_Array_Index_Variable) == 0x000028, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, CallFunc_Array_Get_Item) == 0x00002C, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, K2Node_Event_ActionEndState) == 0x000030, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, K2Node_Event_Actor) == 0x000038, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, K2Node_DynamicCast_AsBPI_Nog) == 0x000040, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::K2Node_DynamicCast_AsBPI_Nog' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, K2Node_MakeArray_Array1) == 0x000058, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, CallFunc_Nog_GetDroneContainer_DroneContainer) == 0x000068, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::CallFunc_Nog_GetDroneContainer_DroneContainer' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, CallFunc_Array_Length_ReturnValue1) == 0x000070, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, Temp_int_Loop_Counter_Variable1) == 0x000074, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, Temp_int_Array_Index_Variable1) == 0x000078, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, CallFunc_Less_IntInt_ReturnValue1) == 0x00007C, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, CallFunc_Array_Get_Item1) == 0x000080, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown, CallFunc_Add_IntInt_ReturnValue1) == 0x000084, "Member 'ASpawn_Nog_WallDropDown_C_ExecuteUbergraph_ASpawn_Nog_WallDropDown::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");

// Function ASpawn_Nog_WallDropDown.ASpawn_Nog_WallDropDown_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct ASpawn_Nog_WallDropDown_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ASpawn_Nog_WallDropDown_C_OnEnd) == 0x000008, "Wrong alignment on ASpawn_Nog_WallDropDown_C_OnEnd");
static_assert(sizeof(ASpawn_Nog_WallDropDown_C_OnEnd) == 0x000010, "Wrong size on ASpawn_Nog_WallDropDown_C_OnEnd");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_OnEnd, ActionEndState) == 0x000000, "Member 'ASpawn_Nog_WallDropDown_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(ASpawn_Nog_WallDropDown_C_OnEnd, Actor) == 0x000008, "Member 'ASpawn_Nog_WallDropDown_C_OnEnd::Actor' has a wrong offset!");

}

