#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AStruct_LiveWeaponPoses

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct AStruct_LiveWeaponPoses.AStruct_LiveWeaponPoses
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FAStruct_LiveWeaponPoses final
{
public:
	class FName                                   AdditiveWeaponPose_2_066CD9F145471FEA5496E08738A6C8F0; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AddWeapPose_RHBase_4_2533F0AB423C7DD7674151805E8C7E06; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Secondary_ADDWeaponPose_6_5CC7D9574D7602A1A9A423B5D30DA494; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AdditiveADSPose_8_A14A18EF4E2D88A4B001FFB29E5F95EC; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AddADSPose_RHBase_10_A21F2C47437389B296E6A88328B19896; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ADSEnter_22_8ACCDD694A5C60E5D9C9EA8CA3CD3E85;      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ADSExit_23_CCDD42CF4737282F8F374894A4602A04;       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   R_Grip_17_ECA276254567B67B7607479441F23366;        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   L_Grip_19_E2B9CB5B442ADD783163E78A7E2FD38E;        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Secondary_L_Grip_21_21140E0D4184CC3C058EE380CC304393; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAStruct_LiveWeaponPoses) == 0x000008, "Wrong alignment on FAStruct_LiveWeaponPoses");
static_assert(sizeof(FAStruct_LiveWeaponPoses) == 0x000050, "Wrong size on FAStruct_LiveWeaponPoses");
static_assert(offsetof(FAStruct_LiveWeaponPoses, AdditiveWeaponPose_2_066CD9F145471FEA5496E08738A6C8F0) == 0x000000, "Member 'FAStruct_LiveWeaponPoses::AdditiveWeaponPose_2_066CD9F145471FEA5496E08738A6C8F0' has a wrong offset!");
static_assert(offsetof(FAStruct_LiveWeaponPoses, AddWeapPose_RHBase_4_2533F0AB423C7DD7674151805E8C7E06) == 0x000008, "Member 'FAStruct_LiveWeaponPoses::AddWeapPose_RHBase_4_2533F0AB423C7DD7674151805E8C7E06' has a wrong offset!");
static_assert(offsetof(FAStruct_LiveWeaponPoses, Secondary_ADDWeaponPose_6_5CC7D9574D7602A1A9A423B5D30DA494) == 0x000010, "Member 'FAStruct_LiveWeaponPoses::Secondary_ADDWeaponPose_6_5CC7D9574D7602A1A9A423B5D30DA494' has a wrong offset!");
static_assert(offsetof(FAStruct_LiveWeaponPoses, AdditiveADSPose_8_A14A18EF4E2D88A4B001FFB29E5F95EC) == 0x000018, "Member 'FAStruct_LiveWeaponPoses::AdditiveADSPose_8_A14A18EF4E2D88A4B001FFB29E5F95EC' has a wrong offset!");
static_assert(offsetof(FAStruct_LiveWeaponPoses, AddADSPose_RHBase_10_A21F2C47437389B296E6A88328B19896) == 0x000020, "Member 'FAStruct_LiveWeaponPoses::AddADSPose_RHBase_10_A21F2C47437389B296E6A88328B19896' has a wrong offset!");
static_assert(offsetof(FAStruct_LiveWeaponPoses, ADSEnter_22_8ACCDD694A5C60E5D9C9EA8CA3CD3E85) == 0x000028, "Member 'FAStruct_LiveWeaponPoses::ADSEnter_22_8ACCDD694A5C60E5D9C9EA8CA3CD3E85' has a wrong offset!");
static_assert(offsetof(FAStruct_LiveWeaponPoses, ADSExit_23_CCDD42CF4737282F8F374894A4602A04) == 0x000030, "Member 'FAStruct_LiveWeaponPoses::ADSExit_23_CCDD42CF4737282F8F374894A4602A04' has a wrong offset!");
static_assert(offsetof(FAStruct_LiveWeaponPoses, R_Grip_17_ECA276254567B67B7607479441F23366) == 0x000038, "Member 'FAStruct_LiveWeaponPoses::R_Grip_17_ECA276254567B67B7607479441F23366' has a wrong offset!");
static_assert(offsetof(FAStruct_LiveWeaponPoses, L_Grip_19_E2B9CB5B442ADD783163E78A7E2FD38E) == 0x000040, "Member 'FAStruct_LiveWeaponPoses::L_Grip_19_E2B9CB5B442ADD783163E78A7E2FD38E' has a wrong offset!");
static_assert(offsetof(FAStruct_LiveWeaponPoses, Secondary_L_Grip_21_21140E0D4184CC3C058EE380CC304393) == 0x000048, "Member 'FAStruct_LiveWeaponPoses::Secondary_L_Grip_21_21140E0D4184CC3C058EE380CC304393' has a wrong offset!");

}

