#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AStruct_WeaponAnimContainer_Menu

#include "Basic.hpp"

#include "AStruct_WeaponAnims_Menu_structs.hpp"


namespace SDK
{

// UserDefinedStruct AStruct_WeaponAnimContainer_Menu.AStruct_WeaponAnimContainer_Menu
// 0x0780 (0x0780 - 0x0000)
struct FAStruct_WeaponAnimContainer_Menu final
{
public:
	struct FAStruct_WeaponAnims_Menu              Atlas_41_7983DEBF4AD7A6A73F08BCBA6CF78288;         // 0x0000(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims_Menu              CoV_42_F229926049915AEDF28B79A2D018C54A;           // 0x00C0(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims_Menu              Dahl_43_555317F84779A4DBF101349769BE7837;          // 0x0180(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims_Menu              Hyperion_44_92D2563444D96BD6379D108794D7795D;      // 0x0240(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims_Menu              Jakobs_45_131E838143A6ED04C9BF87BFFF30AB9C;        // 0x0300(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims_Menu              Maliwan_46_74F57F794A655CE562217EBF9EE8F4FF;       // 0x03C0(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims_Menu              Tediore_47_2250107B4B6B2994C90581A79C1783F6;       // 0x0480(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims_Menu              Torgue_48_B1E5970E436F516BA32D2B9A595EAD65;        // 0x0540(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims_Menu              Vladof_49_31FF5A8E4EF20A81D7B8579220801E2E;        // 0x0600(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims_Menu              Eridian_52_57E1AA0244E3BC2A7F1F788E011C50E9;       // 0x06C0(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FAStruct_WeaponAnimContainer_Menu) == 0x000008, "Wrong alignment on FAStruct_WeaponAnimContainer_Menu");
static_assert(sizeof(FAStruct_WeaponAnimContainer_Menu) == 0x000780, "Wrong size on FAStruct_WeaponAnimContainer_Menu");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, Atlas_41_7983DEBF4AD7A6A73F08BCBA6CF78288) == 0x000000, "Member 'FAStruct_WeaponAnimContainer_Menu::Atlas_41_7983DEBF4AD7A6A73F08BCBA6CF78288' has a wrong offset!");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, CoV_42_F229926049915AEDF28B79A2D018C54A) == 0x0000C0, "Member 'FAStruct_WeaponAnimContainer_Menu::CoV_42_F229926049915AEDF28B79A2D018C54A' has a wrong offset!");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, Dahl_43_555317F84779A4DBF101349769BE7837) == 0x000180, "Member 'FAStruct_WeaponAnimContainer_Menu::Dahl_43_555317F84779A4DBF101349769BE7837' has a wrong offset!");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, Hyperion_44_92D2563444D96BD6379D108794D7795D) == 0x000240, "Member 'FAStruct_WeaponAnimContainer_Menu::Hyperion_44_92D2563444D96BD6379D108794D7795D' has a wrong offset!");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, Jakobs_45_131E838143A6ED04C9BF87BFFF30AB9C) == 0x000300, "Member 'FAStruct_WeaponAnimContainer_Menu::Jakobs_45_131E838143A6ED04C9BF87BFFF30AB9C' has a wrong offset!");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, Maliwan_46_74F57F794A655CE562217EBF9EE8F4FF) == 0x0003C0, "Member 'FAStruct_WeaponAnimContainer_Menu::Maliwan_46_74F57F794A655CE562217EBF9EE8F4FF' has a wrong offset!");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, Tediore_47_2250107B4B6B2994C90581A79C1783F6) == 0x000480, "Member 'FAStruct_WeaponAnimContainer_Menu::Tediore_47_2250107B4B6B2994C90581A79C1783F6' has a wrong offset!");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, Torgue_48_B1E5970E436F516BA32D2B9A595EAD65) == 0x000540, "Member 'FAStruct_WeaponAnimContainer_Menu::Torgue_48_B1E5970E436F516BA32D2B9A595EAD65' has a wrong offset!");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, Vladof_49_31FF5A8E4EF20A81D7B8579220801E2E) == 0x000600, "Member 'FAStruct_WeaponAnimContainer_Menu::Vladof_49_31FF5A8E4EF20A81D7B8579220801E2E' has a wrong offset!");
static_assert(offsetof(FAStruct_WeaponAnimContainer_Menu, Eridian_52_57E1AA0244E3BC2A7F1F788E011C50E9) == 0x0006C0, "Member 'FAStruct_WeaponAnimContainer_Menu::Eridian_52_57E1AA0244E3BC2A7F1F788E011C50E9' has a wrong offset!");

}

