#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ATBP_Perf_PlaceableActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ATBP_Perf_PlaceableActor.ATBP_Perf_PlaceableActor_C.bugitgo
// 0x01A0 (0x01A0 - 0x0000)
struct ATBP_Perf_PlaceableActor_C_bugitgo final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x004C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue1;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue2;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue3;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue4;          // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue5;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue10;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue11;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ATBP_Perf_PlaceableActor_C_bugitgo) == 0x000010, "Wrong alignment on ATBP_Perf_PlaceableActor_C_bugitgo");
static_assert(sizeof(ATBP_Perf_PlaceableActor_C_bugitgo) == 0x0001A0, "Wrong size on ATBP_Perf_PlaceableActor_C_bugitgo");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_BreakTransform_Location) == 0x000040, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_BreakTransform_Rotation) == 0x00004C, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_BreakTransform_Scale) == 0x000058, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_BreakRotator_Roll) == 0x000078, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_BreakRotator_Pitch) == 0x00007C, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_BreakRotator_Yaw) == 0x000080, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_BreakVector_X) == 0x000084, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_BreakVector_Y) == 0x000088, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_BreakVector_Z) == 0x00008C, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Conv_FloatToString_ReturnValue) == 0x000090, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Conv_FloatToString_ReturnValue1) == 0x0000A0, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Conv_FloatToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Conv_FloatToString_ReturnValue2) == 0x0000B0, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Conv_FloatToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Conv_FloatToString_ReturnValue3) == 0x0000C0, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Conv_FloatToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Conv_FloatToString_ReturnValue4) == 0x0000D0, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Conv_FloatToString_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue1) == 0x0000E0, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Conv_FloatToString_ReturnValue5) == 0x0000F0, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Conv_FloatToString_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue2) == 0x000100, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue3) == 0x000110, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue4) == 0x000120, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue5) == 0x000130, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue6) == 0x000140, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue7) == 0x000150, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue8) == 0x000160, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue8' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue9) == 0x000170, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue9' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue10) == 0x000180, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue10' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_bugitgo, CallFunc_Concat_StrStr_ReturnValue11) == 0x000190, "Member 'ATBP_Perf_PlaceableActor_C_bugitgo::CallFunc_Concat_StrStr_ReturnValue11' has a wrong offset!");

// Function ATBP_Perf_PlaceableActor.ATBP_Perf_PlaceableActor_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct ATBP_Perf_PlaceableActor_C_UserConstructionScript final
{
public:
	bool                                          ShouldReportIssues;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditorSession_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ATBP_Perf_PlaceableActor_C_UserConstructionScript) == 0x000008, "Wrong alignment on ATBP_Perf_PlaceableActor_C_UserConstructionScript");
static_assert(sizeof(ATBP_Perf_PlaceableActor_C_UserConstructionScript) == 0x000038, "Wrong size on ATBP_Perf_PlaceableActor_C_UserConstructionScript");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_UserConstructionScript, ShouldReportIssues) == 0x000000, "Member 'ATBP_Perf_PlaceableActor_C_UserConstructionScript::ShouldReportIssues' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'ATBP_Perf_PlaceableActor_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'ATBP_Perf_PlaceableActor_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ATBP_Perf_PlaceableActor_C_UserConstructionScript, CallFunc_IsEditorSession_ReturnValue) == 0x000030, "Member 'ATBP_Perf_PlaceableActor_C_UserConstructionScript::CallFunc_IsEditorSession_ReturnValue' has a wrong offset!");

}

