#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AttInit_M_VendingMachineRepair_SpineDrop

#include "Basic.hpp"


namespace SDK::Params
{

// Function AttInit_M_VendingMachineRepair_SpineDrop.AttInit_M_VendingMachineRepair_SpineDrop_C.CalculateAttributeInitialValue
// 0x0010 (0x0010 - 0x0000)
struct AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue");
static_assert(sizeof(AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue) == 0x000010, "Wrong size on AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue");
static_assert(offsetof(AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue, CallFunc_K2_EvaluateCondition_ReturnValue) == 0x00000C, "Member 'AttInit_M_VendingMachineRepair_SpineDrop_C_CalculateAttributeInitialValue::CallFunc_K2_EvaluateCondition_ReturnValue' has a wrong offset!");

}

