#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bosses_PerPlayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function Bosses_PerPlayer.Bosses_PerPlayer_C.CalculateAttributeInitialValue
// 0x0060 (0x0060 - 0x0000)
struct Bosses_PerPlayer_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MayhemLevel;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue1;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue2;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue1;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue2;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue3;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue5;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue6;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue7;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bosses_PerPlayer_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on Bosses_PerPlayer_C_CalculateAttributeInitialValue");
static_assert(sizeof(Bosses_PerPlayer_C_CalculateAttributeInitialValue) == 0x000060, "Wrong size on Bosses_PerPlayer_C_CalculateAttributeInitialValue");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, MayhemLevel) == 0x00000C, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::MayhemLevel' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000010, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000014, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_FTrunc_ReturnValue1) == 0x00001C, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_FTrunc_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, K2Node_SwitchInteger_CmpSuccess) == 0x000020, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, K2Node_SwitchInteger1_CmpSuccess) == 0x000021, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::K2Node_SwitchInteger1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, K2Node_SwitchInteger2_CmpSuccess) == 0x000022, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, K2Node_SwitchInteger3_CmpSuccess) == 0x000023, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::K2Node_SwitchInteger3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, K2Node_SwitchInteger4_CmpSuccess) == 0x000024, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::K2Node_SwitchInteger4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_GetValueOfAttribute_ReturnValue2) == 0x000028, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_GetValueOfAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_FMax_ReturnValue1) == 0x000034, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_FMax_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_FMax_ReturnValue2) == 0x000038, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_FMax_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_FMax_ReturnValue3) == 0x00003C, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_FMax_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000040, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000044, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000048, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_Add_FloatFloat_ReturnValue4) == 0x00004C, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_Add_FloatFloat_ReturnValue5) == 0x000050, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_Add_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_Add_FloatFloat_ReturnValue6) == 0x000054, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_Add_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Bosses_PerPlayer_C_CalculateAttributeInitialValue, CallFunc_Add_FloatFloat_ReturnValue7) == 0x000058, "Member 'Bosses_PerPlayer_C_CalculateAttributeInitialValue::CallFunc_Add_FloatFloat_ReturnValue7' has a wrong offset!");

}

