#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CE_NogMindControl

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CE_NogMindControl.BP_CE_NogMindControl_C.ExecuteUbergraph_BP_CE_NogMindControl
// 0x0028 (0x0028 - 0x0000)
struct BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl) == 0x000008, "Wrong alignment on BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl");
static_assert(sizeof(BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl) == 0x000028, "Wrong size on BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl");
static_assert(offsetof(BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl, EntryPoint) == 0x000000, "Member 'BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl, K2Node_Event_Actor1) == 0x000008, "Member 'BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl, K2Node_Event_ActionEndState) == 0x000010, "Member 'BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl, K2Node_Event_Actor) == 0x000018, "Member 'BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_CE_NogMindControl_C_ExecuteUbergraph_BP_CE_NogMindControl::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_CE_NogMindControl.BP_CE_NogMindControl_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_CE_NogMindControl_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CE_NogMindControl_C_OnEnd) == 0x000008, "Wrong alignment on BP_CE_NogMindControl_C_OnEnd");
static_assert(sizeof(BP_CE_NogMindControl_C_OnEnd) == 0x000010, "Wrong size on BP_CE_NogMindControl_C_OnEnd");
static_assert(offsetof(BP_CE_NogMindControl_C_OnEnd, ActionEndState) == 0x000000, "Member 'BP_CE_NogMindControl_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_OnEnd, Actor) == 0x000008, "Member 'BP_CE_NogMindControl_C_OnEnd::Actor' has a wrong offset!");

// Function BP_CE_NogMindControl.BP_CE_NogMindControl_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct BP_CE_NogMindControl_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CE_NogMindControl_C_OnBegin) == 0x000008, "Wrong alignment on BP_CE_NogMindControl_C_OnBegin");
static_assert(sizeof(BP_CE_NogMindControl_C_OnBegin) == 0x000008, "Wrong size on BP_CE_NogMindControl_C_OnBegin");
static_assert(offsetof(BP_CE_NogMindControl_C_OnBegin, Actor) == 0x000000, "Member 'BP_CE_NogMindControl_C_OnBegin::Actor' has a wrong offset!");

// Function BP_CE_NogMindControl.BP_CE_NogMindControl_C.MindControlGearSwap
// 0x0088 (0x0088 - 0x0000)
struct BP_CE_NogMindControl_C_MindControlGearSwap final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGestaltPartData_Mesh*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGestaltPartData_Mesh*                  CallFunc_Array_Get_Item1;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGestaltPartData_Mesh*                  CallFunc_Array_Get_Item2;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGestaltMeshPartVisible_ReturnValue;     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGestaltPartData_Mesh*                  CallFunc_Array_Get_Item3;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue1;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGestaltMeshPartVisible_ReturnValue1;    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CE_NogMindControl_C_MindControlGearSwap) == 0x000008, "Wrong alignment on BP_CE_NogMindControl_C_MindControlGearSwap");
static_assert(sizeof(BP_CE_NogMindControl_C_MindControlGearSwap) == 0x000088, "Wrong size on BP_CE_NogMindControl_C_MindControlGearSwap");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, Enable) == 0x000000, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::Enable' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, Temp_int_Loop_Counter_Variable1) == 0x00000C, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, Temp_int_Loop_Counter_Variable2) == 0x000010, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Add_IntInt_ReturnValue1) == 0x000014, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Add_IntInt_ReturnValue2) == 0x000018, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, Temp_int_Array_Index_Variable1) == 0x000020, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, Temp_int_Loop_Counter_Variable3) == 0x000024, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Add_IntInt_ReturnValue3) == 0x000028, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, Temp_int_Array_Index_Variable2) == 0x00002C, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_Length_ReturnValue1) == 0x000040, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Less_IntInt_ReturnValue1) == 0x000044, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, Temp_int_Array_Index_Variable3) == 0x000048, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_Get_Item1) == 0x000050, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_Get_Item2) == 0x000058, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_AddUnique_ReturnValue) == 0x000060, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_IsGestaltMeshPartVisible_ReturnValue) == 0x000064, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_IsGestaltMeshPartVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_Length_ReturnValue2) == 0x000068, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Less_IntInt_ReturnValue2) == 0x00006C, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_Get_Item3) == 0x000070, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_Length_ReturnValue3) == 0x000078, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Array_AddUnique_ReturnValue1) == 0x00007C, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Array_AddUnique_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_Less_IntInt_ReturnValue3) == 0x000080, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_CE_NogMindControl_C_MindControlGearSwap, CallFunc_IsGestaltMeshPartVisible_ReturnValue1) == 0x000081, "Member 'BP_CE_NogMindControl_C_MindControlGearSwap::CallFunc_IsGestaltMeshPartVisible_ReturnValue1' has a wrong offset!");

}

