#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CE_EnrageMod1_Player

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CE_EnrageMod1_Player.BP_CE_EnrageMod1_Player_C.ExecuteUbergraph_BP_CE_EnrageMod1_Player
// 0x0098 (0x0098 - 0x0000)
struct BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor2;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState1;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_bRes;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor3;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveStatusEffectInstance_ReturnValue;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0048(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0080(0x0018)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player) == 0x000008, "Wrong alignment on BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player");
static_assert(sizeof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player) == 0x000098, "Wrong size on BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, EntryPoint) == 0x000000, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, K2Node_Event_Actor2) == 0x000008, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::K2Node_Event_Actor2' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, K2Node_Event_ActionEndState1) == 0x000010, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::K2Node_Event_ActionEndState1' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, K2Node_Event_Actor1) == 0x000018, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, CallFunc_IsLocallyControlled_bRes) == 0x000020, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::CallFunc_IsLocallyControlled_bRes' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, K2Node_Event_Actor3) == 0x000028, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::K2Node_Event_Actor3' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, K2Node_Event_ActionEndState) == 0x000030, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, K2Node_Event_Actor) == 0x000038, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, CallFunc_RemoveStatusEffectInstance_ReturnValue) == 0x000040, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::CallFunc_RemoveStatusEffectInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, K2Node_MakeStruct_StatusEffectSpec) == 0x000048, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player, CallFunc_AddStatusEffect_ReturnValue) == 0x000080, "Member 'BP_CE_EnrageMod1_Player_C_ExecuteUbergraph_BP_CE_EnrageMod1_Player::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");

// Function BP_CE_EnrageMod1_Player.BP_CE_EnrageMod1_Player_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_CE_EnrageMod1_Player_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CE_EnrageMod1_Player_C_OnServerEnd) == 0x000008, "Wrong alignment on BP_CE_EnrageMod1_Player_C_OnServerEnd");
static_assert(sizeof(BP_CE_EnrageMod1_Player_C_OnServerEnd) == 0x000010, "Wrong size on BP_CE_EnrageMod1_Player_C_OnServerEnd");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'BP_CE_EnrageMod1_Player_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_OnServerEnd, Actor) == 0x000008, "Member 'BP_CE_EnrageMod1_Player_C_OnServerEnd::Actor' has a wrong offset!");

// Function BP_CE_EnrageMod1_Player.BP_CE_EnrageMod1_Player_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_CE_EnrageMod1_Player_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CE_EnrageMod1_Player_C_OnEnd) == 0x000008, "Wrong alignment on BP_CE_EnrageMod1_Player_C_OnEnd");
static_assert(sizeof(BP_CE_EnrageMod1_Player_C_OnEnd) == 0x000010, "Wrong size on BP_CE_EnrageMod1_Player_C_OnEnd");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_OnEnd, ActionEndState) == 0x000000, "Member 'BP_CE_EnrageMod1_Player_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_OnEnd, Actor) == 0x000008, "Member 'BP_CE_EnrageMod1_Player_C_OnEnd::Actor' has a wrong offset!");

// Function BP_CE_EnrageMod1_Player.BP_CE_EnrageMod1_Player_C.OnServerBegin
// 0x0008 (0x0008 - 0x0000)
struct BP_CE_EnrageMod1_Player_C_OnServerBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CE_EnrageMod1_Player_C_OnServerBegin) == 0x000008, "Wrong alignment on BP_CE_EnrageMod1_Player_C_OnServerBegin");
static_assert(sizeof(BP_CE_EnrageMod1_Player_C_OnServerBegin) == 0x000008, "Wrong size on BP_CE_EnrageMod1_Player_C_OnServerBegin");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_OnServerBegin, Actor) == 0x000000, "Member 'BP_CE_EnrageMod1_Player_C_OnServerBegin::Actor' has a wrong offset!");

// Function BP_CE_EnrageMod1_Player.BP_CE_EnrageMod1_Player_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct BP_CE_EnrageMod1_Player_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CE_EnrageMod1_Player_C_OnBegin) == 0x000008, "Wrong alignment on BP_CE_EnrageMod1_Player_C_OnBegin");
static_assert(sizeof(BP_CE_EnrageMod1_Player_C_OnBegin) == 0x000008, "Wrong size on BP_CE_EnrageMod1_Player_C_OnBegin");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_OnBegin, Actor) == 0x000000, "Member 'BP_CE_EnrageMod1_Player_C_OnBegin::Actor' has a wrong offset!");

// Function BP_CE_EnrageMod1_Player.BP_CE_EnrageMod1_Player_C.IsLocallyControlled
// 0x0020 (0x0020 - 0x0000)
struct BP_CE_EnrageMod1_Player_C_IsLocallyControlled final
{
public:
	bool                                          bRes;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_K2_GetActor_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CE_EnrageMod1_Player_C_IsLocallyControlled) == 0x000008, "Wrong alignment on BP_CE_EnrageMod1_Player_C_IsLocallyControlled");
static_assert(sizeof(BP_CE_EnrageMod1_Player_C_IsLocallyControlled) == 0x000020, "Wrong size on BP_CE_EnrageMod1_Player_C_IsLocallyControlled");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_IsLocallyControlled, bRes) == 0x000000, "Member 'BP_CE_EnrageMod1_Player_C_IsLocallyControlled::bRes' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_IsLocallyControlled, CallFunc_K2_GetActor_ReturnValue) == 0x000008, "Member 'BP_CE_EnrageMod1_Player_C_IsLocallyControlled::CallFunc_K2_GetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_IsLocallyControlled, K2Node_DynamicCast_AsPawn) == 0x000010, "Member 'BP_CE_EnrageMod1_Player_C_IsLocallyControlled::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_IsLocallyControlled, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CE_EnrageMod1_Player_C_IsLocallyControlled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CE_EnrageMod1_Player_C_IsLocallyControlled, CallFunc_IsLocallyControlled_ReturnValue) == 0x000019, "Member 'BP_CE_EnrageMod1_Player_C_IsLocallyControlled::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

}

