#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CrazyEarlDoor

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"
#include "GbxInventory_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.EnableBling
// 0x0001 (0x0001 - 0x0000)
struct BP_CrazyEarlDoor_C_EnableBling final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrazyEarlDoor_C_EnableBling) == 0x000001, "Wrong alignment on BP_CrazyEarlDoor_C_EnableBling");
static_assert(sizeof(BP_CrazyEarlDoor_C_EnableBling) == 0x000001, "Wrong size on BP_CrazyEarlDoor_C_EnableBling");
static_assert(offsetof(BP_CrazyEarlDoor_C_EnableBling, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_CrazyEarlDoor_C_EnableBling::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.__UserState_CrazyEarlDoor_0
// 0x0001 (0x0001 - 0x0000)
struct BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_0 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_0) == 0x000001, "Wrong alignment on BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_0");
static_assert(sizeof(BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_0) == 0x000001, "Wrong size on BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_0");
static_assert(offsetof(BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_0, bFromLoad) == 0x000000, "Member 'BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_0::bFromLoad' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.__UserState_CrazyEarlDoor_1
// 0x0001 (0x0001 - 0x0000)
struct BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_1) == 0x000001, "Wrong alignment on BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_1");
static_assert(sizeof(BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_1) == 0x000001, "Wrong size on BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_1");
static_assert(offsetof(BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_1, bFromLoad) == 0x000000, "Member 'BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_1::bFromLoad' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.OnPlayerBeginInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_CrazyEarlDoor_C_OnPlayerBeginInteraction final
{
public:
	class AOakPlayerController*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_OnPlayerBeginInteraction) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_OnPlayerBeginInteraction");
static_assert(sizeof(BP_CrazyEarlDoor_C_OnPlayerBeginInteraction) == 0x000008, "Wrong size on BP_CrazyEarlDoor_C_OnPlayerBeginInteraction");
static_assert(offsetof(BP_CrazyEarlDoor_C_OnPlayerBeginInteraction, Player) == 0x000000, "Member 'BP_CrazyEarlDoor_C_OnPlayerBeginInteraction::Player' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.OnPlayerStopInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_CrazyEarlDoor_C_OnPlayerStopInteraction final
{
public:
	class AOakPlayerController*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_OnPlayerStopInteraction) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_OnPlayerStopInteraction");
static_assert(sizeof(BP_CrazyEarlDoor_C_OnPlayerStopInteraction) == 0x000008, "Wrong size on BP_CrazyEarlDoor_C_OnPlayerStopInteraction");
static_assert(offsetof(BP_CrazyEarlDoor_C_OnPlayerStopInteraction, Player) == 0x000000, "Member 'BP_CrazyEarlDoor_C_OnPlayerStopInteraction::Player' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.OnPlayerEnteredInteractRange
// 0x0008 (0x0008 - 0x0000)
struct BP_CrazyEarlDoor_C_OnPlayerEnteredInteractRange final
{
public:
	class AOakPlayerController*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_OnPlayerEnteredInteractRange) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_OnPlayerEnteredInteractRange");
static_assert(sizeof(BP_CrazyEarlDoor_C_OnPlayerEnteredInteractRange) == 0x000008, "Wrong size on BP_CrazyEarlDoor_C_OnPlayerEnteredInteractRange");
static_assert(offsetof(BP_CrazyEarlDoor_C_OnPlayerEnteredInteractRange, Player) == 0x000000, "Member 'BP_CrazyEarlDoor_C_OnPlayerEnteredInteractRange::Player' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.OnPlayerExitedInteractRange
// 0x0008 (0x0008 - 0x0000)
struct BP_CrazyEarlDoor_C_OnPlayerExitedInteractRange final
{
public:
	class AOakPlayerController*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_OnPlayerExitedInteractRange) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_OnPlayerExitedInteractRange");
static_assert(sizeof(BP_CrazyEarlDoor_C_OnPlayerExitedInteractRange) == 0x000008, "Wrong size on BP_CrazyEarlDoor_C_OnPlayerExitedInteractRange");
static_assert(offsetof(BP_CrazyEarlDoor_C_OnPlayerExitedInteractRange, Player) == 0x000000, "Member 'BP_CrazyEarlDoor_C_OnPlayerExitedInteractRange::Player' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor
// 0x0010 (0x0010 - 0x0000)
struct BP_CrazyEarlDoor_C_BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor");
static_assert(sizeof(BP_CrazyEarlDoor_C_BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor) == 0x000010, "Wrong size on BP_CrazyEarlDoor_C_BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor");
static_assert(offsetof(BP_CrazyEarlDoor_C_BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor, UserController) == 0x000000, "Member 'BP_CrazyEarlDoor_C_BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor::UserController' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor, UsedComponent) == 0x000008, "Member 'BP_CrazyEarlDoor_C_BndEvt__UsableMission_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor::UsedComponent' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.__UserState_EarlUsableState_2
// 0x0001 (0x0001 - 0x0000)
struct BP_CrazyEarlDoor_C___UserState_EarlUsableState_2 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrazyEarlDoor_C___UserState_EarlUsableState_2) == 0x000001, "Wrong alignment on BP_CrazyEarlDoor_C___UserState_EarlUsableState_2");
static_assert(sizeof(BP_CrazyEarlDoor_C___UserState_EarlUsableState_2) == 0x000001, "Wrong size on BP_CrazyEarlDoor_C___UserState_EarlUsableState_2");
static_assert(offsetof(BP_CrazyEarlDoor_C___UserState_EarlUsableState_2, bFromLoad) == 0x000000, "Member 'BP_CrazyEarlDoor_C___UserState_EarlUsableState_2::bFromLoad' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.__UserState_EarlUsableState_1
// 0x0001 (0x0001 - 0x0000)
struct BP_CrazyEarlDoor_C___UserState_EarlUsableState_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrazyEarlDoor_C___UserState_EarlUsableState_1) == 0x000001, "Wrong alignment on BP_CrazyEarlDoor_C___UserState_EarlUsableState_1");
static_assert(sizeof(BP_CrazyEarlDoor_C___UserState_EarlUsableState_1) == 0x000001, "Wrong size on BP_CrazyEarlDoor_C___UserState_EarlUsableState_1");
static_assert(offsetof(BP_CrazyEarlDoor_C___UserState_EarlUsableState_1, bFromLoad) == 0x000000, "Member 'BP_CrazyEarlDoor_C___UserState_EarlUsableState_1::bFromLoad' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.__UserState_EarlUsableState_0
// 0x0001 (0x0001 - 0x0000)
struct BP_CrazyEarlDoor_C___UserState_EarlUsableState_0 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrazyEarlDoor_C___UserState_EarlUsableState_0) == 0x000001, "Wrong alignment on BP_CrazyEarlDoor_C___UserState_EarlUsableState_0");
static_assert(sizeof(BP_CrazyEarlDoor_C___UserState_EarlUsableState_0) == 0x000001, "Wrong size on BP_CrazyEarlDoor_C___UserState_EarlUsableState_0");
static_assert(offsetof(BP_CrazyEarlDoor_C___UserState_EarlUsableState_0, bFromLoad) == 0x000000, "Member 'BP_CrazyEarlDoor_C___UserState_EarlUsableState_0::bFromLoad' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.__UserState_EarlBlingState_1
// 0x0001 (0x0001 - 0x0000)
struct BP_CrazyEarlDoor_C___UserState_EarlBlingState_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrazyEarlDoor_C___UserState_EarlBlingState_1) == 0x000001, "Wrong alignment on BP_CrazyEarlDoor_C___UserState_EarlBlingState_1");
static_assert(sizeof(BP_CrazyEarlDoor_C___UserState_EarlBlingState_1) == 0x000001, "Wrong size on BP_CrazyEarlDoor_C___UserState_EarlBlingState_1");
static_assert(offsetof(BP_CrazyEarlDoor_C___UserState_EarlBlingState_1, bFromLoad) == 0x000000, "Member 'BP_CrazyEarlDoor_C___UserState_EarlBlingState_1::bFromLoad' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor
// 0x0010 (0x0010 - 0x0000)
struct BP_CrazyEarlDoor_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor");
static_assert(sizeof(BP_CrazyEarlDoor_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor) == 0x000010, "Wrong size on BP_CrazyEarlDoor_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor");
static_assert(offsetof(BP_CrazyEarlDoor_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor, UserController) == 0x000000, "Member 'BP_CrazyEarlDoor_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor::UserController' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor, UsedComponent) == 0x000008, "Member 'BP_CrazyEarlDoor_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_CrazyEarlDoor::UsedComponent' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.OnPurchase
// 0x0008 (0x0008 - 0x0000)
struct BP_CrazyEarlDoor_C_OnPurchase final
{
public:
	class UOakCustomizationData*                  PurchasedItem_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_OnPurchase) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_OnPurchase");
static_assert(sizeof(BP_CrazyEarlDoor_C_OnPurchase) == 0x000008, "Wrong size on BP_CrazyEarlDoor_C_OnPurchase");
static_assert(offsetof(BP_CrazyEarlDoor_C_OnPurchase, PurchasedItem_0) == 0x000000, "Member 'BP_CrazyEarlDoor_C_OnPurchase::PurchasedItem_0' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.__UserState_CrazyEarlDoor_2
// 0x0001 (0x0001 - 0x0000)
struct BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_2 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_2) == 0x000001, "Wrong alignment on BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_2");
static_assert(sizeof(BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_2) == 0x000001, "Wrong size on BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_2");
static_assert(offsetof(BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_2, bFromLoad) == 0x000000, "Member 'BP_CrazyEarlDoor_C___UserState_CrazyEarlDoor_2::bFromLoad' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.Earl Spawned
// 0x0010 (0x0010 - 0x0000)
struct BP_CrazyEarlDoor_C_Earl_Spawned final
{
public:
	class ASpawner*                               Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_Earl_Spawned) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_Earl_Spawned");
static_assert(sizeof(BP_CrazyEarlDoor_C_Earl_Spawned) == 0x000010, "Wrong size on BP_CrazyEarlDoor_C_Earl_Spawned");
static_assert(offsetof(BP_CrazyEarlDoor_C_Earl_Spawned, Spawner) == 0x000000, "Member 'BP_CrazyEarlDoor_C_Earl_Spawned::Spawner' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_Earl_Spawned, Actor) == 0x000008, "Member 'BP_CrazyEarlDoor_C_Earl_Spawned::Actor' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.ExecuteUbergraph_BP_CrazyEarlDoor
// 0x0528 (0x0528 - 0x0000)
struct BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ASpawner* Spawner, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_UserStateEvent_bFromLoad6;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad5;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_Event_Player3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_Event_Player2;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_Event_Player1;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_Event_Player;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue1;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue1;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0088(0x0218)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x02A4(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_ComponentBoundEvent_UserController1;        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent1;         // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_UserStateEvent_bFromLoad4;                  // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad3;                  // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad2;                  // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x02D0(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult1;   // 0x0360(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult2;   // 0x03F0(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x0480(0x0018)()
	bool                                          K2Node_UserStateEvent_bFromLoad1;                  // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue1;           // 0x04A0(0x0018)()
	class AController*                            K2Node_ComponentBoundEvent_UserController;         // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent;          // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryListComponent*                CallFunc_GetInventoryComponent_ReturnValue;        // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakCustomizationData*                  K2Node_Event_PurchasedItem;                        // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInventoryListEntryHandle>      CallFunc_GetInventoryHandlesOfType_ItemHandleList; // 0x04E8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FInventoryListEntryHandle              CallFunc_Array_Get_Item;                           // 0x04F8(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue; // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0502(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0503(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad;                   // 0x0504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_505[0x3];                                      // 0x0505(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpawner*                               K2Node_CustomEvent_Spawner;                        // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor");
static_assert(sizeof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor) == 0x000528, "Wrong size on BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, EntryPoint) == 0x000000, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_UserStateEvent_bFromLoad6) == 0x00001C, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_UserStateEvent_bFromLoad6' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_UserStateEvent_bFromLoad5) == 0x00001D, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_UserStateEvent_bFromLoad5' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_Event_Player3) == 0x000020, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_Event_Player3' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_Event_Player2) == 0x000030, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_Event_Player2' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_Event_Player1) == 0x000040, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_Event_Player1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Array_AddUnique_ReturnValue) == 0x000048, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_IsValid_ReturnValue1) == 0x00004C, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_Event_Player) == 0x000058, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Array_RemoveItem_ReturnValue) == 0x000060, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000064, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Array_RemoveItem_ReturnValue1) == 0x000070, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Array_RemoveItem_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Array_AddUnique_ReturnValue1) == 0x000074, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Array_AddUnique_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Array_Length_ReturnValue1) == 0x00007C, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x000081, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_NewDialogContext_ReturnValue) == 0x000088, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_BooleanAND_ReturnValue) == 0x0002A0, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_FinishTriggerDialog_Conversation) == 0x0002A4, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_FinishTriggerDialog_SequenceID) == 0x0002B0, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_FinishTriggerDialog_ReturnValue) == 0x0002B4, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Conv_IntToBool_ReturnValue) == 0x0002B5, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_ComponentBoundEvent_UserController1) == 0x0002B8, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_ComponentBoundEvent_UserController1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_ComponentBoundEvent_UsedComponent1) == 0x0002C0, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_ComponentBoundEvent_UsedComponent1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_UserStateEvent_bFromLoad4) == 0x0002C8, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_UserStateEvent_bFromLoad4' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_UserStateEvent_bFromLoad3) == 0x0002C9, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_UserStateEvent_bFromLoad3' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_UserStateEvent_bFromLoad2) == 0x0002CA, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_UserStateEvent_bFromLoad2' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0002D0, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_K2_SetRelativeLocation_SweepHitResult1) == 0x000360, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_K2_SetRelativeLocation_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_K2_SetRelativeLocation_SweepHitResult2) == 0x0003F0, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_K2_SetRelativeLocation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_PostAttachedEvent_ReturnValue) == 0x000480, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_UserStateEvent_bFromLoad1) == 0x000498, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_UserStateEvent_bFromLoad1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_PostAttachedEvent_ReturnValue1) == 0x0004A0, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_PostAttachedEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_ComponentBoundEvent_UserController) == 0x0004B8, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_ComponentBoundEvent_UserController' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_ComponentBoundEvent_UsedComponent) == 0x0004C0, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_ComponentBoundEvent_UsedComponent' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_DynamicCast_AsOak_Player_Controller) == 0x0004C8, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_DynamicCast_bSuccess) == 0x0004D0, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_GetInventoryComponent_ReturnValue) == 0x0004D8, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_GetInventoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_Event_PurchasedItem) == 0x0004E0, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_Event_PurchasedItem' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_GetInventoryHandlesOfType_ItemHandleList) == 0x0004E8, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_GetInventoryHandlesOfType_ItemHandleList' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Array_Get_Item) == 0x0004F8, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Array_Length_ReturnValue2) == 0x0004FC, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_Less_IntInt_ReturnValue) == 0x000500, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_GetMissionObjectiveStatusRef_ReturnValue) == 0x000501, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_GetMissionObjectiveStatusRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, CallFunc_HasAuthority_ReturnValue) == 0x000502, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_SwitchEnum_CmpSuccess) == 0x000503, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_UserStateEvent_bFromLoad) == 0x000504, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_UserStateEvent_bFromLoad' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_CustomEvent_Spawner) == 0x000508, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_CustomEvent_Spawner' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_CustomEvent_Actor) == 0x000510, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_DynamicCast_AsOak_Character) == 0x000518, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor, K2Node_DynamicCast_bSuccess1) == 0x000520, "Member 'BP_CrazyEarlDoor_C_ExecuteUbergraph_BP_CrazyEarlDoor::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.OpenDoorSlide__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_CrazyEarlDoor_C_OpenDoorSlide__DelegateSignature final
{
public:
	class AOakCharacter*                          CrazyEarl_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_OpenDoorSlide__DelegateSignature) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_OpenDoorSlide__DelegateSignature");
static_assert(sizeof(BP_CrazyEarlDoor_C_OpenDoorSlide__DelegateSignature) == 0x000008, "Wrong size on BP_CrazyEarlDoor_C_OpenDoorSlide__DelegateSignature");
static_assert(offsetof(BP_CrazyEarlDoor_C_OpenDoorSlide__DelegateSignature, CrazyEarl_0) == 0x000000, "Member 'BP_CrazyEarlDoor_C_OpenDoorSlide__DelegateSignature::CrazyEarl_0' has a wrong offset!");

// Function BP_CrazyEarlDoor.BP_CrazyEarlDoor_C.ExitedMenu__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_CrazyEarlDoor_C_ExitedMenu__DelegateSignature final
{
public:
	bool                                          PurchasedSomething;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CrazyEarl_0;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CrazyEarlDoor_C_ExitedMenu__DelegateSignature) == 0x000008, "Wrong alignment on BP_CrazyEarlDoor_C_ExitedMenu__DelegateSignature");
static_assert(sizeof(BP_CrazyEarlDoor_C_ExitedMenu__DelegateSignature) == 0x000010, "Wrong size on BP_CrazyEarlDoor_C_ExitedMenu__DelegateSignature");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExitedMenu__DelegateSignature, PurchasedSomething) == 0x000000, "Member 'BP_CrazyEarlDoor_C_ExitedMenu__DelegateSignature::PurchasedSomething' has a wrong offset!");
static_assert(offsetof(BP_CrazyEarlDoor_C_ExitedMenu__DelegateSignature, CrazyEarl_0) == 0x000008, "Member 'BP_CrazyEarlDoor_C_ExitedMenu__DelegateSignature::CrazyEarl_0' has a wrong offset!");

}

