#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CatchARide_Platform

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CatchARide_Platform.BP_CatchARide_Platform_C
// 0x0020 (0x04D8 - 0x04B8)
class ABP_CatchARide_Platform_C final : public ACatchARidePlatform
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(Transient, DuplicateTransient)
	class UGbxChildActorComponent*                GbxChildActor;                                     // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   VehicleScanned;                                    // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UserConstructionScript();
	void DigistructIn(bool bIsScanning);
	void DigistructOut();
	void StopScanFeedback();
	void ExecuteUbergraph_BP_CatchARide_Platform(int32 EntryPoint);
	void VehicleScanned__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CatchARide_Platform_C">();
	}
	static class ABP_CatchARide_Platform_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CatchARide_Platform_C>();
	}
};
static_assert(alignof(ABP_CatchARide_Platform_C) == 0x000008, "Wrong alignment on ABP_CatchARide_Platform_C");
static_assert(sizeof(ABP_CatchARide_Platform_C) == 0x0004D8, "Wrong size on ABP_CatchARide_Platform_C");
static_assert(offsetof(ABP_CatchARide_Platform_C, UberGraphFrame) == 0x0004B8, "Member 'ABP_CatchARide_Platform_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CatchARide_Platform_C, GbxChildActor) == 0x0004C0, "Member 'ABP_CatchARide_Platform_C::GbxChildActor' has a wrong offset!");
static_assert(offsetof(ABP_CatchARide_Platform_C, VehicleScanned) == 0x0004C8, "Member 'ABP_CatchARide_Platform_C::VehicleScanned' has a wrong offset!");

}

