#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Challenge_CharacterSpecific_FinishGame

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Challenge_CharacterSpecific_FinishGame.BP_Challenge_CharacterSpecific_FinishGame_C.ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame
// 0x0018 (0x0018 - 0x0000)
struct BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AGbxPlayerController*             K2Node_Event_CompletedPlayer;                      // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerGuardianRankComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame) == 0x000008, "Wrong alignment on BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame");
static_assert(sizeof(BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame) == 0x000018, "Wrong size on BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame");
static_assert(offsetof(BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame, EntryPoint) == 0x000000, "Member 'BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame, K2Node_Event_CompletedPlayer) == 0x000008, "Member 'BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame::K2Node_Event_CompletedPlayer' has a wrong offset!");
static_assert(offsetof(BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_Challenge_CharacterSpecific_FinishGame_C_ExecuteUbergraph_BP_Challenge_CharacterSpecific_FinishGame::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_Challenge_CharacterSpecific_FinishGame.BP_Challenge_CharacterSpecific_FinishGame_C.CompletedChallenge
// 0x0008 (0x0008 - 0x0000)
struct BP_Challenge_CharacterSpecific_FinishGame_C_CompletedChallenge final
{
public:
	const class AGbxPlayerController*             CompletedPlayer;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Challenge_CharacterSpecific_FinishGame_C_CompletedChallenge) == 0x000008, "Wrong alignment on BP_Challenge_CharacterSpecific_FinishGame_C_CompletedChallenge");
static_assert(sizeof(BP_Challenge_CharacterSpecific_FinishGame_C_CompletedChallenge) == 0x000008, "Wrong size on BP_Challenge_CharacterSpecific_FinishGame_C_CompletedChallenge");
static_assert(offsetof(BP_Challenge_CharacterSpecific_FinishGame_C_CompletedChallenge, CompletedPlayer) == 0x000000, "Member 'BP_Challenge_CharacterSpecific_FinishGame_C_CompletedChallenge::CompletedPlayer' has a wrong offset!");

// Function BP_Challenge_CharacterSpecific_FinishGame.BP_Challenge_CharacterSpecific_FinishGame_C.SetBinds
// 0x0030 (0x0030 - 0x0000)
struct BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds final
{
public:
	class AOakCharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BindSet;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UOakPlayerMissionComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds) == 0x000008, "Wrong alignment on BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds");
static_assert(sizeof(BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds) == 0x000030, "Wrong size on BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds");
static_assert(offsetof(BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds, Character) == 0x000000, "Member 'BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds::Character' has a wrong offset!");
static_assert(offsetof(BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds, BindSet) == 0x000008, "Member 'BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds::BindSet' has a wrong offset!");
static_assert(offsetof(BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Challenge_CharacterSpecific_FinishGame_C_SetBinds::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

