#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CE_OperativeCannon_Digistruct_Out

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CE_OperativeCannon_Digistruct_Out.BP_CE_OperativeCannon_Digistruct_Out_C.ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out
// 0x0028 (0x0028 - 0x0000)
struct BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInterface_IO_Operative_ShoulderCannon_C> K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OperativeShoulderCannonDigistructFinished_Res; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out) == 0x000008, "Wrong alignment on BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out");
static_assert(sizeof(BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out) == 0x000028, "Wrong size on BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out");
static_assert(offsetof(BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out, EntryPoint) == 0x000000, "Member 'BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out, K2Node_Event_ActionEndState) == 0x000004, "Member 'BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out, K2Node_Event_Actor) == 0x000008, "Member 'BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out, K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon) == 0x000010, "Member 'BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out::K2Node_DynamicCast_AsInterface_IO_Operative_Shoulder_Cannon' has a wrong offset!");
static_assert(offsetof(BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out, CallFunc_OperativeShoulderCannonDigistructFinished_Res) == 0x000021, "Member 'BP_CE_OperativeCannon_Digistruct_Out_C_ExecuteUbergraph_BP_CE_OperativeCannon_Digistruct_Out::CallFunc_OperativeShoulderCannonDigistructFinished_Res' has a wrong offset!");

// Function BP_CE_OperativeCannon_Digistruct_Out.BP_CE_OperativeCannon_Digistruct_Out_C.OnServerEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_CE_OperativeCannon_Digistruct_Out_C_OnServerEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CE_OperativeCannon_Digistruct_Out_C_OnServerEnd) == 0x000008, "Wrong alignment on BP_CE_OperativeCannon_Digistruct_Out_C_OnServerEnd");
static_assert(sizeof(BP_CE_OperativeCannon_Digistruct_Out_C_OnServerEnd) == 0x000010, "Wrong size on BP_CE_OperativeCannon_Digistruct_Out_C_OnServerEnd");
static_assert(offsetof(BP_CE_OperativeCannon_Digistruct_Out_C_OnServerEnd, ActionEndState) == 0x000000, "Member 'BP_CE_OperativeCannon_Digistruct_Out_C_OnServerEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(BP_CE_OperativeCannon_Digistruct_Out_C_OnServerEnd, Actor) == 0x000008, "Member 'BP_CE_OperativeCannon_Digistruct_Out_C_OnServerEnd::Actor' has a wrong offset!");

}

