#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Challenge_Console_PlanetDiscovery

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Challenge_Console_PlanetDiscovery.BP_Challenge_Console_PlanetDiscovery_C.ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery
// 0x0070 (0x0070 - 0x0000)
struct BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText DisplayText, class UWwiseEvent* DiscoverySound)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UChallengesComponent*                   K2Node_Event_OwningChallenges;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_Event_AssociatedCharacter;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_DisplayText;                    // 0x0028(0x0018)()
	class UWwiseEvent*                            K2Node_CustomEvent_DiscoverySound;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWorldDiscoveryAreaCounts_TotalWorldDiscoveryAreas; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWorldDiscoveryAreaCounts_FoundWorldDiscoveryAreas; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDiscoveryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery) == 0x000008, "Wrong alignment on BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery");
static_assert(sizeof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery) == 0x000070, "Wrong size on BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, EntryPoint) == 0x000000, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, K2Node_Event_OwningChallenges) == 0x000018, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::K2Node_Event_OwningChallenges' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, K2Node_Event_AssociatedCharacter) == 0x000020, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::K2Node_Event_AssociatedCharacter' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, K2Node_CustomEvent_DisplayText) == 0x000028, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::K2Node_CustomEvent_DisplayText' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, K2Node_CustomEvent_DiscoverySound) == 0x000040, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::K2Node_CustomEvent_DiscoverySound' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000050, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, CallFunc_GetWorldDiscoveryAreaCounts_TotalWorldDiscoveryAreas) == 0x00005C, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::CallFunc_GetWorldDiscoveryAreaCounts_TotalWorldDiscoveryAreas' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, CallFunc_GetWorldDiscoveryAreaCounts_FoundWorldDiscoveryAreas) == 0x000060, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::CallFunc_GetWorldDiscoveryAreaCounts_FoundWorldDiscoveryAreas' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery, CallFunc_GetComponentByClass_ReturnValue) == 0x000068, "Member 'BP_Challenge_Console_PlanetDiscovery_C_ExecuteUbergraph_BP_Challenge_Console_PlanetDiscovery::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_Challenge_Console_PlanetDiscovery.BP_Challenge_Console_PlanetDiscovery_C.AreaDiscovered
// 0x0020 (0x0020 - 0x0000)
struct BP_Challenge_Console_PlanetDiscovery_C_AreaDiscovered final
{
public:
	class FText                                   DisplayText;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWwiseEvent*                            DiscoverySound;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Challenge_Console_PlanetDiscovery_C_AreaDiscovered) == 0x000008, "Wrong alignment on BP_Challenge_Console_PlanetDiscovery_C_AreaDiscovered");
static_assert(sizeof(BP_Challenge_Console_PlanetDiscovery_C_AreaDiscovered) == 0x000020, "Wrong size on BP_Challenge_Console_PlanetDiscovery_C_AreaDiscovered");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_AreaDiscovered, DisplayText) == 0x000000, "Member 'BP_Challenge_Console_PlanetDiscovery_C_AreaDiscovered::DisplayText' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_AreaDiscovered, DiscoverySound) == 0x000018, "Member 'BP_Challenge_Console_PlanetDiscovery_C_AreaDiscovered::DiscoverySound' has a wrong offset!");

// Function BP_Challenge_Console_PlanetDiscovery.BP_Challenge_Console_PlanetDiscovery_C.OnInitChallengeInstance
// 0x0010 (0x0010 - 0x0000)
struct BP_Challenge_Console_PlanetDiscovery_C_OnInitChallengeInstance final
{
public:
	class UChallengesComponent*                   OwningChallenges;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          AssociatedCharacter;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Challenge_Console_PlanetDiscovery_C_OnInitChallengeInstance) == 0x000008, "Wrong alignment on BP_Challenge_Console_PlanetDiscovery_C_OnInitChallengeInstance");
static_assert(sizeof(BP_Challenge_Console_PlanetDiscovery_C_OnInitChallengeInstance) == 0x000010, "Wrong size on BP_Challenge_Console_PlanetDiscovery_C_OnInitChallengeInstance");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_OnInitChallengeInstance, OwningChallenges) == 0x000000, "Member 'BP_Challenge_Console_PlanetDiscovery_C_OnInitChallengeInstance::OwningChallenges' has a wrong offset!");
static_assert(offsetof(BP_Challenge_Console_PlanetDiscovery_C_OnInitChallengeInstance, AssociatedCharacter) == 0x000008, "Member 'BP_Challenge_Console_PlanetDiscovery_C_OnInitChallengeInstance::AssociatedCharacter' has a wrong offset!");

}

