#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CatchARide_HijackDestinationStation

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CatchARide_HijackDestinationStation.BP_CatchARide_HijackDestinationStation_C.ExecuteUbergraph_BP_CatchARide_HijackDestinationStation
// 0x00A8 (0x00A8 - 0x0000)
struct BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPawnAttachSlotComponent* PawnAttachSlotComponent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UPawnAttachSlotComponent*         K2Node_CustomEvent_PawnAttachSlotComponent1;       // 0x0020(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_OakVehicle_C*                       K2Node_DynamicCast_AsBP_Oak_Vehicle;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVehicleScannable_ReturnValue;           // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPawnAttachSlotComponent*         K2Node_CustomEvent_PawnAttachSlotComponent;        // 0x0068(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_CustomEvent_NewCharacter;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGbxCharacter* NewCharacter)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character1;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPawnAttachSlotComponent* PawnAttachSlotComponent)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation) == 0x000008, "Wrong alignment on BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation");
static_assert(sizeof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation) == 0x0000A8, "Wrong size on BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, EntryPoint) == 0x000000, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_CustomEvent_PawnAttachSlotComponent1) == 0x000020, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_CustomEvent_PawnAttachSlotComponent1' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000028, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, CallFunc_GetOwner_ReturnValue1) == 0x000038, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, CallFunc_GetAssociatedCharacter_ReturnValue) == 0x000040, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::CallFunc_GetAssociatedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_DynamicCast_AsBP_Oak_Vehicle) == 0x000048, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_DynamicCast_AsBP_Oak_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_DynamicCast_AsOak_Character) == 0x000058, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, CallFunc_IsVehicleScannable_ReturnValue) == 0x000062, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::CallFunc_IsVehicleScannable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, CallFunc_BooleanAND_ReturnValue) == 0x000063, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_CustomEvent_PawnAttachSlotComponent) == 0x000068, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_CustomEvent_PawnAttachSlotComponent' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_CustomEvent_NewCharacter) == 0x000070, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_CustomEvent_NewCharacter' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_CreateDelegate_OutputDelegate1) == 0x000078, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_DynamicCast_AsOak_Character1) == 0x000088, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_DynamicCast_AsOak_Character1' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_DynamicCast_bSuccess3) == 0x000090, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, CallFunc_HasAuthority_ReturnValue) == 0x000091, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation, K2Node_CreateDelegate_OutputDelegate2) == 0x000098, "Member 'BP_CatchARide_HijackDestinationStation_C_ExecuteUbergraph_BP_CatchARide_HijackDestinationStation::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function BP_CatchARide_HijackDestinationStation.BP_CatchARide_HijackDestinationStation_C.EnteredVehicle
// 0x0008 (0x0008 - 0x0000)
struct BP_CatchARide_HijackDestinationStation_C_EnteredVehicle final
{
public:
	const class UPawnAttachSlotComponent*         PawnAttachSlotComponent;                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CatchARide_HijackDestinationStation_C_EnteredVehicle) == 0x000008, "Wrong alignment on BP_CatchARide_HijackDestinationStation_C_EnteredVehicle");
static_assert(sizeof(BP_CatchARide_HijackDestinationStation_C_EnteredVehicle) == 0x000008, "Wrong size on BP_CatchARide_HijackDestinationStation_C_EnteredVehicle");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_EnteredVehicle, PawnAttachSlotComponent) == 0x000000, "Member 'BP_CatchARide_HijackDestinationStation_C_EnteredVehicle::PawnAttachSlotComponent' has a wrong offset!");

// Function BP_CatchARide_HijackDestinationStation.BP_CatchARide_HijackDestinationStation_C.ExitedVehicle
// 0x0008 (0x0008 - 0x0000)
struct BP_CatchARide_HijackDestinationStation_C_ExitedVehicle final
{
public:
	const class UPawnAttachSlotComponent*         PawnAttachSlotComponent;                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CatchARide_HijackDestinationStation_C_ExitedVehicle) == 0x000008, "Wrong alignment on BP_CatchARide_HijackDestinationStation_C_ExitedVehicle");
static_assert(sizeof(BP_CatchARide_HijackDestinationStation_C_ExitedVehicle) == 0x000008, "Wrong size on BP_CatchARide_HijackDestinationStation_C_ExitedVehicle");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_ExitedVehicle, PawnAttachSlotComponent) == 0x000000, "Member 'BP_CatchARide_HijackDestinationStation_C_ExitedVehicle::PawnAttachSlotComponent' has a wrong offset!");

// Function BP_CatchARide_HijackDestinationStation.BP_CatchARide_HijackDestinationStation_C.SetupForCharacter
// 0x0008 (0x0008 - 0x0000)
struct BP_CatchARide_HijackDestinationStation_C_SetupForCharacter final
{
public:
	class AGbxCharacter*                          NewCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CatchARide_HijackDestinationStation_C_SetupForCharacter) == 0x000008, "Wrong alignment on BP_CatchARide_HijackDestinationStation_C_SetupForCharacter");
static_assert(sizeof(BP_CatchARide_HijackDestinationStation_C_SetupForCharacter) == 0x000008, "Wrong size on BP_CatchARide_HijackDestinationStation_C_SetupForCharacter");
static_assert(offsetof(BP_CatchARide_HijackDestinationStation_C_SetupForCharacter, NewCharacter) == 0x000000, "Member 'BP_CatchARide_HijackDestinationStation_C_SetupForCharacter::NewCharacter' has a wrong offset!");

}

