#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Decorator_HangingSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "Struct_HangingMeshProperties_structs.hpp"


namespace SDK::Params
{

// Function BP_Decorator_HangingSpline.BP_Decorator_HangingSpline_C.GenerateCatenary
// 0x0120 (0x0120 - 0x0000)
struct BP_Decorator_HangingSpline_C_GenerateCatenary final
{
public:
	TArray<struct FVector2D>                      Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable1;                             // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable2;                             // 0x0020(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FTransform                             Temp_struct_Variable3;                             // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProceduralMeshComponent*               CallFunc_AddComponent_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   Temp_struct_Variable4;                             // 0x0078(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_Loft_Spline_Verticies;                    // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<int32>                                 CallFunc_Loft_Spline_Triangles;                    // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_Loft_Spline_Normals;                      // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector2D>                      CallFunc_Loft_Spline_UVs;                          // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FProcMeshTangent>               Temp_struct_Variable5;                             // 0x00E0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_GetCatenaryPoints_Points;                 // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0104(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Decorator_HangingSpline_C_GenerateCatenary) == 0x000010, "Wrong alignment on BP_Decorator_HangingSpline_C_GenerateCatenary");
static_assert(sizeof(BP_Decorator_HangingSpline_C_GenerateCatenary) == 0x000120, "Wrong size on BP_Decorator_HangingSpline_C_GenerateCatenary");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, Temp_struct_Variable) == 0x000000, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, Temp_struct_Variable1) == 0x000010, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, Temp_struct_Variable2) == 0x000020, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, Temp_struct_Variable3) == 0x000030, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_AddComponent_ReturnValue) == 0x000068, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, Temp_int_Array_Index_Variable) == 0x000070, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, Temp_struct_Variable4) == 0x000078, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_VSize_ReturnValue) == 0x000094, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000098, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Loft_Spline_Verticies) == 0x0000A0, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Loft_Spline_Verticies' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Loft_Spline_Triangles) == 0x0000B0, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Loft_Spline_Triangles' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Loft_Spline_Normals) == 0x0000C0, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Loft_Spline_Normals' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Loft_Spline_UVs) == 0x0000D0, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Loft_Spline_UVs' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, Temp_struct_Variable5) == 0x0000E0, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_GetCatenaryPoints_Points) == 0x0000F0, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_GetCatenaryPoints_Points' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Array_Get_Item) == 0x000104, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_GenerateCatenary, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'BP_Decorator_HangingSpline_C_GenerateCatenary::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Decorator_HangingSpline.BP_Decorator_HangingSpline_C.PopulateInstances
// 0x0250 (0x0250 - 0x0000)
struct BP_Decorator_HangingSpline_C_PopulateInstances final
{
public:
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetSplineLength_ReturnValue1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_HangingMeshProperties          CallFunc_Array_Get_Item;                           // 0x0068(0x0068)(HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue2;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeightFromStream_ReturnValue; // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue1; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue2; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue3; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0130(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue4; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue5; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue6; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue5;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x016C(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSplineLength_ReturnValue3;             // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue6;              // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue7;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x01CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue8;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select1_Default;                            // 0x01FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decorator_HangingSpline_C_PopulateInstances) == 0x000010, "Wrong alignment on BP_Decorator_HangingSpline_C_PopulateInstances");
static_assert(sizeof(BP_Decorator_HangingSpline_C_PopulateInstances) == 0x000250, "Wrong size on BP_Decorator_HangingSpline_C_PopulateInstances");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_GetSplineLength_ReturnValue) == 0x000000, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, Temp_int_Variable) == 0x000004, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, Temp_bool_Variable) == 0x000008, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_IntInt_ReturnValue1) == 0x000014, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, Temp_struct_Variable) == 0x000020, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_GetSplineLength_ReturnValue1) == 0x000050, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_GetSplineLength_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_AddComponent_ReturnValue) == 0x000058, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, Temp_bool_Variable1) == 0x000064, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_GetSplineLength_ReturnValue2) == 0x0000D0, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_GetSplineLength_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_IsValid_ReturnValue) == 0x0000D4, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D8, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x0000DC, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_RandomBoolWithWeightFromStream_ReturnValue) == 0x0000E4, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_RandomBoolWithWeightFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakVector_X) == 0x0000E8, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakVector_Y) == 0x0000EC, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000F4, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000F8, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue1) == 0x0000FC, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue2) == 0x000100, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000104, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakVector_X1) == 0x000108, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakVector_Y1) == 0x00010C, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakVector_Z1) == 0x000110, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue3) == 0x000114, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_FloatFloat_ReturnValue) == 0x000118, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_FloatFloat_ReturnValue1) == 0x00011C, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000120, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakRotator_Roll) == 0x000124, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakRotator_Pitch) == 0x000128, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakRotator_Yaw) == 0x00012C, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_MakeVector_ReturnValue) == 0x000130, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x00013C, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x000140, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue4) == 0x000144, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue5) == 0x000148, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x00014C, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakRotator_Roll1) == 0x000150, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakRotator_Roll1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakRotator_Pitch1) == 0x000154, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakRotator_Pitch1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_BreakRotator_Yaw1) == 0x000158, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_BreakRotator_Yaw1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_RandomFloatInRangeFromStream_ReturnValue6) == 0x00015C, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_RandomFloatInRangeFromStream_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000160, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_FloatFloat_ReturnValue4) == 0x000164, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_FloatFloat_ReturnValue5) == 0x000168, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_MakeRotator_ReturnValue) == 0x00016C, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000178, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Subtract_IntInt_ReturnValue) == 0x00017C, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_IsValid_ReturnValue1) == 0x000180, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000181, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_SetStaticMesh_ReturnValue) == 0x000182, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_IsValid_ReturnValue2) == 0x000183, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_GetMaterial_ReturnValue) == 0x000188, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, K2Node_Select_Default) == 0x000190, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000198, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001A0, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Array_Length_ReturnValue) == 0x0001A8, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Less_IntInt_ReturnValue) == 0x0001AC, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_GetSplineLength_ReturnValue3) == 0x0001B0, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_GetSplineLength_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001B4, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0001B8, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_FloatFloat_ReturnValue6) == 0x0001BC, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_MapRangeClamped_ReturnValue) == 0x0001C0, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_FloatFloat_ReturnValue7) == 0x0001C4, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_FClamp_ReturnValue) == 0x0001C8, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x0001CC, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x0001D8, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_VectorVector_ReturnValue) == 0x0001DC, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_GetFloatValue_ReturnValue) == 0x0001E8, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Add_FloatFloat_ReturnValue8) == 0x0001EC, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Add_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001F0, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, K2Node_Select1_Default) == 0x0001FC, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_MakeTransform_ReturnValue) == 0x000210, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_PopulateInstances, CallFunc_AddInstance_ReturnValue) == 0x000240, "Member 'BP_Decorator_HangingSpline_C_PopulateInstances::CallFunc_AddInstance_ReturnValue' has a wrong offset!");

// Function BP_Decorator_HangingSpline.BP_Decorator_HangingSpline_C.ConstructSplineMeshes
// 0x0100 (0x0100 - 0x0000)
struct BP_Decorator_HangingSpline_C_ConstructSplineMeshes final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x006C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue1;                // 0x0078(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue2;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue4;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue1;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue1;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue1; // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue1; // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes) == 0x000010, "Wrong alignment on BP_Decorator_HangingSpline_C_ConstructSplineMeshes");
static_assert(sizeof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes) == 0x000100, "Wrong size on BP_Decorator_HangingSpline_C_ConstructSplineMeshes");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, Temp_struct_Variable) == 0x000000, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x000040, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_GetSplineLength_ReturnValue) == 0x000044, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000050, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x000054, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, Temp_int_Variable) == 0x000058, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x00005C, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Add_IntInt_ReturnValue1) == 0x000064, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_MakeVector2D_ReturnValue) == 0x00006C, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000074, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_MakeVector2D_ReturnValue1) == 0x000078, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_MakeVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_GetSplineLength_ReturnValue1) == 0x000080, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_GetSplineLength_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000084, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_GetSplineLength_ReturnValue2) == 0x000088, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_GetSplineLength_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_SetStaticMesh_ReturnValue) == 0x00008C, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Conv_IntToFloat_ReturnValue4) == 0x000090, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Conv_IntToFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Subtract_IntInt_ReturnValue) == 0x000094, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000098, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00009C, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000A0, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_MapRangeClamped_ReturnValue) == 0x0000A4, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_Multiply_IntFloat_ReturnValue1) == 0x0000A8, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_Multiply_IntFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x0000AC, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Decorator_HangingSpline_C_ConstructSplineMeshes, CallFunc_MapRangeClamped_ReturnValue1) == 0x0000B8, "Member 'BP_Decorator_HangingSpline_C_ConstructSplineMeshes::CallFunc_MapRangeClamped_ReturnValue1' has a wrong offset!");
