#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructibleGameplayAndNetworkRelevant

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DestructibleGameplayAndNetworkRelevant.BP_DestructibleGameplayAndNetworkRelevant_C.ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant
// 0x00F8 (0x00F8 - 0x0000)
struct BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxDestructibleComponent*              K2Node_DynamicCast_AsGbx_Destructible_Component;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalPercentFractured_ReturnValue;     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Fracturable;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxDestructibleComponent*              K2Node_DynamicCast_AsGbx_Destructible_Component1;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalPercentFractured_ReturnValue1;    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DamageRadius;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ImpulseStrength;                      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_ComponentBoundEvent_FractureCentroid;       // 0x0074(0x000C)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_HitDirection;           // 0x0080(0x000C)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_FracturePercent;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bSilentFracture;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x00A8(0x0018)()
	struct FVector                                CallFunc_GetActorBounds_Origin1;                   // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent1;                // 0x00CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue1;                       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue1;         // 0x00E0(0x0018)()
};
static_assert(alignof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant) == 0x000008, "Wrong alignment on BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant");
static_assert(sizeof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant) == 0x0000F8, "Wrong size on BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, EntryPoint) == 0x000000, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_DynamicCast_AsGbx_Destructible_Component) == 0x000008, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_DynamicCast_AsGbx_Destructible_Component' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_GetTotalPercentFractured_ReturnValue) == 0x000014, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_GetTotalPercentFractured_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_Less_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, Temp_float_Variable) == 0x00001C, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_Event_Fracturable) == 0x000020, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_Event_Fracturable' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_GetActorBounds_Origin) == 0x000024, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_GetActorBounds_BoxExtent) == 0x000030, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_VSize_ReturnValue) == 0x00003C, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_DynamicCast_AsGbx_Destructible_Component1) == 0x000040, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_DynamicCast_AsGbx_Destructible_Component1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_DynamicCast_bSuccess1) == 0x000048, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_GetTotalPercentFractured_ReturnValue1) == 0x00004C, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_GetTotalPercentFractured_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_Less_FloatFloat_ReturnValue1) == 0x000054, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_FClamp_ReturnValue) == 0x000058, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00005C, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_Event_DamageRadius) == 0x000068, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_Event_DamageRadius' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_Event_ImpulseStrength) == 0x00006C, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_Event_ImpulseStrength' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, Temp_bool_Variable) == 0x000070, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_ComponentBoundEvent_FractureCentroid) == 0x000074, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_ComponentBoundEvent_FractureCentroid' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_ComponentBoundEvent_HitDirection) == 0x000080, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_ComponentBoundEvent_HitDirection' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_ComponentBoundEvent_FracturePercent) == 0x00008C, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_ComponentBoundEvent_FracturePercent' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_ComponentBoundEvent_bSilentFracture) == 0x000090, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_ComponentBoundEvent_bSilentFracture' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, Temp_int_Variable) == 0x000094, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000098, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000099, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, K2Node_Select_Default) == 0x00009C, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000A0, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_PostEventAtLocation_ReturnValue) == 0x0000A8, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_GetActorBounds_Origin1) == 0x0000C0, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_GetActorBounds_Origin1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_GetActorBounds_BoxExtent1) == 0x0000CC, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_GetActorBounds_BoxExtent1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_VSize_ReturnValue1) == 0x0000D8, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_VSize_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant, CallFunc_PostEventAtLocation_ReturnValue1) == 0x0000E0, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ExecuteUbergraph_BP_DestructibleGameplayAndNetworkRelevant::CallFunc_PostEventAtLocation_ReturnValue1' has a wrong offset!");

// Function BP_DestructibleGameplayAndNetworkRelevant.BP_DestructibleGameplayAndNetworkRelevant_C.BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant
// 0x0020 (0x0020 - 0x0000)
struct BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant final
{
public:
	struct FVector                                FractureCentroid;                                  // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitDirection;                                      // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FracturePercent;                                   // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSilentFracture;                                   // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant) == 0x000004, "Wrong alignment on BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant");
static_assert(sizeof(BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant) == 0x000020, "Wrong size on BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant, FractureCentroid) == 0x000000, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant::FractureCentroid' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant, HitDirection) == 0x00000C, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant::HitDirection' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant, FracturePercent) == 0x000018, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant::FracturePercent' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant, bSilentFracture) == 0x00001C, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_0_GbxComponentFractureSignature__DelegateSignature_BP_DestructibleGameplayAndNetworkRelevant::bSilentFracture' has a wrong offset!");

// Function BP_DestructibleGameplayAndNetworkRelevant.BP_DestructibleGameplayAndNetworkRelevant_C.BPI_ScriptedTotalDestruction
// 0x0008 (0x0008 - 0x0000)
struct BP_DestructibleGameplayAndNetworkRelevant_C_BPI_ScriptedTotalDestruction final
{
public:
	float                                         DamageRadius;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseStrength;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleGameplayAndNetworkRelevant_C_BPI_ScriptedTotalDestruction) == 0x000004, "Wrong alignment on BP_DestructibleGameplayAndNetworkRelevant_C_BPI_ScriptedTotalDestruction");
static_assert(sizeof(BP_DestructibleGameplayAndNetworkRelevant_C_BPI_ScriptedTotalDestruction) == 0x000008, "Wrong size on BP_DestructibleGameplayAndNetworkRelevant_C_BPI_ScriptedTotalDestruction");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_BPI_ScriptedTotalDestruction, DamageRadius) == 0x000000, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_BPI_ScriptedTotalDestruction::DamageRadius' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_BPI_ScriptedTotalDestruction, ImpulseStrength) == 0x000004, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_BPI_ScriptedTotalDestruction::ImpulseStrength' has a wrong offset!");

// Function BP_DestructibleGameplayAndNetworkRelevant.BP_DestructibleGameplayAndNetworkRelevant_C.BPI_SetFracturable
// 0x0001 (0x0001 - 0x0000)
struct BP_DestructibleGameplayAndNetworkRelevant_C_BPI_SetFracturable final
{
public:
	bool                                          Fracturable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DestructibleGameplayAndNetworkRelevant_C_BPI_SetFracturable) == 0x000001, "Wrong alignment on BP_DestructibleGameplayAndNetworkRelevant_C_BPI_SetFracturable");
static_assert(sizeof(BP_DestructibleGameplayAndNetworkRelevant_C_BPI_SetFracturable) == 0x000001, "Wrong size on BP_DestructibleGameplayAndNetworkRelevant_C_BPI_SetFracturable");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_BPI_SetFracturable, Fracturable) == 0x000000, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_BPI_SetFracturable::Fracturable' has a wrong offset!");

// Function BP_DestructibleGameplayAndNetworkRelevant.BP_DestructibleGameplayAndNetworkRelevant_C.AttemptLootableScripting
// 0x0020 (0x0020 - 0x0000)
struct BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting final
{
public:
	class UActorComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakLootableComponent*                  K2Node_DynamicCast_AsOak_Lootable_Component;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_SpawnAndDropLoot_SelectedConfigurationName; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting) == 0x000008, "Wrong alignment on BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting");
static_assert(sizeof(BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting) == 0x000020, "Wrong size on BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting, CallFunc_GetComponentByClass_ReturnValue) == 0x000000, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting, K2Node_DynamicCast_AsOak_Lootable_Component) == 0x000008, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting::K2Node_DynamicCast_AsOak_Lootable_Component' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting, CallFunc_SpawnAndDropLoot_SelectedConfigurationName) == 0x000018, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_AttemptLootableScripting::CallFunc_SpawnAndDropLoot_SelectedConfigurationName' has a wrong offset!");

// Function BP_DestructibleGameplayAndNetworkRelevant.BP_DestructibleGameplayAndNetworkRelevant_C.ForceTotalDestruction
// 0x000C (0x000C - 0x0000)
struct BP_DestructibleGameplayAndNetworkRelevant_C_ForceTotalDestruction final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleGameplayAndNetworkRelevant_C_ForceTotalDestruction) == 0x000004, "Wrong alignment on BP_DestructibleGameplayAndNetworkRelevant_C_ForceTotalDestruction");
static_assert(sizeof(BP_DestructibleGameplayAndNetworkRelevant_C_ForceTotalDestruction) == 0x00000C, "Wrong size on BP_DestructibleGameplayAndNetworkRelevant_C_ForceTotalDestruction");
static_assert(offsetof(BP_DestructibleGameplayAndNetworkRelevant_C_ForceTotalDestruction, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'BP_DestructibleGameplayAndNetworkRelevant_C_ForceTotalDestruction::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

}

