#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DiamondRoom_Music

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WwiseAudio_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DiamondRoom_Music.BP_DiamondRoom_Music_C
// 0x0018 (0x0550 - 0x0538)
class ABP_DiamondRoom_Music_C final : public AWwiseAmbientSound
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_Mus_Sanctuary_C*                    BP_Mus_ref;                                        // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DiamondRoom_Music(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DiamondRoom_Music_C">();
	}
	static class ABP_DiamondRoom_Music_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DiamondRoom_Music_C>();
	}
};
static_assert(alignof(ABP_DiamondRoom_Music_C) == 0x000008, "Wrong alignment on ABP_DiamondRoom_Music_C");
static_assert(sizeof(ABP_DiamondRoom_Music_C) == 0x000550, "Wrong size on ABP_DiamondRoom_Music_C");
static_assert(offsetof(ABP_DiamondRoom_Music_C, UberGraphFrame) == 0x000538, "Member 'ABP_DiamondRoom_Music_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DiamondRoom_Music_C, TextRender) == 0x000540, "Member 'ABP_DiamondRoom_Music_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_DiamondRoom_Music_C, BP_Mus_ref) == 0x000548, "Member 'ABP_DiamondRoom_Music_C::BP_Mus_ref' has a wrong offset!");

}

