#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FogOfDiscoveryCapture

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FogOfDiscoveryCapture.BP_FogOfDiscoveryCapture_C.ExecuteUbergraph_BP_FogOfDiscoveryCapture
// 0x0018 (0x0018 - 0x0000)
struct BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneMapData*                           K2Node_Event_UpdatedZoneMap;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture) == 0x000008, "Wrong alignment on BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture");
static_assert(sizeof(BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture) == 0x000018, "Wrong size on BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture");
static_assert(offsetof(BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture, EntryPoint) == 0x000000, "Member 'BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture, K2Node_Event_UpdatedZoneMap) == 0x000008, "Member 'BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture::K2Node_Event_UpdatedZoneMap' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture, K2Node_Event_EndPlayReason) == 0x000010, "Member 'BP_FogOfDiscoveryCapture_C_ExecuteUbergraph_BP_FogOfDiscoveryCapture::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_FogOfDiscoveryCapture.BP_FogOfDiscoveryCapture_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_FogOfDiscoveryCapture_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FogOfDiscoveryCapture_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_FogOfDiscoveryCapture_C_ReceiveEndPlay");
static_assert(sizeof(BP_FogOfDiscoveryCapture_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_FogOfDiscoveryCapture_C_ReceiveEndPlay");
static_assert(offsetof(BP_FogOfDiscoveryCapture_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_FogOfDiscoveryCapture_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_FogOfDiscoveryCapture.BP_FogOfDiscoveryCapture_C.OnFogLevelLoaded
// 0x0008 (0x0008 - 0x0000)
struct BP_FogOfDiscoveryCapture_C_OnFogLevelLoaded final
{
public:
	class UZoneMapData*                           UpdatedZoneMap;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FogOfDiscoveryCapture_C_OnFogLevelLoaded) == 0x000008, "Wrong alignment on BP_FogOfDiscoveryCapture_C_OnFogLevelLoaded");
static_assert(sizeof(BP_FogOfDiscoveryCapture_C_OnFogLevelLoaded) == 0x000008, "Wrong size on BP_FogOfDiscoveryCapture_C_OnFogLevelLoaded");
static_assert(offsetof(BP_FogOfDiscoveryCapture_C_OnFogLevelLoaded, UpdatedZoneMap) == 0x000000, "Member 'BP_FogOfDiscoveryCapture_C_OnFogLevelLoaded::UpdatedZoneMap' has a wrong offset!");

}

