#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_Veh_CatchARide_Scan

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FX_Veh_CatchARide_Scan.BP_FX_Veh_CatchARide_Scan_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_FX_Veh_CatchARide_Scan_C_UserConstructionScript final
{
public:
	TArray<class UParticleSystemComponent*>       K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_FX_Veh_CatchARide_Scan_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_FX_Veh_CatchARide_Scan_C_UserConstructionScript");
static_assert(sizeof(BP_FX_Veh_CatchARide_Scan_C_UserConstructionScript) == 0x000010, "Wrong size on BP_FX_Veh_CatchARide_Scan_C_UserConstructionScript");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'BP_FX_Veh_CatchARide_Scan_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_FX_Veh_CatchARide_Scan.BP_FX_Veh_CatchARide_Scan_C.DigistructIn
// 0x0001 (0x0001 - 0x0000)
struct BP_FX_Veh_CatchARide_Scan_C_DigistructIn final
{
public:
	bool                                          IsScanning;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FX_Veh_CatchARide_Scan_C_DigistructIn) == 0x000001, "Wrong alignment on BP_FX_Veh_CatchARide_Scan_C_DigistructIn");
static_assert(sizeof(BP_FX_Veh_CatchARide_Scan_C_DigistructIn) == 0x000001, "Wrong size on BP_FX_Veh_CatchARide_Scan_C_DigistructIn");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_DigistructIn, IsScanning) == 0x000000, "Member 'BP_FX_Veh_CatchARide_Scan_C_DigistructIn::IsScanning' has a wrong offset!");

// Function BP_FX_Veh_CatchARide_Scan.BP_FX_Veh_CatchARide_Scan_C.ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan
// 0x0230 (0x0230 - 0x0000)
struct BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0048(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue1;                       // 0x0054(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsScanning;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0068(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue2;                       // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult1;   // 0x0110(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x01C0(0x0018)()
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item1;                          // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item2;                          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item3;                          // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item4;                          // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan) == 0x000008, "Wrong alignment on BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan");
static_assert(sizeof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan) == 0x000230, "Wrong size on BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, EntryPoint) == 0x000000, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Array_Index_Variable1) == 0x000010, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Loop_Counter_Variable1) == 0x000014, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Add_IntInt_ReturnValue1) == 0x000018, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Loop_Counter_Variable2) == 0x00001C, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Add_IntInt_ReturnValue2) == 0x000020, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Array_Index_Variable2) == 0x000024, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Array_Index_Variable3) == 0x000028, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Loop_Counter_Variable3) == 0x00002C, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Add_IntInt_ReturnValue3) == 0x000030, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Array_Index_Variable4) == 0x000034, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000038, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_bool_Has_Been_Initd_Variable) == 0x000044, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_VLerp_ReturnValue) == 0x000048, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_VLerp_ReturnValue1) == 0x000054, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_VLerp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, K2Node_CustomEvent_IsScanning) == 0x000060, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::K2Node_CustomEvent_IsScanning' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000068, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_int_Loop_Counter_Variable4) == 0x0000F8, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Add_IntInt_ReturnValue4) == 0x0000FC, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_VLerp_ReturnValue2) == 0x000100, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_VLerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_K2_SetRelativeLocation_SweepHitResult1) == 0x000110, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_K2_SetRelativeLocation_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001A0, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Add_VectorVector_ReturnValue) == 0x0001AC, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001B8, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_PostAttachedEvent_ReturnValue) == 0x0001C0, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Get_Item1) == 0x0001E0, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Length_ReturnValue) == 0x0001E8, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Length_ReturnValue1) == 0x0001EC, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Less_IntInt_ReturnValue) == 0x0001F0, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Less_IntInt_ReturnValue1) == 0x0001F1, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Get_Item2) == 0x0001F8, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Length_ReturnValue2) == 0x000200, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Less_IntInt_ReturnValue2) == 0x000204, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, Temp_bool_IsClosed_Variable) == 0x000205, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Get_Item3) == 0x000208, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Length_ReturnValue3) == 0x000210, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Less_IntInt_ReturnValue3) == 0x000214, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Length_ReturnValue4) == 0x000218, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Array_Get_Item4) == 0x000220, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan, CallFunc_Less_IntInt_ReturnValue4) == 0x000228, "Member 'BP_FX_Veh_CatchARide_Scan_C_ExecuteUbergraph_BP_FX_Veh_CatchARide_Scan::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");

}

