#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FogOfDiscoveryManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function BP_FogOfDiscoveryManager.BP_FogOfDiscoveryManager_C.ExecuteUbergraph_BP_FogOfDiscoveryManager
// 0x00E0 (0x00E0 - 0x0000)
struct BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0080(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue2;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveCurrentZoneFogOfDiscovery_ReturnValue; // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager) == 0x000010, "Wrong alignment on BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager");
static_assert(sizeof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager) == 0x0000E0, "Wrong size on BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, EntryPoint) == 0x000000, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_CreateDynamicMaterialInstance_ReturnValue1) == 0x000028, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_CreateDynamicMaterialInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_GetPlayerCharacter_ReturnValue1) == 0x000060, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_GetPlayerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_TransformLocation_ReturnValue) == 0x000068, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000074, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000080, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_VSize_ReturnValue) == 0x00009C, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_GetPlayerCharacter_ReturnValue2) == 0x0000A0, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_GetPlayerCharacter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_IsValid_ReturnValue1) == 0x0000A9, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, K2Node_Event_EndPlayReason) == 0x0000AA, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, K2Node_DynamicCast_AsOak_Player_Controller) == 0x0000B8, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_SaveCurrentZoneFogOfDiscovery_ReturnValue) == 0x0000C1, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_SaveCurrentZoneFogOfDiscovery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x0000C8, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager, CallFunc_CreateRenderTarget2D_ReturnValue1) == 0x0000D0, "Member 'BP_FogOfDiscoveryManager_C_ExecuteUbergraph_BP_FogOfDiscoveryManager::CallFunc_CreateRenderTarget2D_ReturnValue1' has a wrong offset!");

// Function BP_FogOfDiscoveryManager.BP_FogOfDiscoveryManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FogOfDiscoveryManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FogOfDiscoveryManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FogOfDiscoveryManager_C_ReceiveTick");
static_assert(sizeof(BP_FogOfDiscoveryManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_FogOfDiscoveryManager_C_ReceiveTick");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FogOfDiscoveryManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FogOfDiscoveryManager.BP_FogOfDiscoveryManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_FogOfDiscoveryManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FogOfDiscoveryManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_FogOfDiscoveryManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_FogOfDiscoveryManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_FogOfDiscoveryManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_FogOfDiscoveryManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_FogOfDiscoveryManager.BP_FogOfDiscoveryManager_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct BP_FogOfDiscoveryManager_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UZoneMapData*                           CallFunc_GetZoneMapForLevel_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UZoneMapMeshData*                       CallFunc_GetZoneMapMeshData_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneMapMeshListEntry                  CallFunc_Array_Get_Item;                           // 0x0068(0x0038)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FogOfDiscoveryManager_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_FogOfDiscoveryManager_C_UserConstructionScript");
static_assert(sizeof(BP_FogOfDiscoveryManager_C_UserConstructionScript) == 0x0000B0, "Wrong size on BP_FogOfDiscoveryManager_C_UserConstructionScript");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, Temp_struct_Variable) == 0x000010, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, CallFunc_GetZoneMapForLevel_ReturnValue) == 0x000040, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::CallFunc_GetZoneMapForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000050, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, CallFunc_GetZoneMapMeshData_ReturnValue) == 0x000058, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::CallFunc_GetZoneMapMeshData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FogOfDiscoveryManager_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A1, "Member 'BP_FogOfDiscoveryManager_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

