#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GalaxyMapStationPatch

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "EZoneNames_structs.hpp"
#include "GbxMission_structs.hpp"
#include "EMapNames_structs.hpp"


namespace SDK::Params
{

// Function BP_GalaxyMapStationPatch.BP_GalaxyMapStationPatch_C.ExecuteUbergraph_BP_GalaxyMapStationPatch
// 0x0120 (0x0120 - 0x0000)
struct BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UGbxLevelSequence*                      CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GalaxyMapStation_C*                 K2Node_DynamicCast_AsBP_Galaxy_Map_Station;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlanetData*                            K2Node_Event_Planet;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZoneNames                                    K2Node_CustomEvent_Destination;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	EZoneNames                                    CallFunc_Map_Find_Value1;                          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetLength_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMissionEventReference                 CallFunc_Map_Find_Value2;                          // 0x0080(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0098(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxLevelSequenceActor*                 CallFunc_CreateGbxLevelSequencePlayer_OutActor;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxLevelSequencePlayer*                CallFunc_CreateGbxLevelSequencePlayer_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x00C8(0x0018)()
	EMapNames                                     CallFunc_Map_Find_Value3;                          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue3;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable;                                // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default;                             // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxLevelSequence*                      CallFunc_Map_Find_Value4;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue4;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxLevelSequenceActor*                 CallFunc_CreateGbxLevelSequencePlayer_OutActor1;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxLevelSequencePlayer*                CallFunc_CreateGbxLevelSequencePlayer_ReturnValue1; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMissionEventReference                 CallFunc_Map_Find_Value5;                          // 0x0108(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue5;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch) == 0x000008, "Wrong alignment on BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch");
static_assert(sizeof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch) == 0x000120, "Wrong size on BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, EntryPoint) == 0x000000, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_Value) == 0x000018, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000028, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, K2Node_DynamicCast_AsBP_Galaxy_Map_Station) == 0x000030, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::K2Node_DynamicCast_AsBP_Galaxy_Map_Station' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, Temp_bool_Variable) == 0x00003A, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, K2Node_Event_Planet) == 0x000040, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::K2Node_Event_Planet' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, K2Node_CustomEvent_Destination) == 0x000048, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::K2Node_CustomEvent_Destination' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, K2Node_CreateDelegate_OutputDelegate1) == 0x000050, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, K2Node_CreateDelegate_OutputDelegate2) == 0x000060, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_Value1) == 0x000070, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_Value1' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_ReturnValue1) == 0x000071, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000072, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_IsValid_ReturnValue1) == 0x000073, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_GetLength_ReturnValue) == 0x000074, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_GetLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_Value2) == 0x000080, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_Value2' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_ReturnValue2) == 0x000090, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_PostWwiseEvent_ReturnValue) == 0x000098, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_IsValid_ReturnValue2) == 0x0000B0, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B1, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_CreateGbxLevelSequencePlayer_OutActor) == 0x0000B8, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_CreateGbxLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_CreateGbxLevelSequencePlayer_ReturnValue) == 0x0000C0, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_CreateGbxLevelSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_PostWwiseEvent_ReturnValue1) == 0x0000C8, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_Value3) == 0x0000E0, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_Value3' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_ReturnValue3) == 0x0000E1, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, Temp_byte_Variable) == 0x0000E2, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, K2Node_Select_Default) == 0x0000E3, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_Value4) == 0x0000E8, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_Value4' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_ReturnValue4) == 0x0000F0, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_CreateGbxLevelSequencePlayer_OutActor1) == 0x0000F8, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_CreateGbxLevelSequencePlayer_OutActor1' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_CreateGbxLevelSequencePlayer_ReturnValue1) == 0x000100, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_CreateGbxLevelSequencePlayer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_Value5) == 0x000108, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_Value5' has a wrong offset!");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch, CallFunc_Map_Find_ReturnValue5) == 0x000118, "Member 'BP_GalaxyMapStationPatch_C_ExecuteUbergraph_BP_GalaxyMapStationPatch::CallFunc_Map_Find_ReturnValue5' has a wrong offset!");

// Function BP_GalaxyMapStationPatch.BP_GalaxyMapStationPatch_C.PlanetTravel_Leave
// 0x0001 (0x0001 - 0x0000)
struct BP_GalaxyMapStationPatch_C_PlanetTravel_Leave final
{
public:
	EZoneNames                                    Destination;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GalaxyMapStationPatch_C_PlanetTravel_Leave) == 0x000001, "Wrong alignment on BP_GalaxyMapStationPatch_C_PlanetTravel_Leave");
static_assert(sizeof(BP_GalaxyMapStationPatch_C_PlanetTravel_Leave) == 0x000001, "Wrong size on BP_GalaxyMapStationPatch_C_PlanetTravel_Leave");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_PlanetTravel_Leave, Destination) == 0x000000, "Member 'BP_GalaxyMapStationPatch_C_PlanetTravel_Leave::Destination' has a wrong offset!");

// Function BP_GalaxyMapStationPatch.BP_GalaxyMapStationPatch_C.K2_OnPlanetSelected
// 0x0008 (0x0008 - 0x0000)
struct BP_GalaxyMapStationPatch_C_K2_OnPlanetSelected final
{
public:
	class UPlanetData*                            Planet;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GalaxyMapStationPatch_C_K2_OnPlanetSelected) == 0x000008, "Wrong alignment on BP_GalaxyMapStationPatch_C_K2_OnPlanetSelected");
static_assert(sizeof(BP_GalaxyMapStationPatch_C_K2_OnPlanetSelected) == 0x000008, "Wrong size on BP_GalaxyMapStationPatch_C_K2_OnPlanetSelected");
static_assert(offsetof(BP_GalaxyMapStationPatch_C_K2_OnPlanetSelected, Planet) == 0x000000, "Member 'BP_GalaxyMapStationPatch_C_K2_OnPlanetSelected::Planet' has a wrong offset!");

}

