#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Payload_Piss

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function BP_GM_Payload_Piss.BP_GM_Payload_Piss_C.K2_GrenadeDamageDealt
// 0x00F0 (0x00F0 - 0x0000)
struct BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class AOakCharacter*                          Character;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageDataEventDetails                DamageEvent;                                       // 0x0048(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x00A0(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x00D8(0x0018)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt) == 0x000008, "Wrong alignment on BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt");
static_assert(sizeof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt) == 0x0000F0, "Wrong size on BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt, Grenade) == 0x000000, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt, Character) == 0x000040, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt::Character' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt, DamageEvent) == 0x000048, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt::DamageEvent' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000098, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt, K2Node_MakeStruct_StatusEffectSpec) == 0x0000A0, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt, CallFunc_AddStatusEffect_ReturnValue) == 0x0000D8, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeDamageDealt::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");

// Function BP_GM_Payload_Piss.BP_GM_Payload_Piss_C.K2_GrenadeExplode
// 0x00D0 (0x00D0 - 0x0000)
struct BP_GM_Payload_Piss_C_K2_GrenadeExplode final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec;          // 0x0050(0x0010)(NoDestructor)
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec1;         // 0x0060(0x0010)(NoDestructor)
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec2;         // 0x0070(0x0010)(NoDestructor)
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec3;         // 0x0080(0x0010)(NoDestructor)
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec4;         // 0x0090(0x0010)(NoDestructor)
	TArray<class AActor*>                         CallFunc_RunEnvQueryForAllActors_ResultActors;     // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_RunEnvQueryForAllActors_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue;           // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue1;          // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue2;          // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue3;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue4;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GM_Payload_Piss_C_K2_GrenadeExplode) == 0x000008, "Wrong alignment on BP_GM_Payload_Piss_C_K2_GrenadeExplode");
static_assert(sizeof(BP_GM_Payload_Piss_C_K2_GrenadeExplode) == 0x0000D0, "Wrong size on BP_GM_Payload_Piss_C_K2_GrenadeExplode");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, Grenade) == 0x000000, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, K2Node_MakeStruct_StatusEffectRemoveSpec) == 0x000050, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::K2Node_MakeStruct_StatusEffectRemoveSpec' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, K2Node_MakeStruct_StatusEffectRemoveSpec1) == 0x000060, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::K2Node_MakeStruct_StatusEffectRemoveSpec1' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, K2Node_MakeStruct_StatusEffectRemoveSpec2) == 0x000070, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::K2Node_MakeStruct_StatusEffectRemoveSpec2' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, K2Node_MakeStruct_StatusEffectRemoveSpec3) == 0x000080, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::K2Node_MakeStruct_StatusEffectRemoveSpec3' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, K2Node_MakeStruct_StatusEffectRemoveSpec4) == 0x000090, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::K2Node_MakeStruct_StatusEffectRemoveSpec4' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_RunEnvQueryForAllActors_ResultActors) == 0x0000A0, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_RunEnvQueryForAllActors_ResultActors' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_RunEnvQueryForAllActors_ReturnValue) == 0x0000B0, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_RunEnvQueryForAllActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_RemoveStatusEffect_ReturnValue) == 0x0000C4, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_RemoveStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_Less_IntInt_ReturnValue) == 0x0000C5, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_RemoveStatusEffect_ReturnValue1) == 0x0000C6, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_RemoveStatusEffect_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_RemoveStatusEffect_ReturnValue2) == 0x0000C7, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_RemoveStatusEffect_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_RemoveStatusEffect_ReturnValue3) == 0x0000C8, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_RemoveStatusEffect_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Piss_C_K2_GrenadeExplode, CallFunc_RemoveStatusEffect_ReturnValue4) == 0x0000C9, "Member 'BP_GM_Payload_Piss_C_K2_GrenadeExplode::CallFunc_RemoveStatusEffect_ReturnValue4' has a wrong offset!");

}

