#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Payload_EMP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function BP_GM_Payload_EMP.BP_GM_Payload_EMP_C.K2_GrenadeDamageDealt
// 0x01F0 (0x01F0 - 0x0000)
struct BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class AOakCharacter*                          Character;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageDataEventDetails                DamageEvent;                                       // 0x0048(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         ShieldMissingPercent;                              // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0098(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHealthType                            CallFunc_GetFirstHealthInformationByType_OutHealthType; // 0x0138(0x0078)(ContainsInstancedReference)
	bool                                          CallFunc_GetFirstHealthInformationByType_ReturnValue; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameResourcePoolReference             CallFunc_GetResourcePoolByResource_ReturnValue;    // 0x01B8(0x0018)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakResourcePoolReference_bValid;        // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakResourcePoolReference_CurrentValue;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakResourcePoolReference_MinValue;      // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakResourcePoolReference_MaxValue;      // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt) == 0x000008, "Wrong alignment on BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt");
static_assert(sizeof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt) == 0x0001F0, "Wrong size on BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, Grenade) == 0x000000, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, InstanceData) == 0x000010, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, Character) == 0x000040, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::Character' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, DamageEvent) == 0x000048, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::DamageEvent' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, ShieldMissingPercent) == 0x000090, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::ShieldMissingPercent' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, Temp_struct_Variable) == 0x000098, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_GetObjectClass_ReturnValue) == 0x000128, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_ClassIsChildOf_ReturnValue) == 0x000130, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_GetFirstHealthInformationByType_OutHealthType) == 0x000138, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_GetFirstHealthInformationByType_OutHealthType' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_GetFirstHealthInformationByType_ReturnValue) == 0x0001B0, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_GetFirstHealthInformationByType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_GetResourcePoolByResource_ReturnValue) == 0x0001B8, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_GetResourcePoolByResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_BreakResourcePoolReference_bValid) == 0x0001D0, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_BreakResourcePoolReference_bValid' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_BreakResourcePoolReference_CurrentValue) == 0x0001D4, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_BreakResourcePoolReference_CurrentValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_BreakResourcePoolReference_MinValue) == 0x0001D8, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_BreakResourcePoolReference_MinValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_BreakResourcePoolReference_MaxValue) == 0x0001DC, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_BreakResourcePoolReference_MaxValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001E0, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_GetValueOfAttribute_ReturnValue) == 0x0001E4, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001E8, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0001EC, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeDamageDealt::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");

// Function BP_GM_Payload_EMP.BP_GM_Payload_EMP_C.K2_GrenadeExplode
// 0x00D8 (0x00D8 - 0x0000)
struct BP_GM_Payload_EMP_C_K2_GrenadeExplode final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0040(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Payload_EMP_C_K2_GrenadeExplode) == 0x000008, "Wrong alignment on BP_GM_Payload_EMP_C_K2_GrenadeExplode");
static_assert(sizeof(BP_GM_Payload_EMP_C_K2_GrenadeExplode) == 0x0000D8, "Wrong size on BP_GM_Payload_EMP_C_K2_GrenadeExplode");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeExplode, Grenade) == 0x000000, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeExplode::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeExplode, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeExplode::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeExplode, InstanceData) == 0x000010, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeExplode::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeExplode, Temp_struct_Variable) == 0x000040, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeExplode::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeExplode, CallFunc_GetValueOfAttribute_ReturnValue) == 0x0000D0, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeExplode::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_EMP_C_K2_GrenadeExplode, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D4, "Member 'BP_GM_Payload_EMP_C_K2_GrenadeExplode::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

