#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Payload_AcidBurn

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function BP_GM_Payload_AcidBurn.BP_GM_Payload_AcidBurn_C.K2_GrenadeDamageDealt
// 0x0108 (0x0108 - 0x0000)
struct BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class AOakCharacter*                          Character;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageDataEventDetails                DamageEvent;                                       // 0x0048(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0090(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TScriptInterface<class IBPI_Nog_C>            K2Node_DynamicCast_AsBPI_Nog;                      // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self1_CastInput;   // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue1;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self2_CastInput;   // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue2;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt) == 0x000008, "Wrong alignment on BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt");
static_assert(sizeof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt) == 0x000108, "Wrong size on BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, Grenade) == 0x000000, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, InstanceData) == 0x000010, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, Character) == 0x000040, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::Character' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, DamageEvent) == 0x000048, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::DamageEvent' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, Temp_struct_Variable) == 0x000090, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, K2Node_DynamicCast_AsBPI_Nog) == 0x0000A0, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::K2Node_DynamicCast_AsBPI_Nog' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000B8, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000C8, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, CallFunc_HasMatchingGameplayTag_self1_CastInput) == 0x0000D0, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::CallFunc_HasMatchingGameplayTag_self1_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, CallFunc_HasMatchingGameplayTag_ReturnValue1) == 0x0000E0, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::CallFunc_HasMatchingGameplayTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, CallFunc_HasMatchingGameplayTag_self2_CastInput) == 0x0000E8, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::CallFunc_HasMatchingGameplayTag_self2_CastInput' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, CallFunc_HasMatchingGameplayTag_ReturnValue2) == 0x0000F8, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::CallFunc_HasMatchingGameplayTag_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, CallFunc_BooleanOR_ReturnValue) == 0x0000F9, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, CallFunc_GetValueOfAttribute_ReturnValue) == 0x0000FC, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt, CallFunc_K2Play_ReturnValue) == 0x000100, "Member 'BP_GM_Payload_AcidBurn_C_K2_GrenadeDamageDealt::CallFunc_K2Play_ReturnValue' has a wrong offset!");

}

