#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Payload_ButtStallion

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "WwiseAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_GM_Payload_ButtStallion.BP_GM_Payload_ButtStallion_C.K2_GrenadeBeginPlay
// 0x0068 (0x0068 - 0x0000)
struct BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x0040(0x0018)()
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay) == 0x000008, "Wrong alignment on BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay");
static_assert(sizeof(BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay) == 0x000068, "Wrong size on BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay, Grenade) == 0x000000, "Member 'BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay, InstanceData) == 0x000010, "Member 'BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay, CallFunc_PostAttachedEvent_ReturnValue) == 0x000040, "Member 'BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000058, "Member 'BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_GM_Payload_ButtStallion_C_K2_GrenadeBeginPlay::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_GM_Payload_ButtStallion.BP_GM_Payload_ButtStallion_C.K2_NativeDelayCallback
// 0x0070 (0x0070 - 0x0000)
struct BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class FName                                   DelayName;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDrunkenRandomMovementComponent*        CallFunc_GetDrunkenRandomComponent_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_RunEnvQueryForBestActor_ResultActor;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunEnvQueryForBestActor_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGrenadeHomingComponent*                CallFunc_GetHomingComponent_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback) == 0x000008, "Wrong alignment on BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback");
static_assert(sizeof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback) == 0x000070, "Wrong size on BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback, Grenade) == 0x000000, "Member 'BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback, InstanceData) == 0x000010, "Member 'BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback, DelayName) == 0x000040, "Member 'BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback::DelayName' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback, K2Node_SwitchName_CmpSuccess) == 0x000048, "Member 'BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback, CallFunc_GetDrunkenRandomComponent_ReturnValue) == 0x000050, "Member 'BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback::CallFunc_GetDrunkenRandomComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback, CallFunc_RunEnvQueryForBestActor_ResultActor) == 0x000058, "Member 'BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback::CallFunc_RunEnvQueryForBestActor_ResultActor' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback, CallFunc_RunEnvQueryForBestActor_ReturnValue) == 0x000060, "Member 'BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback::CallFunc_RunEnvQueryForBestActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback, CallFunc_GetHomingComponent_ReturnValue) == 0x000068, "Member 'BP_GM_Payload_ButtStallion_C_K2_NativeDelayCallback::CallFunc_GetHomingComponent_ReturnValue' has a wrong offset!");

// Function BP_GM_Payload_ButtStallion.BP_GM_Payload_ButtStallion_C.K2_GrenadeExplode
// 0x0040 (0x0040 - 0x0000)
struct BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode) == 0x000008, "Wrong alignment on BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode");
static_assert(sizeof(BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode) == 0x000040, "Wrong size on BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode, Grenade) == 0x000000, "Member 'BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode, InstanceData) == 0x000010, "Member 'BP_GM_Payload_ButtStallion_C_K2_GrenadeExplode::InstanceData' has a wrong offset!");

}

