#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Payload_Nagate

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "WwiseAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_GM_Payload_Nagate.BP_GM_Payload_Nagate_C.K2_GrenadeBeginPlay
// 0x0088 (0x0088 - 0x0000)
struct BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FGrenadeChildGenerationData            CallFunc_GetChildOffset_ReturnValue;               // 0x0040(0x0028)(NoDestructor)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x0068(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay) == 0x000008, "Wrong alignment on BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay");
static_assert(sizeof(BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay) == 0x000088, "Wrong size on BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay");
static_assert(offsetof(BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay, Grenade) == 0x000000, "Member 'BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay, CallFunc_GetChildOffset_ReturnValue) == 0x000040, "Member 'BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay::CallFunc_GetChildOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay, CallFunc_PostAttachedEvent_ReturnValue) == 0x000068, "Member 'BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'BP_GM_Payload_Nagate_C_K2_GrenadeBeginPlay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

