#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Payload_Pyroburst

#include "Basic.hpp"

#include "GbxWeapon_structs.hpp"
#include "OakGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WwiseAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_GM_Payload_Pyroburst.BP_GM_Payload_Pyroburst_C.K2_GrenadeBounce
// 0x0088 (0x0088 - 0x0000)
struct BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FGrenadeChildGenerationData            CallFunc_GetChildOffset_ReturnValue;               // 0x0040(0x0028)(NoDestructor)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x0068(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce) == 0x000008, "Wrong alignment on BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce");
static_assert(sizeof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce) == 0x000088, "Wrong size on BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce, Grenade) == 0x000000, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce, CallFunc_GetChildOffset_ReturnValue) == 0x000040, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce::CallFunc_GetChildOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce, CallFunc_PostAttachedEvent_ReturnValue) == 0x000068, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce, K2Node_SwitchInteger_CmpSuccess) == 0x000081, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBounce::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_GM_Payload_Pyroburst.BP_GM_Payload_Pyroburst_C.K2_GrenadeExplode
// 0x0040 (0x0040 - 0x0000)
struct BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode) == 0x000008, "Wrong alignment on BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode");
static_assert(sizeof(BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode) == 0x000040, "Wrong size on BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode, Grenade) == 0x000000, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeExplode::InstanceData' has a wrong offset!");

// Function BP_GM_Payload_Pyroburst.BP_GM_Payload_Pyroburst_C.K2_NativeDelayCallback
// 0x0210 (0x0210 - 0x0000)
struct BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class FName                                   DelayName;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DmgType;                                           // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnCone_ReturnValue;         // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	struct FRotator                               CallFunc_TransformRotation_ReturnValue;            // 0x0088(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue1; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x00D0(0x0140)(ContainsInstancedReference)
};
static_assert(alignof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback) == 0x000008, "Wrong alignment on BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback");
static_assert(sizeof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback) == 0x000210, "Wrong size on BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, Grenade) == 0x000000, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, DelayName) == 0x000040, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::DelayName' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, DmgType) == 0x000048, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::DmgType' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, K2Node_SwitchName_CmpSuccess) == 0x000050, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000054, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000058, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000060, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_GetOwner_ReturnValue) == 0x000070, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_GeneratePointsOnCone_ReturnValue) == 0x000078, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_GeneratePointsOnCone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_TransformRotation_ReturnValue) == 0x000088, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_TransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue) == 0x000094, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_GetForwardVector_ReturnValue) == 0x000098, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_TransformLocation_ReturnValue) == 0x0000A4, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B0, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_Add_VectorVector_ReturnValue) == 0x0000BC, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue1) == 0x0000C8, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback, K2Node_MakeStruct_LightProjectileInitializationData) == 0x0000D0, "Member 'BP_GM_Payload_Pyroburst_C_K2_NativeDelayCallback::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");

// Function BP_GM_Payload_Pyroburst.BP_GM_Payload_Pyroburst_C.K2_GrenadeBeginPlay
// 0x0088 (0x0088 - 0x0000)
struct BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FGrenadeChildGenerationData            CallFunc_GetChildOffset_ReturnValue;               // 0x0040(0x0028)(NoDestructor)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x0068(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay) == 0x000008, "Wrong alignment on BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay");
static_assert(sizeof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay) == 0x000088, "Wrong size on BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay, Grenade) == 0x000000, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay, CallFunc_GetChildOffset_ReturnValue) == 0x000040, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay::CallFunc_GetChildOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay, CallFunc_PostAttachedEvent_ReturnValue) == 0x000068, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'BP_GM_Payload_Pyroburst_C_K2_GrenadeBeginPlay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

