#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GalaxyMapStation

#include "Basic.hpp"

#include "EZoneNames_structs.hpp"
#include "OakGame_classes.hpp"
#include "EMapNames_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_GalaxyMapStation_State_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GalaxyMapStation.BP_GalaxyMapStation_C
// 0x02E8 (0x0968 - 0x0680)
class ABP_GalaxyMapStation_C final : public AGalaxyMapStation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(Transient, DuplicateTransient)
	class UMissionObserverComponent*              MissionObserver;                                   // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxChildActorComponent*                IO_MissionScripted_GlitchedHyperspeedTunnel;       // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   WwiseAudio_SM_Console_StarMap;                     // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_PlanetOrbitals;                                 // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ProjectionCones02;                              // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ProjectionCones;                                // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AtmosphereMesh;                                    // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TriGrid;                                           // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlanetMesh;                                        // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PlanetRoot;                                        // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          UsableBox;                                         // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxChildActorComponent*                IO_MissionScripted_HyperspeedTunnel;               // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Console_StarMap;                                // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Alpha_2_520B0A3B498A2A81E8DC22995790A7AF; // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Alpha_520B0A3B498A2A81E8DC22995790A7AF;   // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_520B0A3B498A2A81E8DC22995790A7AF; // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_GalaxyMapStation_State                   SkyboxState;                                       // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZoneNames                                    Location_Current;                                  // 0x0719(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZoneNames                                    Location_Destination;                              // 0x071A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71B[0x5];                                      // 0x071B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EZoneNames, EMapNames>                   ZoneID_to_MapID;                                   // 0x0720(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AIO_MissionScripted_HyperspeedTunnel_C* HyperSpaceIO;                                      // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UPlanetData*, EZoneNames>          PlanetData_To_PlanetID;                            // 0x0778(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   MapTravelIDSet;                                    // 0x07C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   DestinationSkyboxVisible;                          // 0x07D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnPlayerSelectedPlanet;                            // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<EZoneNames, struct FMissionEventReference> Update_Event;                                      // 0x07F8(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	TMap<EZoneNames, struct FMissionEventReference> Advance_Event;                                     // 0x0848(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	class UMaterialInstanceDynamic*               DMI_Trigrid;                                       // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlanetMapData_C*                       PreviewData;                                       // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Planet;                                        // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Atmosphere;                                    // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HardLocked;                                        // 0x08B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIO_MissionScripted_GlitchedHyperspeedTunnel_C* GlitchedHyperSpaceIO;                              // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EMapNames, class UPlanetData*>           MapID_To_PlanetData;                               // 0x08C8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AGbxLevelSequenceActor*                 LoopingSequenceObjectReference;                    // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IdlePlayRate;                                      // 0x0920(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_924[0x4];                                      // 0x0924(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIO_MissionScripted_SequencePlayer_C*   IOMissionSequencePlayer_IdleLoop;                  // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExitLoopPlayRate;                                  // 0x0930(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bElpisPhaselocked;                                 // 0x0934(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_935[0x3];                                      // 0x0935(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxLevelSequence*                      SEQ_Exit;                                          // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxCondition*                          ElpisPhaselocked;                                  // 0x0940(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGbxCondition*                          Cond_SkyboxState_NewEnumerator0;                   // 0x0948(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGbxCondition*                          Cond_SkyboxState_NewEnumerator1;                   // 0x0950(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGbxCondition*                          Cond_SkyboxState_NewEnumerator3;                   // 0x0958(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGbxCondition*                          Cond_SkyboxState_NewEnumerator4;                   // 0x0960(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void StopIdleLoopEarly();
	void RestartIdleLoop();
	class UPlanetData* GetPlanetDataFromMapNameID(const uint8 MapNameID);
	class UPlanetData* GetPlanetDataFromZoneNameID(const uint8 ZoneNameID);
	void Update_Planet_Art(class UPlanetMapData_C* Planet_Map_Data);
	void SetCurrentLocation();
	void BP_SelectedPlanet(bool Planet);
	void UserConstructionScript();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void ReceiveBeginPlay();
	void OnMapOpened(class AOakPlayerController* InteractingPlayer);
	void PlanetTravel_Leave(EZoneNames Destination);
	void OnMapClosed(class AOakPlayerController* InteractingPlayer);
	void Leaving_LevelLoad();
	void K2_OnBrowsePlanet(class UPlanetData* Planet);
	void K2_OnPlanetSelected(class UPlanetData* Planet);
	void SkyboxLoad_Complete();
	void Hyperspeed_Bubble_Disabled();
	void OnPlayerBeginInteraction(class AOakPlayerController* Player);
	void OnPlayerStopInteraction(class AOakPlayerController* Player);
	void K2_PostLoadedPlanetMesh();
	void ShowPlanetArt();
	void HidePlanetArt();
	void OnLStateUnlocked();
	void OnLStateLocked();
	void Arrive_OnFinished();
	void CE_BalexReaction_Hyperdrive();
	void LoopComplete();
	void BndEvt__MissionObserver_K2Node_ComponentBoundEvent_2_MissionObserverMissionsInitialized__DelegateSignature_BP_GalaxyMapStation();
	void ExecuteUbergraph_BP_GalaxyMapStation(int32 EntryPoint);
	void OnPlayerSelectedPlanet__DelegateSignature(EZoneNames LocationDestination);
	void DestinationSkyboxVisible__DelegateSignature(EZoneNames LocationDesination);
	void MapTravelIDSet__DelegateSignature(EZoneNames LocationDestination);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GalaxyMapStation_C">();
	}
	static class ABP_GalaxyMapStation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GalaxyMapStation_C>();
	}
};
static_assert(alignof(ABP_GalaxyMapStation_C) == 0x000008, "Wrong alignment on ABP_GalaxyMapStation_C");
static_assert(sizeof(ABP_GalaxyMapStation_C) == 0x000968, "Wrong size on ABP_GalaxyMapStation_C");
static_assert(offsetof(ABP_GalaxyMapStation_C, UberGraphFrame) == 0x000680, "Member 'ABP_GalaxyMapStation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, MissionObserver) == 0x000688, "Member 'ABP_GalaxyMapStation_C::MissionObserver' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Capsule) == 0x000690, "Member 'ABP_GalaxyMapStation_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, IO_MissionScripted_GlitchedHyperspeedTunnel) == 0x000698, "Member 'ABP_GalaxyMapStation_C::IO_MissionScripted_GlitchedHyperspeedTunnel' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, WwiseAudio_SM_Console_StarMap) == 0x0006A0, "Member 'ABP_GalaxyMapStation_C::WwiseAudio_SM_Console_StarMap' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, PS_PlanetOrbitals) == 0x0006A8, "Member 'ABP_GalaxyMapStation_C::PS_PlanetOrbitals' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, SM_ProjectionCones02) == 0x0006B0, "Member 'ABP_GalaxyMapStation_C::SM_ProjectionCones02' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, SM_ProjectionCones) == 0x0006B8, "Member 'ABP_GalaxyMapStation_C::SM_ProjectionCones' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, AtmosphereMesh) == 0x0006C0, "Member 'ABP_GalaxyMapStation_C::AtmosphereMesh' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, TriGrid) == 0x0006C8, "Member 'ABP_GalaxyMapStation_C::TriGrid' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, PlanetMesh) == 0x0006D0, "Member 'ABP_GalaxyMapStation_C::PlanetMesh' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, PlanetRoot) == 0x0006D8, "Member 'ABP_GalaxyMapStation_C::PlanetRoot' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, RotatingMovement) == 0x0006E0, "Member 'ABP_GalaxyMapStation_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, UsableBox) == 0x0006E8, "Member 'ABP_GalaxyMapStation_C::UsableBox' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, IO_MissionScripted_HyperspeedTunnel) == 0x0006F0, "Member 'ABP_GalaxyMapStation_C::IO_MissionScripted_HyperspeedTunnel' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, SM_Console_StarMap) == 0x0006F8, "Member 'ABP_GalaxyMapStation_C::SM_Console_StarMap' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Timeline_Alpha_2_520B0A3B498A2A81E8DC22995790A7AF) == 0x000700, "Member 'ABP_GalaxyMapStation_C::Timeline_Alpha_2_520B0A3B498A2A81E8DC22995790A7AF' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Timeline_Alpha_520B0A3B498A2A81E8DC22995790A7AF) == 0x000704, "Member 'ABP_GalaxyMapStation_C::Timeline_Alpha_520B0A3B498A2A81E8DC22995790A7AF' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Timeline__Direction_520B0A3B498A2A81E8DC22995790A7AF) == 0x000708, "Member 'ABP_GalaxyMapStation_C::Timeline__Direction_520B0A3B498A2A81E8DC22995790A7AF' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Timeline) == 0x000710, "Member 'ABP_GalaxyMapStation_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, SkyboxState) == 0x000718, "Member 'ABP_GalaxyMapStation_C::SkyboxState' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Location_Current) == 0x000719, "Member 'ABP_GalaxyMapStation_C::Location_Current' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Location_Destination) == 0x00071A, "Member 'ABP_GalaxyMapStation_C::Location_Destination' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, ZoneID_to_MapID) == 0x000720, "Member 'ABP_GalaxyMapStation_C::ZoneID_to_MapID' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, HyperSpaceIO) == 0x000770, "Member 'ABP_GalaxyMapStation_C::HyperSpaceIO' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, PlanetData_To_PlanetID) == 0x000778, "Member 'ABP_GalaxyMapStation_C::PlanetData_To_PlanetID' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, MapTravelIDSet) == 0x0007C8, "Member 'ABP_GalaxyMapStation_C::MapTravelIDSet' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, DestinationSkyboxVisible) == 0x0007D8, "Member 'ABP_GalaxyMapStation_C::DestinationSkyboxVisible' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, OnPlayerSelectedPlanet) == 0x0007E8, "Member 'ABP_GalaxyMapStation_C::OnPlayerSelectedPlanet' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Update_Event) == 0x0007F8, "Member 'ABP_GalaxyMapStation_C::Update_Event' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Advance_Event) == 0x000848, "Member 'ABP_GalaxyMapStation_C::Advance_Event' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, DMI_Trigrid) == 0x000898, "Member 'ABP_GalaxyMapStation_C::DMI_Trigrid' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, PreviewData) == 0x0008A0, "Member 'ABP_GalaxyMapStation_C::PreviewData' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, DMI_Planet) == 0x0008A8, "Member 'ABP_GalaxyMapStation_C::DMI_Planet' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, DMI_Atmosphere) == 0x0008B0, "Member 'ABP_GalaxyMapStation_C::DMI_Atmosphere' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, HardLocked) == 0x0008B8, "Member 'ABP_GalaxyMapStation_C::HardLocked' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, GlitchedHyperSpaceIO) == 0x0008C0, "Member 'ABP_GalaxyMapStation_C::GlitchedHyperSpaceIO' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, MapID_To_PlanetData) == 0x0008C8, "Member 'ABP_GalaxyMapStation_C::MapID_To_PlanetData' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, LoopingSequenceObjectReference) == 0x000918, "Member 'ABP_GalaxyMapStation_C::LoopingSequenceObjectReference' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, IdlePlayRate) == 0x000920, "Member 'ABP_GalaxyMapStation_C::IdlePlayRate' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, IOMissionSequencePlayer_IdleLoop) == 0x000928, "Member 'ABP_GalaxyMapStation_C::IOMissionSequencePlayer_IdleLoop' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, ExitLoopPlayRate) == 0x000930, "Member 'ABP_GalaxyMapStation_C::ExitLoopPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, bElpisPhaselocked) == 0x000934, "Member 'ABP_GalaxyMapStation_C::bElpisPhaselocked' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, SEQ_Exit) == 0x000938, "Member 'ABP_GalaxyMapStation_C::SEQ_Exit' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, ElpisPhaselocked) == 0x000940, "Member 'ABP_GalaxyMapStation_C::ElpisPhaselocked' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Cond_SkyboxState_NewEnumerator0) == 0x000948, "Member 'ABP_GalaxyMapStation_C::Cond_SkyboxState_NewEnumerator0' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Cond_SkyboxState_NewEnumerator1) == 0x000950, "Member 'ABP_GalaxyMapStation_C::Cond_SkyboxState_NewEnumerator1' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Cond_SkyboxState_NewEnumerator3) == 0x000958, "Member 'ABP_GalaxyMapStation_C::Cond_SkyboxState_NewEnumerator3' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStation_C, Cond_SkyboxState_NewEnumerator4) == 0x000960, "Member 'ABP_GalaxyMapStation_C::Cond_SkyboxState_NewEnumerator4' has a wrong offset!");

}

