#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Payload_Summit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function BP_GM_Payload_Summit.BP_GM_Payload_Summit_C.K2_GrenadeBeginPlay
// 0x0040 (0x0040 - 0x0000)
struct BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay) == 0x000008, "Wrong alignment on BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay");
static_assert(sizeof(BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay) == 0x000040, "Wrong size on BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay, Grenade) == 0x000000, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeBeginPlay::InstanceData' has a wrong offset!");

// Function BP_GM_Payload_Summit.BP_GM_Payload_Summit_C.K2_NativeDelayCallback
// 0x0048 (0x0048 - 0x0000)
struct BP_GM_Payload_Summit_C_K2_NativeDelayCallback final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class FName                                   DelayName;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Payload_Summit_C_K2_NativeDelayCallback) == 0x000008, "Wrong alignment on BP_GM_Payload_Summit_C_K2_NativeDelayCallback");
static_assert(sizeof(BP_GM_Payload_Summit_C_K2_NativeDelayCallback) == 0x000048, "Wrong size on BP_GM_Payload_Summit_C_K2_NativeDelayCallback");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_NativeDelayCallback, Grenade) == 0x000000, "Member 'BP_GM_Payload_Summit_C_K2_NativeDelayCallback::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_NativeDelayCallback, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Summit_C_K2_NativeDelayCallback::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_NativeDelayCallback, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Summit_C_K2_NativeDelayCallback::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_NativeDelayCallback, DelayName) == 0x000040, "Member 'BP_GM_Payload_Summit_C_K2_NativeDelayCallback::DelayName' has a wrong offset!");

// Function BP_GM_Payload_Summit.BP_GM_Payload_Summit_C.K2_GrenadeExplode
// 0x02A0 (0x02A0 - 0x0000)
struct BP_GM_Payload_Summit_C_K2_GrenadeExplode final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPayloadInstanceData                   InstanceData;                                      // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0050(0x0230)(ContainsInstancedReference)
	struct FStatusEffectInstanceReference         CallFunc_TriggerElementalEffect_ReturnValue;       // 0x0280(0x0018)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GM_Payload_Summit_C_K2_GrenadeExplode) == 0x000010, "Wrong alignment on BP_GM_Payload_Summit_C_K2_GrenadeExplode");
static_assert(sizeof(BP_GM_Payload_Summit_C_K2_GrenadeExplode) == 0x0002A0, "Wrong size on BP_GM_Payload_Summit_C_K2_GrenadeExplode");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeExplode, Grenade) == 0x000000, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeExplode::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeExplode, GrenadeMod) == 0x000008, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeExplode::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeExplode, InstanceData) == 0x000010, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeExplode::InstanceData' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeExplode, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeExplode::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeExplode, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeExplode::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeExplode, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000050, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeExplode::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeExplode, CallFunc_TriggerElementalEffect_ReturnValue) == 0x000280, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeExplode::CallFunc_TriggerElementalEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Payload_Summit_C_K2_GrenadeExplode, CallFunc_SpawnActorAsync_ReturnValue) == 0x000298, "Member 'BP_GM_Payload_Summit_C_K2_GrenadeExplode::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");

}

