#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GalaxyMapStationPatch

#include "Basic.hpp"

#include "EZoneNames_structs.hpp"
#include "EMapNames_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GalaxyMapStationPatch.BP_GalaxyMapStationPatch_C
// 0x00E0 (0x0538 - 0x0458)
class ABP_GalaxyMapStationPatch_C final : public AGalaxyMapStationPatch
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_GalaxyMapStation_C>  GalaxyMapStationSoft;                              // 0x0468(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ABP_GalaxyMapStation_C*                 GalaxyMapStation;                                  // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EZoneNames, class UGbxLevelSequence*>    ArriveSequences;                                   // 0x0498(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<EZoneNames, class UGbxLevelSequence*>    ExitSequences;                                     // 0x04E8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_GalaxyMapStationPatch(int32 EntryPoint);
	void Arrive_OnFinished();
	void SkyboxLoad_Complete();
	void PlanetTravel_Leave(EZoneNames Destination);
	void K2_OnPlanetSelected(class UPlanetData* Planet);
	void Leaving_LevelLoad();
	void LoopComplete();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GalaxyMapStationPatch_C">();
	}
	static class ABP_GalaxyMapStationPatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GalaxyMapStationPatch_C>();
	}
};
static_assert(alignof(ABP_GalaxyMapStationPatch_C) == 0x000008, "Wrong alignment on ABP_GalaxyMapStationPatch_C");
static_assert(sizeof(ABP_GalaxyMapStationPatch_C) == 0x000538, "Wrong size on ABP_GalaxyMapStationPatch_C");
static_assert(offsetof(ABP_GalaxyMapStationPatch_C, UberGraphFrame) == 0x000458, "Member 'ABP_GalaxyMapStationPatch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStationPatch_C, DefaultSceneRoot) == 0x000460, "Member 'ABP_GalaxyMapStationPatch_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStationPatch_C, GalaxyMapStationSoft) == 0x000468, "Member 'ABP_GalaxyMapStationPatch_C::GalaxyMapStationSoft' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStationPatch_C, GalaxyMapStation) == 0x000490, "Member 'ABP_GalaxyMapStationPatch_C::GalaxyMapStation' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStationPatch_C, ArriveSequences) == 0x000498, "Member 'ABP_GalaxyMapStationPatch_C::ArriveSequences' has a wrong offset!");
static_assert(offsetof(ABP_GalaxyMapStationPatch_C, ExitSequences) == 0x0004E8, "Member 'ABP_GalaxyMapStationPatch_C::ExitSequences' has a wrong offset!");

}

