#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GM_Delivery_Kryll

#include "Basic.hpp"

#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function BP_GM_Delivery_Kryll.BP_GM_Delivery_Kryll_C.K2_GrenadeInitialized
// 0x0050 (0x0050 - 0x0000)
struct BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized final
{
public:
	class AGrenade*                               Grenade;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                            GrenadeMod;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGrenadeChildGenerationData            CallFunc_GetChildOffset_ReturnValue;               // 0x0010(0x0028)(NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGrenadeHomingComponent*                CallFunc_GetHomingComponent_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized) == 0x000008, "Wrong alignment on BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized");
static_assert(sizeof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized) == 0x000050, "Wrong size on BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized");
static_assert(offsetof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized, Grenade) == 0x000000, "Member 'BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized::Grenade' has a wrong offset!");
static_assert(offsetof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized, GrenadeMod) == 0x000008, "Member 'BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized::GrenadeMod' has a wrong offset!");
static_assert(offsetof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized, CallFunc_GetChildOffset_ReturnValue) == 0x000010, "Member 'BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized::CallFunc_GetChildOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized, CallFunc_GetHomingComponent_ReturnValue) == 0x000040, "Member 'BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized::CallFunc_GetHomingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized, CallFunc_Greater_IntInt_ReturnValue1) == 0x00004A, "Member 'BP_GM_Delivery_Kryll_C_K2_GrenadeInitialized::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");

}

