#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HijackCarParts_06_City2

#include "Basic.hpp"

#include "BP_HijackCarParts_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HijackCarParts_06_City2.BP_HijackCarParts_06_City2_C
// 0x00F0 (0x0820 - 0x0730)
class ABP_HijackCarParts_06_City2_C final : public ABP_HijackCarParts_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_HijackCarParts_06_City2_C;       // 0x0728(0x0008)(Transient, DuplicateTransient)
	class UGbxSkeletalMeshComponent*              GbxSkeletalMesh1;                                  // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FBoneModInstance                       BoneMod;                                           // 0x0738(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void Challenge_Incomplete();
	void Challenge_Complete();
	void ExecuteUbergraph_BP_HijackCarParts_06_City2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HijackCarParts_06_City2_C">();
	}
	static class ABP_HijackCarParts_06_City2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HijackCarParts_06_City2_C>();
	}
};
static_assert(alignof(ABP_HijackCarParts_06_City2_C) == 0x000010, "Wrong alignment on ABP_HijackCarParts_06_City2_C");
static_assert(sizeof(ABP_HijackCarParts_06_City2_C) == 0x000820, "Wrong size on ABP_HijackCarParts_06_City2_C");
static_assert(offsetof(ABP_HijackCarParts_06_City2_C, UberGraphFrame_BP_HijackCarParts_06_City2_C) == 0x000728, "Member 'ABP_HijackCarParts_06_City2_C::UberGraphFrame_BP_HijackCarParts_06_City2_C' has a wrong offset!");
static_assert(offsetof(ABP_HijackCarParts_06_City2_C, GbxSkeletalMesh1) == 0x000730, "Member 'ABP_HijackCarParts_06_City2_C::GbxSkeletalMesh1' has a wrong offset!");
static_assert(offsetof(ABP_HijackCarParts_06_City2_C, BoneMod) == 0x000738, "Member 'ABP_HijackCarParts_06_City2_C::BoneMod' has a wrong offset!");

}

