#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HYP_Shield_AmpDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HYP_Shield_Basic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HYP_Shield_AmpDamage.BP_HYP_Shield_AmpDamage_C
// 0x0050 (0x03A8 - 0x0358)
class UBP_HYP_Shield_AmpDamage_C final : public UBP_HYP_Shield_Basic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(Transient, DuplicateTransient)
	float                                         AmpTime;                                           // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AmpScale;                                          // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            Audio_AmpStack_1;                                  // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            Audio_AmpStack_2;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            Audio_AmpStack_3;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            Audio_AmpStack_4;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            Audio_AmpStack_5;                                  // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumStacks;                                         // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseEvent*                            Audio_AmpFiringSweetener;                          // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStatusEffectData*                      WeaponAmpDamage_StatusEffectData;                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HYP_Shield_AmpDamage(int32 EntryPoint);
	void OnWeaponUsed();
	void Weapon_Put_Down(class AWeapon* Weapon);
	void Weapon_Equip();
	void OnShieldBreak();
	void OnTakeWeaponShieldDamage(class UDamageComponent* DamageReceiver, float ShieldDamage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser);
	void OnShieldCreated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HYP_Shield_AmpDamage_C">();
	}
	static class UBP_HYP_Shield_AmpDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HYP_Shield_AmpDamage_C>();
	}
};
static_assert(alignof(UBP_HYP_Shield_AmpDamage_C) == 0x000008, "Wrong alignment on UBP_HYP_Shield_AmpDamage_C");
static_assert(sizeof(UBP_HYP_Shield_AmpDamage_C) == 0x0003A8, "Wrong size on UBP_HYP_Shield_AmpDamage_C");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, UberGraphFrame) == 0x000358, "Member 'UBP_HYP_Shield_AmpDamage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, AmpTime) == 0x000360, "Member 'UBP_HYP_Shield_AmpDamage_C::AmpTime' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, AmpScale) == 0x000364, "Member 'UBP_HYP_Shield_AmpDamage_C::AmpScale' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, Audio_AmpStack_1) == 0x000368, "Member 'UBP_HYP_Shield_AmpDamage_C::Audio_AmpStack_1' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, Audio_AmpStack_2) == 0x000370, "Member 'UBP_HYP_Shield_AmpDamage_C::Audio_AmpStack_2' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, Audio_AmpStack_3) == 0x000378, "Member 'UBP_HYP_Shield_AmpDamage_C::Audio_AmpStack_3' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, Audio_AmpStack_4) == 0x000380, "Member 'UBP_HYP_Shield_AmpDamage_C::Audio_AmpStack_4' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, Audio_AmpStack_5) == 0x000388, "Member 'UBP_HYP_Shield_AmpDamage_C::Audio_AmpStack_5' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, NumStacks) == 0x000390, "Member 'UBP_HYP_Shield_AmpDamage_C::NumStacks' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, Audio_AmpFiringSweetener) == 0x000398, "Member 'UBP_HYP_Shield_AmpDamage_C::Audio_AmpFiringSweetener' has a wrong offset!");
static_assert(offsetof(UBP_HYP_Shield_AmpDamage_C, WeaponAmpDamage_StatusEffectData) == 0x0003A0, "Member 'UBP_HYP_Shield_AmpDamage_C::WeaponAmpDamage_StatusEffectData' has a wrong offset!");

}

