#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HijackCarParts_07_Wetlands1

#include "Basic.hpp"

#include "BP_HijackCarParts_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HijackCarParts_07_Wetlands1.BP_HijackCarParts_07_Wetlands1_C
// 0x0010 (0x0740 - 0x0730)
class ABP_HijackCarParts_07_Wetlands1_C final : public ABP_HijackCarParts_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_HijackCarParts_07_Wetlands1_C;   // 0x0728(0x0008)(Transient, DuplicateTransient)
	class UMaterialInstance*                      RingHoloMaterial;                                  // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MetalTrimHoloMaterial;                             // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Challenge_Incomplete();
	void ExecuteUbergraph_BP_HijackCarParts_07_Wetlands1(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HijackCarParts_07_Wetlands1_C">();
	}
	static class ABP_HijackCarParts_07_Wetlands1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HijackCarParts_07_Wetlands1_C>();
	}
};
static_assert(alignof(ABP_HijackCarParts_07_Wetlands1_C) == 0x000010, "Wrong alignment on ABP_HijackCarParts_07_Wetlands1_C");
static_assert(sizeof(ABP_HijackCarParts_07_Wetlands1_C) == 0x000740, "Wrong size on ABP_HijackCarParts_07_Wetlands1_C");
static_assert(offsetof(ABP_HijackCarParts_07_Wetlands1_C, UberGraphFrame_BP_HijackCarParts_07_Wetlands1_C) == 0x000728, "Member 'ABP_HijackCarParts_07_Wetlands1_C::UberGraphFrame_BP_HijackCarParts_07_Wetlands1_C' has a wrong offset!");
static_assert(offsetof(ABP_HijackCarParts_07_Wetlands1_C, RingHoloMaterial) == 0x000730, "Member 'ABP_HijackCarParts_07_Wetlands1_C::RingHoloMaterial' has a wrong offset!");
static_assert(offsetof(ABP_HijackCarParts_07_Wetlands1_C, MetalTrimHoloMaterial) == 0x000738, "Member 'ABP_HijackCarParts_07_Wetlands1_C::MetalTrimHoloMaterial' has a wrong offset!");

}

