#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IO_Switch_Parent_V1

#include "Basic.hpp"

#include "Enum_States_SwitchFeedback_structs.hpp"
#include "Enum_Switch_State_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_Switch_ReasonForMoving_structs.hpp"


namespace SDK::Params
{

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.GetSwitchFeedbackState
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_GetSwitchFeedbackState final
{
public:
	Enum_States_SwitchFeedback                    FeedbackState;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_GetSwitchFeedbackState) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_GetSwitchFeedbackState");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_GetSwitchFeedbackState) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C_GetSwitchFeedbackState");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_GetSwitchFeedbackState, FeedbackState) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_GetSwitchFeedbackState::FeedbackState' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.GetSwitchState
// 0x0002 (0x0002 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_GetSwitchState final
{
public:
	Enum_Switch_State                             SwitchState;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_GetSwitchState) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_GetSwitchState");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_GetSwitchState) == 0x000002, "Wrong size on BP_IO_Switch_Parent_V1_C_GetSwitchState");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_GetSwitchState, SwitchState) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_GetSwitchState::SwitchState' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_GetSwitchState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_IO_Switch_Parent_V1_C_GetSwitchState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.GetSwitchLockedState
// 0x0002 (0x0002 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_GetSwitchLockedState final
{
public:
	bool                                          Locked;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_GetSwitchLockedState) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_GetSwitchLockedState");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_GetSwitchLockedState) == 0x000002, "Wrong size on BP_IO_Switch_Parent_V1_C_GetSwitchLockedState");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_GetSwitchLockedState, Locked) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_GetSwitchLockedState::Locked' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_GetSwitchLockedState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_IO_Switch_Parent_V1_C_GetSwitchLockedState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.GetSwitchInteractiveState
// 0x0002 (0x0002 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_GetSwitchInteractiveState final
{
public:
	bool                                          Interactive;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_GetSwitchInteractiveState) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_GetSwitchInteractiveState");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_GetSwitchInteractiveState) == 0x000002, "Wrong size on BP_IO_Switch_Parent_V1_C_GetSwitchInteractiveState");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_GetSwitchInteractiveState, Interactive) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_GetSwitchInteractiveState::Interactive' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_GetSwitchInteractiveState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_IO_Switch_Parent_V1_C_GetSwitchInteractiveState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.PlayControllerAndCameraFeedback
// 0x0010 (0x0010 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_PlayControllerAndCameraFeedback final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_PlayControllerAndCameraFeedback) == 0x000004, "Wrong alignment on BP_IO_Switch_Parent_V1_C_PlayControllerAndCameraFeedback");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_PlayControllerAndCameraFeedback) == 0x000010, "Wrong size on BP_IO_Switch_Parent_V1_C_PlayControllerAndCameraFeedback");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_PlayControllerAndCameraFeedback, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_PlayControllerAndCameraFeedback::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_PlayControllerAndCameraFeedback, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_IO_Switch_Parent_V1_C_PlayControllerAndCameraFeedback::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.AddToDynamicMaterialArray
// 0x0020 (0x0020 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray final
{
public:
	class UMeshComponent*                         NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray) == 0x000020, "Wrong size on BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray, NewParam) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray::NewParam' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray, CallFunc_GetMaterial_ReturnValue) == 0x000008, "Member 'BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray, CallFunc_Array_AddUnique_ReturnValue) == 0x00001C, "Member 'BP_IO_Switch_Parent_V1_C_AddToDynamicMaterialArray::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetComponentsByClass_ReturnValue;         // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UPointLightComponent*>           CallFunc_GetComponentsByClass_ReturnValue1;        // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_UserConstructionScript");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_UserConstructionScript) == 0x000040, "Wrong size on BP_IO_Switch_Parent_V1_C_UserConstructionScript");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, K2Node_SwitchEnum1_CmpSuccess) == 0x00000D, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, CallFunc_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, CallFunc_GetComponentsByClass_ReturnValue1) == 0x000020, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::CallFunc_GetComponentsByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_IO_Switch_Parent_V1_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.SetSwitchState
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_SetSwitchState final
{
public:
	Enum_Switch_State                             SwitchState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_SetSwitchState) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_SetSwitchState");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_SetSwitchState) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C_SetSwitchState");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_SetSwitchState, SwitchState) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_SetSwitchState::SwitchState' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.SetSwitchInteractiveState
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_SetSwitchInteractiveState final
{
public:
	bool                                          Interactive;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_SetSwitchInteractiveState) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_SetSwitchInteractiveState");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_SetSwitchInteractiveState) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C_SetSwitchInteractiveState");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_SetSwitchInteractiveState, Interactive) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_SetSwitchInteractiveState::Interactive' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.SetSwitchLockedState
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_SetSwitchLockedState final
{
public:
	bool                                          Locked;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_SetSwitchLockedState) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_SetSwitchLockedState");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_SetSwitchLockedState) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C_SetSwitchLockedState");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_SetSwitchLockedState, Locked) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_SetSwitchLockedState::Locked' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.PlaySwitchMovement
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_PlaySwitchMovement final
{
public:
	Enum_Switch_ReasonForMoving                   Reason;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_PlaySwitchMovement) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_PlaySwitchMovement");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_PlaySwitchMovement) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C_PlaySwitchMovement");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_PlaySwitchMovement, Reason) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_PlaySwitchMovement::Reason' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.PrepPlaySwitchMovement
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_PrepPlaySwitchMovement final
{
public:
	Enum_Switch_ReasonForMoving                   Reason;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_PrepPlaySwitchMovement) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_PrepPlaySwitchMovement");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_PrepPlaySwitchMovement) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C_PrepPlaySwitchMovement");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_PrepPlaySwitchMovement, Reason) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_PrepPlaySwitchMovement::Reason' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.__UserState_SwitchPositionState_1
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_1) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_1");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_1) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_1");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_1, bFromLoad) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_1::bFromLoad' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.__UserState_SwitchPositionState_0
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_0 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_0) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_0");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_0) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_0");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_0, bFromLoad) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C___UserState_SwitchPositionState_0::bFromLoad' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.SetLightColor
// 0x0010 (0x0010 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_SetLightColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_SetLightColor) == 0x000004, "Wrong alignment on BP_IO_Switch_Parent_V1_C_SetLightColor");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_SetLightColor) == 0x000010, "Wrong size on BP_IO_Switch_Parent_V1_C_SetLightColor");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_SetLightColor, Color) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_SetLightColor::Color' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.__UserState_SwitchFeedbackState_1
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_1) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_1");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_1) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_1");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_1, bFromLoad) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_1::bFromLoad' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.__UserState_SwitchFeedbackState_0
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_0 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_0) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_0");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_0) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_0");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_0, bFromLoad) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_0::bFromLoad' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.__UserState_SwitchFeedbackState_2
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_2 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_2) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_2");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_2) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_2");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_2, bFromLoad) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C___UserState_SwitchFeedbackState_2::bFromLoad' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BP_IO_Switch_Parent_V1
// 0x0018 (0x0018 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BP_IO_Switch_Parent_V1 final
{
public:
	struct FUseEvent                              UseEvent;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BP_IO_Switch_Parent_V1) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BP_IO_Switch_Parent_V1");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BP_IO_Switch_Parent_V1) == 0x000018, "Wrong size on BP_IO_Switch_Parent_V1_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BP_IO_Switch_Parent_V1");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BP_IO_Switch_Parent_V1, UseEvent) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BP_IO_Switch_Parent_V1::UseEvent' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.SetSwitchFeedbackState
// 0x0001 (0x0001 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_SetSwitchFeedbackState final
{
public:
	Enum_States_SwitchFeedback                    FeedbackState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_SetSwitchFeedbackState) == 0x000001, "Wrong alignment on BP_IO_Switch_Parent_V1_C_SetSwitchFeedbackState");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_SetSwitchFeedbackState) == 0x000001, "Wrong size on BP_IO_Switch_Parent_V1_C_SetSwitchFeedbackState");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_SetSwitchFeedbackState, FeedbackState) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_SetSwitchFeedbackState::FeedbackState' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.ExecuteUbergraph_BP_IO_Switch_Parent_V1
// 0x0128 (0x0128 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Switch_State                             K2Node_Event_SwitchState;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Interactive;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Locked;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_Switch_ReasonForMoving                   K2Node_CustomEvent_Reason1;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasEnableConditionsSetForSpecificUserState_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasEnableConditionsSetForSpecificUserState_ReturnValue1; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0020(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x0038(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_Switch_ReasonForMoving                   K2Node_CustomEvent_Reason;                         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue2;              // 0x0058(0x0018)()
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad4;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad3;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0074(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   CallFunc_Array_Get_Item1;                          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue1;    // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad2;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad1;                  // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad;                   // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FUseEvent                              K2Node_ComponentBoundEvent_UseEvent;               // 0x00C8(0x0018)(ConstParm, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_States_SwitchFeedback                    K2Node_Event_FeedbackState;                        // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue3;              // 0x00F0(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue4;              // 0x0108(0x0018)()
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1) == 0x000128, "Wrong size on BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, EntryPoint) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_Event_SwitchState) == 0x000004, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_Event_SwitchState' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_Event_Interactive) == 0x000005, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_Event_Interactive' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_Event_Locked) == 0x000007, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_Event_Locked' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_CustomEvent_Reason1) == 0x000008, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_CustomEvent_Reason1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_HasEnableConditionsSetForSpecificUserState_ReturnValue) == 0x000010, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_HasEnableConditionsSetForSpecificUserState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_HasEnableConditionsSetForSpecificUserState_ReturnValue1) == 0x000011, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_HasEnableConditionsSetForSpecificUserState_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, Temp_int_Array_Index_Variable1) == 0x000014, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000018, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_PostWwiseEvent_ReturnValue) == 0x000020, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_PostWwiseEvent_ReturnValue1) == 0x000038, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_CustomEvent_Reason) == 0x000051, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_CustomEvent_Reason' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_SwitchEnum1_CmpSuccess) == 0x000052, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000053, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_SwitchEnum2_CmpSuccess) == 0x000054, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_PostWwiseEvent_ReturnValue2) == 0x000058, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_PostWwiseEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_SwitchEnum3_CmpSuccess) == 0x000070, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_UserStateEvent_bFromLoad4) == 0x000071, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_UserStateEvent_bFromLoad4' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_UserStateEvent_bFromLoad3) == 0x000072, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_UserStateEvent_bFromLoad3' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_CustomEvent_Color) == 0x000074, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Array_Get_Item) == 0x000088, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000090, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Array_Get_Item1) == 0x0000A8, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Array_Length_ReturnValue1) == 0x0000B0, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Conv_LinearColorToVector_ReturnValue1) == 0x0000B8, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Conv_LinearColorToVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0000C4, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_UserStateEvent_bFromLoad2) == 0x0000C5, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_UserStateEvent_bFromLoad2' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_UserStateEvent_bFromLoad1) == 0x0000C6, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_UserStateEvent_bFromLoad1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_UserStateEvent_bFromLoad) == 0x0000C7, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_UserStateEvent_bFromLoad' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_ComponentBoundEvent_UseEvent) == 0x0000C8, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_ComponentBoundEvent_UseEvent' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, Temp_int_Loop_Counter_Variable1) == 0x0000E0, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Less_IntInt_ReturnValue1) == 0x0000E4, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_Add_IntInt_ReturnValue1) == 0x0000E8, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, K2Node_Event_FeedbackState) == 0x0000EC, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::K2Node_Event_FeedbackState' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_PostWwiseEvent_ReturnValue3) == 0x0000F0, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_PostWwiseEvent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_PostWwiseEvent_ReturnValue4) == 0x000108, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_PostWwiseEvent_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1, CallFunc_IsValidClass_ReturnValue) == 0x000120, "Member 'BP_IO_Switch_Parent_V1_C_ExecuteUbergraph_BP_IO_Switch_Parent_V1::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.On_SwitchLockedUsed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_On_SwitchLockedUsed__DelegateSignature final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_On_SwitchLockedUsed__DelegateSignature) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_On_SwitchLockedUsed__DelegateSignature");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_On_SwitchLockedUsed__DelegateSignature) == 0x000008, "Wrong size on BP_IO_Switch_Parent_V1_C_On_SwitchLockedUsed__DelegateSignature");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_On_SwitchLockedUsed__DelegateSignature, UserController) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_On_SwitchLockedUsed__DelegateSignature::UserController' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.On_SwitchUsed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_On_SwitchUsed__DelegateSignature final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_On_SwitchUsed__DelegateSignature) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_On_SwitchUsed__DelegateSignature");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_On_SwitchUsed__DelegateSignature) == 0x000008, "Wrong size on BP_IO_Switch_Parent_V1_C_On_SwitchUsed__DelegateSignature");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_On_SwitchUsed__DelegateSignature, UserController) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_On_SwitchUsed__DelegateSignature::UserController' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.On_SwitchTurningOff__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_On_SwitchTurningOff__DelegateSignature final
{
public:
	class AActor*                                 LastActorToUseSwitch;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_On_SwitchTurningOff__DelegateSignature) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_On_SwitchTurningOff__DelegateSignature");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_On_SwitchTurningOff__DelegateSignature) == 0x000008, "Wrong size on BP_IO_Switch_Parent_V1_C_On_SwitchTurningOff__DelegateSignature");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_On_SwitchTurningOff__DelegateSignature, LastActorToUseSwitch) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_On_SwitchTurningOff__DelegateSignature::LastActorToUseSwitch' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.On_SwitchTurningOn__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_On_SwitchTurningOn__DelegateSignature final
{
public:
	class AActor*                                 LastActorToUseSwitch;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_On_SwitchTurningOn__DelegateSignature) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_On_SwitchTurningOn__DelegateSignature");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_On_SwitchTurningOn__DelegateSignature) == 0x000008, "Wrong size on BP_IO_Switch_Parent_V1_C_On_SwitchTurningOn__DelegateSignature");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_On_SwitchTurningOn__DelegateSignature, LastActorToUseSwitch) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_On_SwitchTurningOn__DelegateSignature::LastActorToUseSwitch' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.On_SwitchOff__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_On_SwitchOff__DelegateSignature final
{
public:
	class AActor*                                 LastActorToUseSwitch;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_On_SwitchOff__DelegateSignature) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_On_SwitchOff__DelegateSignature");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_On_SwitchOff__DelegateSignature) == 0x000008, "Wrong size on BP_IO_Switch_Parent_V1_C_On_SwitchOff__DelegateSignature");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_On_SwitchOff__DelegateSignature, LastActorToUseSwitch) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_On_SwitchOff__DelegateSignature::LastActorToUseSwitch' has a wrong offset!");

// Function BP_IO_Switch_Parent_V1.BP_IO_Switch_Parent_V1_C.On_SwitchOn__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_IO_Switch_Parent_V1_C_On_SwitchOn__DelegateSignature final
{
public:
	class AActor*                                 LastActorToUseSwitch;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_IO_Switch_Parent_V1_C_On_SwitchOn__DelegateSignature) == 0x000008, "Wrong alignment on BP_IO_Switch_Parent_V1_C_On_SwitchOn__DelegateSignature");
static_assert(sizeof(BP_IO_Switch_Parent_V1_C_On_SwitchOn__DelegateSignature) == 0x000008, "Wrong size on BP_IO_Switch_Parent_V1_C_On_SwitchOn__DelegateSignature");
static_assert(offsetof(BP_IO_Switch_Parent_V1_C_On_SwitchOn__DelegateSignature, LastActorToUseSwitch) == 0x000000, "Member 'BP_IO_Switch_Parent_V1_C_On_SwitchOn__DelegateSignature::LastActorToUseSwitch' has a wrong offset!");

}

