#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IO_ShootingRangeTargetDoor

#include "Basic.hpp"

#include "OakGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IO_ShootingRangeTargetDoor.BP_IO_ShootingRangeTargetDoor_C
// 0x0018 (0x0568 - 0x0550)
class ABP_IO_ShootingRangeTargetDoor_C final : public AInteractiveObject
{
public:
	class UStaticMeshComponent*                   Plane;                                             // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Spaceship_Window_Skylight_2000x500;             // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IO_ShootingRangeTargetDoor_C">();
	}
	static class ABP_IO_ShootingRangeTargetDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IO_ShootingRangeTargetDoor_C>();
	}
};
static_assert(alignof(ABP_IO_ShootingRangeTargetDoor_C) == 0x000008, "Wrong alignment on ABP_IO_ShootingRangeTargetDoor_C");
static_assert(sizeof(ABP_IO_ShootingRangeTargetDoor_C) == 0x000568, "Wrong size on ABP_IO_ShootingRangeTargetDoor_C");
static_assert(offsetof(ABP_IO_ShootingRangeTargetDoor_C, Plane) == 0x000550, "Member 'ABP_IO_ShootingRangeTargetDoor_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_IO_ShootingRangeTargetDoor_C, SM_Spaceship_Window_Skylight_2000x500) == 0x000558, "Member 'ABP_IO_ShootingRangeTargetDoor_C::SM_Spaceship_Window_Skylight_2000x500' has a wrong offset!");
static_assert(offsetof(ABP_IO_ShootingRangeTargetDoor_C, DefaultSceneRoot) == 0x000560, "Member 'ABP_IO_ShootingRangeTargetDoor_C::DefaultSceneRoot' has a wrong offset!");

}

