#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputComponent_SDUCase

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxInput_structs.hpp"
#include "GbxInput_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InputComponent_SDUCase.BP_InputComponent_SDUCase_C
// 0x03E0 (0x06D0 - 0x02F0)
class UBP_InputComponent_SDUCase_C final : public UGbxInputComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(Transient, DuplicateTransient)
	class ASDUCaseProxy*                          SDUCaseProxy;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxInputEvent_Button_PressPulse       GbxInputEvent__0;                                  // 0x0300(0x0098)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressPulse       GbxInputEvent__1;                                  // 0x0398(0x0098)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressPulse       GbxInputEvent__2;                                  // 0x0430(0x0098)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressPulse       GbxInputEvent__3;                                  // 0x04C8(0x0098)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__4;                                  // 0x0560(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__5;                                  // 0x05D8(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_OakUIAxis               GbxInputEvent__6;                                  // 0x0650(0x0080)(ContainsInstancedReference)

public:
	void K2Node_GbxInputEvent_Button_PressPulse_0_Released_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_0_Pulse_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_0_InitialPulse_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_0_Pressed_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_1_Released_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_1_Pulse_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_1_InitialPulse_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_1_Pressed_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_3_Released_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_3_Pulse_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_3_InitialPulse_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_3_Pressed_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_6_Released_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_6_Pulse_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_6_InitialPulse_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressPulse_6_Pressed_exec(float NextPulseDelay);
	void K2Node_GbxInputEvent_Button_PressRelease_0_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_0_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_2_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_2_Pressed_exec();
	void K2Node_GbxInputEvent_OakUIAxis_0_Released_exec(const struct FVector& Val, bool bGamePad);
	void K2Node_GbxInputEvent_OakUIAxis_0_Held_exec(const struct FVector& Val, bool bGamePad);
	void K2Node_GbxInputEvent_OakUIAxis_0_Pressed_exec(const struct FVector& Val, bool bGamePad);
	void GbxInputEvent_0(float NextPulseDelay);
	void GbxInputEvent_1(float NextPulseDelay);
	void GbxInputEvent_2(float NextPulseDelay);
	void GbxInputEvent_3(float NextPulseDelay);
	void GbxInputEvent_4();
	void ReceiveBeginPlay();
	void GbxInputEvent_5();
	void GbxInputEvent_6(const struct FVector& Val, bool bGamePad);
	void ExecuteUbergraph_BP_InputComponent_SDUCase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InputComponent_SDUCase_C">();
	}
	static class UBP_InputComponent_SDUCase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InputComponent_SDUCase_C>();
	}
};
static_assert(alignof(UBP_InputComponent_SDUCase_C) == 0x000008, "Wrong alignment on UBP_InputComponent_SDUCase_C");
static_assert(sizeof(UBP_InputComponent_SDUCase_C) == 0x0006D0, "Wrong size on UBP_InputComponent_SDUCase_C");
static_assert(offsetof(UBP_InputComponent_SDUCase_C, UberGraphFrame) == 0x0002F0, "Member 'UBP_InputComponent_SDUCase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InputComponent_SDUCase_C, SDUCaseProxy) == 0x0002F8, "Member 'UBP_InputComponent_SDUCase_C::SDUCaseProxy' has a wrong offset!");
static_assert(offsetof(UBP_InputComponent_SDUCase_C, GbxInputEvent__0) == 0x000300, "Member 'UBP_InputComponent_SDUCase_C::GbxInputEvent__0' has a wrong offset!");
static_assert(offsetof(UBP_InputComponent_SDUCase_C, GbxInputEvent__1) == 0x000398, "Member 'UBP_InputComponent_SDUCase_C::GbxInputEvent__1' has a wrong offset!");
static_assert(offsetof(UBP_InputComponent_SDUCase_C, GbxInputEvent__2) == 0x000430, "Member 'UBP_InputComponent_SDUCase_C::GbxInputEvent__2' has a wrong offset!");
static_assert(offsetof(UBP_InputComponent_SDUCase_C, GbxInputEvent__3) == 0x0004C8, "Member 'UBP_InputComponent_SDUCase_C::GbxInputEvent__3' has a wrong offset!");
static_assert(offsetof(UBP_InputComponent_SDUCase_C, GbxInputEvent__4) == 0x000560, "Member 'UBP_InputComponent_SDUCase_C::GbxInputEvent__4' has a wrong offset!");
static_assert(offsetof(UBP_InputComponent_SDUCase_C, GbxInputEvent__5) == 0x0005D8, "Member 'UBP_InputComponent_SDUCase_C::GbxInputEvent__5' has a wrong offset!");
static_assert(offsetof(UBP_InputComponent_SDUCase_C, GbxInputEvent__6) == 0x000650, "Member 'UBP_InputComponent_SDUCase_C::GbxInputEvent__6' has a wrong offset!");

}

