#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IO_Sabotage_RecruitmentBoard

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_IO_Sabotage_RecruitmentBoard.BP_IO_Sabotage_RecruitmentBoard_C.ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard
// 0x0038 (0x0038 - 0x0000)
struct BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue1;       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue3;       // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue4;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         CallFunc_CheckChallengeArrayStatus_Completed_Challenges_Array; // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard) == 0x000008, "Wrong alignment on BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard");
static_assert(sizeof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard) == 0x000038, "Wrong size on BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, EntryPoint) == 0x000000, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_Map_Find_Value) == 0x000008, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_Map_Find_ReturnValue) == 0x00000C, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_EqualEqual_FloatFloat_ReturnValue1) == 0x000015, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_EqualEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x000016, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_EqualEqual_FloatFloat_ReturnValue3) == 0x000017, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_EqualEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_EqualEqual_FloatFloat_ReturnValue4) == 0x000018, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_EqualEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard, CallFunc_CheckChallengeArrayStatus_Completed_Challenges_Array) == 0x000028, "Member 'BP_IO_Sabotage_RecruitmentBoard_C_ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard::CallFunc_CheckChallengeArrayStatus_Completed_Challenges_Array' has a wrong offset!");

}

