#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IO_Sabotage_RecruitmentBoard

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IO_Sabotage_RecruitmentBoard.BP_IO_Sabotage_RecruitmentBoard_C
// 0x00E0 (0x0630 - 0x0550)
class ABP_IO_Sabotage_RecruitmentBoard_C final : public AInteractiveObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SK_02_Moxxie;                                      // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_03_Moxxie;                                      // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_04_Moxxie;                                      // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlayerSkin;                                        // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WeaponSkin;                                        // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BoardMesh;                                         // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         SabotageChallenges;                                // 0x0590(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                         CompletedSabotageChallenges;                       // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                         RewardStats;                                       // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UStaticMesh*                            TrinketMesh;                                       // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      TrinketRevealTempMaterial;                         // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, float>                            RewardStatTracker;                                 // 0x05D0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   DebugCallfromLevelBP;                              // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void OnRep_NewVar_1();
	void OnRep_CompletedSabotageChallenges();
	void DebugCallfromLevelBP_Event();
	void ExecuteUbergraph_BP_IO_Sabotage_RecruitmentBoard(int32 EntryPoint);
	void DebugCallfromLevelBP__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IO_Sabotage_RecruitmentBoard_C">();
	}
	static class ABP_IO_Sabotage_RecruitmentBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IO_Sabotage_RecruitmentBoard_C>();
	}
};
static_assert(alignof(ABP_IO_Sabotage_RecruitmentBoard_C) == 0x000008, "Wrong alignment on ABP_IO_Sabotage_RecruitmentBoard_C");
static_assert(sizeof(ABP_IO_Sabotage_RecruitmentBoard_C) == 0x000630, "Wrong size on ABP_IO_Sabotage_RecruitmentBoard_C");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, UberGraphFrame) == 0x000550, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, SK_02_Moxxie) == 0x000558, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::SK_02_Moxxie' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, SK_03_Moxxie) == 0x000560, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::SK_03_Moxxie' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, SK_04_Moxxie) == 0x000568, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::SK_04_Moxxie' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, PlayerSkin) == 0x000570, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::PlayerSkin' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, WeaponSkin) == 0x000578, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::WeaponSkin' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, BoardMesh) == 0x000580, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::BoardMesh' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, DefaultSceneRoot) == 0x000588, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, SabotageChallenges) == 0x000590, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::SabotageChallenges' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, CompletedSabotageChallenges) == 0x0005A0, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::CompletedSabotageChallenges' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, RewardStats) == 0x0005B0, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::RewardStats' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, TrinketMesh) == 0x0005C0, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::TrinketMesh' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, TrinketRevealTempMaterial) == 0x0005C8, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::TrinketRevealTempMaterial' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, RewardStatTracker) == 0x0005D0, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::RewardStatTracker' has a wrong offset!");
static_assert(offsetof(ABP_IO_Sabotage_RecruitmentBoard_C, DebugCallfromLevelBP) == 0x000620, "Member 'ABP_IO_Sabotage_RecruitmentBoard_C::DebugCallfromLevelBP' has a wrong offset!");

}

