#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LostLootMachine

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LostLootMachine.BP_LostLootMachine_C.ExecuteUbergraph_BP_LostLootMachine
// 0x0200 (0x0200 - 0x0000)
struct BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_UsagePercentage;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUseEvent                              K2Node_ComponentBoundEvent_UseEvent;               // 0x0008(0x0018)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0020(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult1;   // 0x00B0(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x0140(0x0018)()
	class UWwiseAudioComponent*                   CallFunc_GetAudioComponentFromPlaybackInstance_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0160(0x0018)()
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x0188(0x0018)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x01A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue1;         // 0x01C8(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine) == 0x000008, "Wrong alignment on BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine");
static_assert(sizeof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine) == 0x000200, "Wrong size on BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, EntryPoint) == 0x000000, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, K2Node_Event_UsagePercentage) == 0x000004, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::K2Node_Event_UsagePercentage' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, K2Node_ComponentBoundEvent_UseEvent) == 0x000008, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::K2Node_ComponentBoundEvent_UseEvent' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000020, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_K2_SetRelativeLocation_SweepHitResult1) == 0x0000B0, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_K2_SetRelativeLocation_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_PostAttachedEvent_ReturnValue) == 0x000140, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_PostAttachedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_GetAudioComponentFromPlaybackInstance_ReturnValue) == 0x000158, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_GetAudioComponentFromPlaybackInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_PostWwiseEvent_ReturnValue) == 0x000160, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000178, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_PostEventAtLocation_ReturnValue) == 0x000188, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_GetOwner_ReturnValue) == 0x0001A0, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x0001A8, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, K2Node_DynamicCast_AsOak_Player_Controller) == 0x0001B8, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_PostEventAtLocation_ReturnValue1) == 0x0001C8, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_PostEventAtLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, Temp_int_Variable) == 0x0001E0, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_Greater_IntInt_ReturnValue) == 0x0001E4, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001E8, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001EC, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001F0, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x0001F4, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001F8, "Member 'BP_LostLootMachine_C_ExecuteUbergraph_BP_LostLootMachine::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_LostLootMachine.BP_LostLootMachine_C.OnSetScreenState
// 0x0004 (0x0004 - 0x0000)
struct BP_LostLootMachine_C_OnSetScreenState final
{
public:
	float                                         UsagePercentage;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LostLootMachine_C_OnSetScreenState) == 0x000004, "Wrong alignment on BP_LostLootMachine_C_OnSetScreenState");
static_assert(sizeof(BP_LostLootMachine_C_OnSetScreenState) == 0x000004, "Wrong size on BP_LostLootMachine_C_OnSetScreenState");
static_assert(offsetof(BP_LostLootMachine_C_OnSetScreenState, UsagePercentage) == 0x000000, "Member 'BP_LostLootMachine_C_OnSetScreenState::UsagePercentage' has a wrong offset!");

// Function BP_LostLootMachine.BP_LostLootMachine_C.BndEvt__Usable_K2Node_ComponentBoundEvent_2_UsableUsedSignature__DelegateSignature_BP_LostLootMachine
// 0x0018 (0x0018 - 0x0000)
struct BP_LostLootMachine_C_BndEvt__Usable_K2Node_ComponentBoundEvent_2_UsableUsedSignature__DelegateSignature_BP_LostLootMachine final
{
public:
	struct FUseEvent                              UseEvent;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_LostLootMachine_C_BndEvt__Usable_K2Node_ComponentBoundEvent_2_UsableUsedSignature__DelegateSignature_BP_LostLootMachine) == 0x000008, "Wrong alignment on BP_LostLootMachine_C_BndEvt__Usable_K2Node_ComponentBoundEvent_2_UsableUsedSignature__DelegateSignature_BP_LostLootMachine");
static_assert(sizeof(BP_LostLootMachine_C_BndEvt__Usable_K2Node_ComponentBoundEvent_2_UsableUsedSignature__DelegateSignature_BP_LostLootMachine) == 0x000018, "Wrong size on BP_LostLootMachine_C_BndEvt__Usable_K2Node_ComponentBoundEvent_2_UsableUsedSignature__DelegateSignature_BP_LostLootMachine");
static_assert(offsetof(BP_LostLootMachine_C_BndEvt__Usable_K2Node_ComponentBoundEvent_2_UsableUsedSignature__DelegateSignature_BP_LostLootMachine, UseEvent) == 0x000000, "Member 'BP_LostLootMachine_C_BndEvt__Usable_K2Node_ComponentBoundEvent_2_UsableUsedSignature__DelegateSignature_BP_LostLootMachine::UseEvent' has a wrong offset!");

// Function BP_LostLootMachine.BP_LostLootMachine_C.UpdateMaterialState
// 0x0008 (0x0008 - 0x0000)
struct BP_LostLootMachine_C_UpdateMaterialState final
{
public:
	float                                         UsagePercentage;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LostLootMachine_C_UpdateMaterialState) == 0x000004, "Wrong alignment on BP_LostLootMachine_C_UpdateMaterialState");
static_assert(sizeof(BP_LostLootMachine_C_UpdateMaterialState) == 0x000008, "Wrong size on BP_LostLootMachine_C_UpdateMaterialState");
static_assert(offsetof(BP_LostLootMachine_C_UpdateMaterialState, UsagePercentage) == 0x000000, "Member 'BP_LostLootMachine_C_UpdateMaterialState::UsagePercentage' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_UpdateMaterialState, CallFunc_Less_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_LostLootMachine_C_UpdateMaterialState::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LostLootMachine_C_UpdateMaterialState, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_LostLootMachine_C_UpdateMaterialState::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

