#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OakMission

#include "Basic.hpp"

#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function BP_OakMission.BP_OakMission_C.ExecuteUbergraph_BP_OakMission
// 0x000C (0x000C - 0x0000)
struct BP_OakMission_C_ExecuteUbergraph_BP_OakMission final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OakMission_C_ExecuteUbergraph_BP_OakMission) == 0x000004, "Wrong alignment on BP_OakMission_C_ExecuteUbergraph_BP_OakMission");
static_assert(sizeof(BP_OakMission_C_ExecuteUbergraph_BP_OakMission) == 0x00000C, "Wrong size on BP_OakMission_C_ExecuteUbergraph_BP_OakMission");
static_assert(offsetof(BP_OakMission_C_ExecuteUbergraph_BP_OakMission, EntryPoint) == 0x000000, "Member 'BP_OakMission_C_ExecuteUbergraph_BP_OakMission::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OakMission_C_ExecuteUbergraph_BP_OakMission, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent) == 0x000004, "Member 'BP_OakMission_C_ExecuteUbergraph_BP_OakMission::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent' has a wrong offset!");
static_assert(offsetof(BP_OakMission_C_ExecuteUbergraph_BP_OakMission, MissionK2Node_ObjectiveEvent_ObjectiveEvent) == 0x000005, "Member 'BP_OakMission_C_ExecuteUbergraph_BP_OakMission::MissionK2Node_ObjectiveEvent_ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(BP_OakMission_C_ExecuteUbergraph_BP_OakMission, MissionK2Node_ObjectiveEvent_ObjectiveCount) == 0x000008, "Member 'BP_OakMission_C_ExecuteUbergraph_BP_OakMission::MissionK2Node_ObjectiveEvent_ObjectiveCount' has a wrong offset!");

// Function BP_OakMission.BP_OakMission_C.Obj_Dummy
// 0x0008 (0x0008 - 0x0000)
struct BP_OakMission_C_Obj_Dummy final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OakMission_C_Obj_Dummy) == 0x000004, "Wrong alignment on BP_OakMission_C_Obj_Dummy");
static_assert(sizeof(BP_OakMission_C_Obj_Dummy) == 0x000008, "Wrong size on BP_OakMission_C_Obj_Dummy");
static_assert(offsetof(BP_OakMission_C_Obj_Dummy, ObjectiveEvent) == 0x000000, "Member 'BP_OakMission_C_Obj_Dummy::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(BP_OakMission_C_Obj_Dummy, ObjectiveCount) == 0x000004, "Member 'BP_OakMission_C_Obj_Dummy::ObjectiveCount' has a wrong offset!");

// Function BP_OakMission.BP_OakMission_C.Set_Dummy
// 0x0001 (0x0001 - 0x0000)
struct BP_OakMission_C_Set_Dummy final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OakMission_C_Set_Dummy) == 0x000001, "Wrong alignment on BP_OakMission_C_Set_Dummy");
static_assert(sizeof(BP_OakMission_C_Set_Dummy) == 0x000001, "Wrong size on BP_OakMission_C_Set_Dummy");
static_assert(offsetof(BP_OakMission_C_Set_Dummy, ObjectiveSetEvent) == 0x000000, "Member 'BP_OakMission_C_Set_Dummy::ObjectiveSetEvent' has a wrong offset!");

}

