#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OakAttributeComponent

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Enum_ElementalAffinity_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function BP_OakAttributeComponent.BP_OakAttributeComponent_C.ExecuteUbergraph_BP_OakAttributeComponent
// 0x0004 (0x0004 - 0x0000)
struct BP_OakAttributeComponent_C_ExecuteUbergraph_BP_OakAttributeComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OakAttributeComponent_C_ExecuteUbergraph_BP_OakAttributeComponent) == 0x000004, "Wrong alignment on BP_OakAttributeComponent_C_ExecuteUbergraph_BP_OakAttributeComponent");
static_assert(sizeof(BP_OakAttributeComponent_C_ExecuteUbergraph_BP_OakAttributeComponent) == 0x000004, "Wrong size on BP_OakAttributeComponent_C_ExecuteUbergraph_BP_OakAttributeComponent");
static_assert(offsetof(BP_OakAttributeComponent_C_ExecuteUbergraph_BP_OakAttributeComponent, EntryPoint) == 0x000000, "Member 'BP_OakAttributeComponent_C_ExecuteUbergraph_BP_OakAttributeComponent::EntryPoint' has a wrong offset!");

// Function BP_OakAttributeComponent.BP_OakAttributeComponent_C.SetElementAffinity
// 0x01B0 (0x01B0 - 0x0000)
struct BP_OakAttributeComponent_C_SetElementAffinity final
{
public:
	EOakElementalType                             Element;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_ElementalAffinity                        Affinity;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_ElementalAffinity                        MyAffinity;                                        // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             MyElement;                                         // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxAttributeModifierHandle>    MyNewAttributeEffects;                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable1;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable2;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable3;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable4;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable5;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_AttributeEffectSet_C*               Temp_object_Variable6;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable7;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable8;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable9;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable10;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable11;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_ElementalAffinity                        Temp_byte_Variable1;                               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_AttributeEffectSet_C*               Temp_object_Variable12;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             Temp_byte_Variable2;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_AttributeEffectSet_C*               Temp_object_Variable13;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable14;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable15;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable16;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable17;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               Temp_object_Variable18;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             Temp_byte_Variable3;                               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAttributeModifierHandle            CallFunc_Array_Get_Item;                           // 0x00F0(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOakElementalType                             Temp_byte_Variable4;                               // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_AttributeEffectSet_C*               K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               K2Node_Select1_Default;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               K2Node_Select2_Default;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDA_AttributeEffectSet_C*               K2Node_Select3_Default;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxAttributeModifierHandle>    K2Node_Select4_Default;                            // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAttributeModifierHandle            CallFunc_Array_Get_Item1;                          // 0x0148(0x0010)()
	TArray<struct FGbxAttributeModifierHandle>    CallFunc_ApplyAttributeEffectSet_AppliedAttributeEffects; // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_RemoveAttributeModifier_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeModifierHandle            CallFunc_Array_Get_Item2;                          // 0x0170(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOakElementalType                             Temp_byte_Variable5;                               // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxAttributeModifierHandle>    K2Node_Select5_Default;                            // 0x0198(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OakAttributeComponent_C_SetElementAffinity) == 0x000008, "Wrong alignment on BP_OakAttributeComponent_C_SetElementAffinity");
static_assert(sizeof(BP_OakAttributeComponent_C_SetElementAffinity) == 0x0001B0, "Wrong size on BP_OakAttributeComponent_C_SetElementAffinity");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Element) == 0x000000, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Element' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Affinity) == 0x000001, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Affinity' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, MyAffinity) == 0x000002, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::MyAffinity' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, MyElement) == 0x000003, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::MyElement' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, MyNewAttributeEffects) == 0x000008, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::MyNewAttributeEffects' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable) == 0x000018, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable1) == 0x000020, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable2) == 0x000028, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable3) == 0x000030, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable4) == 0x000038, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable5) == 0x000040, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_byte_Variable) == 0x000048, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable6) == 0x000050, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable7) == 0x000058, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable8) == 0x000060, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable8' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable9) == 0x000068, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable9' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable10) == 0x000070, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable10' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable11) == 0x000078, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable11' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_byte_Variable1) == 0x000080, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable12) == 0x000088, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable12' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_byte_Variable2) == 0x000090, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable13) == 0x000098, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable13' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable14) == 0x0000A0, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable14' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable15) == 0x0000A8, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable15' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable16) == 0x0000B0, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable16' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable17) == 0x0000B8, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable17' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_object_Variable18) == 0x0000C0, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_object_Variable18' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_int_Loop_Counter_Variable) == 0x0000C8, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_int_Loop_Counter_Variable1) == 0x0000CC, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Add_IntInt_ReturnValue1) == 0x0000D4, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_int_Array_Index_Variable) == 0x0000D8, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_byte_Variable3) == 0x0000DC, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_int_Array_Index_Variable1) == 0x0000E0, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_int_Loop_Counter_Variable2) == 0x0000E4, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Add_IntInt_ReturnValue2) == 0x0000E8, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_int_Array_Index_Variable2) == 0x0000EC, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Less_IntInt_ReturnValue) == 0x000104, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_byte_Variable4) == 0x000105, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, K2Node_Select_Default) == 0x000108, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, K2Node_Select1_Default) == 0x000110, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, K2Node_Select2_Default) == 0x000118, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, K2Node_Select3_Default) == 0x000120, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, K2Node_Select4_Default) == 0x000130, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_GetOwner_ReturnValue) == 0x000140, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Array_Get_Item1) == 0x000148, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_ApplyAttributeEffectSet_AppliedAttributeEffects) == 0x000158, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_ApplyAttributeEffectSet_AppliedAttributeEffects' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_RemoveAttributeModifier_ReturnValue) == 0x000168, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_RemoveAttributeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Array_Get_Item2) == 0x000170, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Array_Length_ReturnValue1) == 0x000180, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Array_Add_ReturnValue) == 0x000184, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Less_IntInt_ReturnValue1) == 0x000188, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Array_Length_ReturnValue2) == 0x00018C, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Less_IntInt_ReturnValue2) == 0x000190, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, Temp_byte_Variable5) == 0x000191, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, K2Node_Select5_Default) == 0x000198, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(BP_OakAttributeComponent_C_SetElementAffinity, CallFunc_Array_Add_ReturnValue1) == 0x0001A8, "Member 'BP_OakAttributeComponent_C_SetElementAffinity::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");

}

