#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhaseTranceSingularity_Slam_Fracture

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PhaseTranceSingularity_Slam_Fracture.BP_PhaseTranceSingularity_Slam_Fracture_C.ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture
// 0x0018 (0x0018 - 0x0000)
struct BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_GetSingularityAttachComponent_Res;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture) == 0x000008, "Wrong alignment on BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture");
static_assert(sizeof(BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture) == 0x000018, "Wrong size on BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture");
static_assert(offsetof(BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture, EntryPoint) == 0x000000, "Member 'BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture, CallFunc_GetSingularityAttachComponent_Res) == 0x000008, "Member 'BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture::CallFunc_GetSingularityAttachComponent_Res' has a wrong offset!");
static_assert(offsetof(BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000011, "Member 'BP_PhaseTranceSingularity_Slam_Fracture_C_ExecuteUbergraph_BP_PhaseTranceSingularity_Slam_Fracture::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_PhaseTranceSingularity_Slam_Fracture.BP_PhaseTranceSingularity_Slam_Fracture_C.GetSingularityAttachComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_PhaseTranceSingularity_Slam_Fracture_C_GetSingularityAttachComponent final
{
public:
	class UBoxComponent*                          Res;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhaseTranceSingularity_Slam_Fracture_C_GetSingularityAttachComponent) == 0x000008, "Wrong alignment on BP_PhaseTranceSingularity_Slam_Fracture_C_GetSingularityAttachComponent");
static_assert(sizeof(BP_PhaseTranceSingularity_Slam_Fracture_C_GetSingularityAttachComponent) == 0x000010, "Wrong size on BP_PhaseTranceSingularity_Slam_Fracture_C_GetSingularityAttachComponent");
static_assert(offsetof(BP_PhaseTranceSingularity_Slam_Fracture_C_GetSingularityAttachComponent, Res) == 0x000000, "Member 'BP_PhaseTranceSingularity_Slam_Fracture_C_GetSingularityAttachComponent::Res' has a wrong offset!");
static_assert(offsetof(BP_PhaseTranceSingularity_Slam_Fracture_C_GetSingularityAttachComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_PhaseTranceSingularity_Slam_Fracture_C_GetSingularityAttachComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

}

