#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RarityWeightValueResolver

#include "Basic.hpp"

#include "Struct_BaseItemRarity_structs.hpp"


namespace SDK::Params
{

// Function BP_RarityWeightValueResolver.BP_RarityWeightValueResolver_C.GetValueForAttribute
// 0x0020 (0x0020 - 0x0000)
struct BP_RarityWeightValueResolver_C_GetValueForAttribute final
{
public:
	const class UGbxAttributeData*                Attribute;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UObject*                          Context;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContextGameStage;                                  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ProposedNewVersionOfGetValue_Value;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RarityWeightValueResolver_C_GetValueForAttribute) == 0x000008, "Wrong alignment on BP_RarityWeightValueResolver_C_GetValueForAttribute");
static_assert(sizeof(BP_RarityWeightValueResolver_C_GetValueForAttribute) == 0x000020, "Wrong size on BP_RarityWeightValueResolver_C_GetValueForAttribute");
static_assert(offsetof(BP_RarityWeightValueResolver_C_GetValueForAttribute, Attribute) == 0x000000, "Member 'BP_RarityWeightValueResolver_C_GetValueForAttribute::Attribute' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_GetValueForAttribute, Context) == 0x000008, "Member 'BP_RarityWeightValueResolver_C_GetValueForAttribute::Context' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_GetValueForAttribute, ReturnValue) == 0x000010, "Member 'BP_RarityWeightValueResolver_C_GetValueForAttribute::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_GetValueForAttribute, ContextGameStage) == 0x000014, "Member 'BP_RarityWeightValueResolver_C_GetValueForAttribute::ContextGameStage' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_GetValueForAttribute, CallFunc_ProposedNewVersionOfGetValue_Value) == 0x000018, "Member 'BP_RarityWeightValueResolver_C_GetValueForAttribute::CallFunc_ProposedNewVersionOfGetValue_Value' has a wrong offset!");

// Function BP_RarityWeightValueResolver.BP_RarityWeightValueResolver_C.ProposedNewVersionOfGetValue
// 0x0048 (0x0048 - 0x0000)
struct BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_BaseItemRarity                 CallFunc_GetDataTableRowFromHandle_OutRow;         // 0x0010(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromHandle_ReturnValue;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue2;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue3;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue4;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateRarityWeight_Weight;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue) == 0x000008, "Wrong alignment on BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue");
static_assert(sizeof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue) == 0x000048, "Wrong size on BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, Context) == 0x000000, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::Context' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, Value) == 0x000008, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::Value' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, CallFunc_GetValueOfAttribute_ReturnValue) == 0x00000C, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, CallFunc_GetDataTableRowFromHandle_OutRow) == 0x000010, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::CallFunc_GetDataTableRowFromHandle_OutRow' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, CallFunc_GetDataTableRowFromHandle_ReturnValue) == 0x000030, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::CallFunc_GetDataTableRowFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000034, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, CallFunc_GetValueOfAttribute_ReturnValue2) == 0x000038, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::CallFunc_GetValueOfAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, CallFunc_GetValueOfAttribute_ReturnValue3) == 0x00003C, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::CallFunc_GetValueOfAttribute_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, CallFunc_GetValueOfAttribute_ReturnValue4) == 0x000040, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::CallFunc_GetValueOfAttribute_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue, CallFunc_CalculateRarityWeight_Weight) == 0x000044, "Member 'BP_RarityWeightValueResolver_C_ProposedNewVersionOfGetValue::CallFunc_CalculateRarityWeight_Weight' has a wrong offset!");

}

