#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SDUCase

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function BP_SDUCase.BP_SDUCase_C.OnPlayerStopInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_SDUCase_C_OnPlayerStopInteraction final
{
public:
	class AOakPlayerController*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SDUCase_C_OnPlayerStopInteraction) == 0x000008, "Wrong alignment on BP_SDUCase_C_OnPlayerStopInteraction");
static_assert(sizeof(BP_SDUCase_C_OnPlayerStopInteraction) == 0x000008, "Wrong size on BP_SDUCase_C_OnPlayerStopInteraction");
static_assert(offsetof(BP_SDUCase_C_OnPlayerStopInteraction, Player) == 0x000000, "Member 'BP_SDUCase_C_OnPlayerStopInteraction::Player' has a wrong offset!");

// Function BP_SDUCase.BP_SDUCase_C.OnPlayerBeginInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_SDUCase_C_OnPlayerBeginInteraction final
{
public:
	class AOakPlayerController*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SDUCase_C_OnPlayerBeginInteraction) == 0x000008, "Wrong alignment on BP_SDUCase_C_OnPlayerBeginInteraction");
static_assert(sizeof(BP_SDUCase_C_OnPlayerBeginInteraction) == 0x000008, "Wrong size on BP_SDUCase_C_OnPlayerBeginInteraction");
static_assert(offsetof(BP_SDUCase_C_OnPlayerBeginInteraction, Player) == 0x000000, "Member 'BP_SDUCase_C_OnPlayerBeginInteraction::Player' has a wrong offset!");

// Function BP_SDUCase.BP_SDUCase_C.ExecuteUbergraph_BP_SDUCase
// 0x0250 (0x0250 - 0x0000)
struct BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0224(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0236(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_237[0x1];                                      // 0x0237(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_Event_Player1;                              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_Event_Player;                               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue1; // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase) == 0x000008, "Wrong alignment on BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase");
static_assert(sizeof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase) == 0x000250, "Wrong size on BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, EntryPoint) == 0x000000, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, CallFunc_GetMissionObjectiveStatusRef_ReturnValue) == 0x000220, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::CallFunc_GetMissionObjectiveStatusRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, CallFunc_FinishTriggerDialog_Conversation) == 0x000224, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, CallFunc_FinishTriggerDialog_SequenceID) == 0x000230, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000234, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, K2Node_SwitchEnum_CmpSuccess) == 0x000235, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, CallFunc_Conv_IntToBool_ReturnValue) == 0x000236, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, K2Node_Event_Player1) == 0x000238, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::K2Node_Event_Player1' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, K2Node_Event_Player) == 0x000240, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, CallFunc_GetMissionObjectiveStatusRef_ReturnValue1) == 0x000248, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::CallFunc_GetMissionObjectiveStatusRef_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase, K2Node_SwitchEnum1_CmpSuccess) == 0x000249, "Member 'BP_SDUCase_C_ExecuteUbergraph_BP_SDUCase::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");

}

