#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TedBehavior_ETech

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TedBehavior_ETech.BP_TedBehavior_ETech_C.K2_OnProjectileExplode
// 0x02B0 (0x02B0 - 0x0000)
struct BP_TedBehavior_ETech_C_K2_OnProjectileExplode final
{
public:
	class ATedioreProjectile*                     Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplatData*                             SplatData;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_GetProjectileDamageType_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0070(0x0230)(ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue1;       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue2;       // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue3;       // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue4;       // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode) == 0x000010, "Wrong alignment on BP_TedBehavior_ETech_C_K2_OnProjectileExplode");
static_assert(sizeof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode) == 0x0002B0, "Wrong size on BP_TedBehavior_ETech_C_K2_OnProjectileExplode");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, Projectile) == 0x000000, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::Projectile' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, SplatData) == 0x000008, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::SplatData' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_GetProjectileDamageType_ReturnValue) == 0x000060, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_GetProjectileDamageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000070, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0002A0, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_SpawnActorAsync_ReturnValue) == 0x0002A4, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_EqualEqual_ClassClass_ReturnValue1) == 0x0002A8, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_EqualEqual_ClassClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_EqualEqual_ClassClass_ReturnValue2) == 0x0002A9, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_EqualEqual_ClassClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_EqualEqual_ClassClass_ReturnValue3) == 0x0002AA, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_EqualEqual_ClassClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_TedBehavior_ETech_C_K2_OnProjectileExplode, CallFunc_EqualEqual_ClassClass_ReturnValue4) == 0x0002AB, "Member 'BP_TedBehavior_ETech_C_K2_OnProjectileExplode::CallFunc_EqualEqual_ClassClass_ReturnValue4' has a wrong offset!");

}

