#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendingMachineProxyBase

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VendingMachineProxyBase.BP_VendingMachineProxyBase_C
// 0x00A0 (0x0AA0 - 0x0A00)
class ABP_VendingMachineProxyBase_C : public AVendingMachineProxy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A00(0x0008)(Transient, DuplicateTransient)
	class UWwiseAudioComponent*                   WwiseAudio;                                        // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Faceplate;                                         // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dark_Background;                                   // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   InteriorLight;                                     // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   ExteriorLight;                                     // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NearbyPlayerFX_Deactivate;                         // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NearbyPlayerFX_StartAndLoop;                       // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         InteriorLightOnFlicker_Intensity_91B61C0D48D36A8B9DB815A09D9577BB; // 0x0A40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            InteriorLightOnFlicker__Direction_91B61C0D48D36A8B9DB815A09D9577BB; // 0x0A44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A45[0x3];                                      // 0x0A45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     InteriorLightOnFlicker;                            // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InteriorLightIdleFlicker02_Intensity_F478F26B45D0AC3B0BA120A4C65DA846; // 0x0A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            InteriorLightIdleFlicker02__Direction_F478F26B45D0AC3B0BA120A4C65DA846; // 0x0A54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A55[0x3];                                      // 0x0A55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     InteriorLightIdleFlicker02;                        // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InteriorLightIdleFlicker01_Intensity_58BFA2824EF612DBCD4AB09469040806; // 0x0A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            InteriorLightIdleFlicker01__Direction_58BFA2824EF612DBCD4AB09469040806; // 0x0A64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A65[0x3];                                      // 0x0A65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     InteriorLightIdleFlicker01;                        // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExteriorLightOff_Intensity_03E80D8345D0DFF74B5D78A6FC21924E; // 0x0A70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ExteriorLightOff__Direction_03E80D8345D0DFF74B5D78A6FC21924E; // 0x0A74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A75[0x3];                                      // 0x0A75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ExteriorLightOff;                                  // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExteriorLightOn_Intensity_67573662403B2E5F0F377785A30E539E; // 0x0A80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ExteriorLightOn__Direction_67573662403B2E5F0F377785A30E539E; // 0x0A84(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A85[0x3];                                      // 0x0A85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ExteriorLightOn;                                   // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MachineInUse;                                      // 0x0A90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A91[0x3];                                      // 0x0A91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteriorLightIntensity;                            // 0x0A94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExteriorLightIntensity;                            // 0x0A98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void TurnOnExteriorLight();
	void TurnOffInteriorLight();
	void ReceiveBeginPlay();
	void PlayStartupAnim();
	void PlayFrontPanelSFX();
	void OnStopInteractionSequenceFinished();
	void OnStartInteractionSequenceFinished();
	void OnOwningPlayerStoppedInteraction();
	void OnOwningPlayerStartedInteraction();
	void OnOwningPlayerExitedInteractRange();
	void OnOwningPlayerEnteredInteractRange();
	void InteriorLightOnFlicker__UpdateFunc();
	void InteriorLightOnFlicker__FinishedFunc();
	void InteriorLightOnFlicker__AudioEvent__EventFunc();
	void InteriorLightIdleFlicker02__UpdateFunc();
	void InteriorLightIdleFlicker02__FinishedFunc();
	void InteriorLightIdleFlicker02__AudioEvent__EventFunc();
	void InteriorLightIdleFlicker01__UpdateFunc();
	void InteriorLightIdleFlicker01__FinishedFunc();
	void InteriorLightIdleFlicker01__AudioEvent__EventFunc();
	void ExteriorLightOn__UpdateFunc();
	void ExteriorLightOn__FinishedFunc();
	void ExteriorLightOff__UpdateFunc();
	void ExteriorLightOff__FinishedFunc();
	void AttemptInteriorLightFlicker();
	void K2_OnBoughtSomething(EVendingMachineBuyType Type, class AActor* InventoryActor);
	void K2_OnSoldAllJunk();
	void K2_OnSoldSomething(class AActor* InventoryActor);
	void ExecuteUbergraph_BP_VendingMachineProxyBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VendingMachineProxyBase_C">();
	}
	static class ABP_VendingMachineProxyBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VendingMachineProxyBase_C>();
	}
};
static_assert(alignof(ABP_VendingMachineProxyBase_C) == 0x000010, "Wrong alignment on ABP_VendingMachineProxyBase_C");
static_assert(sizeof(ABP_VendingMachineProxyBase_C) == 0x000AA0, "Wrong size on ABP_VendingMachineProxyBase_C");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, UberGraphFrame) == 0x000A00, "Member 'ABP_VendingMachineProxyBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, WwiseAudio) == 0x000A08, "Member 'ABP_VendingMachineProxyBase_C::WwiseAudio' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, Faceplate) == 0x000A10, "Member 'ABP_VendingMachineProxyBase_C::Faceplate' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, Dark_Background) == 0x000A18, "Member 'ABP_VendingMachineProxyBase_C::Dark_Background' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLight) == 0x000A20, "Member 'ABP_VendingMachineProxyBase_C::InteriorLight' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, ExteriorLight) == 0x000A28, "Member 'ABP_VendingMachineProxyBase_C::ExteriorLight' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, NearbyPlayerFX_Deactivate) == 0x000A30, "Member 'ABP_VendingMachineProxyBase_C::NearbyPlayerFX_Deactivate' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, NearbyPlayerFX_StartAndLoop) == 0x000A38, "Member 'ABP_VendingMachineProxyBase_C::NearbyPlayerFX_StartAndLoop' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightOnFlicker_Intensity_91B61C0D48D36A8B9DB815A09D9577BB) == 0x000A40, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightOnFlicker_Intensity_91B61C0D48D36A8B9DB815A09D9577BB' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightOnFlicker__Direction_91B61C0D48D36A8B9DB815A09D9577BB) == 0x000A44, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightOnFlicker__Direction_91B61C0D48D36A8B9DB815A09D9577BB' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightOnFlicker) == 0x000A48, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightOnFlicker' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightIdleFlicker02_Intensity_F478F26B45D0AC3B0BA120A4C65DA846) == 0x000A50, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightIdleFlicker02_Intensity_F478F26B45D0AC3B0BA120A4C65DA846' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightIdleFlicker02__Direction_F478F26B45D0AC3B0BA120A4C65DA846) == 0x000A54, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightIdleFlicker02__Direction_F478F26B45D0AC3B0BA120A4C65DA846' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightIdleFlicker02) == 0x000A58, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightIdleFlicker02' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightIdleFlicker01_Intensity_58BFA2824EF612DBCD4AB09469040806) == 0x000A60, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightIdleFlicker01_Intensity_58BFA2824EF612DBCD4AB09469040806' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightIdleFlicker01__Direction_58BFA2824EF612DBCD4AB09469040806) == 0x000A64, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightIdleFlicker01__Direction_58BFA2824EF612DBCD4AB09469040806' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightIdleFlicker01) == 0x000A68, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightIdleFlicker01' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, ExteriorLightOff_Intensity_03E80D8345D0DFF74B5D78A6FC21924E) == 0x000A70, "Member 'ABP_VendingMachineProxyBase_C::ExteriorLightOff_Intensity_03E80D8345D0DFF74B5D78A6FC21924E' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, ExteriorLightOff__Direction_03E80D8345D0DFF74B5D78A6FC21924E) == 0x000A74, "Member 'ABP_VendingMachineProxyBase_C::ExteriorLightOff__Direction_03E80D8345D0DFF74B5D78A6FC21924E' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, ExteriorLightOff) == 0x000A78, "Member 'ABP_VendingMachineProxyBase_C::ExteriorLightOff' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, ExteriorLightOn_Intensity_67573662403B2E5F0F377785A30E539E) == 0x000A80, "Member 'ABP_VendingMachineProxyBase_C::ExteriorLightOn_Intensity_67573662403B2E5F0F377785A30E539E' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, ExteriorLightOn__Direction_67573662403B2E5F0F377785A30E539E) == 0x000A84, "Member 'ABP_VendingMachineProxyBase_C::ExteriorLightOn__Direction_67573662403B2E5F0F377785A30E539E' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, ExteriorLightOn) == 0x000A88, "Member 'ABP_VendingMachineProxyBase_C::ExteriorLightOn' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, MachineInUse) == 0x000A90, "Member 'ABP_VendingMachineProxyBase_C::MachineInUse' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, InteriorLightIntensity) == 0x000A94, "Member 'ABP_VendingMachineProxyBase_C::InteriorLightIntensity' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineProxyBase_C, ExteriorLightIntensity) == 0x000A98, "Member 'ABP_VendingMachineProxyBase_C::ExteriorLightIntensity' has a wrong offset!");

}

