#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendingMachineBase

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function BP_VendingMachineBase.BP_VendingMachineBase_C.OnPlayerStopInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_VendingMachineBase_C_OnPlayerStopInteraction final
{
public:
	class AOakPlayerController*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendingMachineBase_C_OnPlayerStopInteraction) == 0x000008, "Wrong alignment on BP_VendingMachineBase_C_OnPlayerStopInteraction");
static_assert(sizeof(BP_VendingMachineBase_C_OnPlayerStopInteraction) == 0x000008, "Wrong size on BP_VendingMachineBase_C_OnPlayerStopInteraction");
static_assert(offsetof(BP_VendingMachineBase_C_OnPlayerStopInteraction, Player) == 0x000000, "Member 'BP_VendingMachineBase_C_OnPlayerStopInteraction::Player' has a wrong offset!");

// Function BP_VendingMachineBase.BP_VendingMachineBase_C.OnPlayerBeginInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_VendingMachineBase_C_OnPlayerBeginInteraction final
{
public:
	class AOakPlayerController*                   Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendingMachineBase_C_OnPlayerBeginInteraction) == 0x000008, "Wrong alignment on BP_VendingMachineBase_C_OnPlayerBeginInteraction");
static_assert(sizeof(BP_VendingMachineBase_C_OnPlayerBeginInteraction) == 0x000008, "Wrong size on BP_VendingMachineBase_C_OnPlayerBeginInteraction");
static_assert(offsetof(BP_VendingMachineBase_C_OnPlayerBeginInteraction, Player) == 0x000000, "Member 'BP_VendingMachineBase_C_OnPlayerBeginInteraction::Player' has a wrong offset!");

// Function BP_VendingMachineBase.BP_VendingMachineBase_C.K2_OnSoldSomething
// 0x0008 (0x0008 - 0x0000)
struct BP_VendingMachineBase_C_K2_OnSoldSomething final
{
public:
	class AActor*                                 InventoryActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendingMachineBase_C_K2_OnSoldSomething) == 0x000008, "Wrong alignment on BP_VendingMachineBase_C_K2_OnSoldSomething");
static_assert(sizeof(BP_VendingMachineBase_C_K2_OnSoldSomething) == 0x000008, "Wrong size on BP_VendingMachineBase_C_K2_OnSoldSomething");
static_assert(offsetof(BP_VendingMachineBase_C_K2_OnSoldSomething, InventoryActor) == 0x000000, "Member 'BP_VendingMachineBase_C_K2_OnSoldSomething::InventoryActor' has a wrong offset!");

// Function BP_VendingMachineBase.BP_VendingMachineBase_C.K2_OnShelfStablySelected
// 0x0010 (0x0010 - 0x0000)
struct BP_VendingMachineBase_C_K2_OnShelfStablySelected final
{
public:
	EVendingMachineTrayTileType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InventoryActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendingMachineBase_C_K2_OnShelfStablySelected) == 0x000008, "Wrong alignment on BP_VendingMachineBase_C_K2_OnShelfStablySelected");
static_assert(sizeof(BP_VendingMachineBase_C_K2_OnShelfStablySelected) == 0x000010, "Wrong size on BP_VendingMachineBase_C_K2_OnShelfStablySelected");
static_assert(offsetof(BP_VendingMachineBase_C_K2_OnShelfStablySelected, Type) == 0x000000, "Member 'BP_VendingMachineBase_C_K2_OnShelfStablySelected::Type' has a wrong offset!");
static_assert(offsetof(BP_VendingMachineBase_C_K2_OnShelfStablySelected, InventoryActor) == 0x000008, "Member 'BP_VendingMachineBase_C_K2_OnShelfStablySelected::InventoryActor' has a wrong offset!");

// Function BP_VendingMachineBase.BP_VendingMachineBase_C.K2_OnBoughtSomething
// 0x0010 (0x0010 - 0x0000)
struct BP_VendingMachineBase_C_K2_OnBoughtSomething final
{
public:
	EVendingMachineBuyType                        Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InventoryActor;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendingMachineBase_C_K2_OnBoughtSomething) == 0x000008, "Wrong alignment on BP_VendingMachineBase_C_K2_OnBoughtSomething");
static_assert(sizeof(BP_VendingMachineBase_C_K2_OnBoughtSomething) == 0x000010, "Wrong size on BP_VendingMachineBase_C_K2_OnBoughtSomething");
static_assert(offsetof(BP_VendingMachineBase_C_K2_OnBoughtSomething, Type) == 0x000000, "Member 'BP_VendingMachineBase_C_K2_OnBoughtSomething::Type' has a wrong offset!");
static_assert(offsetof(BP_VendingMachineBase_C_K2_OnBoughtSomething, InventoryActor) == 0x000008, "Member 'BP_VendingMachineBase_C_K2_OnBoughtSomething::InventoryActor' has a wrong offset!");

// Function BP_VendingMachineBase.BP_VendingMachineBase_C.ExecuteUbergraph_BP_VendingMachineBase
// 0x1610 (0x1610 - 0x0000)
struct BP_VendingMachineBase_C_ExecuteUbergraph_BP_VendingMachineBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0220(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0438(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x044C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x045E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45F[0x1];                                      // 0x045F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0460(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0678(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation2;        // 0x0890(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID2;          // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue2;         // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A1[0x3];                                      // 0x08A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation3;        // 0x08A4(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID3;          // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue3;         // 0x08B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x08B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x08B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B7[0x1];                                      // 0x08B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x08B8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AD0(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation4;        // 0x0CE8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID4;          // 0x0CF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue4;         // 0x0CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF9[0x3];                                      // 0x0CF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation5;        // 0x0CFC(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID5;          // 0x0D08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue5;         // 0x0D0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0D0D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0D0E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D0F[0x1];                                      // 0x0D0F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0D10(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x0F28(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation6;        // 0x1140(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID6;          // 0x114C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue6;         // 0x1150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1151[0x3];                                     // 0x1151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation7;        // 0x1154(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID7;          // 0x1160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue7;         // 0x1164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x1165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x1166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1167[0x1];                                     // 0x1167(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_Event_Player1;                              // 0x1168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_InventoryActor2;                      // 0x1170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x1178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x1180(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation8;        // 0x1398(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID8;          // 0x13A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue8;         // 0x13A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x13A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13AA[0x6];                                     // 0x13AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue9;            // 0x13B0(0x0218)()
	class AOakPlayerController*                   K2Node_Event_Player;                               // 0x15C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation9;        // 0x15D0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID9;          // 0x15DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue9;         // 0x15E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVendingMachineTrayTileType                   K2Node_Event_Type1;                                // 0x15E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E2[0x6];                                     // 0x15E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InventoryActor1;                      // 0x15E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x15F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x15F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EVendingMachineBuyType                        K2Node_Event_Type;                                 // 0x15F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15F3[0x5];                                     // 0x15F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InventoryActor;                       // 0x15F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x1600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1601[0x7];                                     // 0x1601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x1608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendingMachineBase_C_ExecuteUbergraph_BP_VendingMachineBase) == 0x000008, "Wrong alignment on BP_VendingMachineBase_C_ExecuteUbergraph_BP_VendingMachineBase");
static_assert(sizeof(BP_VendingMachineBase_C_ExecuteUbergraph_BP_VendingMachineBase) == 0x001610, "Wrong size on BP_VendingMachineBase_C_ExecuteUbergraph_BP_VendingMachineBase");
static_assert(offsetof(BP_VendingMachineBase_C_ExecuteUbergraph_BP_VendingMachineBase, EntryPoint) == 0x000000, "Member 'BP_VendingMachineBase_C_ExecuteUbergraph_BP_VendingMachineBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VendingMachineBase_C_ExecuteUbergraph_BP_VendingMachineBase, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'BP_VendingMachineBase_C_ExecuteUbergraph_BP_VendingMachineBase::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
