#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendingMachine_Ammo

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function BP_VendingMachine_Ammo.BP_VendingMachine_Ammo_C.RefillAmmo
// 0x0040 (0x0040 - 0x0000)
struct BP_VendingMachine_Ammo_C_RefillAmmo final
{
public:
	class AOakCharacter*                          ContextSource;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGbxAttributeData*                Max;                                               // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGbxAttributeData*                Current;                                           // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAttributeModifierActionExecOutput         CallFunc_AddModifierToGbxAttribute_ModifierActionResult; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeModifierHandle            CallFunc_AddModifierToGbxAttribute_ReturnValue;    // 0x0028(0x0010)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VendingMachine_Ammo_C_RefillAmmo) == 0x000008, "Wrong alignment on BP_VendingMachine_Ammo_C_RefillAmmo");
static_assert(sizeof(BP_VendingMachine_Ammo_C_RefillAmmo) == 0x000040, "Wrong size on BP_VendingMachine_Ammo_C_RefillAmmo");
static_assert(offsetof(BP_VendingMachine_Ammo_C_RefillAmmo, ContextSource) == 0x000000, "Member 'BP_VendingMachine_Ammo_C_RefillAmmo::ContextSource' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_RefillAmmo, Max) == 0x000008, "Member 'BP_VendingMachine_Ammo_C_RefillAmmo::Max' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_RefillAmmo, Current) == 0x000010, "Member 'BP_VendingMachine_Ammo_C_RefillAmmo::Current' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_RefillAmmo, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000018, "Member 'BP_VendingMachine_Ammo_C_RefillAmmo::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_RefillAmmo, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x00001C, "Member 'BP_VendingMachine_Ammo_C_RefillAmmo::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_RefillAmmo, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_VendingMachine_Ammo_C_RefillAmmo::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_RefillAmmo, CallFunc_AddModifierToGbxAttribute_ModifierActionResult) == 0x000024, "Member 'BP_VendingMachine_Ammo_C_RefillAmmo::CallFunc_AddModifierToGbxAttribute_ModifierActionResult' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_RefillAmmo, CallFunc_AddModifierToGbxAttribute_ReturnValue) == 0x000028, "Member 'BP_VendingMachine_Ammo_C_RefillAmmo::CallFunc_AddModifierToGbxAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_RefillAmmo, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'BP_VendingMachine_Ammo_C_RefillAmmo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_VendingMachine_Ammo.BP_VendingMachine_Ammo_C.BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo
// 0x0010 (0x0010 - 0x0000)
struct BP_VendingMachine_Ammo_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendingMachine_Ammo_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo) == 0x000008, "Wrong alignment on BP_VendingMachine_Ammo_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo");
static_assert(sizeof(BP_VendingMachine_Ammo_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo) == 0x000010, "Wrong size on BP_VendingMachine_Ammo_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo");
static_assert(offsetof(BP_VendingMachine_Ammo_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo, UserController) == 0x000000, "Member 'BP_VendingMachine_Ammo_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo::UserController' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo, UsedComponent) == 0x000008, "Member 'BP_VendingMachine_Ammo_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Ammo::UsedComponent' has a wrong offset!");

// Function BP_VendingMachine_Ammo.BP_VendingMachine_Ammo_C.ExecuteUbergraph_BP_VendingMachine_Ammo
// 0x0270 (0x0270 - 0x0000)
struct BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_ComponentBoundEvent_UserController;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0018(0x0018)()
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0040(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0258(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo) == 0x000008, "Wrong alignment on BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo");
static_assert(sizeof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo) == 0x000270, "Wrong size on BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, EntryPoint) == 0x000000, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, K2Node_ComponentBoundEvent_UserController) == 0x000008, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::K2Node_ComponentBoundEvent_UserController' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, K2Node_ComponentBoundEvent_UsedComponent) == 0x000010, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::K2Node_ComponentBoundEvent_UsedComponent' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, CallFunc_PostWwiseEvent_ReturnValue) == 0x000018, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000030, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, CallFunc_NewDialogContext_ReturnValue) == 0x000040, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, CallFunc_FinishTriggerDialog_Conversation) == 0x000258, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, CallFunc_FinishTriggerDialog_SequenceID) == 0x000264, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000268, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo, CallFunc_Conv_IntToBool_ReturnValue) == 0x000269, "Member 'BP_VendingMachine_Ammo_C_ExecuteUbergraph_BP_VendingMachine_Ammo::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");

}

