#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendingMachineBase

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VendingMachineBase.BP_VendingMachineBase_C
// 0x0040 (0x0708 - 0x06C8)
class ABP_VendingMachineBase_C : public AVendingMachine
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C8(0x0008)(Transient, DuplicateTransient)
	class UGbxNavMeshPainterComponent*            GbxNavMeshPainter;                                 // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxNavBoxComponent*                    NavBox;                                            // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakDialogComponent*                    GbxDialog;                                         // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          UsableCollision;                                   // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   WwiseAudio;                                        // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TouchBox;                                          // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakMinimapIconComponent*               OakMinimapIcon;                                    // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void OnPlayerStopInteraction(class AOakPlayerController* Player);
	void OnPlayerBeginInteraction(class AOakPlayerController* Player);
	void K2_OnSoldSomething(class AActor* InventoryActor);
	void K2_OnSoldAllJunk();
	void K2_OnShelfStablySelected(EVendingMachineTrayTileType Type, class AActor* InventoryActor);
	void K2_OnBoughtSomething(EVendingMachineBuyType Type, class AActor* InventoryActor);
	void ExecuteUbergraph_BP_VendingMachineBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VendingMachineBase_C">();
	}
	static class ABP_VendingMachineBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VendingMachineBase_C>();
	}
};
static_assert(alignof(ABP_VendingMachineBase_C) == 0x000008, "Wrong alignment on ABP_VendingMachineBase_C");
static_assert(sizeof(ABP_VendingMachineBase_C) == 0x000708, "Wrong size on ABP_VendingMachineBase_C");
static_assert(offsetof(ABP_VendingMachineBase_C, UberGraphFrame) == 0x0006C8, "Member 'ABP_VendingMachineBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineBase_C, GbxNavMeshPainter) == 0x0006D0, "Member 'ABP_VendingMachineBase_C::GbxNavMeshPainter' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineBase_C, NavBox) == 0x0006D8, "Member 'ABP_VendingMachineBase_C::NavBox' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineBase_C, GbxDialog) == 0x0006E0, "Member 'ABP_VendingMachineBase_C::GbxDialog' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineBase_C, UsableCollision) == 0x0006E8, "Member 'ABP_VendingMachineBase_C::UsableCollision' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineBase_C, WwiseAudio) == 0x0006F0, "Member 'ABP_VendingMachineBase_C::WwiseAudio' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineBase_C, TouchBox) == 0x0006F8, "Member 'ABP_VendingMachineBase_C::TouchBox' has a wrong offset!");
static_assert(offsetof(ABP_VendingMachineBase_C, OakMinimapIcon) == 0x000700, "Member 'ABP_VendingMachineBase_C::OakMinimapIcon' has a wrong offset!");

}

