#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VendingMachine_Health

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function BP_VendingMachine_Health.BP_VendingMachine_Health_C.BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health
// 0x0010 (0x0010 - 0x0000)
struct BP_VendingMachine_Health_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VendingMachine_Health_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health) == 0x000008, "Wrong alignment on BP_VendingMachine_Health_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health");
static_assert(sizeof(BP_VendingMachine_Health_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health) == 0x000010, "Wrong size on BP_VendingMachine_Health_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health");
static_assert(offsetof(BP_VendingMachine_Health_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health, UserController) == 0x000000, "Member 'BP_VendingMachine_Health_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health::UserController' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health, UsedComponent) == 0x000008, "Member 'BP_VendingMachine_Health_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BP_VendingMachine_Health::UsedComponent' has a wrong offset!");

// Function BP_VendingMachine_Health.BP_VendingMachine_Health_C.ExecuteUbergraph_BP_VendingMachine_Health
// 0x02A0 (0x02A0 - 0x0000)
struct BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_ComponentBoundEvent_UserController;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0020(0x0218)()
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAttributeModifierActionExecOutput         CallFunc_AddModifierToGbxAttribute_ModifierActionResult; // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeModifierHandle            CallFunc_AddModifierToGbxAttribute_ReturnValue;    // 0x0240(0x0010)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0250(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_263[0x1];                                      // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAttributeModifierActionExecOutput         CallFunc_AddModifierToGbxAttribute_ModifierActionResult1; // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeModifierHandle            CallFunc_AddModifierToGbxAttribute_ReturnValue1;   // 0x0270(0x0010)()
	float                                         CallFunc_GetValueOfAttribute_ReturnValue2;         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0288(0x0018)()
};
static_assert(alignof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health) == 0x000008, "Wrong alignment on BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health");
static_assert(sizeof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health) == 0x0002A0, "Wrong size on BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, EntryPoint) == 0x000000, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, K2Node_ComponentBoundEvent_UserController) == 0x000008, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::K2Node_ComponentBoundEvent_UserController' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, K2Node_ComponentBoundEvent_UsedComponent) == 0x000010, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::K2Node_ComponentBoundEvent_UsedComponent' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_GetAssociatedCharacter_ReturnValue) == 0x000018, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_GetAssociatedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_NewDialogContext_ReturnValue) == 0x000020, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000238, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_AddModifierToGbxAttribute_ModifierActionResult) == 0x00023C, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_AddModifierToGbxAttribute_ModifierActionResult' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_AddModifierToGbxAttribute_ReturnValue) == 0x000240, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_AddModifierToGbxAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_FinishTriggerDialog_Conversation) == 0x000250, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_FinishTriggerDialog_SequenceID) == 0x00025C, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000260, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, K2Node_SwitchEnum_CmpSuccess) == 0x000261, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_Conv_IntToBool_ReturnValue) == 0x000262, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000264, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_AddModifierToGbxAttribute_ModifierActionResult1) == 0x000268, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_AddModifierToGbxAttribute_ModifierActionResult1' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_AddModifierToGbxAttribute_ReturnValue1) == 0x000270, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_AddModifierToGbxAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_GetValueOfAttribute_ReturnValue2) == 0x000280, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_GetValueOfAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, K2Node_SwitchEnum1_CmpSuccess) == 0x000284, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000285, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health, CallFunc_PostWwiseEvent_ReturnValue) == 0x000288, "Member 'BP_VendingMachine_Health_C_ExecuteUbergraph_BP_VendingMachine_Health::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");

}

