#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WantedPosterDefinition

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Enum_WantedPosterText_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WantedPosterDefinition.BP_WantedPosterDefinition_C
// 0x0010 (0x0110 - 0x0100)
class UBP_WantedPosterDefinition_C final : public UWantedPosterDefinition
{
public:
	float                                         WipeParameterVisible;                              // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WipeParameterHidden;                               // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_WantedPosterText                         HologramText;                                      // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WantedPosterDefinition_C">();
	}
	static class UBP_WantedPosterDefinition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WantedPosterDefinition_C>();
	}
};
static_assert(alignof(UBP_WantedPosterDefinition_C) == 0x000010, "Wrong alignment on UBP_WantedPosterDefinition_C");
static_assert(sizeof(UBP_WantedPosterDefinition_C) == 0x000110, "Wrong size on UBP_WantedPosterDefinition_C");
static_assert(offsetof(UBP_WantedPosterDefinition_C, WipeParameterVisible) == 0x000100, "Member 'UBP_WantedPosterDefinition_C::WipeParameterVisible' has a wrong offset!");
static_assert(offsetof(UBP_WantedPosterDefinition_C, WipeParameterHidden) == 0x000104, "Member 'UBP_WantedPosterDefinition_C::WipeParameterHidden' has a wrong offset!");
static_assert(offsetof(UBP_WantedPosterDefinition_C, HologramText) == 0x000108, "Member 'UBP_WantedPosterDefinition_C::HologramText' has a wrong offset!");

}

