#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponRackItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WeaponRackItem.BP_WeaponRackItem_C.CanBePickedUp
// 0x0020 (0x0020 - 0x0000)
struct BP_WeaponRackItem_C_CanBePickedUp final
{
public:
	class AOakCharacter*                          PickupInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsedByInstigator;                                  // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventoryItemPickup*                   WorldPickupActor;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WeaponRackItem_C_CanBePickedUp) == 0x000008, "Wrong alignment on BP_WeaponRackItem_C_CanBePickedUp");
static_assert(sizeof(BP_WeaponRackItem_C_CanBePickedUp) == 0x000020, "Wrong size on BP_WeaponRackItem_C_CanBePickedUp");
static_assert(offsetof(BP_WeaponRackItem_C_CanBePickedUp, PickupInstigator) == 0x000000, "Member 'BP_WeaponRackItem_C_CanBePickedUp::PickupInstigator' has a wrong offset!");
static_assert(offsetof(BP_WeaponRackItem_C_CanBePickedUp, Quantity) == 0x000008, "Member 'BP_WeaponRackItem_C_CanBePickedUp::Quantity' has a wrong offset!");
static_assert(offsetof(BP_WeaponRackItem_C_CanBePickedUp, UsedByInstigator) == 0x00000C, "Member 'BP_WeaponRackItem_C_CanBePickedUp::UsedByInstigator' has a wrong offset!");
static_assert(offsetof(BP_WeaponRackItem_C_CanBePickedUp, WorldPickupActor) == 0x000010, "Member 'BP_WeaponRackItem_C_CanBePickedUp::WorldPickupActor' has a wrong offset!");
static_assert(offsetof(BP_WeaponRackItem_C_CanBePickedUp, ReturnValue) == 0x000018, "Member 'BP_WeaponRackItem_C_CanBePickedUp::ReturnValue' has a wrong offset!");

}

