#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZoneMapAreaPOI

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ZoneMapAreaPOI.BP_ZoneMapAreaPOI_C.ExecuteUbergraph_BP_ZoneMapAreaPOI
// 0x0028 (0x0028 - 0x0000)
struct BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZoneMapViewer*                         K2Node_DynamicCast_AsZone_Map_Viewer;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI) == 0x000008, "Wrong alignment on BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI");
static_assert(sizeof(BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI) == 0x000028, "Wrong size on BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI");
static_assert(offsetof(BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI, EntryPoint) == 0x000000, "Member 'BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI, K2Node_DynamicCast_AsZone_Map_Viewer) == 0x000018, "Member 'BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI::K2Node_DynamicCast_AsZone_Map_Viewer' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'BP_ZoneMapAreaPOI_C_ExecuteUbergraph_BP_ZoneMapAreaPOI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

