#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZeroWantedPoster

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ZeroWantedPoster.BP_ZeroWantedPoster_C.Challenge_Incomplete
// 0x0002 (0x0002 - 0x0000)
struct BP_ZeroWantedPoster_C_Challenge_Incomplete final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroWantedPoster_C_Challenge_Incomplete) == 0x000001, "Wrong alignment on BP_ZeroWantedPoster_C_Challenge_Incomplete");
static_assert(sizeof(BP_ZeroWantedPoster_C_Challenge_Incomplete) == 0x000002, "Wrong size on BP_ZeroWantedPoster_C_Challenge_Incomplete");
static_assert(offsetof(BP_ZeroWantedPoster_C_Challenge_Incomplete, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_ZeroWantedPoster_C_Challenge_Incomplete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_Challenge_Incomplete, CallFunc_IsValid_ReturnValue1) == 0x000001, "Member 'BP_ZeroWantedPoster_C_Challenge_Incomplete::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function BP_ZeroWantedPoster.BP_ZeroWantedPoster_C.Challenge_Complete
// 0x0002 (0x0002 - 0x0000)
struct BP_ZeroWantedPoster_C_Challenge_Complete final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroWantedPoster_C_Challenge_Complete) == 0x000001, "Wrong alignment on BP_ZeroWantedPoster_C_Challenge_Complete");
static_assert(sizeof(BP_ZeroWantedPoster_C_Challenge_Complete) == 0x000002, "Wrong size on BP_ZeroWantedPoster_C_Challenge_Complete");
static_assert(offsetof(BP_ZeroWantedPoster_C_Challenge_Complete, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_ZeroWantedPoster_C_Challenge_Complete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_Challenge_Complete, CallFunc_IsValid_ReturnValue1) == 0x000001, "Member 'BP_ZeroWantedPoster_C_Challenge_Complete::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function BP_ZeroWantedPoster.BP_ZeroWantedPoster_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_ZeroWantedPoster_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroWantedPoster_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_ZeroWantedPoster_C_UserConstructionScript");
static_assert(sizeof(BP_ZeroWantedPoster_C_UserConstructionScript) == 0x000002, "Wrong size on BP_ZeroWantedPoster_C_UserConstructionScript");
static_assert(offsetof(BP_ZeroWantedPoster_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_ZeroWantedPoster_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000001, "Member 'BP_ZeroWantedPoster_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_ZeroWantedPoster.BP_ZeroWantedPoster_C.OnUsedSecondary
// 0x0010 (0x0010 - 0x0000)
struct BP_ZeroWantedPoster_C_OnUsedSecondary final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZeroWantedPoster_C_OnUsedSecondary) == 0x000008, "Wrong alignment on BP_ZeroWantedPoster_C_OnUsedSecondary");
static_assert(sizeof(BP_ZeroWantedPoster_C_OnUsedSecondary) == 0x000010, "Wrong size on BP_ZeroWantedPoster_C_OnUsedSecondary");
static_assert(offsetof(BP_ZeroWantedPoster_C_OnUsedSecondary, UserController) == 0x000000, "Member 'BP_ZeroWantedPoster_C_OnUsedSecondary::UserController' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_OnUsedSecondary, UsedComponent) == 0x000008, "Member 'BP_ZeroWantedPoster_C_OnUsedSecondary::UsedComponent' has a wrong offset!");

// Function BP_ZeroWantedPoster.BP_ZeroWantedPoster_C.__UserState_TrophyState_1
// 0x0001 (0x0001 - 0x0000)
struct BP_ZeroWantedPoster_C___UserState_TrophyState_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroWantedPoster_C___UserState_TrophyState_1) == 0x000001, "Wrong alignment on BP_ZeroWantedPoster_C___UserState_TrophyState_1");
static_assert(sizeof(BP_ZeroWantedPoster_C___UserState_TrophyState_1) == 0x000001, "Wrong size on BP_ZeroWantedPoster_C___UserState_TrophyState_1");
static_assert(offsetof(BP_ZeroWantedPoster_C___UserState_TrophyState_1, bFromLoad) == 0x000000, "Member 'BP_ZeroWantedPoster_C___UserState_TrophyState_1::bFromLoad' has a wrong offset!");

// Function BP_ZeroWantedPoster.BP_ZeroWantedPoster_C.__UserState_TrophyState_0
// 0x0001 (0x0001 - 0x0000)
struct BP_ZeroWantedPoster_C___UserState_TrophyState_0 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroWantedPoster_C___UserState_TrophyState_0) == 0x000001, "Wrong alignment on BP_ZeroWantedPoster_C___UserState_TrophyState_0");
static_assert(sizeof(BP_ZeroWantedPoster_C___UserState_TrophyState_0) == 0x000001, "Wrong size on BP_ZeroWantedPoster_C___UserState_TrophyState_0");
static_assert(offsetof(BP_ZeroWantedPoster_C___UserState_TrophyState_0, bFromLoad) == 0x000000, "Member 'BP_ZeroWantedPoster_C___UserState_TrophyState_0::bFromLoad' has a wrong offset!");

// Function BP_ZeroWantedPoster.BP_ZeroWantedPoster_C.__UserState_TrophyState_2
// 0x0001 (0x0001 - 0x0000)
struct BP_ZeroWantedPoster_C___UserState_TrophyState_2 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroWantedPoster_C___UserState_TrophyState_2) == 0x000001, "Wrong alignment on BP_ZeroWantedPoster_C___UserState_TrophyState_2");
static_assert(sizeof(BP_ZeroWantedPoster_C___UserState_TrophyState_2) == 0x000001, "Wrong size on BP_ZeroWantedPoster_C___UserState_TrophyState_2");
static_assert(offsetof(BP_ZeroWantedPoster_C___UserState_TrophyState_2, bFromLoad) == 0x000000, "Member 'BP_ZeroWantedPoster_C___UserState_TrophyState_2::bFromLoad' has a wrong offset!");

// Function BP_ZeroWantedPoster.BP_ZeroWantedPoster_C.ExecuteUbergraph_BP_ZeroWantedPoster
// 0x0058 (0x0058 - 0x0000)
struct BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_UserStateEvent_bFromLoad2;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDiscoveryComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelDiscovered_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_UserController;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_UsedComponent;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_UserStateEvent_bFromLoad;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChallengesComponent*                   CallFunc_GetComponentByClass_ReturnValue1;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChallengeComplete_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster) == 0x000008, "Wrong alignment on BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster");
static_assert(sizeof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster) == 0x000058, "Wrong size on BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, EntryPoint) == 0x000000, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, K2Node_UserStateEvent_bFromLoad2) == 0x000004, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::K2Node_UserStateEvent_bFromLoad2' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, K2Node_UserStateEvent_bFromLoad1) == 0x000005, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::K2Node_UserStateEvent_bFromLoad1' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, CallFunc_IsLevelDiscovered_ReturnValue) == 0x000020, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::CallFunc_IsLevelDiscovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, K2Node_CustomEvent_UserController) == 0x000028, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::K2Node_CustomEvent_UserController' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, K2Node_CustomEvent_UsedComponent) == 0x000030, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::K2Node_CustomEvent_UsedComponent' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, CallFunc_GetPlayerController_ReturnValue1) == 0x000038, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, K2Node_UserStateEvent_bFromLoad) == 0x000040, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::K2Node_UserStateEvent_bFromLoad' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, CallFunc_GetComponentByClass_ReturnValue1) == 0x000048, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster, CallFunc_IsChallengeComplete_ReturnValue) == 0x000050, "Member 'BP_ZeroWantedPoster_C_ExecuteUbergraph_BP_ZeroWantedPoster::CallFunc_IsChallengeComplete_ReturnValue' has a wrong offset!");

}

