#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZeroWantedPoster

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Enum_TrophyState_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZeroWantedPoster.BP_ZeroWantedPoster_C
// 0x00A0 (0x0730 - 0x0690)
class ABP_ZeroWantedPoster_C final : public AConditionalFlavorTextIO
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Trophy2;                                           // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Trophy;                                            // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TrophyRoot;                                        // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Base;                                              // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 WantedChallenge;                                   // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            TrophyMesh;                                        // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TrophyTransform;                                   // 0x06D0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UMaterialInterface*                     PosterMaterial;                                    // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_TrophyState                              TrophyState;                                       // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelData*                             ChallengeZoneMap;                                  // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     TrophyMat;                                         // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxCondition*                          Cond_TrophyState_NewEnumerator1;                   // 0x0720(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGbxCondition*                          Cond_TrophyState_NewEnumerator2;                   // 0x0728(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Challenge_Incomplete();
	void Challenge_Complete();
	void UserConstructionScript();
	void OnUsedSecondary(class AController* UserController, class UPrimitiveComponent* UsedComponent);
	void ReceiveBeginPlay();
	void __UserState_TrophyState_1(bool bFromLoad);
	void __UserState_TrophyState_0(bool bFromLoad);
	void EvaluateChallenge();
	void __UserState_TrophyState_2(bool bFromLoad);
	void ExecuteUbergraph_BP_ZeroWantedPoster(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ZeroWantedPoster_C">();
	}
	static class ABP_ZeroWantedPoster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ZeroWantedPoster_C>();
	}
};
static_assert(alignof(ABP_ZeroWantedPoster_C) == 0x000010, "Wrong alignment on ABP_ZeroWantedPoster_C");
static_assert(sizeof(ABP_ZeroWantedPoster_C) == 0x000730, "Wrong size on ABP_ZeroWantedPoster_C");
static_assert(offsetof(ABP_ZeroWantedPoster_C, UberGraphFrame) == 0x000690, "Member 'ABP_ZeroWantedPoster_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, Trophy2) == 0x000698, "Member 'ABP_ZeroWantedPoster_C::Trophy2' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, Trophy) == 0x0006A0, "Member 'ABP_ZeroWantedPoster_C::Trophy' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, TrophyRoot) == 0x0006A8, "Member 'ABP_ZeroWantedPoster_C::TrophyRoot' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, Box) == 0x0006B0, "Member 'ABP_ZeroWantedPoster_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, Base) == 0x0006B8, "Member 'ABP_ZeroWantedPoster_C::Base' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, WantedChallenge) == 0x0006C0, "Member 'ABP_ZeroWantedPoster_C::WantedChallenge' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, TrophyMesh) == 0x0006C8, "Member 'ABP_ZeroWantedPoster_C::TrophyMesh' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, TrophyTransform) == 0x0006D0, "Member 'ABP_ZeroWantedPoster_C::TrophyTransform' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, PosterMaterial) == 0x000700, "Member 'ABP_ZeroWantedPoster_C::PosterMaterial' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, TrophyState) == 0x000708, "Member 'ABP_ZeroWantedPoster_C::TrophyState' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, ChallengeZoneMap) == 0x000710, "Member 'ABP_ZeroWantedPoster_C::ChallengeZoneMap' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, TrophyMat) == 0x000718, "Member 'ABP_ZeroWantedPoster_C::TrophyMat' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, Cond_TrophyState_NewEnumerator1) == 0x000720, "Member 'ABP_ZeroWantedPoster_C::Cond_TrophyState_NewEnumerator1' has a wrong offset!");
static_assert(offsetof(ABP_ZeroWantedPoster_C, Cond_TrophyState_NewEnumerator2) == 0x000728, "Member 'ABP_ZeroWantedPoster_C::Cond_TrophyState_NewEnumerator2' has a wrong offset!");

}

