#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZoneMapPOI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ZoneMapPOI.BP_ZoneMapPOI_C.ExecuteUbergraph_BP_ZoneMapPOI
// 0x0038 (0x0038 - 0x0000)
struct BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0010(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI) == 0x000008, "Wrong alignment on BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI");
static_assert(sizeof(BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI) == 0x000038, "Wrong size on BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI");
static_assert(offsetof(BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI, EntryPoint) == 0x000000, "Member 'BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000010, "Member 'BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'BP_ZoneMapPOI_C_ExecuteUbergraph_BP_ZoneMapPOI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_ZoneMapPOI.BP_ZoneMapPOI_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) BP_ZoneMapPOI_C_UserConstructionScript final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_ZoneMapPOI_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ZoneMapPOI_C_UserConstructionScript");
static_assert(sizeof(BP_ZoneMapPOI_C_UserConstructionScript) == 0x000030, "Wrong size on BP_ZoneMapPOI_C_UserConstructionScript");
static_assert(offsetof(BP_ZoneMapPOI_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_ZoneMapPOI_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapPOI_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate1) == 0x000010, "Member 'BP_ZoneMapPOI_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_ZoneMapPOI_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'BP_ZoneMapPOI_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

}

