#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZoneMap_VehiclePOI

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZoneMap_VehiclePOI.BP_ZoneMap_VehiclePOI_C
// 0x0020 (0x0660 - 0x0640)
class ABP_ZoneMap_VehiclePOI_C final : public AZoneMapVehicleIcon_POI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ZoneMap_VehiclePOI(int32 EntryPoint);
	void End_Zone_Map_Cursor_Over();
	void Begin_Zone_Map_Cursor_Over();
	void ReceiveBeginPlay();
	void Activate_POI();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ZoneMap_VehiclePOI_C">();
	}
	static class ABP_ZoneMap_VehiclePOI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ZoneMap_VehiclePOI_C>();
	}
};
static_assert(alignof(ABP_ZoneMap_VehiclePOI_C) == 0x000010, "Wrong alignment on ABP_ZoneMap_VehiclePOI_C");
static_assert(sizeof(ABP_ZoneMap_VehiclePOI_C) == 0x000660, "Wrong size on ABP_ZoneMap_VehiclePOI_C");
static_assert(offsetof(ABP_ZoneMap_VehiclePOI_C, UberGraphFrame) == 0x000640, "Member 'ABP_ZoneMap_VehiclePOI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ZoneMap_VehiclePOI_C, StaticMesh) == 0x000648, "Member 'ABP_ZoneMap_VehiclePOI_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ZoneMap_VehiclePOI_C, Sphere) == 0x000650, "Member 'ABP_ZoneMap_VehiclePOI_C::Sphere' has a wrong offset!");

}

