#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZoneMap_MissionPOI

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ZoneMap_MissionPOI.BP_ZoneMap_MissionPOI_C.ExecuteUbergraph_BP_ZoneMap_MissionPOI
// 0x0038 (0x0038 - 0x0000)
struct BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EZoneMapMissionStatus                         CallFunc_GetMissionStatus_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EZoneMapMissionStatus                         CallFunc_GetMissionStatus_ReturnValue1;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI) == 0x000008, "Wrong alignment on BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI");
static_assert(sizeof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI) == 0x000038, "Wrong size on BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, EntryPoint) == 0x000000, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, CallFunc_GetMissionStatus_ReturnValue) == 0x000005, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::CallFunc_GetMissionStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, CallFunc_GetMissionStatus_ReturnValue1) == 0x000007, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::CallFunc_GetMissionStatus_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, K2Node_SwitchEnum1_CmpSuccess) == 0x000008, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000028, "Member 'BP_ZoneMap_MissionPOI_C_ExecuteUbergraph_BP_ZoneMap_MissionPOI::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function BP_ZoneMap_MissionPOI.BP_ZoneMap_MissionPOI_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) BP_ZoneMap_MissionPOI_C_UserConstructionScript final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_ZoneMap_MissionPOI_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ZoneMap_MissionPOI_C_UserConstructionScript");
static_assert(sizeof(BP_ZoneMap_MissionPOI_C_UserConstructionScript) == 0x000020, "Wrong size on BP_ZoneMap_MissionPOI_C_UserConstructionScript");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_ZoneMap_MissionPOI_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ZoneMap_MissionPOI_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate1) == 0x000010, "Member 'BP_ZoneMap_MissionPOI_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");

}

