#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_EchoCommunicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPAnim_EchoCommunicator.BPAnim_EchoCommunicator_C.ExecuteUbergraph_BPAnim_EchoCommunicator
// 0x0020 (0x0020 - 0x0000)
struct BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerLength_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue1;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue1; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator) == 0x000004, "Wrong alignment on BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator");
static_assert(sizeof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator) == 0x000020, "Wrong size on BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator");
static_assert(offsetof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator, EntryPoint) == 0x000000, "Member 'BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator, CallFunc_GetInstanceAssetPlayerLength_ReturnValue) == 0x000008, "Member 'BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator::CallFunc_GetInstanceAssetPlayerLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator, CallFunc_Not_PreBool_ReturnValue1) == 0x00000D, "Member 'BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000010, "Member 'BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator, CallFunc_EqualEqual_FloatFloat_ReturnValue1) == 0x000014, "Member 'BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator::CallFunc_EqualEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue1) == 0x000018, "Member 'BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x00001C, "Member 'BPAnim_EchoCommunicator_C_ExecuteUbergraph_BPAnim_EchoCommunicator::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");

}

