#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_EFabricator

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_EFabricator.BPAnim_EFabricator_C
// 0x0570 (0x0A00 - 0x0490)
class UBPAnim_EFabricator_C final : public UOakWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_803B8B5D456FD240CB55B99F691CB321; // 0x0498(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_B920227E43E55923947D75935FAE6F5E; // 0x04E0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_A88BE71441822CD9FDE1C183777D0A18; // 0x0590(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B7239D9E46FFBA3CA98B34889CDD4CEC; // 0x0640(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_229462F04A8D818ACE12B9AF2ABEA1C4; // 0x0730(0x00B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5CAE9E1842A68ABF1DBDD49BEC15DAC6; // 0x07E0(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_F2EBB1D54E3068EA2E8880B390087E6A; // 0x0860(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_F8335054443DDF64744F839204C7402B; // 0x08E0(0x0120)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_EFabricator_AnimGraphNode_SequenceEvaluator_5CAE9E1842A68ABF1DBDD49BEC15DAC6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_EFabricator_AnimGraphNode_SequenceEvaluator_F2EBB1D54E3068EA2E8880B390087E6A();
	void ExecuteUbergraph_BPAnim_EFabricator(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAnim_EFabricator_C">();
	}
	static class UBPAnim_EFabricator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_EFabricator_C>();
	}
};
static_assert(alignof(UBPAnim_EFabricator_C) == 0x000010, "Wrong alignment on UBPAnim_EFabricator_C");
static_assert(sizeof(UBPAnim_EFabricator_C) == 0x000A00, "Wrong size on UBPAnim_EFabricator_C");
static_assert(offsetof(UBPAnim_EFabricator_C, UberGraphFrame) == 0x000490, "Member 'UBPAnim_EFabricator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPAnim_EFabricator_C, AnimGraphNode_Root_803B8B5D456FD240CB55B99F691CB321) == 0x000498, "Member 'UBPAnim_EFabricator_C::AnimGraphNode_Root_803B8B5D456FD240CB55B99F691CB321' has a wrong offset!");
static_assert(offsetof(UBPAnim_EFabricator_C, AnimGraphNode_Slot_B920227E43E55923947D75935FAE6F5E) == 0x0004E0, "Member 'UBPAnim_EFabricator_C::AnimGraphNode_Slot_B920227E43E55923947D75935FAE6F5E' has a wrong offset!");
static_assert(offsetof(UBPAnim_EFabricator_C, AnimGraphNode_Slot_A88BE71441822CD9FDE1C183777D0A18) == 0x000590, "Member 'UBPAnim_EFabricator_C::AnimGraphNode_Slot_A88BE71441822CD9FDE1C183777D0A18' has a wrong offset!");
static_assert(offsetof(UBPAnim_EFabricator_C, AnimGraphNode_SequencePlayer_B7239D9E46FFBA3CA98B34889CDD4CEC) == 0x000640, "Member 'UBPAnim_EFabricator_C::AnimGraphNode_SequencePlayer_B7239D9E46FFBA3CA98B34889CDD4CEC' has a wrong offset!");
static_assert(offsetof(UBPAnim_EFabricator_C, AnimGraphNode_Slot_229462F04A8D818ACE12B9AF2ABEA1C4) == 0x000730, "Member 'UBPAnim_EFabricator_C::AnimGraphNode_Slot_229462F04A8D818ACE12B9AF2ABEA1C4' has a wrong offset!");
static_assert(offsetof(UBPAnim_EFabricator_C, AnimGraphNode_SequenceEvaluator_5CAE9E1842A68ABF1DBDD49BEC15DAC6) == 0x0007E0, "Member 'UBPAnim_EFabricator_C::AnimGraphNode_SequenceEvaluator_5CAE9E1842A68ABF1DBDD49BEC15DAC6' has a wrong offset!");
static_assert(offsetof(UBPAnim_EFabricator_C, AnimGraphNode_SequenceEvaluator_F2EBB1D54E3068EA2E8880B390087E6A) == 0x000860, "Member 'UBPAnim_EFabricator_C::AnimGraphNode_SequenceEvaluator_F2EBB1D54E3068EA2E8880B390087E6A' has a wrong offset!");
static_assert(offsetof(UBPAnim_EFabricator_C, AnimGraphNode_LayeredBoneBlend_F8335054443DDF64744F839204C7402B) == 0x0008E0, "Member 'UBPAnim_EFabricator_C::AnimGraphNode_LayeredBoneBlend_F8335054443DDF64744F839204C7402B' has a wrong offset!");

}

