#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Heavy

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxAnimRuntime_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HeavyVariants_structs.hpp"
#include "GbxAnimRuntimeBase_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Heavy.BPAnim_Heavy_C
// 0x6140 (0x6C30 - 0x0AF0)
class UBPAnim_Heavy_C : public UOakCharacterAnimInstance
{
public:
	uint8                                         Pad_AE8[0x8];                                      // 0x0AE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AF0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_A9D4513A41326C3A050AFFA8AE99C06A; // 0x0AF8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6D6E84BE495FA63DC68413926203188E; // 0x0B40(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_BBC661E4449606F81137BB97E562FD9B; // 0x0BF0(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_F966863B4283C0FE225F46A459BD6A91; // 0x0C40(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6C4DFC5B4BB47D1A82AD71B13B3F8557; // 0x0CF0(0x00E0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_81ABFBFB4BC3BEFF801B49A93DD2118B; // 0x0DD0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36D2967E4CDFED862F604AA8F2EC4AE2; // 0x0E18(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5DDAB875492D38C26F6BB49028CC1713; // 0x0E68(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5D1A1CCA44DFAD81C3D4ED9A389FC269; // 0x0EB8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F96ECA8A4C67FF7D07CD87A46A8386E6; // 0x0F08(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A1AD6CD04E64C5B30D814F813DCBDD50; // 0x0F58(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C20071A04542040F4EB007B751397DBD; // 0x0FA8(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57CB1BF24C81C5DA352CF793B4203CC3; // 0x0FF8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_97EEFA704CFCB334B7A80598DD3A1555; // 0x10E8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E788B05C4F3B54B34CBF5BAD9406CCA4; // 0x1130(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_2A4A494346EC62F45ECC2B97A7D68F99; // 0x1220(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6628EA2848994B3803CBDAB1253D4885; // 0x1268(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_655F0A5E471CDCDDDF8CADB89508D43E; // 0x13F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C1CD8B0F42A3B160BF952ABAE1B25FD0; // 0x1438(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D7BF9302409AD9A500EA9987BFCF63A1; // 0x1488(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DF1BB1BA4D736C6C6D1F51B75FE80E89; // 0x14D8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13965BE5417D7C6949A672BFFB7F3E63; // 0x1528(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8EF8402E46632D1C28CDC08804720419; // 0x1578(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2B46B61B4DF5E34D38F8F289DB42FF7B; // 0x15C8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5BC06E124F93AD0633F21498E2E27429; // 0x1618(0x0050)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2EA1E2D64E2FC6577E0F27AB4C8BD4AD; // 0x1668(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_7DF9CE3C48D63F6D749885B3151C9278; // 0x17C8(0x0048)()
	struct FGbxAnimNode_AnimTable                 GbxAnimGraphNode_AnimTable_46F8950D4F848F3963C10898990BDFA4; // 0x1810(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_86334D3044994C159F06ED86B2510C7D; // 0x1898(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_934E4F8E4EFB99AF430ABC91560914A9; // 0x18E0(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E0F365B944CEE660BB6079A3935FA138; // 0x19D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8486BD8947029189EB547A991B2923D5; // 0x1A18(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_931C37E046D05978803E4D9FC0722389; // 0x1B08(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_77B2C9564B9008C28DBCC0B210A6E954; // 0x1B50(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D0F7C17C479C8DB02FD7498599CDDDDD; // 0x1C40(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7539020D4E295D2607559A9B23DA93DC; // 0x1C88(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3C1BC2FF4DBDCC7A64B1C1ACCF1D1850; // 0x1E10(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5D52075444E8EEE426EDA696D8E56544; // 0x1E58(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_AD6175A0431E6898602B9DA5B92C3869; // 0x1ED8(0x0118)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FBC64AB94E5B7CF5E21A5C898CF8CEB1; // 0x1FF0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BDAD22934ABC077CED25499458DA479D; // 0x2040(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A29108FE4A9E585576E092BF41A9AB79; // 0x2090(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_181915D741BF87580BACCA8DE0C74731; // 0x20E0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E9BC02CE4AFD8EA6943B5E9F2A27B641; // 0x2130(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9DAF311A4B88C37F9D5CEA986724CCAD; // 0x2180(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BB689193446005283FD9A59479B1732E; // 0x21D0(0x0050)()
	struct FGbxAnimNode_AnimTable                 GbxAnimGraphNode_AnimTable_8477ADD34A858CA93212609707A7755D; // 0x2220(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_89D3C6ED4874A506222EFBACC6FBBAE6; // 0x22A8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_05339F0B4D3EF50D8CFCF4A2DC57DD13; // 0x22F0(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_B5F846174957F6C19050278D6BB7CD5F; // 0x2450(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_AF9900534F2AEFCF5AA8DAB5590EAEF4; // 0x2498(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_31BFCB9545B5CAFB64DA36AF8C9BAEA9; // 0x25F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D5DE15EA48228136FF417C9B078538D0; // 0x2640(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3B74C1884AFF742D4E4F758F01F3EA48; // 0x2730(0x0048)()
	struct FGbxAnimNode_BlendListByFloatInRange   GbxAnimGraphNode_BlendListByFloatInRange_B8EC897742ADA6FC4848C7846D5CDEB7; // 0x2778(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3F322A8B4C8E477AACDE82A269D3F03E; // 0x2860(0x00F0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_739570CC485ADA8A99E2F1999F011EA4; // 0x2950(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_CDDE0A01423ED04532242CB23882A76A; // 0x2AB0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_AA0542CB4A9FC73B6D5044AE87D39644; // 0x2AF8(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_4E9AD50044CFCFC3D8C821A70A280603; // 0x2C80(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_90D2BB1C4FF45A97E50DEC95CC1F6C10; // 0x2CC8(0x0188)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5CA968514EB414DEC2363D95ECFBE277; // 0x2E50(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2D5CCBCC4576FFCE19041DA581ECAD1E; // 0x2F30(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0AF3A32A46C65DC573DA539A7B463E3C; // 0x2F80(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A226BD7A47BE47D7A0A1D8A3DE5E3DC8; // 0x2FD0(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_99ED4E3D4A59FE61F785BFAD8ABF4C01; // 0x3020(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_67814A5C4CBA47304702E389E13DC5FA; // 0x30D0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7A62E8914DB39BABD3EC96AA786AADB3; // 0x31B0(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_D62F691A482B22C95D2918BD7C4B951F; // 0x3200(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_85B7CF5444D15B11984FEBAD1657A568; // 0x32E0(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71A24CDA4349858378323FB0873FDBF3; // 0x3400(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29E33B4C43B9DE2969A5C09B38A87F56; // 0x3450(0x0050)()
	struct FGbxAnimNode_LegIK                     GbxAnimGraphNode_LegIK_2EBAF96F4980E6B49A66DEA2D6E0D39F; // 0x34A0(0x08B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37FD7B994632972B6BEFFF839D45231A; // 0x3D50(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75668A2F4F5AF0037E944AB63EF63B29; // 0x3DA0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7ABCC7E842DF27C8927C32A1879E343F; // 0x3DF0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FA97E5AF46A1723B1ED5449F33C5E630; // 0x3E40(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6232260A429D75E70B22E48FB6DB7563; // 0x3E90(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_718F488D4C7D6DE493DA648C130DDD9D; // 0x3EE0(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58DA74C6434CFFA77447F2B2AD26A980; // 0x3F30(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_5DA0B16F41A602527C6544BC8FDEE898; // 0x4020(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E6AF71304C6C7F38B47F12A95919DEA5; // 0x4068(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A98017B4483D9F8D7D28DABCEB804F68; // 0x4158(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_63A6903D436344673BB1DEB3042F3B02; // 0x41A0(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_5600DEB8445727F28564D3A981599745; // 0x4328(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AD75F6F043990615D30B8F90AE163126; // 0x4370(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FF587B9E44D111FF05695CBB4AB37EE2; // 0x43C0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9059A660453F27900A98CD8A4B18B58C; // 0x4410(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64614FBF4BE05C42B44FA399341BBABF; // 0x4460(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_227A54A84BC28C4BD7363F9536A56DDD; // 0x44B0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E2B994AE4B083B9CAF9B598006AE7CE4; // 0x4500(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DB5BA23A4D840A331DAC43BB810E58DF; // 0x4550(0x0050)()
	struct FGbxAnimNode_AnimTable                 GbxAnimGraphNode_AnimTable_E678D9054CCE1C9E4630C490A6BCC456; // 0x45A0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_ACA368EE4336556CD612908E7CC98C1E; // 0x4628(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_47FFD8224AC01CFFE38C59853782F914; // 0x4670(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3883BB8043CFE8C7DABFEEA3B4C98A95; // 0x47D0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A53287BB4843DC26A05EDA900C8AA2A2; // 0x4818(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_25090D3C4DF987573D2A45B39CEEAA71; // 0x4978(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_690B2BE547085EA19F3EA683F68E13FD; // 0x49C0(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_EC704793411E323C04AF438013B03D31; // 0x4AB0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8A6457D648A6CF67D963299DEAF725F0; // 0x4AF8(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_5243DF824885F327A5D7A593A5983057; // 0x4C58(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_FB03BF04444E63E56F1936A93ABAB3A8; // 0x4CA0(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_60325D6441855312727A77839966A1F3; // 0x4E28(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AF6D57FC4A19FEE5D68B328736419517; // 0x4E70(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D280327F4C95C8EC7A6F5596330BED9C; // 0x4EC0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9F8EBDBD4EC36C0E90BED0BAC76AA908; // 0x4F10(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BA8A23F94AEE709B08ACF1A34974EE61; // 0x4F60(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20ADF9864362DBF83A2775B347C7C0EA; // 0x4FB0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_329E74804F5AACF3EB08A9B8F8AE92E2; // 0x5000(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5A259015441AD9724AEFE9B6EB9C5ABE; // 0x5050(0x0050)()
	struct FGbxAnimNode_AnimTable                 GbxAnimGraphNode_AnimTable_0F1B5CD54D1AF5836DEFD4A41339A4DC; // 0x50A0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_381D1F214E644F092F27C783F78B673E; // 0x5128(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_849F94C74A77B23BE04F89B6A922B381; // 0x5170(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C0004E1541577AF2E7A31E97E0640631; // 0x52D0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2691167F4C11B9BC03726A94AE973348; // 0x5318(0x0160)()
	struct FGbxAnimNode_BlendListByFloatInRange   GbxAnimGraphNode_BlendListByFloatInRange_CF722508466C04BE5248F78B33170443; // 0x5478(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7101C39E40A82B7FDF4369B9C66A3CF8; // 0x5560(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D3EC2C4E4D8153826344BBBE4CAECCD4; // 0x56C0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D95FE8B144421FBF84F7DAAAE13D24DA; // 0x5708(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0C11CB1E4F62E203A1740F9DD48142F1; // 0x57F8(0x0048)()
	struct FGbxAnimNode_BlendListByFloatInRange   GbxAnimGraphNode_BlendListByFloatInRange_6D1722D54899862103CEA387E2295943; // 0x5840(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_77E488C74C093384DD22F28F89A37EA7; // 0x5928(0x0160)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_DF81E4164F6E7EEA1E7A2E844A372489; // 0x5A88(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E57245484A96C9A5EB870CB6D5A6F318; // 0x5BE8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D5DA2C7E46CFD16C33039EB2D2D82DA7; // 0x5C30(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D2955B834C46793A17EBAD9BD6848FE7; // 0x5DB8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_56384A3E4934C45BD8B7F9A78F510CFE; // 0x5E00(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_21556D6E4532DC507D8144AEE83AC77B; // 0x5F88(0x0238)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D8300948421F7172C7645CAB1EB2A250; // 0x61C0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_D8C5BA964D7FC806EEA8EEB130F8D2E5; // 0x6208(0x00E0)()
	struct FGbxAnimNode_ApplyBoneModifyProfile    GbxAnimGraphNode_ApplyBoneModifyProfile_C9F78D5B43AD471443FF3B8185A821FF; // 0x62E8(0x0180)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9D5ABB5542D4E49FB88CC98148265F13; // 0x6468(0x0120)()
	struct FAnimNode_LayeredBoneSetBlend          AnimGraphNode_LayeredBoneSetBlend_CA50BE8B4CEB06E4AFFC0597D7E56E99; // 0x6588(0x0140)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C328704B4734510552CAB7A0F8FC9799; // 0x66C8(0x0050)()
	uint8                                         Pad_6718[0x8];                                     // 0x6718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C4AE8DE34AE90B0F18F113A90CF63D7C; // 0x6720(0x00B0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_C1C422764003819F6FEFD18F9F52AC25; // 0x67D0(0x0120)()
	struct FGbxAnimNode_LookAt                    GbxAnimGraphNode_LookAt_80CCF9794692DB56003C4994B6E18721; // 0x68F0(0x02D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C5A8A2504F918DE1969ABE98A85FD1FF; // 0x6BC0(0x0050)()
	class ABPChar_Enemy_C*                        Character;                                         // 0x6C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 Movement_Component;                                // 0x6C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHeavyVariants                                Variants;                                          // 0x6C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InPassiveStance;                                   // 0x6C21(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InCombatStance;                                    // 0x6C22(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EHeavyVariants                                VarStyle;                                          // 0x6C23(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GunnerVar;                                         // 0x6C24(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPAnim_Heavy(int32 EntryPoint);
	void OnAnimStyleChanged();
	void OnStanceChanged();
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Heavy_AnimGraphNode_TransitionResult_5DDAB875492D38C26F6BB49028CC1713();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Heavy_AnimGraphNode_TransitionResult_F96ECA8A4C67FF7D07CD87A46A8386E6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Heavy_AnimGraphNode_TransitionResult_C20071A04542040F4EB007B751397DBD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Heavy_AnimGraphNode_TransitionResult_DF1BB1BA4D736C6C6D1F51B75FE80E89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Heavy_AnimGraphNode_TransitionResult_75668A2F4F5AF0037E944AB63EF63B29();
