#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_SM_Maliwan

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_SM_Maliwan.BPAnim_SM_Maliwan_C
// 0x0660 (0x0AF0 - 0x0490)
class UBPAnim_SM_Maliwan_C final : public UOakWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_DB0207324786FE1645800D92558B6B81; // 0x0498(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_0C3713E3469542F33572FEA1D7174FA4; // 0x04E0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_97541FC742165569D46187BBA5154ECA; // 0x0590(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9E4C3A64409A86BFC2FE5EA9CE7E34B2; // 0x0640(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_111E1C8247693B4422F1ECBD4CD04D4A; // 0x0760(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1EAB732843F60D13CF2FE2A24CAB5618; // 0x0810(0x00D0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8B474EF04B61E2D51388BE99551146EC; // 0x08E0(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8417011946156F59875B8B8B46010D91; // 0x0960(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_486E44EF407AF5FAFF817393C388410A; // 0x09E0(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_9FE18F924984DF4081FBF88604FF79C7; // 0x0A60(0x0080)()
	bool                                          bPrimaryUseMode;                                   // 0x0AE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPAnim_SM_Maliwan(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void BlueprintSwitchedMode(int32 NewMode);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_SM_Maliwan_AnimGraphNode_BlendListByBool_1EAB732843F60D13CF2FE2A24CAB5618();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_SM_Maliwan_AnimGraphNode_SequenceEvaluator_486E44EF407AF5FAFF817393C388410A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_SM_Maliwan_AnimGraphNode_SequenceEvaluator_9FE18F924984DF4081FBF88604FF79C7();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAnim_SM_Maliwan_C">();
	}
	static class UBPAnim_SM_Maliwan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_SM_Maliwan_C>();
	}
};
static_assert(alignof(UBPAnim_SM_Maliwan_C) == 0x000010, "Wrong alignment on UBPAnim_SM_Maliwan_C");
static_assert(sizeof(UBPAnim_SM_Maliwan_C) == 0x000AF0, "Wrong size on UBPAnim_SM_Maliwan_C");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, UberGraphFrame) == 0x000490, "Member 'UBPAnim_SM_Maliwan_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_Root_DB0207324786FE1645800D92558B6B81) == 0x000498, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_Root_DB0207324786FE1645800D92558B6B81' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_Slot_0C3713E3469542F33572FEA1D7174FA4) == 0x0004E0, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_Slot_0C3713E3469542F33572FEA1D7174FA4' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_Slot_97541FC742165569D46187BBA5154ECA) == 0x000590, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_Slot_97541FC742165569D46187BBA5154ECA' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_LayeredBoneBlend_9E4C3A64409A86BFC2FE5EA9CE7E34B2) == 0x000640, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_LayeredBoneBlend_9E4C3A64409A86BFC2FE5EA9CE7E34B2' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_Slot_111E1C8247693B4422F1ECBD4CD04D4A) == 0x000760, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_Slot_111E1C8247693B4422F1ECBD4CD04D4A' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_BlendListByBool_1EAB732843F60D13CF2FE2A24CAB5618) == 0x000810, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_BlendListByBool_1EAB732843F60D13CF2FE2A24CAB5618' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_SequenceEvaluator_8B474EF04B61E2D51388BE99551146EC) == 0x0008E0, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_SequenceEvaluator_8B474EF04B61E2D51388BE99551146EC' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_SequenceEvaluator_8417011946156F59875B8B8B46010D91) == 0x000960, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_SequenceEvaluator_8417011946156F59875B8B8B46010D91' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_SequenceEvaluator_486E44EF407AF5FAFF817393C388410A) == 0x0009E0, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_SequenceEvaluator_486E44EF407AF5FAFF817393C388410A' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, AnimGraphNode_SequenceEvaluator_9FE18F924984DF4081FBF88604FF79C7) == 0x000A60, "Member 'UBPAnim_SM_Maliwan_C::AnimGraphNode_SequenceEvaluator_9FE18F924984DF4081FBF88604FF79C7' has a wrong offset!");
static_assert(offsetof(UBPAnim_SM_Maliwan_C, bPrimaryUseMode) == 0x000AE0, "Member 'UBPAnim_SM_Maliwan_C::bPrimaryUseMode' has a wrong offset!");

}

