#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_DAL_PS

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPAnim_DAL_PS.BPAnim_DAL_PS_C.ExecuteUbergraph_BPAnim_DAL_PS
// 0x0048 (0x0048 - 0x0000)
struct BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable1;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NewMode;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS) == 0x000008, "Wrong alignment on BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS");
static_assert(sizeof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS) == 0x000048, "Wrong size on BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, EntryPoint) == 0x000000, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, Temp_object_Variable) == 0x000008, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, Temp_object_Variable1) == 0x000018, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, Temp_object_Variable2) == 0x000020, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, Temp_object_Variable3) == 0x000028, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, Temp_byte_Variable) == 0x000030, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, K2Node_Event_NewMode) == 0x000034, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::K2Node_Event_NewMode' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS, K2Node_Select_Default) == 0x000040, "Member 'BPAnim_DAL_PS_C_ExecuteUbergraph_BPAnim_DAL_PS::K2Node_Select_Default' has a wrong offset!");

// Function BPAnim_DAL_PS.BPAnim_DAL_PS_C.BlueprintSwitchedMode
// 0x0004 (0x0004 - 0x0000)
struct BPAnim_DAL_PS_C_BlueprintSwitchedMode final
{
public:
	int32                                         NewMode;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAnim_DAL_PS_C_BlueprintSwitchedMode) == 0x000004, "Wrong alignment on BPAnim_DAL_PS_C_BlueprintSwitchedMode");
static_assert(sizeof(BPAnim_DAL_PS_C_BlueprintSwitchedMode) == 0x000004, "Wrong size on BPAnim_DAL_PS_C_BlueprintSwitchedMode");
static_assert(offsetof(BPAnim_DAL_PS_C_BlueprintSwitchedMode, NewMode) == 0x000000, "Member 'BPAnim_DAL_PS_C_BlueprintSwitchedMode::NewMode' has a wrong offset!");

// Function BPAnim_DAL_PS.BPAnim_DAL_PS_C.UpdateScopeAnim
// 0x0008 (0x0008 - 0x0000)
struct BPAnim_DAL_PS_C_UpdateScopeAnim final
{
public:
	int32                                         UseMode;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPAnim_DAL_PS_C_UpdateScopeAnim) == 0x000004, "Wrong alignment on BPAnim_DAL_PS_C_UpdateScopeAnim");
static_assert(sizeof(BPAnim_DAL_PS_C_UpdateScopeAnim) == 0x000008, "Wrong size on BPAnim_DAL_PS_C_UpdateScopeAnim");
static_assert(offsetof(BPAnim_DAL_PS_C_UpdateScopeAnim, UseMode) == 0x000000, "Member 'BPAnim_DAL_PS_C_UpdateScopeAnim::UseMode' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_UpdateScopeAnim, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'BPAnim_DAL_PS_C_UpdateScopeAnim::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPAnim_DAL_PS_C_UpdateScopeAnim, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BPAnim_DAL_PS_C_UpdateScopeAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

