#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_SG_Hyperion

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPAnim_SG_Hyperion.BPAnim_SG_Hyperion_C.ExecuteUbergraph_BPAnim_SG_Hyperion
// 0x0014 (0x0014 - 0x0000)
struct BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion) == 0x000004, "Wrong alignment on BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion");
static_assert(sizeof(BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion) == 0x000014, "Wrong size on BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion");
static_assert(offsetof(BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion, EntryPoint) == 0x000000, "Member 'BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000010, "Member 'BPAnim_SG_Hyperion_C_ExecuteUbergraph_BPAnim_SG_Hyperion::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");

}

