#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_SG_Torgue

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_SG_Torgue.BPAnim_SG_Torgue_C
// 0x0570 (0x0A00 - 0x0490)
class UBPAnim_SG_Torgue_C final : public UOakWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_0187AC594203BCC036C443B8B214CDD1; // 0x0498(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_B0174F3A4B0D900F4558B5A9C626D2F7; // 0x04E0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9D30480C42D9CF6985B3638AFC93681B; // 0x0590(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_BA06B1CF46E8ACE6C2B5B281D64D0024; // 0x0640(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E54518AC4C328B25237A44B0E7E44840; // 0x0760(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_CEFA8F134B660D8CBFEA81881438DEFD; // 0x0850(0x00B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2888225446FBAD4864E412824FCA026D; // 0x0900(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_D715C2874F535D4512AB51BCF51DE18C; // 0x0980(0x0080)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_SG_Torgue_AnimGraphNode_SequenceEvaluator_2888225446FBAD4864E412824FCA026D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_SG_Torgue_AnimGraphNode_SequenceEvaluator_D715C2874F535D4512AB51BCF51DE18C();
	void ExecuteUbergraph_BPAnim_SG_Torgue(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAnim_SG_Torgue_C">();
	}
	static class UBPAnim_SG_Torgue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_SG_Torgue_C>();
	}
};
static_assert(alignof(UBPAnim_SG_Torgue_C) == 0x000010, "Wrong alignment on UBPAnim_SG_Torgue_C");
static_assert(sizeof(UBPAnim_SG_Torgue_C) == 0x000A00, "Wrong size on UBPAnim_SG_Torgue_C");
static_assert(offsetof(UBPAnim_SG_Torgue_C, UberGraphFrame) == 0x000490, "Member 'UBPAnim_SG_Torgue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPAnim_SG_Torgue_C, AnimGraphNode_Root_0187AC594203BCC036C443B8B214CDD1) == 0x000498, "Member 'UBPAnim_SG_Torgue_C::AnimGraphNode_Root_0187AC594203BCC036C443B8B214CDD1' has a wrong offset!");
static_assert(offsetof(UBPAnim_SG_Torgue_C, AnimGraphNode_Slot_B0174F3A4B0D900F4558B5A9C626D2F7) == 0x0004E0, "Member 'UBPAnim_SG_Torgue_C::AnimGraphNode_Slot_B0174F3A4B0D900F4558B5A9C626D2F7' has a wrong offset!");
static_assert(offsetof(UBPAnim_SG_Torgue_C, AnimGraphNode_Slot_9D30480C42D9CF6985B3638AFC93681B) == 0x000590, "Member 'UBPAnim_SG_Torgue_C::AnimGraphNode_Slot_9D30480C42D9CF6985B3638AFC93681B' has a wrong offset!");
static_assert(offsetof(UBPAnim_SG_Torgue_C, AnimGraphNode_LayeredBoneBlend_BA06B1CF46E8ACE6C2B5B281D64D0024) == 0x000640, "Member 'UBPAnim_SG_Torgue_C::AnimGraphNode_LayeredBoneBlend_BA06B1CF46E8ACE6C2B5B281D64D0024' has a wrong offset!");
static_assert(offsetof(UBPAnim_SG_Torgue_C, AnimGraphNode_SequencePlayer_E54518AC4C328B25237A44B0E7E44840) == 0x000760, "Member 'UBPAnim_SG_Torgue_C::AnimGraphNode_SequencePlayer_E54518AC4C328B25237A44B0E7E44840' has a wrong offset!");
static_assert(offsetof(UBPAnim_SG_Torgue_C, AnimGraphNode_Slot_CEFA8F134B660D8CBFEA81881438DEFD) == 0x000850, "Member 'UBPAnim_SG_Torgue_C::AnimGraphNode_Slot_CEFA8F134B660D8CBFEA81881438DEFD' has a wrong offset!");
static_assert(offsetof(UBPAnim_SG_Torgue_C, AnimGraphNode_SequenceEvaluator_2888225446FBAD4864E412824FCA026D) == 0x000900, "Member 'UBPAnim_SG_Torgue_C::AnimGraphNode_SequenceEvaluator_2888225446FBAD4864E412824FCA026D' has a wrong offset!");
static_assert(offsetof(UBPAnim_SG_Torgue_C, AnimGraphNode_SequenceEvaluator_D715C2874F535D4512AB51BCF51DE18C) == 0x000980, "Member 'UBPAnim_SG_Torgue_C::AnimGraphNode_SequenceEvaluator_D715C2874F535D4512AB51BCF51DE18C' has a wrong offset!");

}

