#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_MenuStandin

#include "Basic.hpp"

#include "AEnum_WeaponType_structs.hpp"


namespace SDK::Params
{

// Function BPAnim_MenuStandin.BPAnim_MenuStandin_C.ExecuteUbergraph_BPAnim_MenuStandin
// 0x00A8 (0x00A8 - 0x0000)
struct BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable1;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable5;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable6;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAEnum_WeaponType                             Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                K2Node_Event_NewWeapon;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                K2Node_Event_PrevWeapon;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAnimSeqBaseFromAnimSet_bIsValid;       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CallFunc_GetAnimSeqBaseFromAnimSet_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin) == 0x000008, "Wrong alignment on BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin");
static_assert(sizeof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin) == 0x0000A8, "Wrong size on BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, EntryPoint) == 0x000000, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_name_Variable) == 0x000008, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_name_Variable1) == 0x000010, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_name_Variable2) == 0x000020, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_name_Variable3) == 0x000028, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_name_Variable4) == 0x000030, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_name_Variable5) == 0x000038, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_name_Variable5' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_name_Variable6) == 0x000048, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_name_Variable6' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, Temp_byte_Variable) == 0x000050, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, K2Node_Event_NewWeapon) == 0x000058, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::K2Node_Event_NewWeapon' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, K2Node_Event_PrevWeapon) == 0x000060, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::K2Node_Event_PrevWeapon' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000068, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, K2Node_Select_Default) == 0x000070, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_Array_Get_Item) == 0x000078, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_Array_Get_Item1) == 0x000088, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000090, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_GetAnimSeqBaseFromAnimSet_bIsValid) == 0x000091, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_GetAnimSeqBaseFromAnimSet_bIsValid' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_GetAnimSeqBaseFromAnimSet_ReturnValue) == 0x000098, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_GetAnimSeqBaseFromAnimSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_Not_PreBool_ReturnValue) == 0x0000A1, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin, CallFunc_BooleanOR_ReturnValue1) == 0x0000A2, "Member 'BPAnim_MenuStandin_C_ExecuteUbergraph_BPAnim_MenuStandin::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");

// Function BPAnim_MenuStandin.BPAnim_MenuStandin_C.OnWeaponChanged
// 0x0010 (0x0010 - 0x0000)
struct BPAnim_MenuStandin_C_OnWeaponChanged final
{
public:
	class AWeapon*                                NewWeapon;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                PrevWeapon;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAnim_MenuStandin_C_OnWeaponChanged) == 0x000008, "Wrong alignment on BPAnim_MenuStandin_C_OnWeaponChanged");
static_assert(sizeof(BPAnim_MenuStandin_C_OnWeaponChanged) == 0x000010, "Wrong size on BPAnim_MenuStandin_C_OnWeaponChanged");
static_assert(offsetof(BPAnim_MenuStandin_C_OnWeaponChanged, NewWeapon) == 0x000000, "Member 'BPAnim_MenuStandin_C_OnWeaponChanged::NewWeapon' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_OnWeaponChanged, PrevWeapon) == 0x000008, "Member 'BPAnim_MenuStandin_C_OnWeaponChanged::PrevWeapon' has a wrong offset!");

// Function BPAnim_MenuStandin.BPAnim_MenuStandin_C.CalculateWeaponHoldData
// 0x0148 (0x0148 - 0x0000)
struct BPAnim_MenuStandin_C_CalculateWeaponHoldData final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                PreviousWeapon;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakWeapon*                             K2Node_DynamicCast_AsOak_Weapon;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue1;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue3;     // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue4;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue5;     // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakInventoryBalanceStateComponent*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManufacturerData*                      CallFunc_GetManufacturer_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue6;     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue7;     // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue8;     // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue9;     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue10;    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue11;    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue12;    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue13;    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue14;    // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue15;    // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue16;    // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable1;                               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item1;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item2;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item3;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item4;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select1_Default;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select2_Default;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item5;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue5;           // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue6;           // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue7;           // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable4;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable5;                               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select3_Default;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select4_Default;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAnim_MenuStandin_C_CalculateWeaponHoldData) == 0x000008, "Wrong alignment on BPAnim_MenuStandin_C_CalculateWeaponHoldData");
static_assert(sizeof(BPAnim_MenuStandin_C_CalculateWeaponHoldData) == 0x000148, "Wrong size on BPAnim_MenuStandin_C_CalculateWeaponHoldData");
static_assert(offsetof(BPAnim_MenuStandin_C_CalculateWeaponHoldData, Weapon) == 0x000000, "Member 'BPAnim_MenuStandin_C_CalculateWeaponHoldData::Weapon' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_CalculateWeaponHoldData, PreviousWeapon) == 0x000008, "Member 'BPAnim_MenuStandin_C_CalculateWeaponHoldData::PreviousWeapon' has a wrong offset!");
static_assert(offsetof(BPAnim_MenuStandin_C_CalculateWeaponHoldData, K2Node_DynamicCast_AsOak_Weapon) == 0x000010, "Member 'BPAnim_MenuStandin_C_CalculateWeaponHoldData::K2Node_DynamicCast_AsOak_Weapon' has a wrong offset!");
