#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Ratch

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxAnimRuntime_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GbxAnimRuntimeBase_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Ratch.BPAnim_Ratch_C
// 0x4AD0 (0x55C0 - 0x0AF0)
class UBPAnim_Ratch_C final : public UOakCharacterAnimInstance
{
public:
	uint8                                         Pad_AE8[0x8];                                      // 0x0AE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AF0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_E28BA16B48ACA45A740899BAF63867AE; // 0x0AF8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7AE903A146049088A724DEAD07DAFEA9; // 0x0B40(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E2B968204D05E7D0B706EB99AA1DBC9C; // 0x0B90(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A82CC8D64308C75C9A2D8BB3489FAE55; // 0x0BE0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0E37B74C4BD2612CE8D45B92F3614E23; // 0x0C30(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_163CBE8242D67D8474C499867675F56A; // 0x0C80(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BFA82DFE45DD39DAB6060BB7DE2702E0; // 0x0CD0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36B1D02442F63B9B85BAF5AFAE61F081; // 0x0D20(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60AC250045F8FF7E0874A1AB81065716; // 0x0D70(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9BFD859645B1F75390731B9C9F2E2F3F; // 0x0DC0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AACED8A248C0D0AEBF584BBC4A27DC10; // 0x0E10(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F328AAF748DE91FD68071288F250498A; // 0x0E60(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E1869E9941F40371EFD16D9E88A0E9EF; // 0x0EB0(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8D9484AF4F1DF6187ABEC988530913E4; // 0x0F00(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8D1CC9D244C598B3920EBD8F4686578C; // 0x0FF0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A736887A4AF27DEE6EBF6D98DBBA6F68; // 0x1038(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_1CE20C97469BDD9E3B4E1A9689B947A4; // 0x1128(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_57BBC0A5451FD9C88BEF54A0B384E257; // 0x1170(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0C76F2254482C4106C8F889ABF832534; // 0x12F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A41A52F44CDC61C28CC61FA67EA7AF59; // 0x1340(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8040BCEE4C60FAD16C359B99473C469D; // 0x1430(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_69C7C22641D9D95EE2B944ADB10DB46E; // 0x1478(0x00F0)()
	struct FGbxAnimNode_BlendListByFloatComparison GbxAnimGraphNode_BlendListByFloatComparison_DF0CDB344B6E9B842C700AB2223779D0; // 0x1568(0x00D8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_0AD997454968051BA574E39736A097D5; // 0x1640(0x0160)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_200E7EE141709FDCEEB05083F87B1CAB; // 0x17A0(0x00D0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_D4ECA1E54A329B5571146A97184C7D93; // 0x1870(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E64704D340E29007B2E1F4AED03325D6; // 0x19D0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_63EC784F4C0525D6AADE13B5697D8BE4; // 0x1A18(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_152732884D21B068E979EAB389C6D861; // 0x1BA0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E47F0B3D46238F7E2B1F88A711FBA1D0; // 0x1BE8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_942C76EE44C949DABE71499DAB8878DE; // 0x1C38(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F5CD165141BB81987E53C6B03752B888; // 0x1C88(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FC7E05FE436075CC91CCBC8CA49304AD; // 0x1CD8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45B1980D43ED5000C81E52ACF373598F; // 0x1D28(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B4BFA66E46BEB44F90F3D2B270209037; // 0x1D78(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_002B50F0427EDCCAB47251BF145683A8; // 0x1DC8(0x0050)()
	struct FGbxAnimNode_AnimTable                 GbxAnimGraphNode_AnimTable_F2B639CB4F3A0B1BB7CF49B5C2D48387; // 0x1E18(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_BB3C067A4AC31E07205879833593C477; // 0x1EA0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_EA9B046B4D2D381CA3C3D0979C839995; // 0x1EE8(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_F6F3713E4AF72A69B4AC0C9ECF0DB965; // 0x2048(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F6046086430758654021FEAD8661348A; // 0x2090(0x00F0)()
	struct FGbxAnimNode_BlendListByFloatInRange   GbxAnimGraphNode_BlendListByFloatInRange_169740C04AB17025EA01148867AC1739; // 0x2180(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4A3E34D14F984A82F8C8079A1DF6C6A2; // 0x2268(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E06A71854132047200DA539AAEABA1F1; // 0x2358(0x0048)()
	struct FGbxAnimNode_BlendListByFloatInRange   GbxAnimGraphNode_BlendListByFloatInRange_4BD66E224BBA193E003AF184010A575D; // 0x23A0(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4D7366F444E0AEFECD8C57AD081799E8; // 0x2488(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5DF76F314F1F8A38FB133FA4D78B7D05; // 0x2578(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_79BC83F048662788DCE1E6B1C0FAA643; // 0x2668(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E4E3BE194BDA2B2C745C6E8D71AFF57B; // 0x26B0(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3EF2218E4751FCFC4772E9AF01E8634C; // 0x27A0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B32632384BE26C67CAC078B50C050DB1; // 0x27E8(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_1977916647D101F060C49DA357D085DB; // 0x2970(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A4F06CD14AB9476CB6C724A87DBD47B7; // 0x29B8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3291A3514E168FE7490B76B87E03A67D; // 0x2A08(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E7FED94C4C37958B5BD41EAEAA7D40A8; // 0x2A58(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A71C453B41177326D5E273AF80386E6F; // 0x2AA8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1EBC180244C69395E32997A0892F17AF; // 0x2AF8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_994E43A244C6155347354A94833A2E22; // 0x2B48(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7BC9B5CE4D6B2B5F499196BDAFE3462C; // 0x2B98(0x0050)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A5128FDB4485962FA9E7A0867879583C; // 0x2BE8(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_36C0339C4F5CB7EE10B3C8879D2071AB; // 0x2D48(0x0048)()
	struct FGbxAnimNode_AnimTable                 GbxAnimGraphNode_AnimTable_8EE583064417927EEC975C81EFD8FD7F; // 0x2D90(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C0D1B4B34879DBBA5C0734A8649C4D76; // 0x2E18(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_06A872A241762606E031E6A1B8AE4E87; // 0x2E60(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3037DCAD48A5CA3F24A2DD87CA02DDB4; // 0x2F50(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1748772944594A423E179488672A9FBE; // 0x2F98(0x00F0)()
	struct FGbxAnimNode_BlendListByFloatInRange   GbxAnimGraphNode_BlendListByFloatInRange_1470DCB4498575F53CDAFFB78ACF696A; // 0x3088(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2746B5FE47F033C6432648993B780A79; // 0x3170(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_32126BC143F1BC1A04489FA9C54FDF2D; // 0x3260(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F0A96D2F4377CA21CE84559396545792; // 0x32A8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E45E9A5B4F09F120EAB19B843DE1F5FC; // 0x3398(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_97D838DB40F584799BFB559516484F51; // 0x33E0(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_BB86499049A9CBF83830769764669EB8; // 0x3568(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6A2A9B4D48EA953BEA0DEFB8E5B560CC; // 0x35B0(0x0188)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_C8D799EC4A86398064BE498E3B001FAD; // 0x3738(0x00E0)()
	uint8                                         Pad_3818[0x8];                                     // 0x3818(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1B57DA5542E0788C501BF68D1A390B89; // 0x3820(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_84BDBE6B4B5D0B04C76049BEB9EE5225; // 0x38D0(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_399F950947C407D56137F8B019F1E575; // 0x39F0(0x00B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_C252579847368D3A115BBD99D22FF2E4; // 0x3AA0(0x0290)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A0D069254885F6E3E75B869A06BBF39E; // 0x3D30(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_AF881A4B4EBD8F808B4F0DAA93C7FF27; // 0x3D80(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8BCB7DA44FC38FD1808C2687A11DDDB5; // 0x3E30(0x0120)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_EF752AE34180F60BA8F45E83614732F6; // 0x3F50(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7CFCA6684F4C67633F5E1BA82A6136BA; // 0x4030(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49666A634E6B5E134DFF688C638C9C0E; // 0x4080(0x0050)()
	struct FGbxAnimNode_LegIK                     GbxAnimGraphNode_LegIK_BD45119B43E2EC4094F403A5ECBFE15D; // 0x40D0(0x08B0)()
	struct FGbxAnimNode_ApplyBoneModifyProfile    GbxAnimGraphNode_ApplyBoneModifyProfile_F95C332A49234782739CD680295E06D0; // 0x4980(0x0180)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1FF33A87411070FFC8BA768F08E37798; // 0x4B00(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_36E679E84BE23A22EDC7DF9137E06B3B; // 0x4B48(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_724124CC413EB413FAE348934D5E5D21; // 0x4B90(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7DD92E9D4A7CDC30A028D794DCEF4406; // 0x4BE0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61877B8840F6B3E925CBD6ACBD22B973; // 0x4CC0(0x0050)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_02C5E5A740EDFEDBF58DF29787355990; // 0x4D10(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5D58E7824E9BFDF8BF7868899F0DE3D1; // 0x4E30(0x0050)()
	struct FGbxAnimNode_ForwardDynamics           GbxAnimGraphNode_ForwardDynamics_45EDC7B34DD8D4A06104CCB7358889C5; // 0x4E80(0x0730)()
	int32                                         EnemyVarient;                                      // 0x55B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InPassiveStance;                                   // 0x55B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InCombatStance;                                    // 0x55B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChargeStance;                                      // 0x55B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnStanceChanged();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Ratch_GbxAnimGraphNode_ForwardDynamics_45EDC7B34DD8D4A06104CCB7358889C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Ratch_GbxAnimGraphNode_BlendListByFloatInRange_4BD66E224BBA193E003AF184010A575D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Ratch_GbxAnimGraphNode_BlendListByFloatInRange_169740C04AB17025EA01148867AC1739();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Ratch_GbxAnimGraphNode_BlendListByFloatInRange_1470DCB4498575F53CDAFFB78ACF696A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Ratch_GbxAnimGraphNode_BlendListByFloatComparison_DF0CDB344B6E9B842C700AB2223779D0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Ratch_AnimGraphNode_TwoWayBlend_02C5E5A740EDFEDBF58DF29787355990();
