#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Heavy

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPAnim_Heavy.BPAnim_Heavy_C.ExecuteUbergraph_BPAnim_Heavy
// 0x000C (0x000C - 0x0000)
struct BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue1;         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetAnimationStyle_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy) == 0x000004, "Wrong alignment on BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy");
static_assert(sizeof(BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy) == 0x00000C, "Wrong size on BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy");
static_assert(offsetof(BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy, EntryPoint) == 0x000000, "Member 'BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy, CallFunc_Not_PreBool_ReturnValue1) == 0x000005, "Member 'BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000006, "Member 'BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy, CallFunc_EqualEqual_NameName_ReturnValue1) == 0x000007, "Member 'BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy::CallFunc_EqualEqual_NameName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy, CallFunc_GetAnimationStyle_ReturnValue) == 0x000008, "Member 'BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy::CallFunc_GetAnimationStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy, CallFunc_GetValidValue_ReturnValue) == 0x000009, "Member 'BPAnim_Heavy_C_ExecuteUbergraph_BPAnim_Heavy::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function BPAnim_Heavy.BPAnim_Heavy_C.InitComponents
// 0x0018 (0x0018 - 0x0000)
struct BPAnim_Heavy_C_InitComponents final
{
public:
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Enemy_C*                        K2Node_DynamicCast_AsBPChar_Enemy;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPAnim_Heavy_C_InitComponents) == 0x000008, "Wrong alignment on BPAnim_Heavy_C_InitComponents");
static_assert(sizeof(BPAnim_Heavy_C_InitComponents) == 0x000018, "Wrong size on BPAnim_Heavy_C_InitComponents");
static_assert(offsetof(BPAnim_Heavy_C_InitComponents, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000000, "Member 'BPAnim_Heavy_C_InitComponents::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_Heavy_C_InitComponents, K2Node_DynamicCast_AsBPChar_Enemy) == 0x000008, "Member 'BPAnim_Heavy_C_InitComponents::K2Node_DynamicCast_AsBPChar_Enemy' has a wrong offset!");
static_assert(offsetof(BPAnim_Heavy_C_InitComponents, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BPAnim_Heavy_C_InitComponents::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

