#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_IronBear_GunnersNest

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_IronBear_GunnersNest.BPAnim_IronBear_GunnersNest_C
// 0x0370 (0x07D0 - 0x0460)
class UBPAnim_IronBear_GunnersNest_C final : public UIronBearGunnersNestAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_76D720724342E12D36C3058BEB8A530F; // 0x0468(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_84B2D94D4A086EA95256C6A807F909F6; // 0x04B0(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_907DB10242B86506529614948CCDC685; // 0x04F8(0x0198)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1632711C4AEF1582B7805690390EE276; // 0x0690(0x0048)()
	uint8                                         Pad_6D8[0x8];                                      // 0x06D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Slot                         AnimGraphNode_Slot_B6C1389D4979439FD1FC8A95ED06C8E6; // 0x06E0(0x00B0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_54A263B14835BE311B712BA8AB2A7429; // 0x0790(0x0038)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_IronBear_GunnersNest_AnimGraphNode_ModifyBone_907DB10242B86506529614948CCDC685();
	void ExecuteUbergraph_BPAnim_IronBear_GunnersNest(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAnim_IronBear_GunnersNest_C">();
	}
	static class UBPAnim_IronBear_GunnersNest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_IronBear_GunnersNest_C>();
	}
};
static_assert(alignof(UBPAnim_IronBear_GunnersNest_C) == 0x000010, "Wrong alignment on UBPAnim_IronBear_GunnersNest_C");
static_assert(sizeof(UBPAnim_IronBear_GunnersNest_C) == 0x0007D0, "Wrong size on UBPAnim_IronBear_GunnersNest_C");
static_assert(offsetof(UBPAnim_IronBear_GunnersNest_C, UberGraphFrame) == 0x000460, "Member 'UBPAnim_IronBear_GunnersNest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPAnim_IronBear_GunnersNest_C, AnimGraphNode_Root_76D720724342E12D36C3058BEB8A530F) == 0x000468, "Member 'UBPAnim_IronBear_GunnersNest_C::AnimGraphNode_Root_76D720724342E12D36C3058BEB8A530F' has a wrong offset!");
static_assert(offsetof(UBPAnim_IronBear_GunnersNest_C, AnimGraphNode_ComponentToLocalSpace_84B2D94D4A086EA95256C6A807F909F6) == 0x0004B0, "Member 'UBPAnim_IronBear_GunnersNest_C::AnimGraphNode_ComponentToLocalSpace_84B2D94D4A086EA95256C6A807F909F6' has a wrong offset!");
static_assert(offsetof(UBPAnim_IronBear_GunnersNest_C, AnimGraphNode_ModifyBone_907DB10242B86506529614948CCDC685) == 0x0004F8, "Member 'UBPAnim_IronBear_GunnersNest_C::AnimGraphNode_ModifyBone_907DB10242B86506529614948CCDC685' has a wrong offset!");
static_assert(offsetof(UBPAnim_IronBear_GunnersNest_C, AnimGraphNode_LocalToComponentSpace_1632711C4AEF1582B7805690390EE276) == 0x000690, "Member 'UBPAnim_IronBear_GunnersNest_C::AnimGraphNode_LocalToComponentSpace_1632711C4AEF1582B7805690390EE276' has a wrong offset!");
static_assert(offsetof(UBPAnim_IronBear_GunnersNest_C, AnimGraphNode_Slot_B6C1389D4979439FD1FC8A95ED06C8E6) == 0x0006E0, "Member 'UBPAnim_IronBear_GunnersNest_C::AnimGraphNode_Slot_B6C1389D4979439FD1FC8A95ED06C8E6' has a wrong offset!");
static_assert(offsetof(UBPAnim_IronBear_GunnersNest_C, AnimGraphNode_LocalRefPose_54A263B14835BE311B712BA8AB2A7429) == 0x000790, "Member 'UBPAnim_IronBear_GunnersNest_C::AnimGraphNode_LocalRefPose_54A263B14835BE311B712BA8AB2A7429' has a wrong offset!");

}

