#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_SM_TED_RaptorLegs

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPAnim_SM_TED_RaptorLegs.BPAnim_SM_TED_RaptorLegs_C.ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs
// 0x0020 (0x0020 - 0x0000)
struct BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_TedioreTurret_C*                K2Node_DynamicCast_AsBPChar_Tediore_Turret;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs) == 0x000008, "Wrong alignment on BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs");
static_assert(sizeof(BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs) == 0x000020, "Wrong size on BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs");
static_assert(offsetof(BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs, EntryPoint) == 0x000000, "Member 'BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs, K2Node_DynamicCast_AsBPChar_Tediore_Turret) == 0x000010, "Member 'BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs::K2Node_DynamicCast_AsBPChar_Tediore_Turret' has a wrong offset!");
static_assert(offsetof(BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000019, "Member 'BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00001A, "Member 'BPAnim_SM_TED_RaptorLegs_C_ExecuteUbergraph_BPAnim_SM_TED_RaptorLegs::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

