#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_PlayerCharacter_3rd

#include "Basic.hpp"

#include "FaceFX_structs.hpp"
#include "Engine_structs.hpp"
#include "AEnum_WeaponType_structs.hpp"
#include "GbxAnimRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GbxAnimRuntimeBase_structs.hpp"
#include "AStruct_WeaponAnimContainer_Menu_structs.hpp"
#include "OakGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_PlayerCharacter_3rd.BPAnim_PlayerCharacter_3rd_C
// 0x11930 (0x12620 - 0x0CF0)
class UBPAnim_PlayerCharacter_3rd_C final : public UOakPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CF0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F96C115D438046482F07E582EA0B0968; // 0x0CF8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75D37F03428078B898A128A340AE308F; // 0x0D40(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DFBA758E4F65AC9A7A3BF7839414AD52; // 0x0D90(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6D710B914696CB59CBEFB586D06F7562; // 0x0DE0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_03878CD043DEFF11001A44A7D2A12220; // 0x0E30(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5DB240D042CF10D3760C83B7330B666C; // 0x0E80(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_642347504EE1CECE4C707FAF9016905F; // 0x0ED0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B342491C41CC0B5FDAFC8383667C44BB; // 0x0F20(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9C81168548B7B2A2611C3498BA03E2E3; // 0x0F70(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CB3E20F6456029ADBEBF719D25A2E2C8; // 0x0FC0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A1E2098F4824B102441CDA985AB4ED8B; // 0x1010(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AC6BF8F940FC03139252E99156655381; // 0x1060(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CA388B8F40271D923283ED804C8D0EEE; // 0x10B0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3896DA554E9A11CB8EEFF8B93FECD5AC; // 0x1100(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_643B2999411EFB45053037BC522A6A71; // 0x1150(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E81D6CD5465E093101705FA960BE8BF6; // 0x11A0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1F67D38040B75D4BB18B73B2CA3E866A; // 0x11F0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F46496EB4FBFD5F17146B4BEA62A159B; // 0x1240(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31717F784305B4B60CCF66A276231A59; // 0x1290(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A29FA38F43EBB635E8FD80AE9ACDBE05; // 0x12E0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26BC85FA4D743FF3B81F9BA2F00994C1; // 0x1330(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3CD845984CECE83D7FE55CAF99CBB9EC; // 0x1380(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0A6E0F8844BAEEA38EA16D902AEF70E6; // 0x13D0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8D58960D4C2BF7B7C78D79BD877F2697; // 0x1420(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C09B965B457E4A31EAA691B7094C95B5; // 0x1470(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8FA60B1B4A27A7191685BFA4FF8D50E0; // 0x14C0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C5E047914221606C56DC5FB94832F154; // 0x1510(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2E1093C6441140CA6B000582E21FF4EF; // 0x1560(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85A9A8844251EDC057C4F1B901618098; // 0x15B0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C45CD6CF4B152B8ED92712B15EB9461A; // 0x1600(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D7C9B3764D84E1DD45864BA015637D7B; // 0x1650(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6706966E4D1563882D8A94852FA785D6; // 0x16A0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9F2E19724B03206CF100A8AB78835CCF; // 0x16F0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6E847986456092BB00CB4EB378282D42; // 0x1740(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FFE24BB848109C2492D8888B8A89377F; // 0x1790(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_03F57C00419E6C69D539C583AAAFA53E; // 0x17E0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_395DD5C14173EF0690CD2FA5BDA18803; // 0x1830(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B1798D8A4EAF681DD1AC23B4D846D467; // 0x1880(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EEFBDC9E4B6CF25321E21D9B3BF84F4B; // 0x18D0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D663A24A4800DDF64E34F09AA7A76DB0; // 0x1920(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9448EE4845AB5E56684E6A8461930000; // 0x1970(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_12DFBEA441E67FA28B12C2AB2971931C; // 0x1A60(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8C08A07A495ADF6E16A93885D07A3D42; // 0x1AA8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_63DFBD604EF43BFD5429E7A16AD16C52; // 0x1B98(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_100788E64B1BB4B8033CEDB5E002958C; // 0x1BE0(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_97D8EB7A458A110BA956238B4C088D73; // 0x1D68(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_865184D14F842851C0DFF192779E1FF8; // 0x1DB0(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_BD9AE64A4F442FE2A7E33694F21C749E; // 0x1EA0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25747CCA4D5A476744C1658556594DBA; // 0x1EE8(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AF315C99401EB6FEC4A8F2A100A6BFC5; // 0x1F38(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_42E329A34C4A987B6272EFBBCEB3783F; // 0x2028(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_322C2FA34CD51319D629D292C24FCAF0; // 0x2070(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BE562CA7497C056BC00C999D532C9F0A; // 0x20C0(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_7806249447D26F4ACE7AC882F9DD7B53; // 0x21B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_394975354223F1A90ABCA1B055A6D35B; // 0x21F8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_B658D817477932B858F97985DA444E45; // 0x22E8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_00FF4B154020ACE3F884C38C101B57AF; // 0x2330(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_6B4D2F1C407BA50199CBBFB7937ABEE5; // 0x24B8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_655566744C27B7E0BC44D8B0A2C070F8; // 0x2500(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A1D50AA548E660263359A8B1D1EF0214; // 0x2550(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DA140F8542F70085DEC502AA7C1DD86C; // 0x25A0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9579864B4B3B723ECDFF6AA749672A86; // 0x25F0(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EBC01E11436B2F8277A0C7A52CF64698; // 0x2640(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D0C162044DB1B1A3A1255F99718F64E9; // 0x2730(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8E2DD70E472A533237FEC8A680CEEF80; // 0x2778(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_87BC033F47CFD2E2CEB0E3A39FF75285; // 0x2868(0x0048)()
	struct FGbxAnimNode_BlendListByFloatComparison GbxAnimGraphNode_BlendListByFloatComparison_1C02E3A84D4D44E7841783BA4F8BCF27; // 0x28B0(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6B4F6BB64C108AE18BA4B9B89DE9BC97; // 0x2988(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4D3FBF1046E8833C4BF95694D05894C5; // 0x2A78(0x00F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_A8EFC3264E6A5FF0769EFD9272913814; // 0x2B68(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E457F1BF4F8DAEEE00D927856E782366; // 0x2C80(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_EF8A799E46BAC631D87D6D8B01167E27; // 0x2D70(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E47F15D140E7F8EB10D79DAB78148F68; // 0x2DB8(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8B2D456E4D234D847A1BBCA6D00EF894; // 0x2F40(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F7589A5E46648C3585A5D08FDCA84B44; // 0x2F88(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9FF0C6B540C1C613EA4F09BBBD73601D; // 0x2FD8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1BAB9FF8458EEE26D23AC992780BDFA8; // 0x3028(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5743E66B463FE93EFB1204AF29C47A68; // 0x3078(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6EEBEDD2445EA7340455839FF3BA3D8F; // 0x30C8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_425EE7834EF8BF3A8247589959921661; // 0x3118(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19615EE24A22157695B98984E6EC2EDF; // 0x3168(0x0050)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_F856E0B342B2624C587D9FB6342E6B8D; // 0x31B8(0x0168)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0E4431574D99F5CFDD88A0B20391DE75; // 0x3320(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2AE277CA45B980D41C9521A7049457B8; // 0x3368(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A6ADAAC34D2CE6AD5E5532B9F558E32F; // 0x3458(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_818EEC17434081DDE0CB7D8A8017033D; // 0x34A0(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D84ABAED4C2C9CF3A96B539EE148A1D7; // 0x3628(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_56F0A70F414E84FA30F1E6BC846606E7; // 0x3670(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_1FE1F2354F1442E0B8E9E8B82E04D6D7; // 0x37D0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A1CDA8544A810A3F042972BD8697EC5F; // 0x3818(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D37398224B96010BB09039B68C98F842; // 0x3978(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4C9FDAF64E3F5BC45FEAB7A3E4284B0D; // 0x39C0(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9360B3CD44233FB9A009F6ABD2801115; // 0x3B48(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DD237EF343B33A14401E348C475F7A9C; // 0x3B90(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_F9BA19974780232056E2ACB206C73EE4; // 0x3C80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F6A581ED43095FE6C99A1BBD19C2CAC1; // 0x3CC8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8D11C89E4828C48A2C9B54BA92B7BBFD; // 0x3DB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6AD147FF448FC3DB408F3AB1B724CE2C; // 0x3E00(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2942E26F4208C121052890AF85D9E90B; // 0x3EF0(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F863A7394DBB263C838FE8A83A982D19; // 0x3FC0(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_23DFEB744619432080D3BC8CA75125D8; // 0x40B0(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4028AFF740EC61976DFFA08C8BD4E24B; // 0x40F8(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FFC1DF8249B27CDA8272FBB6590B7D1C; // 0x4218(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3BD230C24C7BCDEC66A880BB8E5887AB; // 0x4308(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_2D9E2A0448DC935229731EA55C4F2FC7; // 0x43F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0DAB6FFF452CE383C4A8CCA36193D412; // 0x4440(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_38C69AAA45F56CB128792782924AD00A; // 0x4530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F13AA11D406694F084CD40A07917E304; // 0x4578(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_030126604F293D420BB906A042D2EDC6; // 0x45C8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D75C65F045C7CAA84DA32698B9CC137B; // 0x4618(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8A5C9EB24DFCB5751080018C1F8769E7; // 0x4668(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C467A3A34CECE22A1E90FFBE371A4CC8; // 0x46B8(0x0050)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3E0595604AA6047C126272B61382B34E; // 0x4708(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_543765A441550D24504A95BDF87225D5; // 0x4868(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47543499444986EDEBADBF973923CE1F; // 0x48B0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3D6A20D44B6AD76590B9C2A9817BA7AC; // 0x4900(0x0050)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_E15D09C44233BF0F50543F8541BB2025; // 0x4950(0x0168)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A79321894865C50EB3FDEB9E750151FE; // 0x4AB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2BFBBEC7480B783F6119A6A9B27EA8D1; // 0x4B00(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_868FB36849B26F85DD9F808011D53E10; // 0x4BF0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D26E33574E3335EA0F71488475BA1BD3; // 0x4C38(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A86D7D274D2B7783C8558EBBB0A7D55C; // 0x4DC0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_DB14270948A93EC513E939A839E193EF; // 0x4E08(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_F61882E340EBC4DD648A5AAD20AD436C; // 0x4F68(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_DD4A8B004B46C1C96441A1A7363C5F57; // 0x4FB0(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_6A3DE42B4BC3159CA9D04480EA1C4E45; // 0x5138(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7FB8CF2F41BCD2429DE482A763D6A5F9; // 0x5180(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_EBFF5707425BDF250CB291AF3EE7B773; // 0x5270(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C7FF887F43F68A83DEC301980F4FAD64; // 0x5340(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8336474343132F82B919AFA004CBD6A4; // 0x5430(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1A2848294C652F2A5C2180888B1AA68D; // 0x5478(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7439786D4BC87A66C54304A43DCD58E3; // 0x5598(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_E3302ECE4CD80D7F2C6BD1A307ABAA01; // 0x5688(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C21F402442A9EC92E0518592CADE9B40; // 0x5758(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36590B384671E19F7EC83A9165619B0E; // 0x5848(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0082AE9543DE40C4F985C4B43BDACAF3; // 0x5938(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AA073A6F4493C4CDB30E0983F3117930; // 0x5980(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_5DF7010C48FF69922D60B4BAAAB60173; // 0x5A70(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8E503A96491022F0594726A3D1E86432; // 0x5AB8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48FAEDF644B8A30D0202E8A150D40AEB; // 0x5B08(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37414FB441B9D6EA6274CA985611ADF6; // 0x5B58(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DA8A4BA444D3579558BA10B2A5D6AFC1; // 0x5BA8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2DB4529146B0454227B8AEAE8D809112; // 0x5BF8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1D4D857E4ED3CB60D9225481CBA1690A; // 0x5C48(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68E724B045566E89FA481B8456208064; // 0x5C98(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9A978FBA4DCCAE229CA0909E98BAA9F0; // 0x5CE8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_785D3EC4436574CE4E8901AEC794B69A; // 0x5D38(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A98FF064490794EADB08169479174BE9; // 0x5D88(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8277BC344F606D83CEE813BC623A9420; // 0x5DD8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AD2E5C904C244E410353DD823347ED9F; // 0x5E28(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D04CE54649CA0CD3EDC452BAC41F0C81; // 0x5E78(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3E14C3DE49C66C52BE3FDA907D651EC9; // 0x5EC8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7AFE13BF47F0C470BBB527BBD5EE25D5; // 0x5F18(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4856124E418DF9D563CEB3AF4AEC6DE8; // 0x5F68(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_06DE485849CB45C55E15CF81BAB3A39F; // 0x5FB8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5DA0C14648605FF3C04C9ABC011FC592; // 0x6008(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B9F75A1E48D35329F8BFE7981F54F778; // 0x6058(0x0050)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_C569F95D4F7D97E1C721CD8CCA7BEFDA; // 0x60A8(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_809083A64D599937D97265BD725F4A5D; // 0x6208(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B1DB30424513E63CBF966C93030BA9FC; // 0x6250(0x0050)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6E4E8A5B4927B652393A8D8EF8B66EE1; // 0x62A0(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E378912E4A1A94BDB92A63B2DAC9C534; // 0x6400(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7B6092244EA056279C6311966EB074DB; // 0x6448(0x0050)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_E9A1402E40EBDF2A478210BB3E71E676; // 0x6498(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_7C71F2FE4E998500014DC895D5E12B5F; // 0x65F8(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_F33A2B314A6CFEFED146B4B44F03AC9E; // 0x6640(0x0120)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6A25093F4B46708A9F39CA84480941D9; // 0x6760(0x0160)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_263281354EB91796560F95A93C29A000; // 0x68C0(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_90472F1746DD3AF932F5AF88C2CEB9E8; // 0x6A20(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1AC0FE984DDE9FF2651B8A91E66622BA; // 0x6A68(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B51AA94740CCD0470531ABA2900C59D8; // 0x6AB8(0x0050)()
	struct FGbxAnimNode_BlendListByFloatInRange   GbxAnimGraphNode_BlendListByFloatInRange_E759FD7E4461A3E420B1E3A2F9F1448B; // 0x6B08(0x00E8)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_6A5D5CDF4129A9A4A4568C9E9C4A6469; // 0x6BF0(0x0168)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_5724C6C24BD5F75A6306D4AFF64F9D6A; // 0x6D58(0x0168)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_F76B30664CB583702F610784B9863526; // 0x6EC0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0A19AD9947B65D167D3E488890F98CED; // 0x6F08(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_DA6E14344ECA6522D1BAFA82687D99A3; // 0x6FF8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D1F33C184A74D64F46CB088379AD1FE6; // 0x7040(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D2E2D21D4E8F9980AC6633BF5E26F51B; // 0x71C8(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9EFF4EB6421A3772B6C970944B961971; // 0x7210(0x0120)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_99728E7D4ECD5D76B300079585112DA8; // 0x7330(0x0160)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_CE3239DC4D0D477B0946D18276C21A3C; // 0x7490(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_6D2B86EC49235D018B44D195E261D94E; // 0x75F0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6AF0C8414046378A70D33AABEEE0104C; // 0x7638(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_85926F394B97214537DE09913F887DE9; // 0x77C0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_A2B6B9D24F3D4FBF8F976B8709173A74; // 0x7808(0x0188)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_E0FA563649D4A8204764C8ADB351D9A7; // 0x7990(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_32D68691402EA7FAA47809B37BFD3BCE; // 0x7AB0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4FA7E021456D7847E6347088BD8B6609; // 0x7B60(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_A588A94B469BC72AFB40ECA6B204CE10; // 0x7C30(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7444F99D4D3F2CFD0C1B2CABB332ACFC; // 0x7D10(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15134F84428F3491808EB5A8ACCE1A34; // 0x7D60(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_CB2E477B4F6A9AD4BECA67A3544974F1; // 0x7DB0(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8D5115684CB771FA9189C08333E833FE; // 0x7E90(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19A48E8B4936DB5B12317484AC7B4E53; // 0x7F40(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3C4400A64112B28511063792B5DCE836; // 0x8020(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5789EE9F483A84E9640377A2386B2C8D; // 0x8070(0x0050)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_474B64DD4F7392E7E8732AA009B51154; // 0x80C0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_723E16424EEEACB39A27AFAB34F6D16F; // 0x8108(0x0120)()
	uint8                                         Pad_8228[0x8];                                     // 0x8228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Slot                         AnimGraphNode_Slot_B07405A5475027B8682FF3A0F95D07F8; // 0x8230(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_ACF2A70B4DD477FFFF61CB87F5081BCA; // 0x82E0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_08FE5112445A0FB9E330A9A3A36272E0; // 0x83C0(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_64A70C0945B9C9D8EBB392AADF162D81; // 0x8410(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_A1D23A804AB2E2589D949A82F63C6958; // 0x84F0(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_D8F5714A486E9FFE6C3227B9CE29D4A8; // 0x85D0(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_CDCD24EC46D9AD53C8E9049EF988352A; // 0x8680(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_197C349A49F5E7D186350A975A424326; // 0x87A0(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E1B4225D4BE36AA525C6438EB539EFF8; // 0x8850(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5BE396FB4E0FFFDEBFBD10AE81DBBF9A; // 0x88A0(0x0050)()
	struct FGbxAnimNode_LegIK                     GbxAnimGraphNode_LegIK_638BEA3A4AA2DE16363106B87289DD68; // 0x88F0(0x08B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E312FB93437881EC822B7E9D0178D5A2; // 0x91A0(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6AD5D6AD49C1DCA5B2C4C99EF19A49B9; // 0x91F0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74689970411D6787313AA085A32F1D69; // 0x92D0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3104239B4A09AC55138414BD2FF189AA; // 0x9320(0x0050)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5F2F83264979003A67B057814F9AEB4D; // 0x9370(0x0120)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4502ACF64A7F75028A04889AC88684E5; // 0x9490(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_913AD38440380A0EB3D8BB8489A2BCB6; // 0x9570(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_097BE8124CA6D8CC2A390E8078F6B9B4; // 0x95C0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C24C589343F38EC80F635C9DB086FC37; // 0x9670(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3C809403423B86D491322FBAA4B23429; // 0x9740(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B2D2DC7946CA5EAABDE940A3D8B8AF67; // 0x9810(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7268D7B24E0264839A2B3BB61627A3FD; // 0x9860(0x00E0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_BB2AE34E4E8ED2F723C5529354096A90; // 0x9940(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C48ADFCC48179068424B4481ACADBFDC; // 0x99C0(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_A72D714D4098F4D8D4E6DAAC18891BE2; // 0x9A90(0x0078)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_D7A74DC64957E5DC1333FB8DD2AFCC52; // 0x9B08(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8CF0FCD64549BAB3E76D7E80A6FD8609; // 0x9B88(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_34DE93EE4736EE2FE7605985098B5B80; // 0x9C08(0x0078)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7671B1D344A49F6C18A0919BDD47C606; // 0x9C80(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_96F1CAE74585CBDC974455A95FA05FF6; // 0x9D00(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7B5C47474BF9BA8555DB4FA1D6B1E6A9; // 0x9D78(0x00F0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_922FC42B42B974BAE507AAA4D276CBEA; // 0x9E68(0x0078)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_B452409449FD61047271BCAAB01B9D46; // 0x9EE0(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A9D0581D4378354A3F1386BA43F2FED6; // 0x9F60(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_AF53F47943670FA070B2059725057CA0; // 0x9FA8(0x0188)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_92C372274BC19CC6E251F2BC0D536D8F; // 0xA130(0x0078)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_A609988D465D34F9787E92BEA872BC09; // 0xA1A8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A78127AB44869DEE3A6DC783DFE498CD; // 0xA228(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_01864FE143196FA81497228784685841; // 0xA318(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_BC4F8B1648ABE6CD858D82AC14CA8935; // 0xA398(0x0078)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_528739CD4CDFE8ECF883AA817BD406CB; // 0xA410(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_128DFE6F411F3EAA524398857D05ED2D; // 0xA490(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_790BA948433CB6EFB7016CA691D31DF1; // 0xA508(0x00F0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_031B95A6481B5F76BFCD4AB0572B153F; // 0xA5F8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C29143BC44D8C8B8C48B9B9B723FEA6D; // 0xA670(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7253190C46B917447B7C4099D9A8EBEF; // 0xA6B8(0x0188)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_312A23434D9E5B306BD3C8A26C1F028E; // 0xA840(0x00B0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_0AC8040D401BBDBAF053C8818C319158; // 0xA8F0(0x0120)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_BC04864747100B2522A763904BB70510; // 0xAA10(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A71169934B47EC56C4F8779D94F17EBB; // 0xAAF0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0EDC11CE439A3481F48380B82169FF8B; // 0xAB40(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_79C70D334CFEFE2898E1C9BC9B670EC5; // 0xAB90(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B16CAFB34407BFBEDDC56881168D6EA7; // 0xAC60(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1A2D97914D137BD8EBB2658440FC3428; // 0xAD50(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25DAFE47424F960295B46FB7C36C23CD; // 0xAE30(0x00E0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_F78DCB7E4D7CEC69A6C75F996FDBF24A; // 0xAF10(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_F13DB3F1441819150A4678B29A08720A; // 0xAF90(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_B274B5E7499736063A85F99EAB6956D5; // 0xB010(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_515AD6264B7C4F6A926974937A7E423A; // 0xB0F0(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_624E9B8F492C373BE1F0ABA650015011; // 0xB1D0(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2B90C0BB4D8EAFB9A81B2E8894CAACA7; // 0xB2C0(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_DD5186A1477FC918CF8C6D96373EA96F; // 0xB3B0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6F65AEB9450C76377B0D78B8E2459EB9; // 0xB400(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_BDBDDA6245D9F372316453B4BFE1AB67; // 0xB450(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_9C263D794F2CE1D3AF27D58A9C401292; // 0xB4A0(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2A4078654AF055BBD7ADF3A6950B1BCD; // 0xB520(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_EE829E684489B876D1845E907C670974; // 0xB5A0(0x0078)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_8E90931C456452832A0654B30C2F9CB9; // 0xB618(0x0078)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_A29DC4C14079D52EFBA490BF26D4EF04; // 0xB690(0x0078)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_C84B0BF445CCD90946DAE5AAA6AC3EFC; // 0xB708(0x0080)()
	uint8                                         Pad_B788[0x8];                                     // 0xB788(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAnimNode_HandIK                    GbxAnimGraphNode_HandIK_165D987B461F3FAE3CEAF8967957C8A2; // 0xB790(0x0370)()
	struct FGbxAnimNode_HandIK                    GbxAnimGraphNode_HandIK_E4D628B74E1647D2CA30F19FB5C500C2; // 0xBB00(0x0370)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_0D429DE54F5EE3DCF8753487784EB914; // 0xBE70(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1E3E9075463589BDC0435B949EF6D546; // 0xBEB8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E90CB4A746D7D46026878C8654B29C6A; // 0xBF08(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F09FCF954C8D9D07B03BDD8332946AAD; // 0xBF58(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7B637FE9483077642422A290996E9E2D; // 0xBFA8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_956BC2AA4D56084B892B4F8E3C1FEA7B; // 0xBFF8(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3BF5DB26417261CB5C1AAEAB15F79120; // 0xC048(0x00F0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_DE31E1034C9EAF4812E523A2053F844E; // 0xC138(0x0068)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3917E1174EC007C2A05D769CB9044A57; // 0xC1A0(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D5D0D4F54B3E7AD879EF8A856E8C5A5F; // 0xC290(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_899532774AE0903BE138629CB6C09578; // 0xC2D8(0x00F0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_FD63C6AC4F3D8F50C657AFB63492CF07; // 0xC3C8(0x0068)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A3C5BC1E45EC688481A09480EC8A7C15; // 0xC430(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_67D4B7714445660802CEDC86C5956816; // 0xC520(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1A7A147F4AFDC123C5456CB69E594FFA; // 0xC568(0x00F0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_A3466C2D4A9ABC98999576822A353EE2; // 0xC658(0x0068)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CA50BCB54B329C6C27A817B0662BCCF0; // 0xC6C0(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_61CE7387462EC490FA867B9C4E4534BE; // 0xC7B0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_BA24CCE144C18184FCD195938CC4C782; // 0xC7F8(0x0050)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3976F99D4B873CE9D64EC986F569E94D; // 0xC848(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E67C3643435C9E63997B9A9DC06695D4; // 0xC890(0x0188)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C872D1A64F7BD57DB853D490D1651529; // 0xCA18(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F77246FE4A6FE6ACD396FB8F41FCB7F7; // 0xCAE8(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6B6F7175496FC769CA8F338DFD5E1A57; // 0xCBD8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_121DB620475CAD1B760B109C1B4D16B7; // 0xCCA8(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_845273CF4008CCC042CC9D86612C6D2B; // 0xCD98(0x00F0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_53505D764091879C785BB3963797B0ED; // 0xCE88(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3AF58DAE4FDEB477AC004D94E7E7BCD8; // 0xCF00(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E53CD48D4EAA73C7C9BCF1BAE213B037; // 0xCF48(0x0188)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24BFE8E54AD5C0B7AD9DD3AD5F8B0E26; // 0xD0D0(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_B5D840004020337300B30E81F37C1739; // 0xD120(0x0120)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BC6126B84BB829CACD39649ABF4C0AD5; // 0xD240(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_BFB5553F4D4DC8F0FC1A0ABB09812585; // 0xD310(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B531F1B240CA1F98D205B9B7ACCCA128; // 0xD360(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C133B31B460DBDAF1202F49AAC06F879; // 0xD3B0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7266FB364BE4B3D6785B30916267BAF1; // 0xD400(0x0050)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_5D1ED2F84F8FA3F35292CE828A35CFDF; // 0xD450(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_AF3FA44640BBADF5EDE994A02B30458B; // 0xD520(0x0050)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_BC4FACB54DF9E76669462C836D1D1656; // 0xD570(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A14EDC384B5BB8A26431EDB716204918; // 0xD640(0x00D0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_EA7D8370415BB9B752AADCA2DBBDCA0F; // 0xD710(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E5313CD54618213FF780D0B995FD7937; // 0xD830(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_D56DD9B043E5E5D7E67931BB5669B11E; // 0xD920(0x0050)()
	struct FAnimNode_LayeredBoneSetBlend          AnimGraphNode_LayeredBoneSetBlend_FA39CC534E41CAA9346DC781932B0ACD; // 0xD970(0x0140)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_60404E3443A9FE9605A014A074E66DDB; // 0xDAB0(0x0238)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8700778745B14923F2350B84F4F228E6; // 0xDCE8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7B804C894FED710BFE148984E293F9D5; // 0xDD38(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C0282C7549B9EFF3459A449CF339D5B8; // 0xDD88(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86573E584204C63CA21AB493D5F68572; // 0xDDD8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14CF91664344CFB216638A837D8BBAE9; // 0xDE28(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A63C5C034C916E32E2406ABBAEBA826E; // 0xDE78(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BC9773E245944D5299119699670D0062; // 0xDEC8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_02D4A2F64AFDCFE2060C329086C2CC41; // 0xDFB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E29B4907480023C6B47FBF815C117980; // 0xE000(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_DA3C2B6C45A02B47913077B21BF5E5F9; // 0xE0F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6303DC064BC2CD60ACDB168C71B568B0; // 0xE138(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_851D281C4A3CCAFB83B7A48DC9CF7799; // 0xE228(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9A54FE0242808E1D1AB5AC9C10D8CF0C; // 0xE270(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C8BC09974949CA1B26C20A83759E3966; // 0xE360(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12559A1F4CC7998AE0A55B87618290D9; // 0xE450(0x00F0)()
	struct FGbxAnimNode_BlendListByFloatInRange   GbxAnimGraphNode_BlendListByFloatInRange_A5A221F74A601E534760BB8AE91FB6AA; // 0xE540(0x00E8)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9F387F7142F42991E7AD5D94DBAF029B; // 0xE628(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_AF682DFE4F77A2434A48D48F8B4E1662; // 0xE670(0x0188)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_E1FD9B18410FFF4467D94AAA8C4BD4A0; // 0xE7F8(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6AE542AC449814E0B95FAEA76853B836; // 0xE910(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_43B221054602202EB73B0D83ABAC1F9E; // 0xEA00(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1D06C9B64E28193061CE2AB700C79AE6; // 0xEAE0(0x0050)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_E915634D447B206FFAE2F3B968CFF67C; // 0xEB30(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A24E42B448479552D353BF87B6F96E81; // 0xEC50(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69D352514FBC81A793D5518A3B05C32D; // 0xECA0(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_784481D94E96F56E9D3EC09930A9C480; // 0xECF0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_E2E3207D4B9B8E9162B43C86A17A38F5; // 0xED70(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79F8D496473F4E9078E4E6A0FF2484F7; // 0xEE50(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4837BF7A46AC47280A51AC87F6E91E5B; // 0xEEA0(0x0120)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_FAC7C91F417DAE38BD4DCA82AAA64089; // 0xEFC0(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F27D3B414073CBB6F38DD39A151BC4CB; // 0xF0E0(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_55A28FFD48349DDF7402DA97F8EF8921; // 0xF130(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16362FF7452678D59FC39D8C5DFEDDE5; // 0xF250(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_01996CA44D628853FF1798BB9A39760D; // 0xF2A0(0x00E0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_C6609A2441B16DF34C5FB5855F8AA5FE; // 0xF380(0x0120)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2B707F8342586B291A621CBBAF2FA171; // 0xF4A0(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_FA7C5616498DDA2D30B2EEA430A811C0; // 0xF5C0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_D0401FAA48D4E70A761BE0A676C958C1; // 0xF610(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4A7FEC3E4C40F7FB65C47CA7BB3A23B7; // 0xF660(0x0120)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_B2E174E94F5A02E5FE608F99E787CD3C; // 0xF780(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_97F5C3DD44BE6ADE2BFC78A1FA3542A5; // 0xF860(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5B201CC0488806F90195FE81CB0A26D6; // 0xF8B0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_ED7393374AB2187684A4DCBC0625E758; // 0xF900(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3D3CA9344FFA713584524D9F212BF0C5; // 0xF950(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B31BFA9449DC85843209D4A71A5E731A; // 0xF9A0(0x00D0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_9675B70743B8E7324C543290C718DC02; // 0xFA70(0x0238)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F014127D4F742B0BED90479672633FA6; // 0xFCA8(0x0050)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2EBF110A4F6DAB1B6C0C32A5590215AC; // 0xFCF8(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5C2EC7F04E2CA7D528F91C9C16AB8A8A; // 0xFE18(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_A356BC9844EB0452156C06A10CB71DEA; // 0xFE68(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2348651B460234ACD5D540950CD5485B; // 0xFF88(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_F5614E4E45B54DA9C9AEB0A3EBDC607B; // 0xFFD8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18D78B6447AF6A1C7544E880798D7822; // 0x100B8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1872E78A48A9218B8ED6F0878987FB30; // 0x10108(0x0050)()
	struct FAnimNode_LayeredBoneSetBlend          AnimGraphNode_LayeredBoneSetBlend_81AD31084A195C7D0BFBA1A2D81AE496; // 0x10158(0x0140)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_E23F0E404F602519AA481799FBE87DE2; // 0x10298(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_FC14956E4569156D68A3BEAD0C2CA260; // 0x10368(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65F634754E613DC4925F26BB76C0BAAE; // 0x10448(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F3D590E2460E8E5755A591A3A0061E06; // 0x10498(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_A060B121438A7202F9FB8FA9701E0100; // 0x104E8(0x0120)()
	uint8                                         Pad_10608[0x8];                                    // 0x10608(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAnimNode_ForwardDynamics           GbxAnimGraphNode_ForwardDynamics_896A0ADE4A9E3DD6EC0570BC4FE0EBD6; // 0x10610(0x0730)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_EF2B938643ADB9BDAD6DC2BC90EAF22F; // 0x10D40(0x00F8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_274E73C34213C658280F8D9709434B9E; // 0x10E38(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C6718DB14C42F2FD6BB2ACBFFDB64EB2; // 0x10F08(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_64E33A2541AF108A2DAFEE9CF0ED6DF8; // 0x10F58(0x00D0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_21D3C26046CDCA1472CA91A8AB443683; // 0x11028(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_FAA041674894F6EED2AB959BBC94587F; // 0x11148(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E82743BE4726F5280D5CFA8608D7B241; // 0x11198(0x0050)()
	struct FAnimNode_BlendFaceFXAnimation         AnimGraphNode_BlendFaceFXAnimation_C51A5D8E49B055BAE41AAE8CF64C3012; // 0x111E8(0x0088)()
	struct FAnimNode_LayeredBoneSetBlend          AnimGraphNode_LayeredBoneSetBlend_F3EEC79945A3FE0C343F54B5E437A77B; // 0x11270(0x0140)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_D60C09BB43BB7D70569AA0BF6A053000; // 0x113B0(0x0050)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_05EAEB064C0FF6B418521787B200E879; // 0x11400(0x0120)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_94BC5E674AD05FB493112496CD9C7635; // 0x11520(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_FAAD335E49F131830F1172AFC3770F4A; // 0x11600(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6F1FCA9544F7AB60EC0946AD9D975C89; // 0x11650(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_D7873D5449B8D80832F5A980AE2A63E7; // 0x116A0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74F5E41947477BBA8F8F1A9AB2EAC191; // 0x11780(0x0050)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_29BB900C4117792B3AD6609A5A0E75B9; // 0x117D0(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9CA1DC5B42FDC1D0DE446FBF7DC537D1; // 0x118F0(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_763FF81548483F2ACC8BA3AC75A876A9; // 0x11940(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_784E138C467F31687BA3308D4620436F; // 0x11A10(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EE376A9E4DE66C6B071B539215D7C4CD; // 0x11AE0(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1471FDE94C53B14014BB299C29E5D5C3; // 0x11BD0(0x00F0)()
	class ABPChar_Player_C*                       PlayerCharacter;                                   // 0x11CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomIdle;                                        // 0x11CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time_X;                                      // 0x11CCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviousHipOffset;                                 // 0x11CD0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Hip_Lean;                                          // 0x11CDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HipOffset;                                         // 0x11CE0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         R_IK_Offset;                                       // 0x11CEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               R_IK_Rot_Offset;                                   // 0x11CF0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         R_IK_Alpha;                                        // 0x11CFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_IK_Offset;                                       // 0x11D00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               L_IK_Rot_Offset;                                   // 0x11D04(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         HipAlpha;                                          // 0x11D10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_IK_Alpha;                                        // 0x11D14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HipTarget;                                         // 0x11D18(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Weapon_Type;                               // 0x11D24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ForeGrip_Type;                                     // 0x11D28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Pistol_Stock;                                      // 0x11D2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Grip_Type;                                         // 0x11D30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Weapon_Manufacturer;                       // 0x11D34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UManufacturerData*                      Manufacturer;                                      // 0x11D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakWeapon*                             BaseWeapon;                                        // 0x11D40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Weapon_Mode;                                       // 0x11D48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D49[0x7];                                    // 0x11D49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStanceData*                            Active_Stance_Data;                                // 0x11D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Stance_Type_Debug;                                 // 0x11D58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D59[0x7];                                    // 0x11D59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
