#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_PS_Jakobs

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_PS_Jakobs.BPAnim_PS_Jakobs_C
// 0x05B0 (0x0A40 - 0x0490)
class UBPAnim_PS_Jakobs_C final : public UOakWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1AE2714C4978349F824753ACAE58D1C1; // 0x0498(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_34475B6D47701ECD7FD3FA858AE8EB5C; // 0x04E0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4380062C48C733C6E38512BCFCDCD694; // 0x0590(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_D3411DD5419680D9A83F82A49314DCCE; // 0x0640(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_50DA920748F4A3C435CA258B26FE5672; // 0x0760(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_151BC18947E58E4E58BB4CBBC70BBCB9; // 0x0810(0x00B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_746D18D34F67622E953A4BAB9167BAF0; // 0x08C0(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_CAE2CD864DAA422145C4EC83E60EE958; // 0x0940(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_ABACB6CF48D95558320649AB827FA574; // 0x09C0(0x0080)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_PS_Jakobs_AnimGraphNode_SequenceEvaluator_ABACB6CF48D95558320649AB827FA574();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_PS_Jakobs_AnimGraphNode_SequenceEvaluator_CAE2CD864DAA422145C4EC83E60EE958();
	void ExecuteUbergraph_BPAnim_PS_Jakobs(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAnim_PS_Jakobs_C">();
	}
	static class UBPAnim_PS_Jakobs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_PS_Jakobs_C>();
	}
};
static_assert(alignof(UBPAnim_PS_Jakobs_C) == 0x000010, "Wrong alignment on UBPAnim_PS_Jakobs_C");
static_assert(sizeof(UBPAnim_PS_Jakobs_C) == 0x000A40, "Wrong size on UBPAnim_PS_Jakobs_C");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, UberGraphFrame) == 0x000490, "Member 'UBPAnim_PS_Jakobs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, AnimGraphNode_Root_1AE2714C4978349F824753ACAE58D1C1) == 0x000498, "Member 'UBPAnim_PS_Jakobs_C::AnimGraphNode_Root_1AE2714C4978349F824753ACAE58D1C1' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, AnimGraphNode_Slot_34475B6D47701ECD7FD3FA858AE8EB5C) == 0x0004E0, "Member 'UBPAnim_PS_Jakobs_C::AnimGraphNode_Slot_34475B6D47701ECD7FD3FA858AE8EB5C' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, AnimGraphNode_Slot_4380062C48C733C6E38512BCFCDCD694) == 0x000590, "Member 'UBPAnim_PS_Jakobs_C::AnimGraphNode_Slot_4380062C48C733C6E38512BCFCDCD694' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, AnimGraphNode_LayeredBoneBlend_D3411DD5419680D9A83F82A49314DCCE) == 0x000640, "Member 'UBPAnim_PS_Jakobs_C::AnimGraphNode_LayeredBoneBlend_D3411DD5419680D9A83F82A49314DCCE' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, AnimGraphNode_Slot_50DA920748F4A3C435CA258B26FE5672) == 0x000760, "Member 'UBPAnim_PS_Jakobs_C::AnimGraphNode_Slot_50DA920748F4A3C435CA258B26FE5672' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, AnimGraphNode_Slot_151BC18947E58E4E58BB4CBBC70BBCB9) == 0x000810, "Member 'UBPAnim_PS_Jakobs_C::AnimGraphNode_Slot_151BC18947E58E4E58BB4CBBC70BBCB9' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, AnimGraphNode_SequenceEvaluator_746D18D34F67622E953A4BAB9167BAF0) == 0x0008C0, "Member 'UBPAnim_PS_Jakobs_C::AnimGraphNode_SequenceEvaluator_746D18D34F67622E953A4BAB9167BAF0' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, AnimGraphNode_SequenceEvaluator_CAE2CD864DAA422145C4EC83E60EE958) == 0x000940, "Member 'UBPAnim_PS_Jakobs_C::AnimGraphNode_SequenceEvaluator_CAE2CD864DAA422145C4EC83E60EE958' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_Jakobs_C, AnimGraphNode_SequenceEvaluator_ABACB6CF48D95558320649AB827FA574) == 0x0009C0, "Member 'UBPAnim_PS_Jakobs_C::AnimGraphNode_SequenceEvaluator_ABACB6CF48D95558320649AB827FA574' has a wrong offset!");

}

