#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_IronBear_BearFist

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPAnim_IronBear_BearFist.BPAnim_IronBear_BearFist_C.ExecuteUbergraph_BPAnim_IronBear_BearFist
// 0x0004 (0x0004 - 0x0000)
struct BPAnim_IronBear_BearFist_C_ExecuteUbergraph_BPAnim_IronBear_BearFist final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAnim_IronBear_BearFist_C_ExecuteUbergraph_BPAnim_IronBear_BearFist) == 0x000004, "Wrong alignment on BPAnim_IronBear_BearFist_C_ExecuteUbergraph_BPAnim_IronBear_BearFist");
static_assert(sizeof(BPAnim_IronBear_BearFist_C_ExecuteUbergraph_BPAnim_IronBear_BearFist) == 0x000004, "Wrong size on BPAnim_IronBear_BearFist_C_ExecuteUbergraph_BPAnim_IronBear_BearFist");
static_assert(offsetof(BPAnim_IronBear_BearFist_C_ExecuteUbergraph_BPAnim_IronBear_BearFist, EntryPoint) == 0x000000, "Member 'BPAnim_IronBear_BearFist_C_ExecuteUbergraph_BPAnim_IronBear_BearFist::EntryPoint' has a wrong offset!");

// Function BPAnim_IronBear_BearFist.BPAnim_IronBear_BearFist_C.GetHardpointMods
// 0x0010 (0x0010 - 0x0000)
struct BPAnim_IronBear_BearFist_C_GetHardpointMods final
{
public:
	class AOakWeapon_IronBearHardPoint*           Hardpoint;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMod_ReturnValue;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPAnim_IronBear_BearFist_C_GetHardpointMods) == 0x000008, "Wrong alignment on BPAnim_IronBear_BearFist_C_GetHardpointMods");
static_assert(sizeof(BPAnim_IronBear_BearFist_C_GetHardpointMods) == 0x000010, "Wrong size on BPAnim_IronBear_BearFist_C_GetHardpointMods");
static_assert(offsetof(BPAnim_IronBear_BearFist_C_GetHardpointMods, Hardpoint) == 0x000000, "Member 'BPAnim_IronBear_BearFist_C_GetHardpointMods::Hardpoint' has a wrong offset!");
static_assert(offsetof(BPAnim_IronBear_BearFist_C_GetHardpointMods, CallFunc_HasMod_ReturnValue) == 0x000008, "Member 'BPAnim_IronBear_BearFist_C_GetHardpointMods::CallFunc_HasMod_ReturnValue' has a wrong offset!");

}

