#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_PS_TED_Legs

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_PS_TED_Legs.BPAnim_PS_TED_Legs_C
// 0x0B50 (0x1640 - 0x0AF0)
class UBPAnim_PS_TED_Legs_C final : public UOakCharacterAnimInstance
{
public:
	uint8                                         Pad_AE8[0x8];                                      // 0x0AE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AF0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FF8556324C55EAA047EFE5AD0AB97FD7; // 0x0AF8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E42B0CAF4EFD295A94DD5D82616975EC; // 0x0B48(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3A73355847EF7B31FA972DA3E46D86D4; // 0x0B98(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8BF11D714755FD0B96E10182AA17015D; // 0x0BE8(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5131C524446B71C07F2FC4AC073D79F3; // 0x0C38(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_34E3C0654D90A343FAC1379D40BBDDEA; // 0x0D28(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_775735114E9AF1DFCC8A0E9E8CC519CB; // 0x0D70(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_613E0B494AE2BD8A09F1DEA8CE53E080; // 0x0ED0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8695DF394AFEF67DCF68E69D4D5D4DBD; // 0x0F18(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_FBD661EB4F7CAC036295F08402A8C40C; // 0x0F98(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_79192A064E293ECEC2ED909BBB6FF7CE; // 0x0FE0(0x0188)()
	uint8                                         Pad_1168[0x8];                                     // 0x1168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Slot                         AnimGraphNode_Slot_FA8D33F8499AE27A82F7CCA831163EA5; // 0x1170(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7F5DF62140A3069AE3C22983488D6227; // 0x1220(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_BC9E91F84BBDC824F18E98A2469796DB; // 0x12D0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F8FE7C5241A28939501E3997CA88BB9D; // 0x1318(0x0048)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_3FC0186F42CEB2275504BAAB5B57C1E6; // 0x1360(0x0290)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_35D146094494052DF3D83298E9C0BA94; // 0x15F0(0x0048)()
	class ABPChar_TedioreTurret_C*                Base_BPChar;                                       // 0x1638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_PS_TED_Legs_AnimGraphNode_BlendSpacePlayer_775735114E9AF1DFCC8A0E9E8CC519CB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_PS_TED_Legs_AnimGraphNode_TransitionResult_3A73355847EF7B31FA972DA3E46D86D4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_PS_TED_Legs_AnimGraphNode_LookAt_3FC0186F42CEB2275504BAAB5B57C1E6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_PS_TED_Legs_AnimGraphNode_TransitionResult_8BF11D714755FD0B96E10182AA17015D();
	void ExecuteUbergraph_BPAnim_PS_TED_Legs(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_PS_TED_Legs_AnimGraphNode_TransitionResult_FF8556324C55EAA047EFE5AD0AB97FD7();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAnim_PS_TED_Legs_C">();
	}
	static class UBPAnim_PS_TED_Legs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_PS_TED_Legs_C>();
	}
};
static_assert(alignof(UBPAnim_PS_TED_Legs_C) == 0x000010, "Wrong alignment on UBPAnim_PS_TED_Legs_C");
static_assert(sizeof(UBPAnim_PS_TED_Legs_C) == 0x001640, "Wrong size on UBPAnim_PS_TED_Legs_C");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, UberGraphFrame) == 0x000AF0, "Member 'UBPAnim_PS_TED_Legs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_TransitionResult_FF8556324C55EAA047EFE5AD0AB97FD7) == 0x000AF8, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_TransitionResult_FF8556324C55EAA047EFE5AD0AB97FD7' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_TransitionResult_E42B0CAF4EFD295A94DD5D82616975EC) == 0x000B48, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_TransitionResult_E42B0CAF4EFD295A94DD5D82616975EC' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_TransitionResult_3A73355847EF7B31FA972DA3E46D86D4) == 0x000B98, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_TransitionResult_3A73355847EF7B31FA972DA3E46D86D4' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_TransitionResult_8BF11D714755FD0B96E10182AA17015D) == 0x000BE8, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_TransitionResult_8BF11D714755FD0B96E10182AA17015D' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_SequencePlayer_5131C524446B71C07F2FC4AC073D79F3) == 0x000C38, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_SequencePlayer_5131C524446B71C07F2FC4AC073D79F3' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_StateResult_34E3C0654D90A343FAC1379D40BBDDEA) == 0x000D28, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_StateResult_34E3C0654D90A343FAC1379D40BBDDEA' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_BlendSpacePlayer_775735114E9AF1DFCC8A0E9E8CC519CB) == 0x000D70, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_BlendSpacePlayer_775735114E9AF1DFCC8A0E9E8CC519CB' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_StateResult_613E0B494AE2BD8A09F1DEA8CE53E080) == 0x000ED0, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_StateResult_613E0B494AE2BD8A09F1DEA8CE53E080' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_SequenceEvaluator_8695DF394AFEF67DCF68E69D4D5D4DBD) == 0x000F18, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_SequenceEvaluator_8695DF394AFEF67DCF68E69D4D5D4DBD' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_StateResult_FBD661EB4F7CAC036295F08402A8C40C) == 0x000F98, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_StateResult_FBD661EB4F7CAC036295F08402A8C40C' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_StateMachine_79192A064E293ECEC2ED909BBB6FF7CE) == 0x000FE0, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_StateMachine_79192A064E293ECEC2ED909BBB6FF7CE' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_Slot_FA8D33F8499AE27A82F7CCA831163EA5) == 0x001170, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_Slot_FA8D33F8499AE27A82F7CCA831163EA5' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_Slot_7F5DF62140A3069AE3C22983488D6227) == 0x001220, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_Slot_7F5DF62140A3069AE3C22983488D6227' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_Root_BC9E91F84BBDC824F18E98A2469796DB) == 0x0012D0, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_Root_BC9E91F84BBDC824F18E98A2469796DB' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_LocalToComponentSpace_F8FE7C5241A28939501E3997CA88BB9D) == 0x001318, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_LocalToComponentSpace_F8FE7C5241A28939501E3997CA88BB9D' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_LookAt_3FC0186F42CEB2275504BAAB5B57C1E6) == 0x001360, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_LookAt_3FC0186F42CEB2275504BAAB5B57C1E6' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, AnimGraphNode_ComponentToLocalSpace_35D146094494052DF3D83298E9C0BA94) == 0x0015F0, "Member 'UBPAnim_PS_TED_Legs_C::AnimGraphNode_ComponentToLocalSpace_35D146094494052DF3D83298E9C0BA94' has a wrong offset!");
static_assert(offsetof(UBPAnim_PS_TED_Legs_C, Base_BPChar) == 0x001638, "Member 'UBPAnim_PS_TED_Legs_C::Base_BPChar' has a wrong offset!");

}

