#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_IronBear_GrenadeLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_IronBear_GrenadeLauncher.BPAnim_IronBear_GrenadeLauncher_C
// 0x0140 (0x0580 - 0x0440)
class UBPAnim_IronBear_GrenadeLauncher_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_0A624C3C4AD5EEE2D072178E630B68DC; // 0x0448(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_86B864FE4000DA0CD177B48E9BCEAD87; // 0x0490(0x00B0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_D9A6C7AA409FF9C00432D29471CECB16; // 0x0540(0x0038)()

public:
	void ExecuteUbergraph_BPAnim_IronBear_GrenadeLauncher(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAnim_IronBear_GrenadeLauncher_C">();
	}
	static class UBPAnim_IronBear_GrenadeLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_IronBear_GrenadeLauncher_C>();
	}
};
static_assert(alignof(UBPAnim_IronBear_GrenadeLauncher_C) == 0x000010, "Wrong alignment on UBPAnim_IronBear_GrenadeLauncher_C");
static_assert(sizeof(UBPAnim_IronBear_GrenadeLauncher_C) == 0x000580, "Wrong size on UBPAnim_IronBear_GrenadeLauncher_C");
static_assert(offsetof(UBPAnim_IronBear_GrenadeLauncher_C, UberGraphFrame) == 0x000440, "Member 'UBPAnim_IronBear_GrenadeLauncher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPAnim_IronBear_GrenadeLauncher_C, AnimGraphNode_Root_0A624C3C4AD5EEE2D072178E630B68DC) == 0x000448, "Member 'UBPAnim_IronBear_GrenadeLauncher_C::AnimGraphNode_Root_0A624C3C4AD5EEE2D072178E630B68DC' has a wrong offset!");
static_assert(offsetof(UBPAnim_IronBear_GrenadeLauncher_C, AnimGraphNode_Slot_86B864FE4000DA0CD177B48E9BCEAD87) == 0x000490, "Member 'UBPAnim_IronBear_GrenadeLauncher_C::AnimGraphNode_Slot_86B864FE4000DA0CD177B48E9BCEAD87' has a wrong offset!");
static_assert(offsetof(UBPAnim_IronBear_GrenadeLauncher_C, AnimGraphNode_LocalRefPose_D9A6C7AA409FF9C00432D29471CECB16) == 0x000540, "Member 'UBPAnim_IronBear_GrenadeLauncher_C::AnimGraphNode_LocalRefPose_D9A6C7AA409FF9C00432D29471CECB16' has a wrong offset!");

}

