#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_AR_JAK

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_AR_JAK.BPAnim_AR_JAK_C
// 0x0950 (0x0DE0 - 0x0490)
class UBPAnim_AR_JAK_C final : public UOakWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_65D61765405514CFD4DE61A728DA65B5; // 0x0498(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_AFDAA879489D75587CCA90B9D095A6EC; // 0x04E0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1FFC08D54788B5207EA3AAB4D511C509; // 0x0590(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_D774ABD644B43591C11A7597402BFBD8; // 0x0640(0x0120)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_0CB23B1B4A1E02A2FB4E059EF87A23C5; // 0x0760(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_A3315CEB48B079F1D04B42A22A6E05B3; // 0x07E0(0x00B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_B23BAB3F4420E8E52A34939016E61FF4; // 0x0890(0x0080)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_ECA38BFD43AF093E08D8BBA91F9454CF; // 0x0910(0x0168)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1FD2F75841D91445643045A38773FE25; // 0x0A78(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_613EC15D49888B7414BA309F4687CD9E; // 0x0AF8(0x00D0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_86551BF64175C7499DE100A18AED4CF7; // 0x0BC8(0x0048)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_92BBC3264C1309D8B50075830DCDE378; // 0x0C10(0x0178)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27DCB5D5456854616C410CB4A45E7B9B; // 0x0D88(0x0048)()
	bool                                          bIsCrankGrip;                                      // 0x0DD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPAnim_AR_JAK(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_AR_JAK_AnimGraphNode_BlendListByBool_613EC15D49888B7414BA309F4687CD9E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_AR_JAK_AnimGraphNode_SequenceEvaluator_1FD2F75841D91445643045A38773FE25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_AR_JAK_AnimGraphNode_SequenceEvaluator_B23BAB3F4420E8E52A34939016E61FF4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAnim_AR_JAK_C">();
	}
	static class UBPAnim_AR_JAK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_AR_JAK_C>();
	}
};
static_assert(alignof(UBPAnim_AR_JAK_C) == 0x000010, "Wrong alignment on UBPAnim_AR_JAK_C");
static_assert(sizeof(UBPAnim_AR_JAK_C) == 0x000DE0, "Wrong size on UBPAnim_AR_JAK_C");
static_assert(offsetof(UBPAnim_AR_JAK_C, UberGraphFrame) == 0x000490, "Member 'UBPAnim_AR_JAK_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_Root_65D61765405514CFD4DE61A728DA65B5) == 0x000498, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_Root_65D61765405514CFD4DE61A728DA65B5' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_Slot_AFDAA879489D75587CCA90B9D095A6EC) == 0x0004E0, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_Slot_AFDAA879489D75587CCA90B9D095A6EC' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_Slot_1FFC08D54788B5207EA3AAB4D511C509) == 0x000590, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_Slot_1FFC08D54788B5207EA3AAB4D511C509' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_LayeredBoneBlend_D774ABD644B43591C11A7597402BFBD8) == 0x000640, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_LayeredBoneBlend_D774ABD644B43591C11A7597402BFBD8' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_SequenceEvaluator_0CB23B1B4A1E02A2FB4E059EF87A23C5) == 0x000760, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_SequenceEvaluator_0CB23B1B4A1E02A2FB4E059EF87A23C5' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_Slot_A3315CEB48B079F1D04B42A22A6E05B3) == 0x0007E0, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_Slot_A3315CEB48B079F1D04B42A22A6E05B3' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_SequenceEvaluator_B23BAB3F4420E8E52A34939016E61FF4) == 0x000890, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_SequenceEvaluator_B23BAB3F4420E8E52A34939016E61FF4' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_BlendSpaceEvaluator_ECA38BFD43AF093E08D8BBA91F9454CF) == 0x000910, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_BlendSpaceEvaluator_ECA38BFD43AF093E08D8BBA91F9454CF' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_SequenceEvaluator_1FD2F75841D91445643045A38773FE25) == 0x000A78, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_SequenceEvaluator_1FD2F75841D91445643045A38773FE25' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_BlendListByBool_613EC15D49888B7414BA309F4687CD9E) == 0x000AF8, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_BlendListByBool_613EC15D49888B7414BA309F4687CD9E' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_LocalToComponentSpace_86551BF64175C7499DE100A18AED4CF7) == 0x000BC8, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_LocalToComponentSpace_86551BF64175C7499DE100A18AED4CF7' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_CopyBone_92BBC3264C1309D8B50075830DCDE378) == 0x000C10, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_CopyBone_92BBC3264C1309D8B50075830DCDE378' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, AnimGraphNode_ComponentToLocalSpace_27DCB5D5456854616C410CB4A45E7B9B) == 0x000D88, "Member 'UBPAnim_AR_JAK_C::AnimGraphNode_ComponentToLocalSpace_27DCB5D5456854616C410CB4A45E7B9B' has a wrong offset!");
static_assert(offsetof(UBPAnim_AR_JAK_C, bIsCrankGrip) == 0x000DD0, "Member 'UBPAnim_AR_JAK_C::bIsCrankGrip' has a wrong offset!");

}

