#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_CineOnly_GenericNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_CineOnly_GenericNPC.BPAnim_CineOnly_GenericNPC_C
// 0x0CE0 (0x1120 - 0x0440)
class UBPAnim_CineOnly_GenericNPC_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F55CF26B44AED9A041EDACB812C8586F; // 0x0448(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C2BBEB414C0557E4B126B08D84BE6697; // 0x0490(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_A27714034958365CF4A7E38B7BC40E43; // 0x0540(0x0048)()
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_C08AEB3F44A0DE67551198A8E0B09CEC; // 0x0590(0x0290)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_799D2BA84B582D15E075B8A06B012061; // 0x0820(0x0048)()
	uint8                                         Pad_868[0x8];                                      // 0x0868(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Slot                         AnimGraphNode_Slot_92C1DF8D4106747BD03185AF70E2628F; // 0x0870(0x00B0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_BDF41AA3419892AF6C2367B4900FDDF8; // 0x0920(0x0038)()
	uint8                                         Pad_958[0x8];                                      // 0x0958(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_764DD3EE4BC0DFE4D664F091D8B63603; // 0x0960(0x0290)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_6C83691946947CF5D67DB1B56B52F317; // 0x0BF0(0x0290)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_266F598C4678BC228AC607A993AE1054; // 0x0E80(0x0290)()
	float                                         HandIKOverride;                                    // 0x1110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootIKOverride;                                    // 0x1114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPAnim_CineOnly_GenericNPC(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_CineOnly_GenericNPC_AnimGraphNode_TwoBoneIK_C08AEB3F44A0DE67551198A8E0B09CEC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_CineOnly_GenericNPC_AnimGraphNode_TwoBoneIK_764DD3EE4BC0DFE4D664F091D8B63603();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_CineOnly_GenericNPC_AnimGraphNode_TwoBoneIK_6C83691946947CF5D67DB1B56B52F317();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_CineOnly_GenericNPC_AnimGraphNode_TwoBoneIK_266F598C4678BC228AC607A993AE1054();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAnim_CineOnly_GenericNPC_C">();
	}
	static class UBPAnim_CineOnly_GenericNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_CineOnly_GenericNPC_C>();
	}
};
static_assert(alignof(UBPAnim_CineOnly_GenericNPC_C) == 0x000010, "Wrong alignment on UBPAnim_CineOnly_GenericNPC_C");
static_assert(sizeof(UBPAnim_CineOnly_GenericNPC_C) == 0x001120, "Wrong size on UBPAnim_CineOnly_GenericNPC_C");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, UberGraphFrame) == 0x000440, "Member 'UBPAnim_CineOnly_GenericNPC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_Root_F55CF26B44AED9A041EDACB812C8586F) == 0x000448, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_Root_F55CF26B44AED9A041EDACB812C8586F' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_Slot_C2BBEB414C0557E4B126B08D84BE6697) == 0x000490, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_Slot_C2BBEB414C0557E4B126B08D84BE6697' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_LocalToComponentSpace_A27714034958365CF4A7E38B7BC40E43) == 0x000540, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_LocalToComponentSpace_A27714034958365CF4A7E38B7BC40E43' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_TwoBoneIK_C08AEB3F44A0DE67551198A8E0B09CEC) == 0x000590, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_TwoBoneIK_C08AEB3F44A0DE67551198A8E0B09CEC' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_ComponentToLocalSpace_799D2BA84B582D15E075B8A06B012061) == 0x000820, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_ComponentToLocalSpace_799D2BA84B582D15E075B8A06B012061' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_Slot_92C1DF8D4106747BD03185AF70E2628F) == 0x000870, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_Slot_92C1DF8D4106747BD03185AF70E2628F' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_LocalRefPose_BDF41AA3419892AF6C2367B4900FDDF8) == 0x000920, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_LocalRefPose_BDF41AA3419892AF6C2367B4900FDDF8' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_TwoBoneIK_764DD3EE4BC0DFE4D664F091D8B63603) == 0x000960, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_TwoBoneIK_764DD3EE4BC0DFE4D664F091D8B63603' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_TwoBoneIK_6C83691946947CF5D67DB1B56B52F317) == 0x000BF0, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_TwoBoneIK_6C83691946947CF5D67DB1B56B52F317' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, AnimGraphNode_TwoBoneIK_266F598C4678BC228AC607A993AE1054) == 0x000E80, "Member 'UBPAnim_CineOnly_GenericNPC_C::AnimGraphNode_TwoBoneIK_266F598C4678BC228AC607A993AE1054' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, HandIKOverride) == 0x001110, "Member 'UBPAnim_CineOnly_GenericNPC_C::HandIKOverride' has a wrong offset!");
static_assert(offsetof(UBPAnim_CineOnly_GenericNPC_C, FootIKOverride) == 0x001114, "Member 'UBPAnim_CineOnly_GenericNPC_C::FootIKOverride' has a wrong offset!");

}

