#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Maurice_0

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAnimRuntime_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GbxAnimRuntimeBase_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Maurice.BPAnim_Maurice_C
// 0x3D50 (0x4840 - 0x0AF0)
class BPAnim_Maurice_0::UBPAnim_Maurice_C final : public UOakCharacterAnimInstance
{
public:
	uint8                                         Pad_AE8[0x8];                                      // 0x0AE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AF0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_73E22C4D4D336959829CE0B66AB9F1F4; // 0x0AF8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1F5F36E64F38E41052C17BA7E4B85F71; // 0x0B40(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_572F045B42FD389739258ABAEF8C78A4; // 0x0BF0(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_241A75F8479951745549568F44A1BFE1; // 0x0CA0(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_849649494545EB1E8CA6AEA26815B364; // 0x0D80(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_D72AB8904E5CDC34761A96A878AAD0F1; // 0x0EA0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2D4BAC864D09DCBBAE2A639EEA71A686; // 0x0EF0(0x0050)()
	struct FGbxAnimNode_LegIK                     GbxAnimGraphNode_LegIK_861B5C0741C1AA782573D3A4F7008051; // 0x0F40(0x08B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_967A7D094E7C2BE3E6E070AFA543C531; // 0x17F0(0x0048)()
	struct FGbxAnimNode_ApplyBoneModifyProfile    GbxAnimGraphNode_ApplyBoneModifyProfile_C75606714E795EA0AD2E9EA53BC51D1D; // 0x1838(0x0180)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_53D8246A4C233EA498C1DE8CC138878F; // 0x19B8(0x0238)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_D9AACE72400D52E818B859AB65C32D00; // 0x1BF0(0x0120)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_E43D215C470A7D48FDD4199CFD932D90; // 0x1D10(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_EDBF5E984F3479A5BE116A9486D665AB; // 0x1DF0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_84790BBA4FAB00A4A89615B38B79B384; // 0x1ED0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_BF08731046C1136D63C96BBC4484820C; // 0x1F20(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_B01E803C40A1D33A9483F1A375DA8C11; // 0x1F70(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_A02B09964CD1705D8448C8849155412E; // 0x2050(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B596FFE446C708699F5D83A300DA2691; // 0x2100(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_C08FC77C4DB0FA9D037C0CAEE52C0D7D; // 0x2150(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E641277B4094F25A9E7B209F30FF6D92; // 0x2270(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BB48CDEB45B7286D17BD388CEEFD7277; // 0x22C0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73E8F3CB445E406DBB2960A40CF06DE3; // 0x2310(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_664D651347869C25198E1C85F6913B96; // 0x2360(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8D8557AF41876AB95D7E79A805742C3A; // 0x23B0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7B579306418B7C99FB51A69E00A11F89; // 0x2400(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A0D0A10E4A6C4F37E3F2A781490E6E88; // 0x2450(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EB4C6AE646A1EAD6440D5B985B0CBB40; // 0x24A0(0x0050)()
	struct FGbxAnimNode_AnimTable                 GbxAnimGraphNode_AnimTable_E1BE1E0E4A16E32F91DD3BB4C3A4E694; // 0x24F0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_AECAB5124AD0834029534980D784B507; // 0x2578(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A7900C6943D5299695A06E8207F94C1A; // 0x25C0(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_CB871FCE48A616DE787F489FA97D88D5; // 0x2720(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5382162540492B600C08C296CA3DC2C5; // 0x2768(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_98C259784696B2BA05931AAE636EDCA1; // 0x2858(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_86AD14C644C33B83E4F640B6587909FB; // 0x28A0(0x0160)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9172FC5449988CA44338CBA36238EF9B; // 0x2A00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_913BF182481D03E598C3179D35AEFD79; // 0x2A48(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_1676458E4E049A481B4125BF5A9EE9B0; // 0x2B38(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_EDB9FC8742405312EEB03EA42E206E10; // 0x2B80(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_1CC1BE6A490E6B22318527AE48EB6912; // 0x2D08(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E1929A0B49DC150D4A2263BC0CEEF643; // 0x2D50(0x0188)()
	uint8                                         Pad_2ED8[0x8];                                     // 0x2ED8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAnimNode_ForwardDynamics           GbxAnimGraphNode_ForwardDynamics_C055EC4E4E82F2AD23735ABE48AFC562; // 0x2EE0(0x0730)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2969B4C44A11B505E44993AAA1E48A56; // 0x3610(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_57A1AAB1483EBA446489648E72DB63B4; // 0x3658(0x0120)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_252316C94D093D39F4739C8F9F612A5F; // 0x3778(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F6CD37DC4CBBBF1F8DB2ECAAC0B0BC5B; // 0x37C8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3CABAC0B4ACB4966FDEDF59AD6011078; // 0x3818(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9413DE6A44617DBCE7EA098B22655586; // 0x3868(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A4F756594A93687F10AD699769302B40; // 0x38B8(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9B660C2D4A3242F1F6E67499F75E4814; // 0x3908(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6E7CDC5840B75D237E4CDAB76F431916; // 0x3958(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_648881104720EBF68D0EC3BDA2CE34BB; // 0x39A8(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1C1A1904449F75EB73D803B80EB9E231; // 0x39F8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_BD7BFCB64FC6A6C4BF18A59F0B5D546A; // 0x3AE8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9832EBA34E0C8C64ED63379DDB86E278; // 0x3B30(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3D325A2547EEEC11F92938BD55DC0EF1; // 0x3C20(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_D66D676742AFEF7E585F268EC7075973; // 0x3C68(0x0050)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_147CFE08409D09B764B750B1297914A3; // 0x3CB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EA2BCD79450EFCBC50D416A843B6DF12; // 0x3D00(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_31E01930472E373DBBAEA5B69F7F75A4; // 0x3DF0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0DFCD8E246356EAAE5818094BF41C741; // 0x3E38(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_B3B162A74BD3FDBCD4A82F9E5539D6C2; // 0x3F28(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_583DCE764A46E7CA1CDFF98832366A23; // 0x3F70(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D000374343A2CA4FBD9B44A26B23BA97; // 0x4060(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_98BECD494BBFBC135C4B7BB1BFF5F78B; // 0x40A8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_EBDFEAEE427C29C99468D48E7A2CABAF; // 0x4198(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_EF7108A8403971BF5ACB6E8711F089EE; // 0x41E0(0x0188)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_83FDA69A4AD45B3BAC7E72A4F88DCA59; // 0x4368(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F2F6581C42044723CD4869BAA6FBB3D9; // 0x4448(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_AB6FE95D49B86754D097A79B60C9C677; // 0x4498(0x0050)()
	uint8                                         Pad_44E8[0x8];                                     // 0x44E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAnimNode_LookAt                    GbxAnimGraphNode_LookAt_3ACE04E643183D826EB09FB07DC39C15; // 0x44F0(0x02D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8D88FCD54CEA621D6312C9B152802037; // 0x47C0(0x0050)()
	class UGbxCharacterMovementComponent*         GBX_Move_Comp;                                     // 0x4810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakCharacterMovementComponent*         OAK_Move_Comp;                                     // 0x4818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Combat;                                            // 0x4820(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Passive;                                           // 0x4821(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Give;                                              // 0x4822(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Take;                                              // 0x4823(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4824[0x4];                                     // 0x4824(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          Character;                                         // 0x4828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxCharacterMovementComponent*         GbxMoveComp;                                       // 0x4830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakCharacterMovementComponent*         OakMoveComp;                                       // 0x4838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStanceChanged();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Maurice_GbxAnimGraphNode_LookAt_3ACE04E643183D826EB09FB07DC39C15();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Maurice_GbxAnimGraphNode_ForwardDynamics_C055EC4E4E82F2AD23735ABE48AFC562();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Maurice_AnimGraphNode_TwoWayBlend_57A1AAB1483EBA446489648E72DB63B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Maurice_AnimGraphNode_TransitionResult_A4F756594A93687F10AD699769302B40();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Maurice_AnimGraphNode_TransitionResult_A0D0A10E4A6C4F37E3F2A781490E6E88();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Maurice_AnimGraphNode_TransitionResult_9413DE6A44617DBCE7EA098B22655586();
