#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_NonPlayerCharacter

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "GbxInventory_structs.hpp"
#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.NPCEngageRange
// 0x0018 (0x0018 - 0x0000)
struct BPChar_NonPlayerCharacter_C_NPCEngageRange final
{
public:
	float                                         UnitIn;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_NPCEngageRange) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_NPCEngageRange");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_NPCEngageRange) == 0x000018, "Wrong size on BPChar_NonPlayerCharacter_C_NPCEngageRange");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCEngageRange, UnitIn) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_NPCEngageRange::UnitIn' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCEngageRange, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000008, "Member 'BPChar_NonPlayerCharacter_C_NPCEngageRange::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCEngageRange, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'BPChar_NonPlayerCharacter_C_NPCEngageRange::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.NPCIgnoreEnemies
// 0x0018 (0x0018 - 0x0000)
struct BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies final
{
public:
	bool                                          BoolValue;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies) == 0x000018, "Wrong size on BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies, BoolValue) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies::BoolValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000008, "Member 'BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'BPChar_NonPlayerCharacter_C_NPCIgnoreEnemies::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.NPCUseSmartObjects
// 0x0018 (0x0018 - 0x0000)
struct BPChar_NonPlayerCharacter_C_NPCUseSmartObjects final
{
public:
	bool                                          UseSmartObjects;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_NPCUseSmartObjects) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_NPCUseSmartObjects");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_NPCUseSmartObjects) == 0x000018, "Wrong size on BPChar_NonPlayerCharacter_C_NPCUseSmartObjects");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCUseSmartObjects, UseSmartObjects) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_NPCUseSmartObjects::UseSmartObjects' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCUseSmartObjects, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'BPChar_NonPlayerCharacter_C_NPCUseSmartObjects::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCUseSmartObjects, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000010, "Member 'BPChar_NonPlayerCharacter_C_NPCUseSmartObjects::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.NPCCanPatrol
// 0x0018 (0x0018 - 0x0000)
struct BPChar_NonPlayerCharacter_C_NPCCanPatrol final
{
public:
	bool                                          CanPatrol;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_NPCCanPatrol) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_NPCCanPatrol");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_NPCCanPatrol) == 0x000018, "Wrong size on BPChar_NonPlayerCharacter_C_NPCCanPatrol");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCCanPatrol, CanPatrol) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_NPCCanPatrol::CanPatrol' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCCanPatrol, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000008, "Member 'BPChar_NonPlayerCharacter_C_NPCCanPatrol::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCCanPatrol, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'BPChar_NonPlayerCharacter_C_NPCCanPatrol::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.NPCEngagePlayerWhenIdle
// 0x0018 (0x0018 - 0x0000)
struct BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle final
{
public:
	bool                                          LookAtPlayer;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle) == 0x000018, "Wrong size on BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle, LookAtPlayer) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle::LookAtPlayer' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000008, "Member 'BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'BPChar_NonPlayerCharacter_C_NPCEngagePlayerWhenIdle::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.NPCEngageInCombat
// 0x0018 (0x0018 - 0x0000)
struct BPChar_NonPlayerCharacter_C_NPCEngageInCombat final
{
public:
	bool                                          EngageInCombat;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_NPCEngageInCombat) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_NPCEngageInCombat");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_NPCEngageInCombat) == 0x000018, "Wrong size on BPChar_NonPlayerCharacter_C_NPCEngageInCombat");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCEngageInCombat, EngageInCombat) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_NPCEngageInCombat::EngageInCombat' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCEngageInCombat, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'BPChar_NonPlayerCharacter_C_NPCEngageInCombat::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCEngageInCombat, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000010, "Member 'BPChar_NonPlayerCharacter_C_NPCEngageInCombat::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.ChangeBehaviorTree_LookAt
// 0x0010 (0x0010 - 0x0000)
struct BPChar_NonPlayerCharacter_C_ChangeBehaviorTree_LookAt final
{
public:
	class AAIController*                          NPC_AIController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_ChangeBehaviorTree_LookAt) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_ChangeBehaviorTree_LookAt");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_ChangeBehaviorTree_LookAt) == 0x000010, "Wrong size on BPChar_NonPlayerCharacter_C_ChangeBehaviorTree_LookAt");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_ChangeBehaviorTree_LookAt, NPC_AIController) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_ChangeBehaviorTree_LookAt::NPC_AIController' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_ChangeBehaviorTree_LookAt, Enable) == 0x000008, "Member 'BPChar_NonPlayerCharacter_C_ChangeBehaviorTree_LookAt::Enable' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.PlayerUsedMe
// 0x0250 (0x0250 - 0x0000)
struct BPChar_NonPlayerCharacter_C_PlayerUsedMe final
{
public:
	struct FUseEvent                              UseEvent;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0018(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0230(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_PlayerUsedMe) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_PlayerUsedMe");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_PlayerUsedMe) == 0x000250, "Wrong size on BPChar_NonPlayerCharacter_C_PlayerUsedMe");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_PlayerUsedMe, UseEvent) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_PlayerUsedMe::UseEvent' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_PlayerUsedMe, CallFunc_NewDialogContext_ReturnValue) == 0x000018, "Member 'BPChar_NonPlayerCharacter_C_PlayerUsedMe::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_PlayerUsedMe, CallFunc_FinishSpeak_Conversation) == 0x000230, "Member 'BPChar_NonPlayerCharacter_C_PlayerUsedMe::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_PlayerUsedMe, CallFunc_FinishSpeak_SequenceID) == 0x00023C, "Member 'BPChar_NonPlayerCharacter_C_PlayerUsedMe::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_PlayerUsedMe, CallFunc_FinishSpeak_ReturnValue) == 0x000240, "Member 'BPChar_NonPlayerCharacter_C_PlayerUsedMe::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_PlayerUsedMe, CallFunc_Array_Length_ReturnValue) == 0x000244, "Member 'BPChar_NonPlayerCharacter_C_PlayerUsedMe::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_PlayerUsedMe, CallFunc_Greater_IntInt_ReturnValue) == 0x000248, "Member 'BPChar_NonPlayerCharacter_C_PlayerUsedMe::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.ClearText
// 0x0018 (0x0018 - 0x0000)
struct BPChar_NonPlayerCharacter_C_ClearText final
{
public:
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0000(0x0018)()
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_ClearText) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_ClearText");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_ClearText) == 0x000018, "Wrong size on BPChar_NonPlayerCharacter_C_ClearText");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_ClearText, CallFunc_Conv_StringToText_ReturnValue) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_ClearText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.SetText
// 0x0090 (0x0090 - 0x0000)
struct BPChar_NonPlayerCharacter_C_SetText final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         TextSize_0;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor_0;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FacePlayer_0;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ColorToText_ReturnValue;             // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0068(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue1;       // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0070(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue1;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_SetText) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_SetText");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_SetText) == 0x000090, "Wrong size on BPChar_NonPlayerCharacter_C_SetText");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, Text_0) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_SetText::Text_0' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, TextSize_0) == 0x000018, "Member 'BPChar_NonPlayerCharacter_C_SetText::TextSize_0' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, Duration) == 0x00001C, "Member 'BPChar_NonPlayerCharacter_C_SetText::Duration' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, TextColor_0) == 0x000020, "Member 'BPChar_NonPlayerCharacter_C_SetText::TextColor_0' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, FacePlayer_0) == 0x000030, "Member 'BPChar_NonPlayerCharacter_C_SetText::FacePlayer_0' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, CallFunc_Conv_ColorToText_ReturnValue) == 0x000038, "Member 'BPChar_NonPlayerCharacter_C_SetText::CallFunc_Conv_ColorToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'BPChar_NonPlayerCharacter_C_SetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x000068, "Member 'BPChar_NonPlayerCharacter_C_SetText::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, CallFunc_EqualEqual_TextText_ReturnValue) == 0x00006C, "Member 'BPChar_NonPlayerCharacter_C_SetText::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00006D, "Member 'BPChar_NonPlayerCharacter_C_SetText::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, CallFunc_EqualEqual_FloatFloat_ReturnValue1) == 0x00006E, "Member 'BPChar_NonPlayerCharacter_C_SetText::CallFunc_EqualEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, CallFunc_GetEmptyText_ReturnValue) == 0x000070, "Member 'BPChar_NonPlayerCharacter_C_SetText::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetText, CallFunc_EqualEqual_TextText_ReturnValue1) == 0x000088, "Member 'BPChar_NonPlayerCharacter_C_SetText::CallFunc_EqualEqual_TextText_ReturnValue1' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.GbxAsyncRequest_PickupSpawned_57F45FEF4D675ABCF62E0A81821A5187
// 0x0008 (0x0008 - 0x0000)
struct BPChar_NonPlayerCharacter_C_GbxAsyncRequest_PickupSpawned_57F45FEF4D675ABCF62E0A81821A5187 final
{
public:
	class ADroppedInventoryItemPickup*            Pickup;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_GbxAsyncRequest_PickupSpawned_57F45FEF4D675ABCF62E0A81821A5187) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_GbxAsyncRequest_PickupSpawned_57F45FEF4D675ABCF62E0A81821A5187");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_GbxAsyncRequest_PickupSpawned_57F45FEF4D675ABCF62E0A81821A5187) == 0x000008, "Wrong size on BPChar_NonPlayerCharacter_C_GbxAsyncRequest_PickupSpawned_57F45FEF4D675ABCF62E0A81821A5187");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_GbxAsyncRequest_PickupSpawned_57F45FEF4D675ABCF62E0A81821A5187, Pickup) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_GbxAsyncRequest_PickupSpawned_57F45FEF4D675ABCF62E0A81821A5187::Pickup' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.BeingUsed
// 0x0018 (0x0018 - 0x0000)
struct BPChar_NonPlayerCharacter_C_BeingUsed final
{
public:
	struct FUseEvent                              UseEvent;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_BeingUsed) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_BeingUsed");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_BeingUsed) == 0x000018, "Wrong size on BPChar_NonPlayerCharacter_C_BeingUsed");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_BeingUsed, UseEvent) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_BeingUsed::UseEvent' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.LootableTaken
// 0x0008 (0x0008 - 0x0000)
struct BPChar_NonPlayerCharacter_C_LootableTaken final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_LootableTaken) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_LootableTaken");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_LootableTaken) == 0x000008, "Wrong size on BPChar_NonPlayerCharacter_C_LootableTaken");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_LootableTaken, DestroyedActor) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_LootableTaken::DestroyedActor' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.EngageInCombat
// 0x0001 (0x0001 - 0x0000)
struct BPChar_NonPlayerCharacter_C_EngageInCombat final
{
public:
	bool                                          EngageInCombat_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_EngageInCombat) == 0x000001, "Wrong alignment on BPChar_NonPlayerCharacter_C_EngageInCombat");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_EngageInCombat) == 0x000001, "Wrong size on BPChar_NonPlayerCharacter_C_EngageInCombat");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_EngageInCombat, EngageInCombat_0) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_EngageInCombat::EngageInCombat_0' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.CanPatrol
// 0x0001 (0x0001 - 0x0000)
struct BPChar_NonPlayerCharacter_C_CanPatrol final
{
public:
	bool                                          CanPatrol_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_CanPatrol) == 0x000001, "Wrong alignment on BPChar_NonPlayerCharacter_C_CanPatrol");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_CanPatrol) == 0x000001, "Wrong size on BPChar_NonPlayerCharacter_C_CanPatrol");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_CanPatrol, CanPatrol_0) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_CanPatrol::CanPatrol_0' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.UseSmartObjects
// 0x0001 (0x0001 - 0x0000)
struct BPChar_NonPlayerCharacter_C_UseSmartObjects final
{
public:
	bool                                          UseSmartObjects_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_UseSmartObjects) == 0x000001, "Wrong alignment on BPChar_NonPlayerCharacter_C_UseSmartObjects");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_UseSmartObjects) == 0x000001, "Wrong size on BPChar_NonPlayerCharacter_C_UseSmartObjects");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_UseSmartObjects, UseSmartObjects_0) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_UseSmartObjects::UseSmartObjects_0' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.ThingToHold
// 0x00D0 (0x00D0 - 0x0000)
struct BPChar_NonPlayerCharacter_C_ThingToHold final
{
public:
	class UStaticMesh*                            TheThingToHold;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemPoolInfo                          ThePickupToHold;                                   // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FTransform                             OffsetTransform;                                   // 0x0090(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         PutAwayOffset;                                     // 0x00C0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TakeOutOffset;                                     // 0x00C4(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseAltAnimation;                                   // 0x00C8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_ThingToHold) == 0x000010, "Wrong alignment on BPChar_NonPlayerCharacter_C_ThingToHold");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_ThingToHold) == 0x0000D0, "Wrong size on BPChar_NonPlayerCharacter_C_ThingToHold");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_ThingToHold, TheThingToHold) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_ThingToHold::TheThingToHold' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_ThingToHold, ThePickupToHold) == 0x000008, "Member 'BPChar_NonPlayerCharacter_C_ThingToHold::ThePickupToHold' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_ThingToHold, OffsetTransform) == 0x000090, "Member 'BPChar_NonPlayerCharacter_C_ThingToHold::OffsetTransform' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_ThingToHold, PutAwayOffset) == 0x0000C0, "Member 'BPChar_NonPlayerCharacter_C_ThingToHold::PutAwayOffset' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_ThingToHold, TakeOutOffset) == 0x0000C4, "Member 'BPChar_NonPlayerCharacter_C_ThingToHold::TakeOutOffset' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_ThingToHold, UseAltAnimation) == 0x0000C8, "Member 'BPChar_NonPlayerCharacter_C_ThingToHold::UseAltAnimation' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.IgnoreEnemies
// 0x0001 (0x0001 - 0x0000)
struct BPChar_NonPlayerCharacter_C_IgnoreEnemies final
{
public:
	bool                                          IgnoreEnemies_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_IgnoreEnemies) == 0x000001, "Wrong alignment on BPChar_NonPlayerCharacter_C_IgnoreEnemies");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_IgnoreEnemies) == 0x000001, "Wrong size on BPChar_NonPlayerCharacter_C_IgnoreEnemies");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_IgnoreEnemies, IgnoreEnemies_0) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_IgnoreEnemies::IgnoreEnemies_0' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.NPCCanReviveOthers
// 0x0001 (0x0001 - 0x0000)
struct BPChar_NonPlayerCharacter_C_NPCCanReviveOthers final
{
public:
	bool                                          CanReviveOthers_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_NPCCanReviveOthers) == 0x000001, "Wrong alignment on BPChar_NonPlayerCharacter_C_NPCCanReviveOthers");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_NPCCanReviveOthers) == 0x000001, "Wrong size on BPChar_NonPlayerCharacter_C_NPCCanReviveOthers");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_NPCCanReviveOthers, CanReviveOthers_0) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_NPCCanReviveOthers::CanReviveOthers_0' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.BndEvt__Stance_K2Node_ComponentBoundEvent_0_StanceChangedEvent__DelegateSignature_BPChar_NonPlayerCharacter
// 0x0030 (0x0030 - 0x0000)
struct BPChar_NonPlayerCharacter_C_BndEvt__Stance_K2Node_ComponentBoundEvent_0_StanceChangedEvent__DelegateSignature_BPChar_NonPlayerCharacter final
{
public:
	struct FStanceChangedEventArgs                Args;                                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_BndEvt__Stance_K2Node_ComponentBoundEvent_0_StanceChangedEvent__DelegateSignature_BPChar_NonPlayerCharacter) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_BndEvt__Stance_K2Node_ComponentBoundEvent_0_StanceChangedEvent__DelegateSignature_BPChar_NonPlayerCharacter");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_BndEvt__Stance_K2Node_ComponentBoundEvent_0_StanceChangedEvent__DelegateSignature_BPChar_NonPlayerCharacter) == 0x000030, "Wrong size on BPChar_NonPlayerCharacter_C_BndEvt__Stance_K2Node_ComponentBoundEvent_0_StanceChangedEvent__DelegateSignature_BPChar_NonPlayerCharacter");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_BndEvt__Stance_K2Node_ComponentBoundEvent_0_StanceChangedEvent__DelegateSignature_BPChar_NonPlayerCharacter, Args) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_BndEvt__Stance_K2Node_ComponentBoundEvent_0_StanceChangedEvent__DelegateSignature_BPChar_NonPlayerCharacter::Args' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.EngagePlayerWhenIdle
// 0x0001 (0x0001 - 0x0000)
struct BPChar_NonPlayerCharacter_C_EngagePlayerWhenIdle final
{
public:
	bool                                          LookAtPlayer;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_EngagePlayerWhenIdle) == 0x000001, "Wrong alignment on BPChar_NonPlayerCharacter_C_EngagePlayerWhenIdle");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_EngagePlayerWhenIdle) == 0x000001, "Wrong size on BPChar_NonPlayerCharacter_C_EngagePlayerWhenIdle");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_EngagePlayerWhenIdle, LookAtPlayer) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_EngagePlayerWhenIdle::LookAtPlayer' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.SetNPCEngagePlayerRange
// 0x0004 (0x0004 - 0x0000)
struct BPChar_NonPlayerCharacter_C_SetNPCEngagePlayerRange final
{
public:
	float                                         Units;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_SetNPCEngagePlayerRange) == 0x000004, "Wrong alignment on BPChar_NonPlayerCharacter_C_SetNPCEngagePlayerRange");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_SetNPCEngagePlayerRange) == 0x000004, "Wrong size on BPChar_NonPlayerCharacter_C_SetNPCEngagePlayerRange");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetNPCEngagePlayerRange, Units) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_SetNPCEngagePlayerRange::Units' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700
// 0x0010 (0x0010 - 0x0000)
struct BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700 final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700) == 0x000010, "Wrong size on BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700, UserController) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700::UserController' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700, UsedComponent) == 0x000008, "Member 'BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700::UsedComponent' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BPChar_NonPlayerCharacter
// 0x0018 (0x0018 - 0x0000)
struct BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BPChar_NonPlayerCharacter final
{
public:
	struct FUseEvent                              UseEvent;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BPChar_NonPlayerCharacter) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BPChar_NonPlayerCharacter");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BPChar_NonPlayerCharacter) == 0x000018, "Wrong size on BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BPChar_NonPlayerCharacter");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BPChar_NonPlayerCharacter, UseEvent) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedSignature__DelegateSignature_BPChar_NonPlayerCharacter::UseEvent' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.TextClear
// 0x0004 (0x0004 - 0x0000)
struct BPChar_NonPlayerCharacter_C_TextClear final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_TextClear) == 0x000004, "Wrong alignment on BPChar_NonPlayerCharacter_C_TextClear");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_TextClear) == 0x000004, "Wrong size on BPChar_NonPlayerCharacter_C_TextClear");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_TextClear, Time) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_TextClear::Time' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.SetMissionDebugText
// 0x0038 (0x0038 - 0x0000)
struct BPChar_NonPlayerCharacter_C_SetMissionDebugText final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         TextSize_0;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor_0;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FacePlayer_0;                                      // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_NonPlayerCharacter_C_SetMissionDebugText) == 0x000008, "Wrong alignment on BPChar_NonPlayerCharacter_C_SetMissionDebugText");
static_assert(sizeof(BPChar_NonPlayerCharacter_C_SetMissionDebugText) == 0x000038, "Wrong size on BPChar_NonPlayerCharacter_C_SetMissionDebugText");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetMissionDebugText, Text_0) == 0x000000, "Member 'BPChar_NonPlayerCharacter_C_SetMissionDebugText::Text_0' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetMissionDebugText, TextSize_0) == 0x000018, "Member 'BPChar_NonPlayerCharacter_C_SetMissionDebugText::TextSize_0' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetMissionDebugText, Duration) == 0x00001C, "Member 'BPChar_NonPlayerCharacter_C_SetMissionDebugText::Duration' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetMissionDebugText, TextColor_0) == 0x000020, "Member 'BPChar_NonPlayerCharacter_C_SetMissionDebugText::TextColor_0' has a wrong offset!");
static_assert(offsetof(BPChar_NonPlayerCharacter_C_SetMissionDebugText, FacePlayer_0) == 0x000030, "Member 'BPChar_NonPlayerCharacter_C_SetMissionDebugText::FacePlayer_0' has a wrong offset!");

// Function BPChar_NonPlayerCharacter.BPChar_NonPlayerCharacter_C.ExecuteUbergraph_BPChar_NonPlayerCharacter
// 0x0780 (0x0780 - 0x0000)
struct BPChar_NonPlayerCharacter_C_ExecuteUbergraph_BPChar_NonPlayerCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ADroppedInventoryItemPickup* Pickup)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0038(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUseEvent                              K2Node_CustomEvent_UseEvent;                       // 0x00E0(0x0018)(NoDestructor, ContainsInstancedReference)
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_Player*                   K2Node_DynamicCast_AsOak_Character_Player;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue1;      // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue1;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotifyNPCUsedByPlayer_ReturnValue;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0144(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x0150(0x0018)()
	bool                                          CallFunc_SetStaticMesh_ReturnValue1;               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_EngageInCombat;                       // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_CanPatrol;                            // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_UseSmartObjects;                      // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Event_TheThingToHold;                       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemPoolInfo                          K2Node_Event_ThePickupToHold;                      // 0x0178(0x0088)()
	struct FTransform                             K2Node_Event_OffsetTransform;                      // 0x0200(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_PutAwayOffset;                        // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TakeOutOffset;                        // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_UseAltAnimation;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B[0x5];                                      // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue1;                 // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IgnoreEnemies;                        // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0254(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue1;         // 0x0260(0x0018)()
	struct FHitResult                             CallFunc_K2_SetActorRelativeTransform_SweepHitResult; // 0x0278(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_CanReviveOthers;                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStanceChangedEventArgs                K2Node_ComponentBoundEvent_Args;                   // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue; // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue1; // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue2; // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue3; // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue4; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue5; // 0x0346(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0347(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue6; // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue7; // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue8; // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue9; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue10; // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue11; // 0x034E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x034F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue6;                   // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_LookAtPlayer;                         // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue7;                   // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue8;                   // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue9;                   // 0x0356(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_357[0x1];                                      // 0x0357(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Units;                                // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue2;      // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0370(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0388(0x0010)(ZeroConstructor, NoDestructor)
	class AController*                            K2Node_ComponentBoundEvent_UserController;         // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent;          // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
