#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_Marcus

#include "Basic.hpp"

#include "GbxMission_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function BPChar_Marcus.BPChar_Marcus_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BPChar_Marcus_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Setup_ReturnValue;                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_Marcus_C_UserConstructionScript) == 0x000001, "Wrong alignment on BPChar_Marcus_C_UserConstructionScript");
static_assert(sizeof(BPChar_Marcus_C_UserConstructionScript) == 0x000001, "Wrong size on BPChar_Marcus_C_UserConstructionScript");
static_assert(offsetof(BPChar_Marcus_C_UserConstructionScript, CallFunc_Setup_ReturnValue) == 0x000000, "Member 'BPChar_Marcus_C_UserConstructionScript::CallFunc_Setup_ReturnValue' has a wrong offset!");

// Function BPChar_Marcus.BPChar_Marcus_C.BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146
// 0x0010 (0x0010 - 0x0000)
struct BPChar_Marcus_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146 final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_Marcus_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146) == 0x000008, "Wrong alignment on BPChar_Marcus_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146");
static_assert(sizeof(BPChar_Marcus_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146) == 0x000010, "Wrong size on BPChar_Marcus_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146");
static_assert(offsetof(BPChar_Marcus_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146, UserController) == 0x000000, "Member 'BPChar_Marcus_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146::UserController' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146, UsedComponent) == 0x000008, "Member 'BPChar_Marcus_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509371146::UsedComponent' has a wrong offset!");

// Function BPChar_Marcus.BPChar_Marcus_C.ExecuteUbergraph_BPChar_Marcus
// 0x0F78 (0x0F78 - 0x0000)
struct BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0224(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0238(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x0454(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466[0x2];                                      // 0x0466(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0468(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation2;        // 0x0680(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID2;          // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue2;         // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0698(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B1[0x3];                                      // 0x08B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation3;        // 0x08B4(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID3;          // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue3;         // 0x08C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x08C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C6[0x2];                                      // 0x08C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x08C8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation4;        // 0x0AE0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID4;          // 0x0AEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue4;         // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0AF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF2[0x6];                                      // 0x0AF2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AF8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation5;        // 0x0D10(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID5;          // 0x0D1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue5;         // 0x0D20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0D21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue1; // 0x0D22(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0D23(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D24[0x4];                                      // 0x0D24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_ComponentBoundEvent_UserController;         // 0x0D28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent;          // 0x0D30(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0D38(0x0218)()
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0F50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0F58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TriggerMissionDeliveryPlacard_bMissionAvailable; // 0x0F59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5A[0x2];                                      // 0x0F5A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation6;        // 0x0F5C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID6;          // 0x0F68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue6;         // 0x0F6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x0F6D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionActiveResult                          CallFunc_IsAnyMissionActive_OutResult;             // 0x0F6E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0F6F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue2; // 0x0F70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0F71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus) == 0x000008, "Wrong alignment on BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus");
static_assert(sizeof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus) == 0x000F78, "Wrong size on BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, EntryPoint) == 0x000000, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_GetMissionObjectiveStatusRef_ReturnValue) == 0x000004, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_GetMissionObjectiveStatusRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, K2Node_SwitchEnum_CmpSuccess) == 0x000220, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_Conversation) == 0x000224, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_SequenceID) == 0x000230, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000234, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_NewDialogContext_ReturnValue1) == 0x000238, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_Conv_IntToBool_ReturnValue) == 0x000450, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_Conversation1) == 0x000454, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_SequenceID1) == 0x000460, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x000464, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000465, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_NewDialogContext_ReturnValue2) == 0x000468, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_Conversation2) == 0x000680, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_Conversation2' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_SequenceID2) == 0x00068C, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_SequenceID2' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_ReturnValue2) == 0x000690, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_NewDialogContext_ReturnValue3) == 0x000698, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_Conv_IntToBool_ReturnValue2) == 0x0008B0, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_Conversation3) == 0x0008B4, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_Conversation3' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_SequenceID3) == 0x0008C0, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_SequenceID3' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_ReturnValue3) == 0x0008C4, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_Conv_IntToBool_ReturnValue3) == 0x0008C5, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_NewDialogContext_ReturnValue4) == 0x0008C8, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_NewDialogContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_Conversation4) == 0x000AE0, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_Conversation4' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_SequenceID4) == 0x000AEC, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_SequenceID4' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_ReturnValue4) == 0x000AF0, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_Conv_IntToBool_ReturnValue4) == 0x000AF1, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_NewDialogContext_ReturnValue5) == 0x000AF8, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_NewDialogContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_Conversation5) == 0x000D10, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_Conversation5' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_SequenceID5) == 0x000D1C, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_SequenceID5' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_ReturnValue5) == 0x000D20, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_Conv_IntToBool_ReturnValue5) == 0x000D21, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_GetMissionObjectiveStatusRef_ReturnValue1) == 0x000D22, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_GetMissionObjectiveStatusRef_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, K2Node_SwitchEnum1_CmpSuccess) == 0x000D23, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, K2Node_ComponentBoundEvent_UserController) == 0x000D28, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::K2Node_ComponentBoundEvent_UserController' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, K2Node_ComponentBoundEvent_UsedComponent) == 0x000D30, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::K2Node_ComponentBoundEvent_UsedComponent' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_NewDialogContext_ReturnValue6) == 0x000D38, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_NewDialogContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000F50, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, K2Node_DynamicCast_bSuccess) == 0x000F58, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_TriggerMissionDeliveryPlacard_bMissionAvailable) == 0x000F59, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_TriggerMissionDeliveryPlacard_bMissionAvailable' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_Conversation6) == 0x000F5C, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_Conversation6' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_SequenceID6) == 0x000F68, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_SequenceID6' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_FinishTriggerDialog_ReturnValue6) == 0x000F6C, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_FinishTriggerDialog_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_Conv_IntToBool_ReturnValue6) == 0x000F6D, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_Conv_IntToBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_IsAnyMissionActive_OutResult) == 0x000F6E, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_IsAnyMissionActive_OutResult' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, K2Node_SwitchEnum2_CmpSuccess) == 0x000F6F, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, CallFunc_GetMissionObjectiveStatusRef_ReturnValue2) == 0x000F70, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::CallFunc_GetMissionObjectiveStatusRef_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus, K2Node_SwitchEnum3_CmpSuccess) == 0x000F71, "Member 'BPChar_Marcus_C_ExecuteUbergraph_BPChar_Marcus::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");

}

