#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_AtlasSoldierShared

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPChar_NonPlayerCharacter_Combat_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPChar_AtlasSoldierShared.BPChar_AtlasSoldierShared_C
// 0x0030 (0x2610 - 0x25E0)
class ABPChar_AtlasSoldierShared_C : public ABPChar_NonPlayerCharacter_Combat_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPChar_AtlasSoldierShared_C;        // 0x25E0(0x0008)(Transient, DuplicateTransient)
	class UWwiseAudioComponent*                   DefaultAudioComponent;                             // 0x25E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFoleyMainComponent*                    FoleyMain;                                         // 0x25F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakHitRegionComponent*                 OakHitRegion;                                      // 0x25F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIExplosiveSpawningComponent_C*        AIExplosiveSpawningComponent;                      // 0x2600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Demigod;                                           // 0x2608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BPChar_AtlasSoldierShared(int32 EntryPoint);
	void BndEvt__BPNPCFightForYourLifeComponent_K2Node_ComponentBoundEvent_6_FightForYourLifeEvent__DelegateSignature_BPChar_AtlasSoldierShared();
	void BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier(class UDamageComponent* DamageReceiver, class UDamageCauserComponent* DamageCauser);
	void BndEvt__Stance_K2Node_ComponentBoundEvent_1_StanceChangedEvent__DelegateSignature_BPChar_AtlasSoldierShared(const struct FStanceChangedEventArgs& Args);
	void ImmediateDownState();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPChar_AtlasSoldierShared_C">();
	}
	static class ABPChar_AtlasSoldierShared_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPChar_AtlasSoldierShared_C>();
	}
};
static_assert(alignof(ABPChar_AtlasSoldierShared_C) == 0x000010, "Wrong alignment on ABPChar_AtlasSoldierShared_C");
static_assert(sizeof(ABPChar_AtlasSoldierShared_C) == 0x002610, "Wrong size on ABPChar_AtlasSoldierShared_C");
static_assert(offsetof(ABPChar_AtlasSoldierShared_C, UberGraphFrame_BPChar_AtlasSoldierShared_C) == 0x0025E0, "Member 'ABPChar_AtlasSoldierShared_C::UberGraphFrame_BPChar_AtlasSoldierShared_C' has a wrong offset!");
static_assert(offsetof(ABPChar_AtlasSoldierShared_C, DefaultAudioComponent) == 0x0025E8, "Member 'ABPChar_AtlasSoldierShared_C::DefaultAudioComponent' has a wrong offset!");
static_assert(offsetof(ABPChar_AtlasSoldierShared_C, FoleyMain) == 0x0025F0, "Member 'ABPChar_AtlasSoldierShared_C::FoleyMain' has a wrong offset!");
static_assert(offsetof(ABPChar_AtlasSoldierShared_C, OakHitRegion) == 0x0025F8, "Member 'ABPChar_AtlasSoldierShared_C::OakHitRegion' has a wrong offset!");
static_assert(offsetof(ABPChar_AtlasSoldierShared_C, AIExplosiveSpawningComponent) == 0x002600, "Member 'ABPChar_AtlasSoldierShared_C::AIExplosiveSpawningComponent' has a wrong offset!");
static_assert(offsetof(ABPChar_AtlasSoldierShared_C, Demigod) == 0x002608, "Member 'ABPChar_AtlasSoldierShared_C::Demigod' has a wrong offset!");

}

