#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_StandIn_Beastmaster_SkillScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPChar_StandIn_Beastmaster_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPChar_StandIn_Beastmaster_SkillScreen.BPChar_StandIn_Beastmaster_SkillScreen_C
// 0x0010 (0x23B0 - 0x23A0)
class ABPChar_StandIn_Beastmaster_SkillScreen_C final : public ABPChar_StandIn_Beastmaster_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2398(0x0008)(Transient, DuplicateTransient)
	class UGbxSkeletalMeshComponent*              GravTrap;                                          // 0x23A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BeastmasterMelee;                               // 0x23A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPChar_StandIn_Beastmaster_SkillScreen(int32 EntryPoint);
	void HideGravTrap();
	void Notify_HideMeleeMesh();
	void Notify_Stealth();
	void PlayTrapAnim();
	void ShowGravTrap();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPChar_StandIn_Beastmaster_SkillScreen_C">();
	}
	static class ABPChar_StandIn_Beastmaster_SkillScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPChar_StandIn_Beastmaster_SkillScreen_C>();
	}
};
static_assert(alignof(ABPChar_StandIn_Beastmaster_SkillScreen_C) == 0x000010, "Wrong alignment on ABPChar_StandIn_Beastmaster_SkillScreen_C");
static_assert(sizeof(ABPChar_StandIn_Beastmaster_SkillScreen_C) == 0x0023B0, "Wrong size on ABPChar_StandIn_Beastmaster_SkillScreen_C");
static_assert(offsetof(ABPChar_StandIn_Beastmaster_SkillScreen_C, UberGraphFrame) == 0x002398, "Member 'ABPChar_StandIn_Beastmaster_SkillScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPChar_StandIn_Beastmaster_SkillScreen_C, GravTrap) == 0x0023A0, "Member 'ABPChar_StandIn_Beastmaster_SkillScreen_C::GravTrap' has a wrong offset!");
static_assert(offsetof(ABPChar_StandIn_Beastmaster_SkillScreen_C, SM_BeastmasterMelee) == 0x0023A8, "Member 'ABPChar_StandIn_Beastmaster_SkillScreen_C::SM_BeastmasterMelee' has a wrong offset!");

}

