#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_Heavy_Basic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPChar_Heavy_Shared_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPChar_Heavy_Basic.BPChar_Heavy_Basic_C
// 0x0020 (0x27C0 - 0x27A0)
class ABPChar_Heavy_Basic_C final : public ABPChar_Heavy_Shared_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPChar_Heavy_Basic_C;               // 0x2798(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_Heavy_Fire_WeaponAmbient_L;                     // 0x27A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Heavy_Fire_WeaponAmbient_R;                     // 0x27A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Heavy_Backpack_Fire_Ambient;                    // 0x27B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPChar_Heavy_Basic(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPChar_Heavy_Basic_C">();
	}
	static class ABPChar_Heavy_Basic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPChar_Heavy_Basic_C>();
	}
};
static_assert(alignof(ABPChar_Heavy_Basic_C) == 0x000010, "Wrong alignment on ABPChar_Heavy_Basic_C");
static_assert(sizeof(ABPChar_Heavy_Basic_C) == 0x0027C0, "Wrong size on ABPChar_Heavy_Basic_C");
static_assert(offsetof(ABPChar_Heavy_Basic_C, UberGraphFrame_BPChar_Heavy_Basic_C) == 0x002798, "Member 'ABPChar_Heavy_Basic_C::UberGraphFrame_BPChar_Heavy_Basic_C' has a wrong offset!");
static_assert(offsetof(ABPChar_Heavy_Basic_C, PS_Heavy_Fire_WeaponAmbient_L) == 0x0027A0, "Member 'ABPChar_Heavy_Basic_C::PS_Heavy_Fire_WeaponAmbient_L' has a wrong offset!");
static_assert(offsetof(ABPChar_Heavy_Basic_C, PS_Heavy_Fire_WeaponAmbient_R) == 0x0027A8, "Member 'ABPChar_Heavy_Basic_C::PS_Heavy_Fire_WeaponAmbient_R' has a wrong offset!");
static_assert(offsetof(ABPChar_Heavy_Basic_C, PS_Heavy_Backpack_Fire_Ambient) == 0x0027B0, "Member 'ABPChar_Heavy_Basic_C::PS_Heavy_Backpack_Fire_Ambient' has a wrong offset!");

}

