#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_Operative

#include "Basic.hpp"

#include "BPChar_Player_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "WwiseAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPChar_Operative.BPChar_Operative_C
// 0x00F0 (0x36E0 - 0x35F0)
class ABPChar_Operative_C final : public ABPChar_Player_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPChar_Operative_C;                 // 0x35E8(0x0008)(Transient, DuplicateTransient)
	class UFaceFXComponent*                       FaceFX;                                            // 0x35F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_OperativeCharacterComponent_C*      BP_OperativeCharacterComponent;                    // 0x35F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              ActionSkillDevice3rd;                              // 0x3600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              DroneSpawn3rd;                                     // 0x3608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   WwiseAudio;                                        // 0x3610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFoleyAccessoryComponent*               R_Hand_Audio;                                      // 0x3618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFoleyAccessoryComponent*               L_Hand_Audio;                                      // 0x3620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              Head;                                              // 0x3628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DigistructSNTRY_MaterialScalar_9133ADCB49700F8E9184039E3D946B87; // 0x3630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DigistructSNTRY__Direction_9133ADCB49700F8E9184039E3D946B87; // 0x3634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3635[0x3];                                     // 0x3635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DigistructSNTRY;                                   // 0x3638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              DroneSpawn;                                        // 0x3640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              ActionSkillDevice1st;                              // 0x3648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 DroneSpawnWWiseComponent;                          // 0x3650(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWwiseAudioComponent*                   DroneSpawnAudio;                                   // 0x3668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableValueHandle                  StatusEffectBaseChance;                            // 0x3670(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableValueHandle                  StatusEffectBaseDuration;                          // 0x3688(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableValueHandle                  StatusEffectBaseDamage;                            // 0x36A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGbxAttributeFloat                     DeathFollowsCloseDurationBonus;                    // 0x36B8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGbxAttributeFloat                     DeathFollowsCloseEffectBonus;                      // 0x36C4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGbxAttributeFloat                     bActivateTrapCard;                                 // 0x36D0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPChar_Operative(int32 EntryPoint);
	void SpawnCannonEmitterMulticast(class UParticleSystem* CannonEmitter, class USkeletalMeshComponent* CannonComponent);
	void SetOperativeDeviceVisible(bool bVisible);
	void DoOperativeCryoNovaAtLocation(const struct FVector& Location, float Damage);
	void HideOperativeDroneSpawnAnimation();
	void PlayerOperativeDroneSpawnAnimation();
	void DigistructSNTRY__UpdateFunc();
	void DigistructSNTRY__FinishedFunc();
	void InnerDoCryoNovaAtLocation(const struct FVector& InLocation, float InDamage);
	void Get_Materials_TP_Gun(TArray<class UMaterialInterface*>* Materials);
	void Get_Materials_FP_Gun(TArray<class UMaterialInterface*>* Materials);
	void Get_Materials_Skeletal_Mesh(TArray<class UMaterialInterface*>* Materials);
	void Get_Materials_Legs(TArray<class UMaterialInterface*>* Materials);
	void Get_Materials_Arms(TArray<class UMaterialInterface*>* Materials);
	void Get_Materials_Head(TArray<class UMaterialInterface*>* Materials);
	void Get_Skeletal_Mesh(class USkeletalMeshComponent** Skeletal_Mesh);
	void Get_Skeletal_Mesh_Legs(class UGbxSkeletalMeshComponent** Legs);
	void Get_Skeletal_Mesh_Arms(class USkeletalMeshComponent** Arms_Mesh);
	void Get_Skeletal_Mesh_Head(class UGbxSkeletalMeshComponent** Head_Mesh);
	void GetDroneSpawnLocation(struct FTransform* Transform);
	void BlockOperativeActionSkillActivation(bool* ShouldBlock);
	void SpawnAndThrowOperativeGrenade(class AActor* SpawnFromActor, class FName SpawnFromSocket, bool* Res, class AActor** Grenade);
	void GetDigiCloneShieldRemainingPercent(float* ShieldPercentRemaining);
	void GetOperativeShieldRemainingPercent(float* ShieldPercentRemaining);
	void GetOperativeStatusEffectOverrides(struct FCauseDamageStatusEffectOverrides* Overrides);
	void GetBarrierActionAbility(class UOakActionAbility_Barrier** Res);
	void CanActivateTrapCard(bool* Res);
	void UserConstructionScript();
	void GetHeadMesh(class USkeletalMesh** HeadMesh);

	class UOakActionAbility* GetPrimaryActionAbility() const;
	class UOakActionAbility* GetSecondaryActionAbility() const;
	void GetDigicloneActionAbility(class UOakActionAbility_Digiclone** Res) const;
	void GetGRMLNActionAbility(class UOakActionAbility_GRMLN** Res) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPChar_Operative_C">();
	}
	static class ABPChar_Operative_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPChar_Operative_C>();
	}
};
static_assert(alignof(ABPChar_Operative_C) == 0x000010, "Wrong alignment on ABPChar_Operative_C");
static_assert(sizeof(ABPChar_Operative_C) == 0x0036E0, "Wrong size on ABPChar_Operative_C");
static_assert(offsetof(ABPChar_Operative_C, UberGraphFrame_BPChar_Operative_C) == 0x0035E8, "Member 'ABPChar_Operative_C::UberGraphFrame_BPChar_Operative_C' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, FaceFX) == 0x0035F0, "Member 'ABPChar_Operative_C::FaceFX' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, BP_OperativeCharacterComponent) == 0x0035F8, "Member 'ABPChar_Operative_C::BP_OperativeCharacterComponent' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, ActionSkillDevice3rd) == 0x003600, "Member 'ABPChar_Operative_C::ActionSkillDevice3rd' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, DroneSpawn3rd) == 0x003608, "Member 'ABPChar_Operative_C::DroneSpawn3rd' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, WwiseAudio) == 0x003610, "Member 'ABPChar_Operative_C::WwiseAudio' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, R_Hand_Audio) == 0x003618, "Member 'ABPChar_Operative_C::R_Hand_Audio' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, L_Hand_Audio) == 0x003620, "Member 'ABPChar_Operative_C::L_Hand_Audio' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, Head) == 0x003628, "Member 'ABPChar_Operative_C::Head' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, DigistructSNTRY_MaterialScalar_9133ADCB49700F8E9184039E3D946B87) == 0x003630, "Member 'ABPChar_Operative_C::DigistructSNTRY_MaterialScalar_9133ADCB49700F8E9184039E3D946B87' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, DigistructSNTRY__Direction_9133ADCB49700F8E9184039E3D946B87) == 0x003634, "Member 'ABPChar_Operative_C::DigistructSNTRY__Direction_9133ADCB49700F8E9184039E3D946B87' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, DigistructSNTRY) == 0x003638, "Member 'ABPChar_Operative_C::DigistructSNTRY' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, DroneSpawn) == 0x003640, "Member 'ABPChar_Operative_C::DroneSpawn' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, ActionSkillDevice1st) == 0x003648, "Member 'ABPChar_Operative_C::ActionSkillDevice1st' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, DroneSpawnWWiseComponent) == 0x003650, "Member 'ABPChar_Operative_C::DroneSpawnWWiseComponent' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, DroneSpawnAudio) == 0x003668, "Member 'ABPChar_Operative_C::DroneSpawnAudio' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, StatusEffectBaseChance) == 0x003670, "Member 'ABPChar_Operative_C::StatusEffectBaseChance' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, StatusEffectBaseDuration) == 0x003688, "Member 'ABPChar_Operative_C::StatusEffectBaseDuration' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, StatusEffectBaseDamage) == 0x0036A0, "Member 'ABPChar_Operative_C::StatusEffectBaseDamage' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, DeathFollowsCloseDurationBonus) == 0x0036B8, "Member 'ABPChar_Operative_C::DeathFollowsCloseDurationBonus' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, DeathFollowsCloseEffectBonus) == 0x0036C4, "Member 'ABPChar_Operative_C::DeathFollowsCloseEffectBonus' has a wrong offset!");
static_assert(offsetof(ABPChar_Operative_C, bActivateTrapCard) == 0x0036D0, "Member 'ABPChar_Operative_C::bActivateTrapCard' has a wrong offset!");

}

