#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_Maya

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPChar_NonPlayerCharacter_Combat_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPChar_Maya.BPChar_Maya_C
// 0x0080 (0x2660 - 0x25E0)
class ABPChar_Maya_C final : public ABPChar_NonPlayerCharacter_Combat_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPChar_Maya_C;                      // 0x25E0(0x0008)(Transient, DuplicateTransient)
	class UWwiseAudioComponent*                   DefaultAudio;                                      // 0x25E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIExplosiveSpawningComponent_C*        AIExplosiveSpawningComponent;                      // 0x25F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFaceFXComponent*                       FaceFX;                                            // 0x25F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Maya_Hand_Idle_Magic;                           // 0x2600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFoleyMainComponent*                    FoleyMain;                                         // 0x2608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UDialogTimeSlotData*>            Mission_2;                                         // 0x2610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   PrometheaVaultMission_SendMayaAway;                // 0x2620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UInventoryListComponent*                NewVar_1_1;                                        // 0x2630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                WeaponRef;                                         // 0x2638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            User_0;                                            // 0x2640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            MyFollower;                                        // 0x2648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HeliosTarget;                                      // 0x2650(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Posture;                                           // 0x2658(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void OnRep_Posture();
	void ResetPosture();
	void SetPosture(const struct FGameplayTag& Posture_0);
	void CalcPhaselockHoverAltitude(class USceneComponent* Component, class AActor* TargetActor, float VerticalSeperation, float* Altitude);
	void OnCompleted_BF1EF73344F02CFC3AEA7EA3C2FA4EFE();
	void OnAborted_BF1EF73344F02CFC3AEA7EA3C2FA4EFE();
	void NPCMayaHeliosBlast(class AActor* HeliosTargetActor);
	void NPCSirenPhaselockMove(class AActor* ObjectToMove, class AActor* HoverTarget, const struct FTransform& ObjectEndingTransform, float OverTime, class AActor* MoveToNode);
	void NPCMayaPhaselockMoveEnd();
	void BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509011008(class AController* UserController, class UPrimitiveComponent* UsedComponent);
	void MayaHideFX();
	void MayaUnhideFX();
	void ExecuteUbergraph_BPChar_Maya(int32 EntryPoint);
	void PrometheaVaultMission_SendMayaAway__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPChar_Maya_C">();
	}
	static class ABPChar_Maya_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPChar_Maya_C>();
	}
};
static_assert(alignof(ABPChar_Maya_C) == 0x000010, "Wrong alignment on ABPChar_Maya_C");
static_assert(sizeof(ABPChar_Maya_C) == 0x002660, "Wrong size on ABPChar_Maya_C");
static_assert(offsetof(ABPChar_Maya_C, UberGraphFrame_BPChar_Maya_C) == 0x0025E0, "Member 'ABPChar_Maya_C::UberGraphFrame_BPChar_Maya_C' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, DefaultAudio) == 0x0025E8, "Member 'ABPChar_Maya_C::DefaultAudio' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, AIExplosiveSpawningComponent) == 0x0025F0, "Member 'ABPChar_Maya_C::AIExplosiveSpawningComponent' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, FaceFX) == 0x0025F8, "Member 'ABPChar_Maya_C::FaceFX' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, PS_Maya_Hand_Idle_Magic) == 0x002600, "Member 'ABPChar_Maya_C::PS_Maya_Hand_Idle_Magic' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, FoleyMain) == 0x002608, "Member 'ABPChar_Maya_C::FoleyMain' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, Mission_2) == 0x002610, "Member 'ABPChar_Maya_C::Mission_2' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, PrometheaVaultMission_SendMayaAway) == 0x002620, "Member 'ABPChar_Maya_C::PrometheaVaultMission_SendMayaAway' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, NewVar_1_1) == 0x002630, "Member 'ABPChar_Maya_C::NewVar_1_1' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, WeaponRef) == 0x002638, "Member 'ABPChar_Maya_C::WeaponRef' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, User_0) == 0x002640, "Member 'ABPChar_Maya_C::User_0' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, MyFollower) == 0x002648, "Member 'ABPChar_Maya_C::MyFollower' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, HeliosTarget) == 0x002650, "Member 'ABPChar_Maya_C::HeliosTarget' has a wrong offset!");
static_assert(offsetof(ABPChar_Maya_C, Posture) == 0x002658, "Member 'ABPChar_Maya_C::Posture' has a wrong offset!");

}

