#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_Moxxi

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function BPChar_Moxxi.BPChar_Moxxi_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BPChar_Moxxi_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Setup_ReturnValue;                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_Moxxi_C_UserConstructionScript) == 0x000001, "Wrong alignment on BPChar_Moxxi_C_UserConstructionScript");
static_assert(sizeof(BPChar_Moxxi_C_UserConstructionScript) == 0x000001, "Wrong size on BPChar_Moxxi_C_UserConstructionScript");
static_assert(offsetof(BPChar_Moxxi_C_UserConstructionScript, CallFunc_Setup_ReturnValue) == 0x000000, "Member 'BPChar_Moxxi_C_UserConstructionScript::CallFunc_Setup_ReturnValue' has a wrong offset!");

// Function BPChar_Moxxi.BPChar_Moxxi_C.BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700
// 0x0010 (0x0010 - 0x0000)
struct BPChar_Moxxi_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700 final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_Moxxi_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700) == 0x000008, "Wrong alignment on BPChar_Moxxi_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700");
static_assert(sizeof(BPChar_Moxxi_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700) == 0x000010, "Wrong size on BPChar_Moxxi_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700");
static_assert(offsetof(BPChar_Moxxi_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700, UserController) == 0x000000, "Member 'BPChar_Moxxi_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700::UserController' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700, UsedComponent) == 0x000008, "Member 'BPChar_Moxxi_C_BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700::UsedComponent' has a wrong offset!");

// Function BPChar_Moxxi.BPChar_Moxxi_C.ExecuteUbergraph_BPChar_Moxxi
// 0x08E8 (0x08E8 - 0x0000)
struct BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0220(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0438(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x044C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x045E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue; // 0x045F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0468(0x0218)()
	class AController*                            K2Node_ComponentBoundEvent_UserController;         // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent;          // 0x0688(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x0690(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue1; // 0x06A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A3[0x5];                                      // 0x06A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TriggerMissionDeliveryPlacard_bMissionAvailable; // 0x06B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionActiveResult                          CallFunc_IsAnyMissionActive_OutResult;             // 0x06B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x06B8(0x0218)()
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D1[0x3];                                      // 0x08D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation2;        // 0x08D4(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID2;          // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue2;         // 0x08E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x08E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue2; // 0x08E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x08E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi) == 0x000008, "Wrong alignment on BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi");
static_assert(sizeof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi) == 0x0008E8, "Wrong size on BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, EntryPoint) == 0x000000, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_NewDialogContext_ReturnValue1) == 0x000220, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishSpeak_Conversation) == 0x000438, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishSpeak_SequenceID) == 0x000444, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishSpeak_ReturnValue) == 0x000448, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishTriggerDialog_Conversation) == 0x00044C, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishTriggerDialog_SequenceID) == 0x000458, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishTriggerDialog_ReturnValue) == 0x00045C, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_Conv_IntToBool_ReturnValue) == 0x00045D, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_Conv_IntToBool_ReturnValue1) == 0x00045E, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_GetMissionObjectiveStatusRef_ReturnValue) == 0x00045F, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_GetMissionObjectiveStatusRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, K2Node_SwitchEnum_CmpSuccess) == 0x000460, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_K2_EvaluateCondition_ReturnValue) == 0x000461, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_K2_EvaluateCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_NewDialogContext_ReturnValue2) == 0x000468, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, K2Node_ComponentBoundEvent_UserController) == 0x000680, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::K2Node_ComponentBoundEvent_UserController' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, K2Node_ComponentBoundEvent_UsedComponent) == 0x000688, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::K2Node_ComponentBoundEvent_UsedComponent' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishTriggerDialog_Conversation1) == 0x000690, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishTriggerDialog_SequenceID1) == 0x00069C, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x0006A0, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_Conv_IntToBool_ReturnValue2) == 0x0006A1, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_GetMissionObjectiveStatusRef_ReturnValue1) == 0x0006A2, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_GetMissionObjectiveStatusRef_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, K2Node_DynamicCast_AsOak_Player_Controller) == 0x0006A8, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, K2Node_DynamicCast_bSuccess) == 0x0006B0, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, K2Node_SwitchEnum1_CmpSuccess) == 0x0006B1, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_TriggerMissionDeliveryPlacard_bMissionAvailable) == 0x0006B2, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_TriggerMissionDeliveryPlacard_bMissionAvailable' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_IsAnyMissionActive_OutResult) == 0x0006B3, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_IsAnyMissionActive_OutResult' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_NewDialogContext_ReturnValue3) == 0x0006B8, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, K2Node_SwitchEnum2_CmpSuccess) == 0x0008D0, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishTriggerDialog_Conversation2) == 0x0008D4, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishTriggerDialog_Conversation2' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishTriggerDialog_SequenceID2) == 0x0008E0, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishTriggerDialog_SequenceID2' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_FinishTriggerDialog_ReturnValue2) == 0x0008E4, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_FinishTriggerDialog_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_Conv_IntToBool_ReturnValue3) == 0x0008E5, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, CallFunc_GetMissionObjectiveStatusRef_ReturnValue2) == 0x0008E6, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::CallFunc_GetMissionObjectiveStatusRef_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi, K2Node_SwitchEnum3_CmpSuccess) == 0x0008E7, "Member 'BPChar_Moxxi_C_ExecuteUbergraph_BPChar_Moxxi::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");

}

