#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_PetSpiderant_Evo1_Fire

#include "Basic.hpp"

#include "BPChar_PetSpiderant_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPChar_PetSpiderant_Evo1_Fire.BPChar_PetSpiderant_Evo1_Fire_C
// 0x0020 (0x2650 - 0x2630)
class ABPChar_PetSpiderant_Evo1_Fire_C final : public ABPChar_PetSpiderant_C
{
public:
	class UWwiseAudioComponent*                   Fire_Audio;                                        // 0x2630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFoleyMainComponent*                    FoleyMain_0;                                       // 0x2638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Ambient_Fire;                                   // 0x2640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPChar_PetSpiderant_Evo1_Fire_C">();
	}
	static class ABPChar_PetSpiderant_Evo1_Fire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPChar_PetSpiderant_Evo1_Fire_C>();
	}
};
static_assert(alignof(ABPChar_PetSpiderant_Evo1_Fire_C) == 0x000010, "Wrong alignment on ABPChar_PetSpiderant_Evo1_Fire_C");
static_assert(sizeof(ABPChar_PetSpiderant_Evo1_Fire_C) == 0x002650, "Wrong size on ABPChar_PetSpiderant_Evo1_Fire_C");
static_assert(offsetof(ABPChar_PetSpiderant_Evo1_Fire_C, Fire_Audio) == 0x002630, "Member 'ABPChar_PetSpiderant_Evo1_Fire_C::Fire_Audio' has a wrong offset!");
static_assert(offsetof(ABPChar_PetSpiderant_Evo1_Fire_C, FoleyMain_0) == 0x002638, "Member 'ABPChar_PetSpiderant_Evo1_Fire_C::FoleyMain_0' has a wrong offset!");
static_assert(offsetof(ABPChar_PetSpiderant_Evo1_Fire_C, PS_Ambient_Fire) == 0x002640, "Member 'ABPChar_PetSpiderant_Evo1_Fire_C::PS_Ambient_Fire' has a wrong offset!");

}

