#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_PetMonkey_Evo2_Gunslinger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function BPChar_PetMonkey_Evo2_Gunslinger.BPChar_PetMonkey_Evo2_Gunslinger_C.ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger
// 0x01E0 (0x01E0 - 0x0000)
struct BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0008(0x0018)()
	EGbxActionEndState                            K2Node_CustomEvent_EndState1;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor1;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGbxActionEndState EndState, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	EGbxActionEndState                            K2Node_CustomEvent_EndState;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGbxActionEndState EndState, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable1;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            Temp_byte_Variable1;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable1;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x00A0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UGameplayTask_PlayGbxAction*            CallFunc_PlayGbxAction_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBlackboardObject_Value;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0120(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue1;              // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0170(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x017C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0188(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AProjectile_PetJabbermon_Rocket_C*      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable1;                             // 0x01A0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_Select_Default;                             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_PlayGbxAction*            CallFunc_PlayGbxAction_ReturnValue1;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBestKnownLocation_ReturnValue;         // 0x01C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_NewVisibility;                        // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetComponentByClass_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger) == 0x000010, "Wrong alignment on BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger");
static_assert(sizeof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger) == 0x0001E0, "Wrong size on BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, EntryPoint) == 0x000000, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_PostWwiseEvent_ReturnValue) == 0x000008, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_CustomEvent_EndState1) == 0x000020, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_CustomEvent_EndState1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_CustomEvent_Actor1) == 0x000028, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_CustomEvent_Actor1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, Temp_object_Variable) == 0x000040, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, Temp_byte_Variable) == 0x000048, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_CreateDelegate_OutputDelegate1) == 0x000050, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_CustomEvent_EndState) == 0x000060, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_CustomEvent_EndState' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_CustomEvent_Actor) == 0x000068, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_CreateDelegate_OutputDelegate2) == 0x000070, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, Temp_object_Variable1) == 0x000080, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, Temp_byte_Variable1) == 0x000088, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, Temp_bool_Variable) == 0x000089, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, Temp_name_Variable) == 0x000090, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, Temp_name_Variable1) == 0x000098, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, Temp_struct_Variable) == 0x0000A0, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_PlayGbxAction_ReturnValue) == 0x0000B0, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_PlayGbxAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B8, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_GetBlackboardObject_Value) == 0x0000D0, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_GetBlackboardObject_Value' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_DynamicCast_AsActor) == 0x0000D8, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_GetActorSocket_ReturnValue) == 0x0000F0, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_GetVelocity_ReturnValue) == 0x000120, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000130, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_GetActorSocket_ReturnValue1) == 0x000140, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_GetActorSocket_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_BreakTransform_Location) == 0x000170, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_BreakTransform_Rotation) == 0x00017C, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_BreakTransform_Scale) == 0x000188, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000194, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_FinishSpawningActor_ReturnValue) == 0x000198, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, Temp_struct_Variable1) == 0x0001A0, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_Select_Default) == 0x0001B0, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_PlayGbxAction_ReturnValue1) == 0x0001B8, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_PlayGbxAction_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_GetBestKnownLocation_ReturnValue) == 0x0001C0, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_GetBestKnownLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_IsValid_ReturnValue1) == 0x0001CC, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, K2Node_Event_NewVisibility) == 0x0001CD, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::K2Node_Event_NewVisibility' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_GetComponentByClass_ReturnValue) == 0x0001D0, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001D8, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_ExecuteUbergraph_BPChar_PetMonkey_Evo2_Gunslinger::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function BPChar_PetMonkey_Evo2_Gunslinger.BPChar_PetMonkey_Evo2_Gunslinger_C.PetJabbermon_ChangeLauncherVis
// 0x0001 (0x0001 - 0x0000)
struct BPChar_PetMonkey_Evo2_Gunslinger_C_PetJabbermon_ChangeLauncherVis final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_PetMonkey_Evo2_Gunslinger_C_PetJabbermon_ChangeLauncherVis) == 0x000001, "Wrong alignment on BPChar_PetMonkey_Evo2_Gunslinger_C_PetJabbermon_ChangeLauncherVis");
static_assert(sizeof(BPChar_PetMonkey_Evo2_Gunslinger_C_PetJabbermon_ChangeLauncherVis) == 0x000001, "Wrong size on BPChar_PetMonkey_Evo2_Gunslinger_C_PetJabbermon_ChangeLauncherVis");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_PetJabbermon_ChangeLauncherVis, NewVisibility) == 0x000000, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_PetJabbermon_ChangeLauncherVis::NewVisibility' has a wrong offset!");

// Function BPChar_PetMonkey_Evo2_Gunslinger.BPChar_PetMonkey_Evo2_Gunslinger_C.OnEnd_292D015A43F1D3D26922399926AD5DD0
// 0x0010 (0x0010 - 0x0000)
struct BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_292D015A43F1D3D26922399926AD5DD0 final
{
public:
	EGbxActionEndState                            EndState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_292D015A43F1D3D26922399926AD5DD0) == 0x000008, "Wrong alignment on BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_292D015A43F1D3D26922399926AD5DD0");
static_assert(sizeof(BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_292D015A43F1D3D26922399926AD5DD0) == 0x000010, "Wrong size on BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_292D015A43F1D3D26922399926AD5DD0");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_292D015A43F1D3D26922399926AD5DD0, EndState) == 0x000000, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_292D015A43F1D3D26922399926AD5DD0::EndState' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_292D015A43F1D3D26922399926AD5DD0, Actor) == 0x000008, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_292D015A43F1D3D26922399926AD5DD0::Actor' has a wrong offset!");

// Function BPChar_PetMonkey_Evo2_Gunslinger.BPChar_PetMonkey_Evo2_Gunslinger_C.OnEnd_D784EC3D42D3956B70F01FACFD3F075D
// 0x0010 (0x0010 - 0x0000)
struct BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_D784EC3D42D3956B70F01FACFD3F075D final
{
public:
	EGbxActionEndState                            EndState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_D784EC3D42D3956B70F01FACFD3F075D) == 0x000008, "Wrong alignment on BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_D784EC3D42D3956B70F01FACFD3F075D");
static_assert(sizeof(BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_D784EC3D42D3956B70F01FACFD3F075D) == 0x000010, "Wrong size on BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_D784EC3D42D3956B70F01FACFD3F075D");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_D784EC3D42D3956B70F01FACFD3F075D, EndState) == 0x000000, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_D784EC3D42D3956B70F01FACFD3F075D::EndState' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_D784EC3D42D3956B70F01FACFD3F075D, Actor) == 0x000008, "Member 'BPChar_PetMonkey_Evo2_Gunslinger_C_OnEnd_D784EC3D42D3956B70F01FACFD3F075D::Actor' has a wrong offset!");

}

