#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_AtlasSoldierShared

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function BPChar_AtlasSoldierShared.BPChar_AtlasSoldierShared_C.ExecuteUbergraph_BPChar_AtlasSoldierShared
// 0x0050 (0x0050 - 0x0000)
struct BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStanceChangedEventArgs                K2Node_ComponentBoundEvent_Args;                   // 0x0018(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue1; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue2; // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StanceDataStanceData_ReturnValue3; // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared) == 0x000008, "Wrong alignment on BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared");
static_assert(sizeof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared) == 0x000050, "Wrong size on BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, EntryPoint) == 0x000000, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, K2Node_ComponentBoundEvent_DamageReceiver) == 0x000008, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::K2Node_ComponentBoundEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, K2Node_ComponentBoundEvent_DamageCauser) == 0x000010, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, K2Node_ComponentBoundEvent_Args) == 0x000018, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::K2Node_ComponentBoundEvent_Args' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, CallFunc_EqualEqual_StanceDataStanceData_ReturnValue) == 0x000048, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::CallFunc_EqualEqual_StanceDataStanceData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, CallFunc_EqualEqual_StanceDataStanceData_ReturnValue1) == 0x000049, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::CallFunc_EqualEqual_StanceDataStanceData_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, CallFunc_EqualEqual_StanceDataStanceData_ReturnValue2) == 0x00004A, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::CallFunc_EqualEqual_StanceDataStanceData_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, CallFunc_EqualEqual_StanceDataStanceData_ReturnValue3) == 0x00004B, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::CallFunc_EqualEqual_StanceDataStanceData_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, CallFunc_BooleanOR_ReturnValue) == 0x00004C, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, CallFunc_BooleanOR_ReturnValue1) == 0x00004D, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared, CallFunc_BooleanOR_ReturnValue2) == 0x00004E, "Member 'BPChar_AtlasSoldierShared_C_ExecuteUbergraph_BPChar_AtlasSoldierShared::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");

// Function BPChar_AtlasSoldierShared.BPChar_AtlasSoldierShared_C.BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier
// 0x0010 (0x0010 - 0x0000)
struct BPChar_AtlasSoldierShared_C_BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_AtlasSoldierShared_C_BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier) == 0x000008, "Wrong alignment on BPChar_AtlasSoldierShared_C_BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier");
static_assert(sizeof(BPChar_AtlasSoldierShared_C_BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier) == 0x000010, "Wrong size on BPChar_AtlasSoldierShared_C_BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier, DamageReceiver) == 0x000000, "Member 'BPChar_AtlasSoldierShared_C_BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier::DamageReceiver' has a wrong offset!");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier, DamageCauser) == 0x000008, "Member 'BPChar_AtlasSoldierShared_C_BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_BPChar_AtlasSoldier::DamageCauser' has a wrong offset!");

// Function BPChar_AtlasSoldierShared.BPChar_AtlasSoldierShared_C.BndEvt__Stance_K2Node_ComponentBoundEvent_1_StanceChangedEvent__DelegateSignature_BPChar_AtlasSoldierShared
// 0x0030 (0x0030 - 0x0000)
struct BPChar_AtlasSoldierShared_C_BndEvt__Stance_K2Node_ComponentBoundEvent_1_StanceChangedEvent__DelegateSignature_BPChar_AtlasSoldierShared final
{
public:
	struct FStanceChangedEventArgs                Args;                                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_AtlasSoldierShared_C_BndEvt__Stance_K2Node_ComponentBoundEvent_1_StanceChangedEvent__DelegateSignature_BPChar_AtlasSoldierShared) == 0x000008, "Wrong alignment on BPChar_AtlasSoldierShared_C_BndEvt__Stance_K2Node_ComponentBoundEvent_1_StanceChangedEvent__DelegateSignature_BPChar_AtlasSoldierShared");
static_assert(sizeof(BPChar_AtlasSoldierShared_C_BndEvt__Stance_K2Node_ComponentBoundEvent_1_StanceChangedEvent__DelegateSignature_BPChar_AtlasSoldierShared) == 0x000030, "Wrong size on BPChar_AtlasSoldierShared_C_BndEvt__Stance_K2Node_ComponentBoundEvent_1_StanceChangedEvent__DelegateSignature_BPChar_AtlasSoldierShared");
static_assert(offsetof(BPChar_AtlasSoldierShared_C_BndEvt__Stance_K2Node_ComponentBoundEvent_1_StanceChangedEvent__DelegateSignature_BPChar_AtlasSoldierShared, Args) == 0x000000, "Member 'BPChar_AtlasSoldierShared_C_BndEvt__Stance_K2Node_ComponentBoundEvent_1_StanceChangedEvent__DelegateSignature_BPChar_AtlasSoldierShared::Args' has a wrong offset!");

}

