#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_PetMonkey

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.ExecuteUbergraph_BPChar_PetMonkey
// 0x02B0 (0x02B0 - 0x0000)
struct BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGbxBlackboardKeySelector              K2Node_MakeStruct_GbxBlackboardKeySelector;        // 0x0018(0x0010)(NoDestructor)
	struct FVector                                CallFunc_Setup_for_Throw_Actor_At_TargetLocation;  // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Setup_for_Throw_Actor_At_TargetVelocity;  // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_IO_Combat_Barrel_C> K2Node_DynamicCast_AsBPI_IO_Combat_Barrel;         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakTriggerComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_IO_Combat_Barrel_C> K2Node_DynamicCast_AsBPI_IO_Combat_Barrel1;        // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_IO_Combat_Barrel_C> K2Node_DynamicCast_AsBPI_IO_Combat_Barrel2;        // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable1;                             // 0x0098(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00EC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue1;         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_NewBarrel1;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_NewBarrel;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable2;                             // 0x0140(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_IO_Combat_Barrel_C> K2Node_DynamicCast_AsBPI_IO_Combat_Barrel3;        // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxProjectileMovementComponent*        CallFunc_AddComponent_ReturnValue;                 // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ExplodingObject_Barrel_C*           K2Node_DynamicCast_AsBP_Exploding_Object_Barrel;   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMoveComponentAction                          Temp_byte_Variable;                                // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageComponent*                       K2Node_CustomEvent_DamageReceiver;                 // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x01B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x01C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_CustomEvent_DamageCauser;                   // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_CustomEvent_Details;                        // 0x01D8(0x0058)(ContainsInstancedReference)
	TDelegate<void(class UDamageComponent* DamageReceiver, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, const struct FReceivedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInDownState_ReturnValue;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bForced;                              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPetReleaseReason                             K2Node_Event_Reason;                               // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_IO_Combat_Barrel_C> K2Node_DynamicCast_AsBPI_IO_Combat_Barrel4;        // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_ChildActor;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakDamageComponent*                    CallFunc_GetComponentByClass_ReturnValue1;         // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue1;                      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_ReturnJabbermonGunWeapon_NewWeapon;       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewVisibility;                        // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue4;                // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey) == 0x000010, "Wrong alignment on BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey");
static_assert(sizeof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey) == 0x0002B0, "Wrong size on BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, EntryPoint) == 0x000000, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, Temp_struct_Variable) == 0x000008, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_MakeStruct_GbxBlackboardKeySelector) == 0x000018, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_MakeStruct_GbxBlackboardKeySelector' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_Setup_for_Throw_Actor_At_TargetLocation) == 0x000028, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_Setup_for_Throw_Actor_At_TargetLocation' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_Setup_for_Throw_Actor_At_TargetVelocity) == 0x000034, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_Setup_for_Throw_Actor_At_TargetVelocity' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_AsBPI_IO_Combat_Barrel) == 0x000040, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_AsBPI_IO_Combat_Barrel' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_AsBPI_IO_Combat_Barrel1) == 0x000060, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_AsBPI_IO_Combat_Barrel1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_bSuccess1) == 0x000070, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_AsBPI_IO_Combat_Barrel2) == 0x000078, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_AsBPI_IO_Combat_Barrel2' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_bSuccess2) == 0x000088, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000090, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, Temp_struct_Variable1) == 0x000098, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_GetSocketTransform_ReturnValue) == 0x0000B0, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_BreakTransform_Location) == 0x0000E0, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_BreakTransform_Rotation) == 0x0000EC, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_BreakTransform_Scale) == 0x0000F8, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000108, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_HasAuthority_ReturnValue) == 0x000110, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_K2_GetRootComponent_ReturnValue1) == 0x000118, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_K2_GetRootComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000120, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_Event_NewBarrel1) == 0x000128, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_Event_NewBarrel1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_Event_NewBarrel) == 0x000130, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_Event_NewBarrel' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, Temp_struct_Variable2) == 0x000140, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_AsBPI_IO_Combat_Barrel3) == 0x000170, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_AsBPI_IO_Combat_Barrel3' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_bSuccess3) == 0x000180, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_AddComponent_ReturnValue) == 0x000188, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_IsValid_ReturnValue) == 0x000190, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_IsValid_ReturnValue1) == 0x000191, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_AsBP_Exploding_Object_Barrel) == 0x000198, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_AsBP_Exploding_Object_Barrel' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_bSuccess4) == 0x0001A0, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_HasAuthority_ReturnValue1) == 0x0001A1, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, Temp_byte_Variable) == 0x0001A2, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_CustomEvent_DamageReceiver) == 0x0001A8, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_CustomEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_CustomEvent_Damage) == 0x0001B0, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_CustomEvent_DamageType) == 0x0001B8, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_CustomEvent_DamageSource) == 0x0001C0, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_CustomEvent_InstigatedBy) == 0x0001C8, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_CustomEvent_DamageCauser) == 0x0001D0, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_CustomEvent_Details) == 0x0001D8, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_CreateDelegate_OutputDelegate) == 0x000230, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_IsInDownState_ReturnValue) == 0x000240, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_IsInDownState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_K2Play_ReturnValue) == 0x000248, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_K2Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_CreateDelegate_OutputDelegate1) == 0x000250, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_Event_bForced) == 0x000260, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_Event_bForced' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_Event_Reason) == 0x000261, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_AsBPI_IO_Combat_Barrel4) == 0x000268, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_AsBPI_IO_Combat_Barrel4' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_DynamicCast_bSuccess5) == 0x000278, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_ComponentBoundEvent_ChildActor) == 0x000280, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_ComponentBoundEvent_ChildActor' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_GetComponentByClass_ReturnValue1) == 0x000288, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_K2Play_ReturnValue1) == 0x000290, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_K2Play_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_ReturnJabbermonGunWeapon_NewWeapon) == 0x000298, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_ReturnJabbermonGunWeapon_NewWeapon' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, K2Node_Event_NewVisibility) == 0x0002A0, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::K2Node_Event_NewVisibility' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_Not_PreBool_ReturnValue) == 0x0002A1, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_HasAuthority_ReturnValue2) == 0x0002A2, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_HasAuthority_ReturnValue3) == 0x0002A3, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey, CallFunc_HasAuthority_ReturnValue4) == 0x0002A4, "Member 'BPChar_PetMonkey_C_ExecuteUbergraph_BPChar_PetMonkey::CallFunc_HasAuthority_ReturnValue4' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.PetJabbermon_ChangeGunVis
// 0x0001 (0x0001 - 0x0000)
struct BPChar_PetMonkey_C_PetJabbermon_ChangeGunVis final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_PetMonkey_C_PetJabbermon_ChangeGunVis) == 0x000001, "Wrong alignment on BPChar_PetMonkey_C_PetJabbermon_ChangeGunVis");
static_assert(sizeof(BPChar_PetMonkey_C_PetJabbermon_ChangeGunVis) == 0x000001, "Wrong size on BPChar_PetMonkey_C_PetJabbermon_ChangeGunVis");
static_assert(offsetof(BPChar_PetMonkey_C_PetJabbermon_ChangeGunVis, NewVisibility) == 0x000000, "Member 'BPChar_PetMonkey_C_PetJabbermon_ChangeGunVis::NewVisibility' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.BndEvt__AIHeldActor_K2Node_ComponentBoundEvent_0_GbxChildActorSpawnedSignature__DelegateSignature_BPChar_PetMonkey
// 0x0008 (0x0008 - 0x0000)
struct BPChar_PetMonkey_C_BndEvt__AIHeldActor_K2Node_ComponentBoundEvent_0_GbxChildActorSpawnedSignature__DelegateSignature_BPChar_PetMonkey final
{
public:
	class AActor*                                 ChildActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_C_BndEvt__AIHeldActor_K2Node_ComponentBoundEvent_0_GbxChildActorSpawnedSignature__DelegateSignature_BPChar_PetMonkey) == 0x000008, "Wrong alignment on BPChar_PetMonkey_C_BndEvt__AIHeldActor_K2Node_ComponentBoundEvent_0_GbxChildActorSpawnedSignature__DelegateSignature_BPChar_PetMonkey");
static_assert(sizeof(BPChar_PetMonkey_C_BndEvt__AIHeldActor_K2Node_ComponentBoundEvent_0_GbxChildActorSpawnedSignature__DelegateSignature_BPChar_PetMonkey) == 0x000008, "Wrong size on BPChar_PetMonkey_C_BndEvt__AIHeldActor_K2Node_ComponentBoundEvent_0_GbxChildActorSpawnedSignature__DelegateSignature_BPChar_PetMonkey");
static_assert(offsetof(BPChar_PetMonkey_C_BndEvt__AIHeldActor_K2Node_ComponentBoundEvent_0_GbxChildActorSpawnedSignature__DelegateSignature_BPChar_PetMonkey, ChildActor) == 0x000000, "Member 'BPChar_PetMonkey_C_BndEvt__AIHeldActor_K2Node_ComponentBoundEvent_0_GbxChildActorSpawnedSignature__DelegateSignature_BPChar_PetMonkey::ChildActor' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.OnTakeDamage_PetJabbermonBarrel
// 0x0088 (0x0088 - 0x0000)
struct BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0030(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel) == 0x000008, "Wrong alignment on BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel");
static_assert(sizeof(BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel) == 0x000088, "Wrong size on BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel");
static_assert(offsetof(BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel, DamageReceiver) == 0x000000, "Member 'BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel::DamageReceiver' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel, Damage) == 0x000008, "Member 'BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel::Damage' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel, DamageType) == 0x000010, "Member 'BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel::DamageType' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel, DamageSource) == 0x000018, "Member 'BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel::DamageSource' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel, InstigatedBy) == 0x000020, "Member 'BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel, DamageCauser) == 0x000028, "Member 'BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel::DamageCauser' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel, Details) == 0x000030, "Member 'BPChar_PetMonkey_C_OnTakeDamage_PetJabbermonBarrel::Details' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.PetJabbermon_BarrelSet
// 0x0008 (0x0008 - 0x0000)
struct BPChar_PetMonkey_C_PetJabbermon_BarrelSet final
{
public:
	class AActor*                                 NewBarrel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_C_PetJabbermon_BarrelSet) == 0x000008, "Wrong alignment on BPChar_PetMonkey_C_PetJabbermon_BarrelSet");
static_assert(sizeof(BPChar_PetMonkey_C_PetJabbermon_BarrelSet) == 0x000008, "Wrong size on BPChar_PetMonkey_C_PetJabbermon_BarrelSet");
static_assert(offsetof(BPChar_PetMonkey_C_PetJabbermon_BarrelSet, NewBarrel) == 0x000000, "Member 'BPChar_PetMonkey_C_PetJabbermon_BarrelSet::NewBarrel' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.PetJabbermon_BarrelAlign
// 0x0008 (0x0008 - 0x0000)
struct BPChar_PetMonkey_C_PetJabbermon_BarrelAlign final
{
public:
	class AActor*                                 NewBarrel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_C_PetJabbermon_BarrelAlign) == 0x000008, "Wrong alignment on BPChar_PetMonkey_C_PetJabbermon_BarrelAlign");
static_assert(sizeof(BPChar_PetMonkey_C_PetJabbermon_BarrelAlign) == 0x000008, "Wrong size on BPChar_PetMonkey_C_PetJabbermon_BarrelAlign");
static_assert(offsetof(BPChar_PetMonkey_C_PetJabbermon_BarrelAlign, NewBarrel) == 0x000000, "Member 'BPChar_PetMonkey_C_PetJabbermon_BarrelAlign::NewBarrel' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.ReturnJabbermonGunWeapon
// 0x0010 (0x0010 - 0x0000)
struct BPChar_PetMonkey_C_ReturnJabbermonGunWeapon final
{
public:
	class AWeapon*                                NewWeapon;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_C_ReturnJabbermonGunWeapon) == 0x000008, "Wrong alignment on BPChar_PetMonkey_C_ReturnJabbermonGunWeapon");
static_assert(sizeof(BPChar_PetMonkey_C_ReturnJabbermonGunWeapon) == 0x000010, "Wrong size on BPChar_PetMonkey_C_ReturnJabbermonGunWeapon");
static_assert(offsetof(BPChar_PetMonkey_C_ReturnJabbermonGunWeapon, NewWeapon) == 0x000000, "Member 'BPChar_PetMonkey_C_ReturnJabbermonGunWeapon::NewWeapon' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ReturnJabbermonGunWeapon, CallFunc_GetWeapon_ReturnValue) == 0x000008, "Member 'BPChar_PetMonkey_C_ReturnJabbermonGunWeapon::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.OnRep_Ape_Barrel_Held
// 0x0001 (0x0001 - 0x0000)
struct BPChar_PetMonkey_C_OnRep_Ape_Barrel_Held final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPChar_PetMonkey_C_OnRep_Ape_Barrel_Held) == 0x000001, "Wrong alignment on BPChar_PetMonkey_C_OnRep_Ape_Barrel_Held");
static_assert(sizeof(BPChar_PetMonkey_C_OnRep_Ape_Barrel_Held) == 0x000001, "Wrong size on BPChar_PetMonkey_C_OnRep_Ape_Barrel_Held");
static_assert(offsetof(BPChar_PetMonkey_C_OnRep_Ape_Barrel_Held, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BPChar_PetMonkey_C_OnRep_Ape_Barrel_Held::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.ClearBarrelStanceAndBB
// 0x0018 (0x0018 - 0x0000)
struct BPChar_PetMonkey_C_ClearBarrelStanceAndBB final
{
public:
	struct FGbxBlackboardKeySelector              K2Node_MakeStruct_GbxBlackboardKeySelector;        // 0x0000(0x0010)(NoDestructor)
	class UBlackboardComponent*                   CallFunc_GetBlackboardComponent_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_C_ClearBarrelStanceAndBB) == 0x000008, "Wrong alignment on BPChar_PetMonkey_C_ClearBarrelStanceAndBB");
static_assert(sizeof(BPChar_PetMonkey_C_ClearBarrelStanceAndBB) == 0x000018, "Wrong size on BPChar_PetMonkey_C_ClearBarrelStanceAndBB");
static_assert(offsetof(BPChar_PetMonkey_C_ClearBarrelStanceAndBB, K2Node_MakeStruct_GbxBlackboardKeySelector) == 0x000000, "Member 'BPChar_PetMonkey_C_ClearBarrelStanceAndBB::K2Node_MakeStruct_GbxBlackboardKeySelector' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_ClearBarrelStanceAndBB, CallFunc_GetBlackboardComponent_ReturnValue) == 0x000010, "Member 'BPChar_PetMonkey_C_ClearBarrelStanceAndBB::CallFunc_GetBlackboardComponent_ReturnValue' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.OnPetReleased
// 0x0002 (0x0002 - 0x0000)
struct BPChar_PetMonkey_C_OnPetReleased final
{
public:
	bool                                          bForced;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPetReleaseReason                             Reason;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_C_OnPetReleased) == 0x000001, "Wrong alignment on BPChar_PetMonkey_C_OnPetReleased");
static_assert(sizeof(BPChar_PetMonkey_C_OnPetReleased) == 0x000002, "Wrong size on BPChar_PetMonkey_C_OnPetReleased");
static_assert(offsetof(BPChar_PetMonkey_C_OnPetReleased, bForced) == 0x000000, "Member 'BPChar_PetMonkey_C_OnPetReleased::bForced' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_OnPetReleased, Reason) == 0x000001, "Member 'BPChar_PetMonkey_C_OnPetReleased::Reason' has a wrong offset!");

// Function BPChar_PetMonkey.BPChar_PetMonkey_C.GetPetJabberIngenuityBarrel
// 0x0010 (0x0010 - 0x0000)
struct BPChar_PetMonkey_C_GetPetJabberIngenuityBarrel final
{
public:
	class AActor*                                 Barrel;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetPetJabberIngenuityBarrel_Barrel;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_PetMonkey_C_GetPetJabberIngenuityBarrel) == 0x000008, "Wrong alignment on BPChar_PetMonkey_C_GetPetJabberIngenuityBarrel");
static_assert(sizeof(BPChar_PetMonkey_C_GetPetJabberIngenuityBarrel) == 0x000010, "Wrong size on BPChar_PetMonkey_C_GetPetJabberIngenuityBarrel");
static_assert(offsetof(BPChar_PetMonkey_C_GetPetJabberIngenuityBarrel, Barrel) == 0x000000, "Member 'BPChar_PetMonkey_C_GetPetJabberIngenuityBarrel::Barrel' has a wrong offset!");
static_assert(offsetof(BPChar_PetMonkey_C_GetPetJabberIngenuityBarrel, CallFunc_GetPetJabberIngenuityBarrel_Barrel) == 0x000008, "Member 'BPChar_PetMonkey_C_GetPetJabberIngenuityBarrel::CallFunc_GetPetJabberIngenuityBarrel_Barrel' has a wrong offset!");

}

