#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_LeagueNPC_Maurice_VDay

#include "Basic.hpp"

#include "GbxMission_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function BPChar_LeagueNPC_Maurice_VDay.BPChar_LeagueNPC_Maurice_VDay_C.ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay
// 0x0478 (0x0478 - 0x0000)
struct BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	EMissionActiveResult                          CallFunc_IsAnyMissionActive_OutResult;             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0224(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0236(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_237[0x1];                                      // 0x0237(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0238(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x0450(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_ComponentBoundEvent_UserController;         // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent;          // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay) == 0x000008, "Wrong alignment on BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay");
static_assert(sizeof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay) == 0x000478, "Wrong size on BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, EntryPoint) == 0x000000, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_IsAnyMissionActive_OutResult) == 0x000220, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_IsAnyMissionActive_OutResult' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_FinishTriggerDialog_Conversation) == 0x000224, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_FinishTriggerDialog_SequenceID) == 0x000230, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000234, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, K2Node_SwitchEnum_CmpSuccess) == 0x000235, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_Conv_IntToBool_ReturnValue) == 0x000236, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_NewDialogContext_ReturnValue1) == 0x000238, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_FinishTriggerDialog_Conversation1) == 0x000450, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_FinishTriggerDialog_SequenceID1) == 0x00045C, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x000460, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000461, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, K2Node_ComponentBoundEvent_UserController) == 0x000468, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::K2Node_ComponentBoundEvent_UserController' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay, K2Node_ComponentBoundEvent_UsedComponent) == 0x000470, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_ExecuteUbergraph_BPChar_LeagueNPC_Maurice_VDay::K2Node_ComponentBoundEvent_UsedComponent' has a wrong offset!");

// Function BPChar_LeagueNPC_Maurice_VDay.BPChar_LeagueNPC_Maurice_VDay_C.BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child
// 0x0010 (0x0010 - 0x0000)
struct BPChar_LeagueNPC_Maurice_VDay_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPChar_LeagueNPC_Maurice_VDay_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child) == 0x000008, "Wrong alignment on BPChar_LeagueNPC_Maurice_VDay_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child");
static_assert(sizeof(BPChar_LeagueNPC_Maurice_VDay_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child) == 0x000010, "Wrong size on BPChar_LeagueNPC_Maurice_VDay_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child, UserController) == 0x000000, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child::UserController' has a wrong offset!");
static_assert(offsetof(BPChar_LeagueNPC_Maurice_VDay_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child, UsedComponent) == 0x000008, "Member 'BPChar_LeagueNPC_Maurice_VDay_C_BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_SeasonalSaurian_Child::UsedComponent' has a wrong offset!");

}

