#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_HeavyGunner

#include "Basic.hpp"

#include "Enum_Heavy_WeaponSocket_structs.hpp"
#include "Engine_structs.hpp"
#include "BPChar_Heavy_Shared_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPChar_HeavyGunner.BPChar_HeavyGunner_C
// 0x0010 (0x27B0 - 0x27A0)
class ABPChar_HeavyGunner_C final : public ABPChar_Heavy_Shared_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPChar_HeavyGunner_C;               // 0x2798(0x0008)(Transient, DuplicateTransient)
	class UOakAIWeaponUserComponent*              OakAIWeaponUser;                                   // 0x27A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               JetFire;                                           // 0x27A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPChar_HeavyGunner(int32 EntryPoint);
	void Heavy_BlastShot(class AActor* ProjectileTarget, class FName WeaponSocket);
	void Heavy_FireBeam_Stop(bool IsNavAnim);
	void Heavy_FireBeam_Start(Enum_Heavy_WeaponSocket WeaponSocket, bool IsNavAnim);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPChar_HeavyGunner_C">();
	}
	static class ABPChar_HeavyGunner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPChar_HeavyGunner_C>();
	}
};
static_assert(alignof(ABPChar_HeavyGunner_C) == 0x000010, "Wrong alignment on ABPChar_HeavyGunner_C");
static_assert(sizeof(ABPChar_HeavyGunner_C) == 0x0027B0, "Wrong size on ABPChar_HeavyGunner_C");
static_assert(offsetof(ABPChar_HeavyGunner_C, UberGraphFrame_BPChar_HeavyGunner_C) == 0x002798, "Member 'ABPChar_HeavyGunner_C::UberGraphFrame_BPChar_HeavyGunner_C' has a wrong offset!");
static_assert(offsetof(ABPChar_HeavyGunner_C, OakAIWeaponUser) == 0x0027A0, "Member 'ABPChar_HeavyGunner_C::OakAIWeaponUser' has a wrong offset!");
static_assert(offsetof(ABPChar_HeavyGunner_C, JetFire) == 0x0027A8, "Member 'ABPChar_HeavyGunner_C::JetFire' has a wrong offset!");

}

