#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_Ellie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPChar_NonPlayerCharacter_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPChar_Ellie.BPChar_Ellie_C
// 0x0050 (0x25E0 - 0x2590)
class ABPChar_Ellie_C final : public ABPChar_NonPlayerCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPChar_Ellie_C;                     // 0x2590(0x0008)(Transient, DuplicateTransient)
	class UWwiseAudioComponent*                   DefaultAudioComponent;                             // 0x2598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFaceFXComponent*                       FaceFX;                                            // 0x25A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFoleyMainComponent*                    FoleyMain;                                         // 0x25A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SetScaleOverTimeExit__Direction_C25001074289D71C75D69183BBFB6A36; // 0x25B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B1[0x7];                                     // 0x25B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SetScaleOverTimeExit;                              // 0x25B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SetScaleOverTimeEnter__Direction_E95033444EE14DBE589A85B37047BB59; // 0x25C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C1[0x7];                                     // 0x25C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SetScaleOverTimeEnter;                             // 0x25C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAtDistance;                                    // 0x25D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_1;                                          // 0x25D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxCondition*                          MissionAvailablePandorasNTMP;                      // 0x25D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void BndEvt__Usable_K2Node_ComponentBoundEvent_24_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Typhon_UNIX1509007700(class AController* UserController, class UPrimitiveComponent* UsedComponent);
	void ReceiveBeginPlay();
	void SetScaleOverTimeEnter__FinishedFunc();
	void SetScaleOverTimeEnter__UpdateFunc();
	void SetScaleOverTimeExit__FinishedFunc();
	void SetScaleOverTimeExit__UpdateFunc();
	void OnEnterVehicle(const class UPawnAttachSlotComponent* PawnAttachSlotComponent);
	void CustomEvent(const class UPawnAttachSlotComponent* PawnAttachSlotComponent);
	void ExecuteUbergraph_BPChar_Ellie(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPChar_Ellie_C">();
	}
	static class ABPChar_Ellie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPChar_Ellie_C>();
	}
};
static_assert(alignof(ABPChar_Ellie_C) == 0x000010, "Wrong alignment on ABPChar_Ellie_C");
static_assert(sizeof(ABPChar_Ellie_C) == 0x0025E0, "Wrong size on ABPChar_Ellie_C");
static_assert(offsetof(ABPChar_Ellie_C, UberGraphFrame_BPChar_Ellie_C) == 0x002590, "Member 'ABPChar_Ellie_C::UberGraphFrame_BPChar_Ellie_C' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, DefaultAudioComponent) == 0x002598, "Member 'ABPChar_Ellie_C::DefaultAudioComponent' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, FaceFX) == 0x0025A0, "Member 'ABPChar_Ellie_C::FaceFX' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, FoleyMain) == 0x0025A8, "Member 'ABPChar_Ellie_C::FoleyMain' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, SetScaleOverTimeExit__Direction_C25001074289D71C75D69183BBFB6A36) == 0x0025B0, "Member 'ABPChar_Ellie_C::SetScaleOverTimeExit__Direction_C25001074289D71C75D69183BBFB6A36' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, SetScaleOverTimeExit) == 0x0025B8, "Member 'ABPChar_Ellie_C::SetScaleOverTimeExit' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, SetScaleOverTimeEnter__Direction_E95033444EE14DBE589A85B37047BB59) == 0x0025C0, "Member 'ABPChar_Ellie_C::SetScaleOverTimeEnter__Direction_E95033444EE14DBE589A85B37047BB59' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, SetScaleOverTimeEnter) == 0x0025C8, "Member 'ABPChar_Ellie_C::SetScaleOverTimeEnter' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, LookAtDistance) == 0x0025D0, "Member 'ABPChar_Ellie_C::LookAtDistance' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, NewVar_1) == 0x0025D4, "Member 'ABPChar_Ellie_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ABPChar_Ellie_C, MissionAvailablePandorasNTMP) == 0x0025D8, "Member 'ABPChar_Ellie_C::MissionAvailablePandorasNTMP' has a wrong offset!");

}

