#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_Saurian_Shared

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "BPChar_Enemy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPChar_Saurian_Shared.BPChar_Saurian_Shared_C
// 0x0030 (0x23C0 - 0x2390)
#pragma pack(push, 0x1)
class alignas(0x10) ABPChar_Saurian_Shared_C : public ABPChar_Enemy_C
{
public:
	uint8                                         Pad_2381[0x7];                                     // 0x2381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BPChar_Saurian_Shared_C;            // 0x2388(0x0008)(Transient, DuplicateTransient)
	class UFoleyMainComponent*                    FoleyMain;                                         // 0x2390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             ElementalType;                                     // 0x2398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2399[0x7];                                     // 0x2399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Variant;                                           // 0x23A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UOakCapsuleComponent*>           AuxiliaryCollision;                                // 0x23A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BPChar_Saurian_Shared(int32 EntryPoint);
	void BndEvt__OakDamageComponent_K2Node_ComponentBoundEvent_0_DamageCompDiedDelegate__DelegateSignature_BPChar_Saurian_Shared(class AActor* DamageReceiver, class AActor* DamageCauser);
	void Player_HealthDepleted(class AOakCharacter* Character);
	void ReceiveBeginPlay();
	void SaurianTargetChanged(class AActor* TargetActor);
	void SetSlaughterWeaponState(bool Active);
	void TyrantFootstep(bool IsLeft);
	void SetCustomCritEnabled(bool Enabled);
	void TailGrenadeThrown();
	void UserConstructionScript();
	void DisableAuxiliaryCollision();
	void GetVariant(class FName* Variant_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPChar_Saurian_Shared_C">();
	}
	static class ABPChar_Saurian_Shared_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPChar_Saurian_Shared_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABPChar_Saurian_Shared_C) == 0x000010, "Wrong alignment on ABPChar_Saurian_Shared_C");
static_assert(sizeof(ABPChar_Saurian_Shared_C) == 0x0023C0, "Wrong size on ABPChar_Saurian_Shared_C");
static_assert(offsetof(ABPChar_Saurian_Shared_C, UberGraphFrame_BPChar_Saurian_Shared_C) == 0x002388, "Member 'ABPChar_Saurian_Shared_C::UberGraphFrame_BPChar_Saurian_Shared_C' has a wrong offset!");
static_assert(offsetof(ABPChar_Saurian_Shared_C, FoleyMain) == 0x002390, "Member 'ABPChar_Saurian_Shared_C::FoleyMain' has a wrong offset!");
static_assert(offsetof(ABPChar_Saurian_Shared_C, ElementalType) == 0x002398, "Member 'ABPChar_Saurian_Shared_C::ElementalType' has a wrong offset!");
static_assert(offsetof(ABPChar_Saurian_Shared_C, Variant) == 0x0023A0, "Member 'ABPChar_Saurian_Shared_C::Variant' has a wrong offset!");
static_assert(offsetof(ABPChar_Saurian_Shared_C, AuxiliaryCollision) == 0x0023A8, "Member 'ABPChar_Saurian_Shared_C::AuxiliaryCollision' has a wrong offset!");

}

