#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPChar_IronBear

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function BPChar_IronBear.BPChar_IronBear_C.ExecuteUbergraph_BPChar_IronBear
// 0x0AC0 (0x0AC0 - 0x0000)
struct BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EGbxActionEndState                            K2Node_CustomEvent_EndState;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor1;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGbxActionEndState EndState, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0048(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable1;                             // 0x00E0(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable2;                             // 0x0170(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1; // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable3;                             // 0x0190(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable4;                             // 0x01A0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActionRegister>             Temp_struct_Variable5;                             // 0x01B8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInstantExit;                         // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_OldController;                        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCoreActive_ReturnValue;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTask_PlayGbxAction*            CallFunc_PlayGbxAction_ReturnValue;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSurpriseForYouTarget_AsActor;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartControlledMove_ReturnValue;          // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxActionEndState                            Temp_byte_Variable1;                               // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable1;                             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHealthy_ReturnValue;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_KickPlayerOutOfGunnersNest_Delay;         // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_PlayGbxAction*            CallFunc_PlayGbxAction_ReturnValue1;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTask_PlayGbxAction*            CallFunc_PlayGbxAction_ReturnValue2;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BootGunnersNestOccupant_Delay;            // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxActionEndState                            K2Node_CustomEvent_EndState1;                      // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor2;                         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGbxActionEndState EndState, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_RepDelay;                       // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver1;        // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser1;          // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCoreActive_ReturnValue1;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCoreActive_ReturnValue2;                // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0290(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsActorBeingDestroyed_ReturnValue;        // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x02A8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_StartControlledMove_ReturnValue1;         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver;         // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Damage;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_ComponentBoundEvent_DamageType;             // 0x0350(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_ComponentBoundEvent_DamageSource;           // 0x0358(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_ComponentBoundEvent_InstigatedBy;           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_ComponentBoundEvent_Details;                // 0x0370(0x0058)(ContainsInstancedReference)
	float                                         CallFunc_GetCurrentHealth_ReturnValue;             // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable6;                             // 0x03D0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            Temp_byte_Variable2;                               // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable2;                             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_CustomEvent_EndState2;                      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor3;                         // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGbxActionEndState EndState, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0410(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue1;         // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EIronBearHardPointOrientation                 K2Node_Event_HardpointOrientation;                 // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_423[0x5];                                      // 0x0423(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue;     // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0430(0x0018)()
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue1;    // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue2;    // 0x0450(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x0458(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue2;              // 0x0470(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue3;              // 0x0488(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x04A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x04B0(0x0218)()
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x06C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA[0x6];                                      // 0x06CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter_Player*                   K2Node_Event_InGunner;                             // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x06D8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x08F0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x08FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0901(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_902[0x2];                                      // 0x0902(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x0904(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x0914(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0915(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_916[0x2];                                      // 0x0916(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91C[0x4];                                      // 0x091C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponSlotData*                        CallFunc_Array_Get_Item;                           // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_931[0x7];                                      // 0x0931(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponFireComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0938(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Enabled;                              // 0x0941(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942[0x6];                                      // 0x0942(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue1;               // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0950(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0960(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x096C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D[0x3];                                      // 0x096D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0970(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue1;         // 0x0A00(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPEventHub_Gunner_C*                   K2Node_DynamicCast_AsBPEvent_Hub_Gunner;           // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11[0x7];                                      // 0x0A11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0A18(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsOccupied_ReturnValue;                   // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0A29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue2;         // 0x0A2A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue3;         // 0x0A2B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2C[0x4];                                      // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakCharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue2;         // 0x0A38(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0A41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A42[0x2];                                      // 0x0A42(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0A44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue1;                      // 0x0A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PerformPlayerMelee_ReturnValue;           // 0x0A50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x0A51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAttributeModifierActionExecOutput         CallFunc_ApplyAttributeEffect_ModifierActionResult; // 0x0A52(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A53[0x5];                                      // 0x0A53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeModifierHandle            CallFunc_ApplyAttributeEffect_ReturnValue;         // 0x0A58(0x0010)()
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A69[0x7];                                      // 0x0A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0A70(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsWalking_ReturnValue;                    // 0x0A80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A81[0x7];                                      // 0x0A81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue2;               // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue3;         // 0x0A90(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0A98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0A9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9D[0x3];                                      // 0x0A9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0AA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA4[0x4];                                      // 0x0AA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0AA8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0AB8(0x0008)(NoDestructor)
};
static_assert(alignof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear) == 0x000008, "Wrong alignment on BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear");
static_assert(sizeof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear) == 0x000AC0, "Wrong size on BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, EntryPoint) == 0x000000, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CustomEvent_EndState) == 0x000018, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CustomEvent_EndState' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CustomEvent_Actor1) == 0x000020, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CustomEvent_Actor1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_object_Variable) == 0x000038, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_byte_Variable) == 0x000040, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_struct_Variable) == 0x000048, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_SwitchEnum_CmpSuccess) == 0x0000D8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_struct_Variable1) == 0x0000E0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_struct_Variable2) == 0x000170, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_Variable) == 0x000180, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_float_Variable) == 0x000184, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_float_Variable1) == 0x000188, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x00018C, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_Has_Been_Initd_Variable) == 0x00018D, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_IsClosed_Variable) == 0x00018E, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1) == 0x00018F, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_struct_Variable3) == 0x000190, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_struct_Variable4) == 0x0001A0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_Has_Been_Initd_Variable1) == 0x0001B0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_struct_Variable5) == 0x0001B8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_HasAuthority_ReturnValue) == 0x0001C8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_Event_bInstantExit) == 0x0001C9, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_Event_bInstantExit' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_Has_Been_Initd_Variable2) == 0x0001CA, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_Event_OldController) == 0x0001D0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_Event_OldController' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsCoreActive_ReturnValue) == 0x0001D8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsCoreActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_PlayGbxAction_ReturnValue) == 0x0001E0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_PlayGbxAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_GetSurpriseForYouTarget_AsActor) == 0x0001E8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_GetSurpriseForYouTarget_AsActor' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsValid_ReturnValue) == 0x0001F0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsValid_ReturnValue1) == 0x0001F1, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_GetDistanceTo_ReturnValue) == 0x0001F4, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_GetInstigator_ReturnValue) == 0x0001F8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000200, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_StartControlledMove_ReturnValue) == 0x000201, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_StartControlledMove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_BooleanAND_ReturnValue) == 0x000202, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsLocallyControlled_ReturnValue) == 0x000203, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_byte_Variable1) == 0x000204, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_object_Variable1) == 0x000208, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsHealthy_ReturnValue) == 0x000210, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsHealthy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_BooleanAND_ReturnValue1) == 0x000211, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_KickPlayerOutOfGunnersNest_Delay) == 0x000214, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_KickPlayerOutOfGunnersNest_Delay' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_PlayGbxAction_ReturnValue1) == 0x000218, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_PlayGbxAction_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsValid_ReturnValue2) == 0x000220, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_PlayGbxAction_ReturnValue2) == 0x000228, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_PlayGbxAction_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_BootGunnersNestOccupant_Delay) == 0x000230, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_BootGunnersNestOccupant_Delay' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsValid_ReturnValue3) == 0x000234, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CustomEvent_EndState1) == 0x000235, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CustomEvent_EndState1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CustomEvent_Actor2) == 0x000238, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CustomEvent_Actor2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CreateDelegate_OutputDelegate2) == 0x000240, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_IsClosed_Variable1) == 0x000250, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_IsClosed_Variable2) == 0x000251, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CustomEvent_RepDelay) == 0x000254, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CustomEvent_RepDelay' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CustomEvent_Actor) == 0x000258, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CustomEvent_ActionAbility) == 0x000260, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CustomEvent_ActionAbility' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsValid_ReturnValue4) == 0x000268, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_Array_Length_ReturnValue) == 0x00026C, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_GetAssociatedPlayerController_ReturnValue) == 0x000270, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_GetAssociatedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_ComponentBoundEvent_DamageReceiver1) == 0x000278, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_ComponentBoundEvent_DamageReceiver1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_ComponentBoundEvent_DamageCauser1) == 0x000280, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_ComponentBoundEvent_DamageCauser1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsCoreActive_ReturnValue1) == 0x000288, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsCoreActive_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsCoreActive_ReturnValue2) == 0x000289, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsCoreActive_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_Not_PreBool_ReturnValue) == 0x00028A, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_BooleanAND_ReturnValue2) == 0x00028B, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CreateDelegate_OutputDelegate3) == 0x000290, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsActorBeingDestroyed_ReturnValue) == 0x0002A0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsActorBeingDestroyed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_Event_Hit) == 0x0002A8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_StartControlledMove_ReturnValue1) == 0x000338, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_StartControlledMove_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_ComponentBoundEvent_DamageReceiver) == 0x000340, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_ComponentBoundEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_ComponentBoundEvent_Damage) == 0x000348, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_ComponentBoundEvent_Damage' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_ComponentBoundEvent_DamageType) == 0x000350, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_ComponentBoundEvent_DamageType' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_ComponentBoundEvent_DamageSource) == 0x000358, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_ComponentBoundEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_ComponentBoundEvent_InstigatedBy) == 0x000360, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_ComponentBoundEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_ComponentBoundEvent_DamageCauser) == 0x000368, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_ComponentBoundEvent_Details) == 0x000370, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_ComponentBoundEvent_Details' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_GetCurrentHealth_ReturnValue) == 0x0003C8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_GetCurrentHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0003CC, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_struct_Variable6) == 0x0003D0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0003E0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_K2Play_ReturnValue) == 0x0003E8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_K2Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_byte_Variable2) == 0x0003F0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_object_Variable2) == 0x0003F8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CustomEvent_EndState2) == 0x000400, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CustomEvent_EndState2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CustomEvent_Actor3) == 0x000408, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CustomEvent_Actor3' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CreateDelegate_OutputDelegate4) == 0x000410, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsLocallyControlled_ReturnValue1) == 0x000420, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsLocallyControlled_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_SwitchEnum1_CmpSuccess) == 0x000421, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_Event_HardpointOrientation) == 0x000422, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_Event_HardpointOrientation' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_GetDefaultWwiseComponent_ReturnValue) == 0x000428, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_GetDefaultWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_PostWwiseEvent_ReturnValue) == 0x000430, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_GetDefaultWwiseComponent_ReturnValue1) == 0x000448, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_GetDefaultWwiseComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_GetDefaultWwiseComponent_ReturnValue2) == 0x000450, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_GetDefaultWwiseComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_PostWwiseEvent_ReturnValue1) == 0x000458, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_PostWwiseEvent_ReturnValue2) == 0x000470, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_PostWwiseEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_PostWwiseEvent_ReturnValue3) == 0x000488, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_PostWwiseEvent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_CreateDelegate_OutputDelegate5) == 0x0004A0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_NewDialogContext_ReturnValue) == 0x0004B0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_IsValid_ReturnValue5) == 0x0006C8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_bool_Has_Been_Initd_Variable3) == 0x0006C9, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, K2Node_Event_InGunner) == 0x0006D0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::K2Node_Event_InGunner' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_NewDialogContext_ReturnValue1) == 0x0006D8, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_FinishTriggerDialog_Conversation) == 0x0008F0, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_FinishTriggerDialog_SequenceID) == 0x0008FC, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000900, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_Conv_IntToBool_ReturnValue) == 0x000901, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_FinishTriggerDialog_Conversation1) == 0x000904, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_FinishTriggerDialog_SequenceID1) == 0x000910, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x000914, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000915, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear, Temp_int_Array_Index_Variable) == 0x000918, "Member 'BPChar_IronBear_C_ExecuteUbergraph_BPChar_IronBear::Temp_int_Array_Index_Variable' has a wrong offset!");
