#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCont_Tediore_FriendZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPCont_AI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPCont_Tediore_FriendZone.BPCont_Tediore_FriendZone_C
// 0x0018 (0x0790 - 0x0778)
class ABPCont_Tediore_FriendZone_C final : public ABPCont_AI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(Transient, DuplicateTransient)
	bool                                          bCanShoot;                                         // 0x0780(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bCanWalk;                                          // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Targeting_K2Node_ComponentBoundEvent_4_TargetingComponentTargetListChangedSignature__DelegateSignature_BPCont_TedioreTurret(class UTargetingComponent* TargetingComponent_0);
	void ExecuteUbergraph_BPCont_Tediore_FriendZone(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPCont_Tediore_FriendZone_C">();
	}
	static class ABPCont_Tediore_FriendZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPCont_Tediore_FriendZone_C>();
	}
};
static_assert(alignof(ABPCont_Tediore_FriendZone_C) == 0x000008, "Wrong alignment on ABPCont_Tediore_FriendZone_C");
static_assert(sizeof(ABPCont_Tediore_FriendZone_C) == 0x000790, "Wrong size on ABPCont_Tediore_FriendZone_C");
static_assert(offsetof(ABPCont_Tediore_FriendZone_C, UberGraphFrame) == 0x000778, "Member 'ABPCont_Tediore_FriendZone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPCont_Tediore_FriendZone_C, bCanShoot) == 0x000780, "Member 'ABPCont_Tediore_FriendZone_C::bCanShoot' has a wrong offset!");
static_assert(offsetof(ABPCont_Tediore_FriendZone_C, bCanWalk) == 0x000788, "Member 'ABPCont_Tediore_FriendZone_C::bCanWalk' has a wrong offset!");

}

