#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCont_Heavy

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPCont_Heavy.BPCont_Heavy_C.ExecuteUbergraph_BPCont_Heavy
// 0x0038 (0x0038 - 0x0000)
struct BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared;             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTargetingComponent*                    K2Node_ComponentBoundEvent_TargetingComponent;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBestTargetActor_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy) == 0x000008, "Wrong alignment on BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy");
static_assert(sizeof(BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy) == 0x000038, "Wrong size on BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy");
static_assert(offsetof(BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy, EntryPoint) == 0x000000, "Member 'BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy, K2Node_DynamicCast_AsBPI_Heavy_Shared) == 0x000010, "Member 'BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy::K2Node_DynamicCast_AsBPI_Heavy_Shared' has a wrong offset!");
static_assert(offsetof(BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy, K2Node_ComponentBoundEvent_TargetingComponent) == 0x000028, "Member 'BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy::K2Node_ComponentBoundEvent_TargetingComponent' has a wrong offset!");
static_assert(offsetof(BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy, CallFunc_GetBestTargetActor_ReturnValue) == 0x000030, "Member 'BPCont_Heavy_C_ExecuteUbergraph_BPCont_Heavy::CallFunc_GetBestTargetActor_ReturnValue' has a wrong offset!");

// Function BPCont_Heavy.BPCont_Heavy_C.BndEvt__Targeting_K2Node_ComponentBoundEvent_0_TargetingComponentTargetListChangedSignature__DelegateSignature_BPCont_Heavy
// 0x0008 (0x0008 - 0x0000)
struct BPCont_Heavy_C_BndEvt__Targeting_K2Node_ComponentBoundEvent_0_TargetingComponentTargetListChangedSignature__DelegateSignature_BPCont_Heavy final
{
public:
	class UTargetingComponent*                    TargetingComponent_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCont_Heavy_C_BndEvt__Targeting_K2Node_ComponentBoundEvent_0_TargetingComponentTargetListChangedSignature__DelegateSignature_BPCont_Heavy) == 0x000008, "Wrong alignment on BPCont_Heavy_C_BndEvt__Targeting_K2Node_ComponentBoundEvent_0_TargetingComponentTargetListChangedSignature__DelegateSignature_BPCont_Heavy");
static_assert(sizeof(BPCont_Heavy_C_BndEvt__Targeting_K2Node_ComponentBoundEvent_0_TargetingComponentTargetListChangedSignature__DelegateSignature_BPCont_Heavy) == 0x000008, "Wrong size on BPCont_Heavy_C_BndEvt__Targeting_K2Node_ComponentBoundEvent_0_TargetingComponentTargetListChangedSignature__DelegateSignature_BPCont_Heavy");
static_assert(offsetof(BPCont_Heavy_C_BndEvt__Targeting_K2Node_ComponentBoundEvent_0_TargetingComponentTargetListChangedSignature__DelegateSignature_BPCont_Heavy, TargetingComponent_0) == 0x000000, "Member 'BPCont_Heavy_C_BndEvt__Targeting_K2Node_ComponentBoundEvent_0_TargetingComponentTargetListChangedSignature__DelegateSignature_BPCont_Heavy::TargetingComponent_0' has a wrong offset!");

}

