#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCryoFreezeComponent

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPCryoFreezeComponent.BPCryoFreezeComponent_C.ExecuteUbergraph_BPCryoFreezeComponent
// 0x0070 (0x0070 - 0x0000)
struct BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FVector& FractureCentroid, struct FVector& HitDirection, float FracturePercent, bool bSilentFracture)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                K2Node_CustomEvent_FractureCentroid;               // 0x0018(0x000C)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitDirection;                   // 0x0024(0x000C)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FracturePercent;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSilentFracture;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0038(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseAudioComponent*                   CallFunc_SpawnWwiseComponentAtLocation_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0058(0x0018)()
};
static_assert(alignof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent) == 0x000008, "Wrong alignment on BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent");
static_assert(sizeof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent) == 0x000070, "Wrong size on BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, EntryPoint) == 0x000000, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, K2Node_CustomEvent_FractureCentroid) == 0x000018, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::K2Node_CustomEvent_FractureCentroid' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, K2Node_CustomEvent_HitDirection) == 0x000024, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::K2Node_CustomEvent_HitDirection' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, K2Node_CustomEvent_FracturePercent) == 0x000030, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::K2Node_CustomEvent_FracturePercent' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, K2Node_CustomEvent_bSilentFracture) == 0x000034, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::K2Node_CustomEvent_bSilentFracture' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000038, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, CallFunc_SpawnWwiseComponentAtLocation_ReturnValue) == 0x000048, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::CallFunc_SpawnWwiseComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent, CallFunc_PostWwiseEvent_ReturnValue) == 0x000058, "Member 'BPCryoFreezeComponent_C_ExecuteUbergraph_BPCryoFreezeComponent::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");

// Function BPCryoFreezeComponent.BPCryoFreezeComponent_C.OnGbxComponentFracture_Event_0
// 0x0020 (0x0020 - 0x0000)
struct BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0 final
{
public:
	struct FVector                                FractureCentroid;                                  // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitDirection;                                      // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FracturePercent;                                   // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSilentFracture;                                   // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0) == 0x000004, "Wrong alignment on BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0");
static_assert(sizeof(BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0) == 0x000020, "Wrong size on BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0");
static_assert(offsetof(BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0, FractureCentroid) == 0x000000, "Member 'BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0::FractureCentroid' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0, HitDirection) == 0x00000C, "Member 'BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0::HitDirection' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0, FracturePercent) == 0x000018, "Member 'BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0::FracturePercent' has a wrong offset!");
static_assert(offsetof(BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0, bSilentFracture) == 0x00001C, "Member 'BPCryoFreezeComponent_C_OnGbxComponentFracture_Event_0::bSilentFracture' has a wrong offset!");

}

