#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPEventHub_Siren

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "EPhasetranceAttackAction_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPEventHub_Siren.BPEventHub_Siren_C
// 0x0080 (0x0118 - 0x0098)
class UBPEventHub_Siren_C final : public UOakPlayerAbilityEventHub_Siren
{
public:
	UMulticastDelegateProperty_                   SkillEvent_ActivateRushBonus;                      // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   SkillEvent_RushEvent;                              // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   PhaseTranceOnSuccessfullyActivated;                // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   SkillEvent_PhaseSlamStarted;                       // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   SkillEvent_PhaseSlamEnded;                         // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   SkillEvent_PhaseGraspEnemy;                        // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   SkillEvent_PhaseGraspEnemyEnded;                   // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   SkillEvent_OnCausedDamage;                         // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SkillEvent_ActivateRushBonus__DelegateSignature(int32 RushStacks);
	void SkillEvent_RushEvent__DelegateSignature();
	void PhaseTranceOnSuccessfullyActivated__DelegateSignature(EPhaseTranceAttackFamilyType FamilyType, EPhasetranceAttackAction PhaseTranceAction, bool Success);
	void SkillEvent_PhaseSlamStarted__DelegateSignature();
	void SkillEvent_PhaseSlamEnded__DelegateSignature();
	void SkillEvent_PhaseGraspEnemy__DelegateSignature(class AActor* Enemy, EPhaseTranceElementalType Element);
	void SkillEvent_PhaseGraspEnemyEnded__DelegateSignature(bool Killed);
	void SkillEvent_OnCausedDamage__DelegateSignature(float Damage, class UClass* DamageSource, class UClass* DamageType, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPEventHub_Siren_C">();
	}
	static class UBPEventHub_Siren_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPEventHub_Siren_C>();
	}
};
static_assert(alignof(UBPEventHub_Siren_C) == 0x000008, "Wrong alignment on UBPEventHub_Siren_C");
static_assert(sizeof(UBPEventHub_Siren_C) == 0x000118, "Wrong size on UBPEventHub_Siren_C");
static_assert(offsetof(UBPEventHub_Siren_C, SkillEvent_ActivateRushBonus) == 0x000098, "Member 'UBPEventHub_Siren_C::SkillEvent_ActivateRushBonus' has a wrong offset!");
static_assert(offsetof(UBPEventHub_Siren_C, SkillEvent_RushEvent) == 0x0000A8, "Member 'UBPEventHub_Siren_C::SkillEvent_RushEvent' has a wrong offset!");
static_assert(offsetof(UBPEventHub_Siren_C, PhaseTranceOnSuccessfullyActivated) == 0x0000B8, "Member 'UBPEventHub_Siren_C::PhaseTranceOnSuccessfullyActivated' has a wrong offset!");
static_assert(offsetof(UBPEventHub_Siren_C, SkillEvent_PhaseSlamStarted) == 0x0000C8, "Member 'UBPEventHub_Siren_C::SkillEvent_PhaseSlamStarted' has a wrong offset!");
static_assert(offsetof(UBPEventHub_Siren_C, SkillEvent_PhaseSlamEnded) == 0x0000D8, "Member 'UBPEventHub_Siren_C::SkillEvent_PhaseSlamEnded' has a wrong offset!");
static_assert(offsetof(UBPEventHub_Siren_C, SkillEvent_PhaseGraspEnemy) == 0x0000E8, "Member 'UBPEventHub_Siren_C::SkillEvent_PhaseGraspEnemy' has a wrong offset!");
static_assert(offsetof(UBPEventHub_Siren_C, SkillEvent_PhaseGraspEnemyEnded) == 0x0000F8, "Member 'UBPEventHub_Siren_C::SkillEvent_PhaseGraspEnemyEnded' has a wrong offset!");
static_assert(offsetof(UBPEventHub_Siren_C, SkillEvent_OnCausedDamage) == 0x000108, "Member 'UBPEventHub_Siren_C::SkillEvent_OnCausedDamage' has a wrong offset!");

}

