#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPHeatComponent_CoV

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPHeatComponent_CoV.BPHeatComponent_CoV_C.ExecuteUbergraph_BPHeatComponent_CoV
// 0x0028 (0x0028 - 0x0000)
struct BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeap_COV_BaseWeapon_C*               K2Node_DynamicCast_AsBPWeap_COV_Base_Weapon;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV) == 0x000008, "Wrong alignment on BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV");
static_assert(sizeof(BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV) == 0x000028, "Wrong size on BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV");
static_assert(offsetof(BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV, EntryPoint) == 0x000000, "Member 'BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV, K2Node_DynamicCast_AsBPWeap_COV_Base_Weapon) == 0x000010, "Member 'BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV::K2Node_DynamicCast_AsBPWeap_COV_Base_Weapon' has a wrong offset!");
static_assert(offsetof(BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV, CallFunc_GetAssociatedPlayerController_ReturnValue) == 0x000020, "Member 'BPHeatComponent_CoV_C_ExecuteUbergraph_BPHeatComponent_CoV::CallFunc_GetAssociatedPlayerController_ReturnValue' has a wrong offset!");

}

