#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPInterface_TempHudTextProvider

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPInterface_TempHudTextProvider.BPInterface_TempHudTextProvider_C.SetMissionDebugText
// 0x0038 (0x0038 - 0x0000)
struct BPInterface_TempHudTextProvider_C_SetMissionDebugText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         TextSize;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor;                                         // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FacePlayer;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPInterface_TempHudTextProvider_C_SetMissionDebugText) == 0x000008, "Wrong alignment on BPInterface_TempHudTextProvider_C_SetMissionDebugText");
static_assert(sizeof(BPInterface_TempHudTextProvider_C_SetMissionDebugText) == 0x000038, "Wrong size on BPInterface_TempHudTextProvider_C_SetMissionDebugText");
static_assert(offsetof(BPInterface_TempHudTextProvider_C_SetMissionDebugText, Text) == 0x000000, "Member 'BPInterface_TempHudTextProvider_C_SetMissionDebugText::Text' has a wrong offset!");
static_assert(offsetof(BPInterface_TempHudTextProvider_C_SetMissionDebugText, TextSize) == 0x000018, "Member 'BPInterface_TempHudTextProvider_C_SetMissionDebugText::TextSize' has a wrong offset!");
static_assert(offsetof(BPInterface_TempHudTextProvider_C_SetMissionDebugText, Duration) == 0x00001C, "Member 'BPInterface_TempHudTextProvider_C_SetMissionDebugText::Duration' has a wrong offset!");
static_assert(offsetof(BPInterface_TempHudTextProvider_C_SetMissionDebugText, TextColor) == 0x000020, "Member 'BPInterface_TempHudTextProvider_C_SetMissionDebugText::TextColor' has a wrong offset!");
static_assert(offsetof(BPInterface_TempHudTextProvider_C_SetMissionDebugText, FacePlayer) == 0x000030, "Member 'BPInterface_TempHudTextProvider_C_SetMissionDebugText::FacePlayer' has a wrong offset!");

}

