#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPIO_Lootable_Global_GoldenKey

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPIO_Lootable_Global_GoldenKey.BPIO_Lootable_Global_GoldenKey_C.BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey
// 0x0010 (0x0010 - 0x0000)
struct BPIO_Lootable_Global_GoldenKey_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    UsedComponent;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey) == 0x000008, "Wrong alignment on BPIO_Lootable_Global_GoldenKey_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey");
static_assert(sizeof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey) == 0x000010, "Wrong size on BPIO_Lootable_Global_GoldenKey_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey, UserController) == 0x000000, "Member 'BPIO_Lootable_Global_GoldenKey_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey::UserController' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey, UsedComponent) == 0x000008, "Member 'BPIO_Lootable_Global_GoldenKey_C_BndEvt__UsableComponent_K2Node_ComponentBoundEvent_2_UsableUsedOnChannelSignature__DelegateSignature_BPIO_Lootable_Global_GoldenKey::UsedComponent' has a wrong offset!");

// Function BPIO_Lootable_Global_GoldenKey.BPIO_Lootable_Global_GoldenKey_C.BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey
// 0x0010 (0x0010 - 0x0000)
struct BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey final
{
public:
	class ADroppedInventoryItemPickup*            Pickup;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PickedUpBy;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey) == 0x000008, "Wrong alignment on BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey");
static_assert(sizeof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey) == 0x000010, "Wrong size on BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey, Pickup) == 0x000000, "Member 'BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey::Pickup' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey, PickedUpBy) == 0x000008, "Member 'BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_3_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey::PickedUpBy' has a wrong offset!");

// Function BPIO_Lootable_Global_GoldenKey.BPIO_Lootable_Global_GoldenKey_C.BndEvt__Loot_K2Node_ComponentBoundEvent_1_PickupAttachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey
// 0x0008 (0x0008 - 0x0000)
struct BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_1_PickupAttachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey final
{
public:
	class ADroppedInventoryItemPickup*            Pickup;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_1_PickupAttachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey) == 0x000008, "Wrong alignment on BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_1_PickupAttachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey");
static_assert(sizeof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_1_PickupAttachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey) == 0x000008, "Wrong size on BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_1_PickupAttachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_1_PickupAttachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey, Pickup) == 0x000000, "Member 'BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_1_PickupAttachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey::Pickup' has a wrong offset!");

// Function BPIO_Lootable_Global_GoldenKey.BPIO_Lootable_Global_GoldenKey_C.BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey
// 0x0010 (0x0010 - 0x0000)
struct BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey final
{
public:
	class ADroppedInventoryItemPickup*            Pickup;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PickedUpBy;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey) == 0x000008, "Wrong alignment on BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey");
static_assert(sizeof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey) == 0x000010, "Wrong size on BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey, Pickup) == 0x000000, "Member 'BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey::Pickup' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey, PickedUpBy) == 0x000008, "Member 'BPIO_Lootable_Global_GoldenKey_C_BndEvt__Loot_K2Node_ComponentBoundEvent_0_PickupDetachedDelegate__DelegateSignature_BPIO_Lootable_Global_GoldenKey::PickedUpBy' has a wrong offset!");

// Function BPIO_Lootable_Global_GoldenKey.BPIO_Lootable_Global_GoldenKey_C.ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey
// 0x0080 (0x0080 - 0x0000)
struct BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADroppedInventoryItemPickup*            K2Node_ComponentBoundEvent_Pickup2;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADroppedInventoryItemPickup*            K2Node_ComponentBoundEvent_Pickup1;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_PickedUpBy1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADroppedInventoryItemPickup*            K2Node_ComponentBoundEvent_Pickup;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_PickedUpBy;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          CallFunc_GetAssociatedPrimaryCharacter_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADroppedInventoryItemPickup*>    CallFunc_GetAttachedPickups_ReturnValue;           // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_ComponentBoundEvent_UserController;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey) == 0x000008, "Wrong alignment on BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey");
static_assert(sizeof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey) == 0x000080, "Wrong size on BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, EntryPoint) == 0x000000, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_ComponentBoundEvent_Pickup2) == 0x000008, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_ComponentBoundEvent_Pickup2' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_ComponentBoundEvent_Pickup1) == 0x000010, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_ComponentBoundEvent_Pickup1' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_ComponentBoundEvent_PickedUpBy1) == 0x000018, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_ComponentBoundEvent_PickedUpBy1' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_ComponentBoundEvent_Pickup) == 0x000020, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_ComponentBoundEvent_Pickup' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_ComponentBoundEvent_PickedUpBy) == 0x000028, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_ComponentBoundEvent_PickedUpBy' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, CallFunc_GetAssociatedPrimaryCharacter_ReturnValue) == 0x000030, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::CallFunc_GetAssociatedPrimaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_DynamicCast_AsOak_Character) == 0x000038, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, CallFunc_GetAttachedPickups_ReturnValue) == 0x000048, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::CallFunc_GetAttachedPickups_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_ComponentBoundEvent_UserController) == 0x000060, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_ComponentBoundEvent_UserController' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_ComponentBoundEvent_UsedComponent) == 0x000068, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_ComponentBoundEvent_UsedComponent' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000070, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'BPIO_Lootable_Global_GoldenKey_C_ExecuteUbergraph_BPIO_Lootable_Global_GoldenKey::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

}

