#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPIO_CS_Console

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakCS_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPIO_CS_Console.BPIO_CS_CONSOLE_C
// 0x0038 (0x06A0 - 0x0668)
class ABPIO_CS_CONSOLE_C final : public ACSConsole
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(Transient, DuplicateTransient)
	class UMissionObserverComponent*              MissionObserver;                                   // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MissionGiverSpawnPoint;                            // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_UsableComponent_C*                  BP_CitizenScienceUsableComponent;                  // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Console_CitizenScience;                         // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   SlotPlayer;                                        // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIO_CS_IntroMissionGiver_C*             SpawnedMissionDirector;                            // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionsInitialized__DelegateSignature_BPIO_CS_Console();
	void ExecuteUbergraph_BPIO_CS_Console(int32 EntryPoint);
	void ReceiveDestroyed();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPIO_CS_CONSOLE_C">();
	}
	static class ABPIO_CS_CONSOLE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPIO_CS_CONSOLE_C>();
	}
};
static_assert(alignof(ABPIO_CS_CONSOLE_C) == 0x000008, "Wrong alignment on ABPIO_CS_CONSOLE_C");
static_assert(sizeof(ABPIO_CS_CONSOLE_C) == 0x0006A0, "Wrong size on ABPIO_CS_CONSOLE_C");
static_assert(offsetof(ABPIO_CS_CONSOLE_C, UberGraphFrame) == 0x000668, "Member 'ABPIO_CS_CONSOLE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPIO_CS_CONSOLE_C, MissionObserver) == 0x000670, "Member 'ABPIO_CS_CONSOLE_C::MissionObserver' has a wrong offset!");
static_assert(offsetof(ABPIO_CS_CONSOLE_C, MissionGiverSpawnPoint) == 0x000678, "Member 'ABPIO_CS_CONSOLE_C::MissionGiverSpawnPoint' has a wrong offset!");
static_assert(offsetof(ABPIO_CS_CONSOLE_C, BP_CitizenScienceUsableComponent) == 0x000680, "Member 'ABPIO_CS_CONSOLE_C::BP_CitizenScienceUsableComponent' has a wrong offset!");
static_assert(offsetof(ABPIO_CS_CONSOLE_C, SM_Console_CitizenScience) == 0x000688, "Member 'ABPIO_CS_CONSOLE_C::SM_Console_CitizenScience' has a wrong offset!");
static_assert(offsetof(ABPIO_CS_CONSOLE_C, SlotPlayer) == 0x000690, "Member 'ABPIO_CS_CONSOLE_C::SlotPlayer' has a wrong offset!");
static_assert(offsetof(ABPIO_CS_CONSOLE_C, SpawnedMissionDirector) == 0x000698, "Member 'ABPIO_CS_CONSOLE_C::SpawnedMissionDirector' has a wrong offset!");

}

