#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPIO_DiamondChest

#include "Basic.hpp"

#include "Enum_DChest_MusicStates_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_DiamondChestWallStates_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function BPIO_DiamondChest.BPIO_DiamondChest_C.ExecuteUbergraph_BPIO_DiamondChest
// 0x19B0 (0x19B0 - 0x0000)
struct BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	bool                                          Temp_bool_Variable;                                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0224(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0240(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0458(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B[0x5];                                      // 0x046B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0470(0x0218)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x068C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x069C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x069D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x069E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69F[0x1];                                      // 0x069F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x06A0(0x0218)()
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B9[0x3];                                      // 0x08B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x08BC(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x08CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x08CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue4;                // 0x08CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CF[0x1];                                      // 0x08CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent3;   // 0x08D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor3;            // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp3;             // 0x08E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex3;        // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep2;            // 0x08EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8ED[0x3];                                      // 0x08ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult2;           // 0x08F0(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_UserStateEvent_bFromLoad6;                  // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad5;                  // 0x0981(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad4;                  // 0x0982(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad3;                  // 0x0983(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0984(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0985(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_986[0x2];                                      // 0x0986(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent2;   // 0x0988(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0998(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex2;        // 0x09A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A4[0x4];                                      // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x09A8(0x0218)()
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0BC0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x0BD0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x0BDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x0BE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE1[0x7];                                      // 0x0BE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0BE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0BF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF1[0x7];                                      // 0x0BF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x0BF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0C00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C01[0x7];                                      // 0x0C01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetAssociatedController_ReturnValue;      // 0x0C08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0C10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C11[0x3];                                      // 0x0C11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0C14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0C18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0C1C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1D[0x3];                                      // 0x0C1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_ComponentBoundEvent_UserController;         // 0x0C20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_UsedComponent;          // 0x0C28(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0C30(0x0218)()
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0E48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0E50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E51[0x3];                                      // 0x0E51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x0E54(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x0E60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x0E64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0E65(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlayerLvReq_PlayerMeetsLvReq;        // 0x0E66(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E67[0x1];                                      // 0x0E67(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CallFunc_CheckPlayerLvReq_OakCharacter;            // 0x0E68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0E70(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x1088(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x1094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x1098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad2;                  // 0x1099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x109A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad1;                  // 0x109B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109C[0x4];                                     // 0x109C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_SpawnAndAttachLoot_SelectedConfigurationName; // 0x10A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADroppedInventoryItemPickup*            K2Node_ComponentBoundEvent_Pickup1;                // 0x10A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADroppedInventoryItemPickup*            K2Node_ComponentBoundEvent_Pickup;                 // 0x10B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_PickedUpBy;             // 0x10B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x10C0(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation7;                // 0x12D8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID7;                  // 0x12E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue7;                 // 0x12E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x12E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12EA[0x6];                                     // 0x12EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x12F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent1;   // 0x12F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor1;            // 0x1300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp1;             // 0x1308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex1;        // 0x1310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep1;            // 0x1314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1315[0x3];                                     // 0x1315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult1;           // 0x1318(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue1; // 0x13A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x13B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller1;       // 0x13B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x13C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C1[0x7];                                     // 0x13C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x13C8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation8;                // 0x15E0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID8;                  // 0x15EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue8;                 // 0x15F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlayerLvReq_PlayerMeetsLvReq1;       // 0x15F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15F2[0x6];                                     // 0x15F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CallFunc_CheckPlayerLvReq_OakCharacter1;           // 0x15F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x1600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1601[0x7];                                     // 0x1601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryListComponent*                CallFunc_GetBankInventoryComponent_ReturnValue;    // 0x1608(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCategoryItemQuantity_ReturnValue;      // 0x1610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x1614(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1615[0x3];                                     // 0x1615(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADroppedInventoryItemPickup*>    CallFunc_GetAttachedPickups_ReturnValue;           // 0x1618(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x1628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x162C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162D[0x3];                                     // 0x162D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x1630(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163C[0x4];                                     // 0x163C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x1640(0x0008)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x1648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x164C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_164D[0x3];                                     // 0x164D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x1650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x1654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors1;  // 0x1658(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x1668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x166C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_166D[0x3];                                     // 0x166D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x1670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x1674(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x1680(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x1688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x1690(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x1698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x169C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169D[0x3];                                     // 0x169D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x16A0(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue2; // 0x1730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller2;       // 0x1738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x1740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1741[0x3];                                     // 0x1741(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x1744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x1748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x1749(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x174A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_174B[0x5];                                     // 0x174B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x1750(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x1768(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x1780(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue2;              // 0x1798(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue3;              // 0x17B0(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue4;              // 0x17C8(0x0018)()
	bool                                          K2Node_UserStateEvent_bFromLoad;                   // 0x17E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckWallStatesToRestart_AllWallsClosed;  // 0x17E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x17E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17E3[0x5];                                     // 0x17E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue5;              // 0x17E8(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_ShieldWallProgressBar; // 0x1800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GunWallProgressBar;   // 0x1808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GrenadeWallProgressBar; // 0x1810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_ShieldWallProgressBar1; // 0x1818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GunWallProgressBar1;  // 0x1820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GrenadeWallProgressBar1; // 0x1828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue6;              // 0x1830(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostAttachedEvent_ReturnValue;            // 0x1848(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue1;         // 0x1860(0x0018)()
	float                                         K2Node_CustomEvent_Delay;                          // 0x1878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x187C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_187D[0x3];                                     // 0x187D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x1880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1884[0x4];                                     // 0x1884(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_GetWallTimers_ShieldWallTimer;            // 0x1888(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GunWallTimerL;              // 0x1890(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GunWallTimerR;              // 0x1898(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GrenadeWallTimer;           // 0x18A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x18A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18AC[0x4];                                     // 0x18AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_ShieldWallProgressBar2; // 0x18B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GunWallProgressBar2;  // 0x18B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GrenadeWallProgressBar2; // 0x18C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_ShieldWallProgressBar3; // 0x18C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GunWallProgressBar3;  // 0x18D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GrenadeWallProgressBar3; // 0x18D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_ShieldWallProgressBar4; // 0x18E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GunWallProgressBar4;  // 0x18E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetWallProgressBars_GrenadeWallProgressBar4; // 0x18F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_ShieldWallTimer1;           // 0x18F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GunWallTimerL1;             // 0x1900(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GunWallTimerR1;             // 0x1908(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GrenadeWallTimer1;          // 0x1910(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue7;              // 0x1918(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x1930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x1934(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1935[0x3];                                     // 0x1935(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x1938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193C[0x4];                                     // 0x193C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_GetWallTimers_ShieldWallTimer2;           // 0x1940(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GunWallTimerL2;             // 0x1948(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GunWallTimerR2;             // 0x1950(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GrenadeWallTimer2;          // 0x1958(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue1;                      // 0x1960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1964[0x4];                                     // 0x1964(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x1968(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x1978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x1979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_197A[0x6];                                     // 0x197A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_GetWallTimers_ShieldWallTimer3;           // 0x1980(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GunWallTimerL3;             // 0x1988(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GunWallTimerR3;             // 0x1990(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetWallTimers_GrenadeWallTimer3;          // 0x1998(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ServerTimeRemaining;            // 0x19A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x19A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x19A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest) == 0x000008, "Wrong alignment on BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest");
static_assert(sizeof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest) == 0x0019B0, "Wrong size on BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, EntryPoint) == 0x000000, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_IsPlaying_ReturnValue) == 0x000004, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, Temp_bool_Variable) == 0x000220, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_Conversation) == 0x000224, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_SequenceID) == 0x000230, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_ReturnValue) == 0x000234, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Conv_IntToBool_ReturnValue) == 0x000235, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, Temp_float_Variable) == 0x000238, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_HasAuthority_ReturnValue) == 0x00023C, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_NewDialogContext_ReturnValue1) == 0x000240, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_Conversation1) == 0x000458, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_Conversation1' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_SequenceID1) == 0x000464, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_SequenceID1' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_ReturnValue1) == 0x000468, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_HasAuthority_ReturnValue1) == 0x000469, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Conv_IntToBool_ReturnValue1) == 0x00046A, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_NewDialogContext_ReturnValue2) == 0x000470, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, Temp_int_Array_Index_Variable) == 0x000688, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_Conversation2) == 0x00068C, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_Conversation2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_SequenceID2) == 0x000698, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_SequenceID2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_ReturnValue2) == 0x00069C, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Conv_IntToBool_ReturnValue2) == 0x00069D, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_HasAuthority_ReturnValue2) == 0x00069E, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_NewDialogContext_ReturnValue3) == 0x0006A0, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_HasAuthority_ReturnValue3) == 0x0008B8, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_Conversation3) == 0x0008BC, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_Conversation3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_SequenceID3) == 0x0008C8, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_SequenceID3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_ReturnValue3) == 0x0008CC, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Conv_IntToBool_ReturnValue3) == 0x0008CD, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_HasAuthority_ReturnValue4) == 0x0008CE, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_HasAuthority_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_OverlappedComponent3) == 0x0008D0, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_OverlappedComponent3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_OtherActor3) == 0x0008D8, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_OtherActor3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_OtherComp3) == 0x0008E0, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_OtherComp3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_OtherBodyIndex3) == 0x0008E8, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_OtherBodyIndex3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_bFromSweep2) == 0x0008EC, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_bFromSweep2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_SweepResult2) == 0x0008F0, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_SweepResult2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_UserStateEvent_bFromLoad6) == 0x000980, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_UserStateEvent_bFromLoad6' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_UserStateEvent_bFromLoad5) == 0x000981, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_UserStateEvent_bFromLoad5' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_UserStateEvent_bFromLoad4) == 0x000982, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_UserStateEvent_bFromLoad4' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_UserStateEvent_bFromLoad3) == 0x000983, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_UserStateEvent_bFromLoad3' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000984, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000985, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_OverlappedComponent2) == 0x000988, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_OverlappedComponent2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_OtherActor2) == 0x000990, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_OtherComp2) == 0x000998, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_OtherBodyIndex2) == 0x0009A0, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_OtherBodyIndex2' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_NewDialogContext_ReturnValue4) == 0x0009A8, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_NewDialogContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000BC0, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_Conversation4) == 0x000BD0, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_Conversation4' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_SequenceID4) == 0x000BDC, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_SequenceID4' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_ReturnValue4) == 0x000BE0, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Array_Get_Item) == 0x000BE8, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Conv_IntToBool_ReturnValue4) == 0x000BF0, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_GetAssociatedPlayerController_ReturnValue) == 0x000BF8, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_GetAssociatedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_IsValid_ReturnValue) == 0x000C00, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_GetAssociatedController_ReturnValue) == 0x000C08, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_GetAssociatedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_IsValid_ReturnValue1) == 0x000C10, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Array_Length_ReturnValue) == 0x000C14, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Array_Length_ReturnValue1) == 0x000C18, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Greater_IntInt_ReturnValue) == 0x000C1C, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_UserController) == 0x000C20, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_UserController' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_ComponentBoundEvent_UsedComponent) == 0x000C28, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_ComponentBoundEvent_UsedComponent' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_NewDialogContext_ReturnValue5) == 0x000C30, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_NewDialogContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000E48, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, K2Node_DynamicCast_bSuccess) == 0x000E50, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_Conversation5) == 0x000E54, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_Conversation5' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_SequenceID5) == 0x000E60, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_SequenceID5' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_ReturnValue5) == 0x000E64, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_Conv_IntToBool_ReturnValue5) == 0x000E65, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_CheckPlayerLvReq_PlayerMeetsLvReq) == 0x000E66, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_CheckPlayerLvReq_PlayerMeetsLvReq' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_CheckPlayerLvReq_OakCharacter) == 0x000E68, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_CheckPlayerLvReq_OakCharacter' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_NewDialogContext_ReturnValue6) == 0x000E70, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_NewDialogContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_Conversation6) == 0x001088, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_Conversation6' has a wrong offset!");
static_assert(offsetof(BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest, CallFunc_FinishSpeak_SequenceID6) == 0x001094, "Member 'BPIO_DiamondChest_C_ExecuteUbergraph_BPIO_DiamondChest::CallFunc_FinishSpeak_SequenceID6' has a wrong offset!");
