#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPMenuActor_QuickChangeMenu

#include "Basic.hpp"

#include "OakGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPMenuActor_QuickChangeMenu.BPMenuActor_QuickChangeMenu_C
// 0x0020 (0x04F8 - 0x04D8)
class ABPMenuActor_QuickChangeMenu_C final : public AOakUIActorContainer
{
public:
	class USpotLightComponent*                    BlueLight01;                                       // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Key;                                               // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Rim;                                               // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       ViewCamera;                                        // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPMenuActor_QuickChangeMenu_C">();
	}
	static class ABPMenuActor_QuickChangeMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPMenuActor_QuickChangeMenu_C>();
	}
};
static_assert(alignof(ABPMenuActor_QuickChangeMenu_C) == 0x000008, "Wrong alignment on ABPMenuActor_QuickChangeMenu_C");
static_assert(sizeof(ABPMenuActor_QuickChangeMenu_C) == 0x0004F8, "Wrong size on ABPMenuActor_QuickChangeMenu_C");
static_assert(offsetof(ABPMenuActor_QuickChangeMenu_C, BlueLight01) == 0x0004D8, "Member 'ABPMenuActor_QuickChangeMenu_C::BlueLight01' has a wrong offset!");
static_assert(offsetof(ABPMenuActor_QuickChangeMenu_C, Key) == 0x0004E0, "Member 'ABPMenuActor_QuickChangeMenu_C::Key' has a wrong offset!");
static_assert(offsetof(ABPMenuActor_QuickChangeMenu_C, Rim) == 0x0004E8, "Member 'ABPMenuActor_QuickChangeMenu_C::Rim' has a wrong offset!");
static_assert(offsetof(ABPMenuActor_QuickChangeMenu_C, ViewCamera) == 0x0004F0, "Member 'ABPMenuActor_QuickChangeMenu_C::ViewCamera' has a wrong offset!");

}

