#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeaponFireProjectileComponent_Nemesis

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPWeaponFireProjectileComponent_Nemesis.BPWeaponFireProjectileComponent_Nemesis_C.ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis
// 0x0028 (0x0028 - 0x0000)
struct BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor)
};
static_assert(alignof(BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis) == 0x000008, "Wrong alignment on BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis");
static_assert(sizeof(BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis) == 0x000028, "Wrong size on BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis");
static_assert(offsetof(BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis, EntryPoint) == 0x000000, "Member 'BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis, CallFunc_RandomBool_ReturnValue) == 0x000018, "Member 'BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BPWeaponFireProjectileComponent_Nemesis_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Nemesis::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

