#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeap_PS_MAL_SuckerPunch

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPWeap_PS_MAL_SuckerPunch.BPWeap_PS_MAL_SuckerPunch_C.ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch
// 0x0528 (0x0528 - 0x0000)
struct BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0220(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0438(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A[0x2];                                      // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation1;        // 0x044C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID1;          // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue1;         // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E[0x2];                                      // 0x045E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0460(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AWeapon* EventWeapon)>   K2Node_CreateDelegate_OutputDelegate1;             // 0x0470(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0480(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0490(0x0008)(NoDestructor)
	class AWeapon*                                K2Node_CustomEvent_EventWeapon;                    // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageComponent*                 K2Node_CustomEvent_Damaged;                        // 0x04A8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x04B0(0x0068)(ConstParm)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAutoReload;                          // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch) == 0x000008, "Wrong alignment on BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch");
static_assert(sizeof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch) == 0x000528, "Wrong size on BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, EntryPoint) == 0x000000, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_NewDialogContext_ReturnValue1) == 0x000220, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_FinishTriggerDialog_Conversation) == 0x000438, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_FinishTriggerDialog_SequenceID) == 0x000444, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000448, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_Conv_IntToBool_ReturnValue) == 0x000449, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_FinishTriggerDialog_Conversation1) == 0x00044C, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_FinishTriggerDialog_Conversation1' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_FinishTriggerDialog_SequenceID1) == 0x000458, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_FinishTriggerDialog_SequenceID1' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_FinishTriggerDialog_ReturnValue1) == 0x00045C, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_FinishTriggerDialog_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_Conv_IntToBool_ReturnValue1) == 0x00045D, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, K2Node_CreateDelegate_OutputDelegate) == 0x000460, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, K2Node_CreateDelegate_OutputDelegate1) == 0x000470, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, K2Node_CreateDelegate_OutputDelegate2) == 0x000480, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_K2_SetTimer_ReturnValue) == 0x000490, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, K2Node_CustomEvent_EventWeapon) == 0x000498, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::K2Node_CustomEvent_EventWeapon' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_GetInstigator_ReturnValue) == 0x0004A0, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, K2Node_CustomEvent_Damaged) == 0x0004A8, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, K2Node_CustomEvent_Details) == 0x0004B0, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, K2Node_DynamicCast_AsOak_Character) == 0x000518, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, K2Node_DynamicCast_bSuccess) == 0x000520, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000521, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch, K2Node_Event_bAutoReload) == 0x000522, "Member 'BPWeap_PS_MAL_SuckerPunch_C_ExecuteUbergraph_BPWeap_PS_MAL_SuckerPunch::K2Node_Event_bAutoReload' has a wrong offset!");

// Function BPWeap_PS_MAL_SuckerPunch.BPWeap_PS_MAL_SuckerPunch_C.Notify_ReloadStarted
// 0x0001 (0x0001 - 0x0000)
struct BPWeap_PS_MAL_SuckerPunch_C_Notify_ReloadStarted final
{
public:
	bool                                          bAutoReload;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWeap_PS_MAL_SuckerPunch_C_Notify_ReloadStarted) == 0x000001, "Wrong alignment on BPWeap_PS_MAL_SuckerPunch_C_Notify_ReloadStarted");
static_assert(sizeof(BPWeap_PS_MAL_SuckerPunch_C_Notify_ReloadStarted) == 0x000001, "Wrong size on BPWeap_PS_MAL_SuckerPunch_C_Notify_ReloadStarted");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_Notify_ReloadStarted, bAutoReload) == 0x000000, "Member 'BPWeap_PS_MAL_SuckerPunch_C_Notify_ReloadStarted::bAutoReload' has a wrong offset!");

// Function BPWeap_PS_MAL_SuckerPunch.BPWeap_PS_MAL_SuckerPunch_C.OnKilledEnemy_Event
// 0x0070 (0x0070 - 0x0000)
struct BPWeap_PS_MAL_SuckerPunch_C_OnKilledEnemy_Event final
{
public:
	const class UDamageComponent*                 Damaged;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPWeap_PS_MAL_SuckerPunch_C_OnKilledEnemy_Event) == 0x000008, "Wrong alignment on BPWeap_PS_MAL_SuckerPunch_C_OnKilledEnemy_Event");
static_assert(sizeof(BPWeap_PS_MAL_SuckerPunch_C_OnKilledEnemy_Event) == 0x000070, "Wrong size on BPWeap_PS_MAL_SuckerPunch_C_OnKilledEnemy_Event");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_OnKilledEnemy_Event, Damaged) == 0x000000, "Member 'BPWeap_PS_MAL_SuckerPunch_C_OnKilledEnemy_Event::Damaged' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_OnKilledEnemy_Event, Details) == 0x000008, "Member 'BPWeap_PS_MAL_SuckerPunch_C_OnKilledEnemy_Event::Details' has a wrong offset!");

// Function BPWeap_PS_MAL_SuckerPunch.BPWeap_PS_MAL_SuckerPunch_C.WeaponPutDownEvent
// 0x0008 (0x0008 - 0x0000)
struct BPWeap_PS_MAL_SuckerPunch_C_WeaponPutDownEvent final
{
public:
	class AWeapon*                                EventWeapon;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWeap_PS_MAL_SuckerPunch_C_WeaponPutDownEvent) == 0x000008, "Wrong alignment on BPWeap_PS_MAL_SuckerPunch_C_WeaponPutDownEvent");
static_assert(sizeof(BPWeap_PS_MAL_SuckerPunch_C_WeaponPutDownEvent) == 0x000008, "Wrong size on BPWeap_PS_MAL_SuckerPunch_C_WeaponPutDownEvent");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_WeaponPutDownEvent, EventWeapon) == 0x000000, "Member 'BPWeap_PS_MAL_SuckerPunch_C_WeaponPutDownEvent::EventWeapon' has a wrong offset!");

// Function BPWeap_PS_MAL_SuckerPunch.BPWeap_PS_MAL_SuckerPunch_C.TryIdleAudio
// 0x0230 (0x0230 - 0x0000)
struct BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio final
{
public:
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0000(0x0218)()
	struct FDialogConversation                    CallFunc_FinishTriggerDialog_Conversation;         // 0x0218(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishTriggerDialog_SequenceID;           // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishTriggerDialog_ReturnValue;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio) == 0x000008, "Wrong alignment on BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio");
static_assert(sizeof(BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio) == 0x000230, "Wrong size on BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio, CallFunc_NewDialogContext_ReturnValue) == 0x000000, "Member 'BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio, CallFunc_FinishTriggerDialog_Conversation) == 0x000218, "Member 'BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio::CallFunc_FinishTriggerDialog_Conversation' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio, CallFunc_FinishTriggerDialog_SequenceID) == 0x000224, "Member 'BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio::CallFunc_FinishTriggerDialog_SequenceID' has a wrong offset!");
static_assert(offsetof(BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio, CallFunc_FinishTriggerDialog_ReturnValue) == 0x000228, "Member 'BPWeap_PS_MAL_SuckerPunch_C_TryIdleAudio::CallFunc_FinishTriggerDialog_ReturnValue' has a wrong offset!");

}

