#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeap_COV_BaseWeapon

#include "Basic.hpp"

#include "GbxWeapon_structs.hpp"


namespace SDK::Params
{

// Function BPWeap_COV_BaseWeapon.BPWeap_COV_BaseWeapon_C.ExecuteUbergraph_BPWeap_COV_BaseWeapon
// 0x00E8 (0x00E8 - 0x0000)
struct BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FWeaponMaterialEffectData              K2Node_MakeStruct_WeaponMaterialEffectData;        // 0x0018(0x0060)(NoDestructor)
	struct FWeaponMaterialEffectData              K2Node_MakeStruct_WeaponMaterialEffectData1;       // 0x0078(0x0060)(NoDestructor)
	int32                                         CallFunc_PlayDynamicMaterialEffect_ReturnValue;    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayDynamicMaterialEffect_ReturnValue1;   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCompleted;                           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon) == 0x000008, "Wrong alignment on BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon");
static_assert(sizeof(BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon) == 0x0000E8, "Wrong size on BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon, EntryPoint) == 0x000000, "Member 'BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon, K2Node_MakeStruct_WeaponMaterialEffectData) == 0x000018, "Member 'BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon::K2Node_MakeStruct_WeaponMaterialEffectData' has a wrong offset!");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon, K2Node_MakeStruct_WeaponMaterialEffectData1) == 0x000078, "Member 'BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon::K2Node_MakeStruct_WeaponMaterialEffectData1' has a wrong offset!");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon, CallFunc_PlayDynamicMaterialEffect_ReturnValue) == 0x0000D8, "Member 'BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon::CallFunc_PlayDynamicMaterialEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon, CallFunc_PlayDynamicMaterialEffect_ReturnValue1) == 0x0000DC, "Member 'BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon::CallFunc_PlayDynamicMaterialEffect_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon, K2Node_Event_bCompleted) == 0x0000E0, "Member 'BPWeap_COV_BaseWeapon_C_ExecuteUbergraph_BPWeap_COV_BaseWeapon::K2Node_Event_bCompleted' has a wrong offset!");

// Function BPWeap_COV_BaseWeapon.BPWeap_COV_BaseWeapon_C.Notify_ReloadEnded
// 0x0001 (0x0001 - 0x0000)
struct BPWeap_COV_BaseWeapon_C_Notify_ReloadEnded final
{
public:
	bool                                          bCompleted;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWeap_COV_BaseWeapon_C_Notify_ReloadEnded) == 0x000001, "Wrong alignment on BPWeap_COV_BaseWeapon_C_Notify_ReloadEnded");
static_assert(sizeof(BPWeap_COV_BaseWeapon_C_Notify_ReloadEnded) == 0x000001, "Wrong size on BPWeap_COV_BaseWeapon_C_Notify_ReloadEnded");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_Notify_ReloadEnded, bCompleted) == 0x000000, "Member 'BPWeap_COV_BaseWeapon_C_Notify_ReloadEnded::bCompleted' has a wrong offset!");

// Function BPWeap_COV_BaseWeapon.BPWeap_COV_BaseWeapon_C.GetRepairStyle
// 0x0018 (0x0018 - 0x0000)
struct BPWeap_COV_BaseWeapon_C_GetRepairStyle final
{
public:
	int32                                         Param;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponCOVRepairComponent*              CallFunc_GetUseModeComponentByClass_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWeap_COV_BaseWeapon_C_GetRepairStyle) == 0x000008, "Wrong alignment on BPWeap_COV_BaseWeapon_C_GetRepairStyle");
static_assert(sizeof(BPWeap_COV_BaseWeapon_C_GetRepairStyle) == 0x000018, "Wrong size on BPWeap_COV_BaseWeapon_C_GetRepairStyle");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_GetRepairStyle, Param) == 0x000000, "Member 'BPWeap_COV_BaseWeapon_C_GetRepairStyle::Param' has a wrong offset!");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_GetRepairStyle, CallFunc_GetUseModeComponentByClass_ReturnValue) == 0x000008, "Member 'BPWeap_COV_BaseWeapon_C_GetRepairStyle::CallFunc_GetUseModeComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_GetRepairStyle, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BPWeap_COV_BaseWeapon_C_GetRepairStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_COV_BaseWeapon_C_GetRepairStyle, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'BPWeap_COV_BaseWeapon_C_GetRepairStyle::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

}

