#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeaponFireProjectile_Salamander

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPWeaponFireProjectile_Salamander.BPWeaponFireProjectile_Salamander_C.SetReadyForSplat
// 0x0001 (0x0001 - 0x0000)
struct BPWeaponFireProjectile_Salamander_C_SetReadyForSplat final
{
public:
	bool                                          bReadyForSplat_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWeaponFireProjectile_Salamander_C_SetReadyForSplat) == 0x000001, "Wrong alignment on BPWeaponFireProjectile_Salamander_C_SetReadyForSplat");
static_assert(sizeof(BPWeaponFireProjectile_Salamander_C_SetReadyForSplat) == 0x000001, "Wrong size on BPWeaponFireProjectile_Salamander_C_SetReadyForSplat");
static_assert(offsetof(BPWeaponFireProjectile_Salamander_C_SetReadyForSplat, bReadyForSplat_0) == 0x000000, "Member 'BPWeaponFireProjectile_Salamander_C_SetReadyForSplat::bReadyForSplat_0' has a wrong offset!");

// Function BPWeaponFireProjectile_Salamander.BPWeaponFireProjectile_Salamander_C.GetShotLightProjectileData
// 0x0010 (0x0010 - 0x0000)
struct BPWeaponFireProjectile_Salamander_C_GetShotLightProjectileData final
{
public:
	TSubclassOf<class ULightProjectileData>       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 FinalProjectile;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWeaponFireProjectile_Salamander_C_GetShotLightProjectileData) == 0x000008, "Wrong alignment on BPWeaponFireProjectile_Salamander_C_GetShotLightProjectileData");
static_assert(sizeof(BPWeaponFireProjectile_Salamander_C_GetShotLightProjectileData) == 0x000010, "Wrong size on BPWeaponFireProjectile_Salamander_C_GetShotLightProjectileData");
static_assert(offsetof(BPWeaponFireProjectile_Salamander_C_GetShotLightProjectileData, ReturnValue) == 0x000000, "Member 'BPWeaponFireProjectile_Salamander_C_GetShotLightProjectileData::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_Salamander_C_GetShotLightProjectileData, FinalProjectile) == 0x000008, "Member 'BPWeaponFireProjectile_Salamander_C_GetShotLightProjectileData::FinalProjectile' has a wrong offset!");

}

