#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeaponFireProjectileComponent_Torgue_RoisensThorns

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxWeapon_structs.hpp"


namespace SDK::Params
{

// Function BPWeaponFireProjectileComponent_Torgue_RoisensThorns.BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C.ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns
// 0x02A0 (0x02A0 - 0x0000)
struct BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0064(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0070(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x007C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorAimViewPoint_OutLocation;         // 0x0088(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorAimViewPoint_OutRotation;         // 0x0094(0x000C)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnCone_ReturnValue;         // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location1;                 // 0x0104(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation1;                 // 0x0110(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale1;                    // 0x011C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x012C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0138(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0148(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x0158(0x0140)(ContainsInstancedReference)
};
static_assert(alignof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns) == 0x000010, "Wrong alignment on BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns");
static_assert(sizeof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns) == 0x0002A0, "Wrong size on BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, EntryPoint) == 0x000000, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000028, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_GetActorSocket_ReturnValue) == 0x000030, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_BreakTransform_Location) == 0x000064, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_BreakTransform_Rotation) == 0x000070, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_BreakTransform_Scale) == 0x00007C, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_GetActorAimViewPoint_OutLocation) == 0x000088, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_GetActorAimViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_GetActorAimViewPoint_OutRotation) == 0x000094, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_GetActorAimViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_GetOwner_ReturnValue1) == 0x0000A0, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x0000A8, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B4, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_GeneratePointsOnCone_ReturnValue) == 0x0000B8, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_GeneratePointsOnCone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue) == 0x000100, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_BreakTransform_Location1) == 0x000104, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_BreakTransform_Location1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_BreakTransform_Rotation1) == 0x000110, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_BreakTransform_Rotation1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_BreakTransform_Scale1) == 0x00011C, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_BreakTransform_Scale1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000128, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_GetForwardVector_ReturnValue) == 0x00012C, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000138, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_Array_Length_ReturnValue) == 0x000144, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_Add_VectorVector_ReturnValue) == 0x000148, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns, K2Node_MakeStruct_LightProjectileInitializationData) == 0x000158, "Member 'BPWeaponFireProjectileComponent_Torgue_RoisensThorns_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_RoisensThorns::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");

}

