#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeaponFireProjectile_MAL_SM_DestructoSpin

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPWeaponFireProjectile_MAL_SM_DestructoSpin.BPWeaponFireProjectile_MAL_SM_DestructoSpin_C.ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin
// 0x0058 (0x0058 - 0x0000)
struct BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGbxDamageType*                   CallFunc_GetDamageType_ReturnValue;                // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGbxDamageType*                   CallFunc_GetDamageType_ReturnValue1;               // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin) == 0x000008, "Wrong alignment on BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin");
static_assert(sizeof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin) == 0x000058, "Wrong size on BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, EntryPoint) == 0x000000, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_GetWeapon_ReturnValue) == 0x000028, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_GetDamageType_ReturnValue) == 0x000030, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_GetDamageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_GetObjectClass_ReturnValue) == 0x000038, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_GetDamageType_ReturnValue1) == 0x000040, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_GetDamageType_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_GetObjectClass_ReturnValue1) == 0x000048, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_GetObjectClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000050, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000052, "Member 'BPWeaponFireProjectile_MAL_SM_DestructoSpin_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_DestructoSpin::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");

}

