#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeapFireProjComponent_Fbolt

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPWeapFireProjComponent_Fbolt.BPWeapFireProjComponent_Fbolt_C.ExecuteUbergraph_BPWeapFireProjComponent_Fbolt
// 0x0048 (0x0048 - 0x0000)
struct BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAttributeInteger                   CallFunc_MakeGbxAttributeInteger_ReturnValue;      // 0x0004(0x000C)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAttributeInteger                   CallFunc_MakeGbxAttributeInteger_ReturnValue1;     // 0x0030(0x000C)(HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt) == 0x000008, "Wrong alignment on BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt");
static_assert(sizeof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt) == 0x000048, "Wrong size on BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt");
static_assert(offsetof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt, EntryPoint) == 0x000000, "Member 'BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt, CallFunc_MakeGbxAttributeInteger_ReturnValue) == 0x000004, "Member 'BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt::CallFunc_MakeGbxAttributeInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt, CallFunc_MakeGbxAttributeInteger_ReturnValue1) == 0x000030, "Member 'BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt::CallFunc_MakeGbxAttributeInteger_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt, CallFunc_GetValueOfAttribute_ReturnValue) == 0x00003C, "Member 'BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'BPWeapFireProjComponent_Fbolt_C_ExecuteUbergraph_BPWeapFireProjComponent_Fbolt::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

