#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeap_SM_TED_PatMk3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPWeap_SM_TED_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPWeap_SM_TED_PatMk3.BPWeap_SM_TED_PatMk3_C
// 0x0020 (0x0A88 - 0x0A68)
class ABPWeap_SM_TED_PatMk3_C final : public ABPWeap_SM_TED_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPWeap_SM_TED_PatMk3_C;             // 0x0A68(0x0008)(Transient, DuplicateTransient)
	class UOakDialogComponent*                    OakDialog;                                         // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TenGallon_0;                                       // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          MyOakCharacter;                                    // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPWeap_SM_TED_PatMk3(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnKilledEnemy_Event(const class UDamageComponent* Damaged, const struct FCausedDeathDetails& Details);
	void WeaponPutDownEvent(class AWeapon* EventWeapon);
	void EquipEventNotify();
	void WeaponAttached();
	void UserConstructionScript();
	void TryAdvancingAudio();
	void Tediore_WeaponData(float* DamageRadius, class UClass** DamageTypeClass, int32* NumMirvProjectiles_0, float* FireRate, float* LoadedAmmo, int32* ThrowType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPWeap_SM_TED_PatMk3_C">();
	}
	static class ABPWeap_SM_TED_PatMk3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPWeap_SM_TED_PatMk3_C>();
	}
};
static_assert(alignof(ABPWeap_SM_TED_PatMk3_C) == 0x000008, "Wrong alignment on ABPWeap_SM_TED_PatMk3_C");
static_assert(sizeof(ABPWeap_SM_TED_PatMk3_C) == 0x000A88, "Wrong size on ABPWeap_SM_TED_PatMk3_C");
static_assert(offsetof(ABPWeap_SM_TED_PatMk3_C, UberGraphFrame_BPWeap_SM_TED_PatMk3_C) == 0x000A68, "Member 'ABPWeap_SM_TED_PatMk3_C::UberGraphFrame_BPWeap_SM_TED_PatMk3_C' has a wrong offset!");
static_assert(offsetof(ABPWeap_SM_TED_PatMk3_C, OakDialog) == 0x000A70, "Member 'ABPWeap_SM_TED_PatMk3_C::OakDialog' has a wrong offset!");
static_assert(offsetof(ABPWeap_SM_TED_PatMk3_C, TenGallon_0) == 0x000A78, "Member 'ABPWeap_SM_TED_PatMk3_C::TenGallon_0' has a wrong offset!");
static_assert(offsetof(ABPWeap_SM_TED_PatMk3_C, MyOakCharacter) == 0x000A80, "Member 'ABPWeap_SM_TED_PatMk3_C::MyOakCharacter' has a wrong offset!");

}

