#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeaponFireProjectile_MAL_SM_SFForce

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxWeapon_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPWeaponFireProjectile_MAL_SM_SFForce.BPWeaponFireProjectile_MAL_SM_SFForce_C.ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce
// 0x0310 (0x0310 - 0x0000)
struct BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValue_OutValue1;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue1;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGbxDamageType*                   CallFunc_GetDamageType_ReturnValue;                // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGbxDamageType*                   CallFunc_GetDamageType_ReturnValue1;               // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue1;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00BC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorAimViewPoint_OutLocation;         // 0x00D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorAimViewPoint_OutRotation;         // 0x00E0(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x00F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnCone_ReturnValue;         // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location1;                 // 0x0154(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation1;                 // 0x0160(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale1;                    // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x017C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0188(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0198(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class UClass*                                 K2Node_Select_Default;                             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x01D0(0x0140)(ContainsInstancedReference)
};
static_assert(alignof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce) == 0x000010, "Wrong alignment on BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce");
static_assert(sizeof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce) == 0x000310, "Wrong size on BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, EntryPoint) == 0x000000, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000004, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetDataTableValue_OutValue) == 0x000008, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetDataTableValue_ReturnValue) == 0x00000C, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, Temp_bool_Variable) == 0x00000D, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetDataTableValue_OutValue1) == 0x00001C, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetDataTableValue_OutValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetDataTableValue_ReturnValue1) == 0x000020, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetDataTableValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetWeapon_ReturnValue) == 0x000048, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetDamageType_ReturnValue) == 0x000050, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetDamageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetObjectClass_ReturnValue) == 0x000058, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetDamageType_ReturnValue1) == 0x000060, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetDamageType_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetObjectClass_ReturnValue1) == 0x000068, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetObjectClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetOwner_ReturnValue1) == 0x000070, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetActorSocket_ReturnValue) == 0x000080, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_BreakTransform_Location) == 0x0000B0, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_BreakTransform_Rotation) == 0x0000BC, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_BreakTransform_Scale) == 0x0000C8, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetActorAimViewPoint_OutLocation) == 0x0000D4, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetActorAimViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetActorAimViewPoint_OutRotation) == 0x0000E0, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetActorAimViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Add_VectorVector_ReturnValue) == 0x0000EC, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x0000F8, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GeneratePointsOnCone_ReturnValue) == 0x000108, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GeneratePointsOnCone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Array_Get_Item) == 0x000120, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue) == 0x000150, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_BreakTransform_Location1) == 0x000154, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_BreakTransform_Location1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_BreakTransform_Rotation1) == 0x000160, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_BreakTransform_Rotation1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_BreakTransform_Scale1) == 0x00016C, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_BreakTransform_Scale1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000178, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_GetForwardVector_ReturnValue) == 0x00017C, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000188, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Array_Length_ReturnValue) == 0x000194, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Add_VectorVector_ReturnValue1) == 0x000198, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, K2Node_CreateDelegate_OutputDelegate1) == 0x0001A8, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, K2Node_CreateDelegate_OutputDelegate2) == 0x0001B8, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, K2Node_Select_Default) == 0x0001C8, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce, K2Node_MakeStruct_LightProjectileInitializationData) == 0x0001D0, "Member 'BPWeaponFireProjectile_MAL_SM_SFForce_C_ExecuteUbergraph_BPWeaponFireProjectile_MAL_SM_SFForce::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");

}

