#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeap_SG_TED_FriendZone

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPWeap_SG_TED_FriendZone.BPWeap_SG_TED_FriendZone_C.ExecuteUbergraph_BPWeap_SG_TED_FriendZone
// 0x0250 (0x0250 - 0x0000)
struct BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0010(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone) == 0x000010, "Wrong alignment on BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone");
static_assert(sizeof(BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone) == 0x000250, "Wrong size on BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone, EntryPoint) == 0x000000, "Member 'BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000010, "Member 'BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone, CallFunc_SpawnActorAsync_ReturnValue) == 0x000240, "Member 'BPWeap_SG_TED_FriendZone_C_ExecuteUbergraph_BPWeap_SG_TED_FriendZone::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");

// Function BPWeap_SG_TED_FriendZone.BPWeap_SG_TED_FriendZone_C.TedioreThrowWeapon
// 0x0020 (0x0020 - 0x0000)
struct BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon final
{
public:
	class AActor*                                 ThrownProjectile;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_TedioreThrowWeapon_ThrownProjectile;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon) == 0x000008, "Wrong alignment on BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon");
static_assert(sizeof(BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon) == 0x000020, "Wrong size on BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon, ThrownProjectile) == 0x000000, "Member 'BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon::ThrownProjectile' has a wrong offset!");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000010, "Member 'BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon, CallFunc_IsPlayer_ReturnValue) == 0x000011, "Member 'BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon, CallFunc_TedioreThrowWeapon_ThrownProjectile) == 0x000018, "Member 'BPWeap_SG_TED_FriendZone_C_TedioreThrowWeapon::CallFunc_TedioreThrowWeapon_ThrownProjectile' has a wrong offset!");

}

