#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeaponFireProjectileComponent_Torgue_Craps

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPWeaponFireProjectileComponent_Torgue_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPWeaponFireProjectileComponent_Torgue_Craps.BPWeaponFireProjectileComponent_Torgue_Craps_C
// 0x0020 (0x09A0 - 0x0980)
class UBPWeaponFireProjectileComponent_Torgue_Craps_C final : public UBPWeaponFireProjectileComponent_Torgue_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPWeaponFireProjectileComponent_Torgue_Craps_C; // 0x0980(0x0008)(Transient, DuplicateTransient)
	int32                                         MaxMagazineSize;                                   // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CrapsShot;                                         // 0x098C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98D[0x3];                                      // 0x098D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CrapsNumber;                                       // 0x0990(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NumberChosen;                                      // 0x0994(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_995[0x3];                                      // 0x0995(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CrapsNumberExtra;                                  // 0x0998(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPWeaponFireProjectileComponent_Torgue_Craps(int32 EntryPoint);
	void K2_OnActivated();
	void CheckCrapsShot();
	void ChooseCrapsNumber();
	void WeaponUsed();
	void ReloadComplete(class AWeapon* EventWeapon, bool bCompleted);

	TSubclassOf<class ULightProjectileData> GetShotLightProjectileData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPWeaponFireProjectileComponent_Torgue_Craps_C">();
	}
	static class UBPWeaponFireProjectileComponent_Torgue_Craps_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPWeaponFireProjectileComponent_Torgue_Craps_C>();
	}
};
static_assert(alignof(UBPWeaponFireProjectileComponent_Torgue_Craps_C) == 0x000008, "Wrong alignment on UBPWeaponFireProjectileComponent_Torgue_Craps_C");
static_assert(sizeof(UBPWeaponFireProjectileComponent_Torgue_Craps_C) == 0x0009A0, "Wrong size on UBPWeaponFireProjectileComponent_Torgue_Craps_C");
static_assert(offsetof(UBPWeaponFireProjectileComponent_Torgue_Craps_C, UberGraphFrame_BPWeaponFireProjectileComponent_Torgue_Craps_C) == 0x000980, "Member 'UBPWeaponFireProjectileComponent_Torgue_Craps_C::UberGraphFrame_BPWeaponFireProjectileComponent_Torgue_Craps_C' has a wrong offset!");
static_assert(offsetof(UBPWeaponFireProjectileComponent_Torgue_Craps_C, MaxMagazineSize) == 0x000988, "Member 'UBPWeaponFireProjectileComponent_Torgue_Craps_C::MaxMagazineSize' has a wrong offset!");
static_assert(offsetof(UBPWeaponFireProjectileComponent_Torgue_Craps_C, CrapsShot) == 0x00098C, "Member 'UBPWeaponFireProjectileComponent_Torgue_Craps_C::CrapsShot' has a wrong offset!");
static_assert(offsetof(UBPWeaponFireProjectileComponent_Torgue_Craps_C, CrapsNumber) == 0x000990, "Member 'UBPWeaponFireProjectileComponent_Torgue_Craps_C::CrapsNumber' has a wrong offset!");
static_assert(offsetof(UBPWeaponFireProjectileComponent_Torgue_Craps_C, NumberChosen) == 0x000994, "Member 'UBPWeaponFireProjectileComponent_Torgue_Craps_C::NumberChosen' has a wrong offset!");
static_assert(offsetof(UBPWeaponFireProjectileComponent_Torgue_Craps_C, CrapsNumberExtra) == 0x000998, "Member 'UBPWeaponFireProjectileComponent_Torgue_Craps_C::CrapsNumberExtra' has a wrong offset!");

}

