#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeaponChargeComponent_BanditLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPWeaponChargeComponent_BanditLauncher.BPWeaponChargeComponent_BanditLauncher_C.ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher
// 0x0058 (0x0058 - 0x0000)
struct BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponFireComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGbxAttributeInteger_Value;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGbxAttributeInteger_BaseValue;       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAttributeInteger                   CallFunc_MakeGbxAttributeInteger_ReturnValue;      // 0x003C(0x000C)(HasGetValueTypeHash)
	struct FGbxAttributeInteger                   CallFunc_MakeGbxAttributeInteger_ReturnValue1;     // 0x0048(0x000C)(HasGetValueTypeHash)
};
static_assert(alignof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher) == 0x000008, "Wrong alignment on BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher");
static_assert(sizeof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher) == 0x000058, "Wrong size on BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, EntryPoint) == 0x000000, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, CallFunc_GetWeapon_ReturnValue) == 0x000020, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, CallFunc_BreakGbxAttributeInteger_Value) == 0x000030, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::CallFunc_BreakGbxAttributeInteger_Value' has a wrong offset!");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, CallFunc_BreakGbxAttributeInteger_BaseValue) == 0x000034, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::CallFunc_BreakGbxAttributeInteger_BaseValue' has a wrong offset!");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, CallFunc_MakeGbxAttributeInteger_ReturnValue) == 0x00003C, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::CallFunc_MakeGbxAttributeInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher, CallFunc_MakeGbxAttributeInteger_ReturnValue1) == 0x000048, "Member 'BPWeaponChargeComponent_BanditLauncher_C_ExecuteUbergraph_BPWeaponChargeComponent_BanditLauncher::CallFunc_MakeGbxAttributeInteger_ReturnValue1' has a wrong offset!");

}

