#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWeaponFireProjectileComponent_JAK_Rose

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPWeaponFireProjectileComponent_JAK_Rose.BPWeaponFireProjectileComponent_JAK_Rose_C.ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose
// 0x00A0 (0x00A0 - 0x0000)
struct BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BreakGbxAttributeInteger_Value;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGbxAttributeInteger_BaseValue;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAttributeInteger                   CallFunc_MakeGbxAttributeInteger_ReturnValue;      // 0x0048(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAttributeInteger                   CallFunc_MakeGbxAttributeInteger_ReturnValue1;     // 0x0090(0x000C)(HasGetValueTypeHash)
};
static_assert(alignof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose) == 0x000008, "Wrong alignment on BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose");
static_assert(sizeof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose) == 0x0000A0, "Wrong size on BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, EntryPoint) == 0x000000, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, K2Node_CreateDelegate_OutputDelegate1) == 0x000018, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_GetDataTableValue_OutValue) == 0x000028, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_GetDataTableValue_ReturnValue) == 0x00002C, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, Temp_bool_Has_Been_Initd_Variable) == 0x00002D, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, Temp_bool_IsClosed_Variable) == 0x000038, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_BreakGbxAttributeInteger_Value) == 0x00003C, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_BreakGbxAttributeInteger_Value' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_BreakGbxAttributeInteger_BaseValue) == 0x000040, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_BreakGbxAttributeInteger_BaseValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_MakeGbxAttributeInteger_ReturnValue) == 0x000048, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_MakeGbxAttributeInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_GetWeapon_ReturnValue) == 0x000060, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000068, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_FTrunc_ReturnValue) == 0x00006C, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_Add_IntInt_ReturnValue1) == 0x000070, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, K2Node_CreateDelegate_OutputDelegate2) == 0x000078, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000088, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_Clamp_ReturnValue) == 0x00008C, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose, CallFunc_MakeGbxAttributeInteger_ReturnValue1) == 0x000090, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_ExecuteUbergraph_BPWeaponFireProjectileComponent_JAK_Rose::CallFunc_MakeGbxAttributeInteger_ReturnValue1' has a wrong offset!");

// Function BPWeaponFireProjectileComponent_JAK_Rose.BPWeaponFireProjectileComponent_JAK_Rose_C.GetShotLightProjectileData
// 0x0008 (0x0008 - 0x0000)
struct BPWeaponFireProjectileComponent_JAK_Rose_C_GetShotLightProjectileData final
{
public:
	TSubclassOf<class ULightProjectileData>       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BPWeaponFireProjectileComponent_JAK_Rose_C_GetShotLightProjectileData) == 0x000008, "Wrong alignment on BPWeaponFireProjectileComponent_JAK_Rose_C_GetShotLightProjectileData");
static_assert(sizeof(BPWeaponFireProjectileComponent_JAK_Rose_C_GetShotLightProjectileData) == 0x000008, "Wrong size on BPWeaponFireProjectileComponent_JAK_Rose_C_GetShotLightProjectileData");
static_assert(offsetof(BPWeaponFireProjectileComponent_JAK_Rose_C_GetShotLightProjectileData, ReturnValue) == 0x000000, "Member 'BPWeaponFireProjectileComponent_JAK_Rose_C_GetShotLightProjectileData::ReturnValue' has a wrong offset!");

}

