#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWidget_NumberListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPWidget_NumberListItem.BPWidget_NumberListItem_C
// 0x0030 (0x0348 - 0x0318)
class UBPWidget_NumberListItem_C final : public UGbxListItemNumber
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(Transient, DuplicateTransient)
	class UBUTTON*                                ItemButton_asset;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Label_asset;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedImage_asset;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_asset;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                ValueSlider_asset;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BPWidget_NumberListItem(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPWidget_NumberListItem_C">();
	}
	static class UBPWidget_NumberListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPWidget_NumberListItem_C>();
	}
};
static_assert(alignof(UBPWidget_NumberListItem_C) == 0x000008, "Wrong alignment on UBPWidget_NumberListItem_C");
static_assert(sizeof(UBPWidget_NumberListItem_C) == 0x000348, "Wrong size on UBPWidget_NumberListItem_C");
static_assert(offsetof(UBPWidget_NumberListItem_C, UberGraphFrame) == 0x000318, "Member 'UBPWidget_NumberListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPWidget_NumberListItem_C, ItemButton_asset) == 0x000320, "Member 'UBPWidget_NumberListItem_C::ItemButton_asset' has a wrong offset!");
static_assert(offsetof(UBPWidget_NumberListItem_C, Label_asset) == 0x000328, "Member 'UBPWidget_NumberListItem_C::Label_asset' has a wrong offset!");
static_assert(offsetof(UBPWidget_NumberListItem_C, SelectedImage_asset) == 0x000330, "Member 'UBPWidget_NumberListItem_C::SelectedImage_asset' has a wrong offset!");
static_assert(offsetof(UBPWidget_NumberListItem_C, Value_asset) == 0x000338, "Member 'UBPWidget_NumberListItem_C::Value_asset' has a wrong offset!");
static_assert(offsetof(UBPWidget_NumberListItem_C, ValueSlider_asset) == 0x000340, "Member 'UBPWidget_NumberListItem_C::ValueSlider_asset' has a wrong offset!");

}

