#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraBehavior_Vehicle_TransitionIn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxCameraModes_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraBehavior_Vehicle_TransitionIn.CameraBehavior_Vehicle_TransitionIn_C
// 0x0018 (0x0048 - 0x0030)
class UCameraBehavior_Vehicle_TransitionIn_C final : public UCameraBehavior
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(Transient, DuplicateTransient)
	class UGbxActionComponent*                    ActionComponent;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PlayerMesh;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CameraBehavior_Vehicle_TransitionIn(int32 EntryPoint);
	void Start(class UCameraState* State);
	void Update(float DeltaTime, class UCameraState* State);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraBehavior_Vehicle_TransitionIn_C">();
	}
	static class UCameraBehavior_Vehicle_TransitionIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraBehavior_Vehicle_TransitionIn_C>();
	}
};
static_assert(alignof(UCameraBehavior_Vehicle_TransitionIn_C) == 0x000008, "Wrong alignment on UCameraBehavior_Vehicle_TransitionIn_C");
static_assert(sizeof(UCameraBehavior_Vehicle_TransitionIn_C) == 0x000048, "Wrong size on UCameraBehavior_Vehicle_TransitionIn_C");
static_assert(offsetof(UCameraBehavior_Vehicle_TransitionIn_C, UberGraphFrame) == 0x000030, "Member 'UCameraBehavior_Vehicle_TransitionIn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCameraBehavior_Vehicle_TransitionIn_C, ActionComponent) == 0x000038, "Member 'UCameraBehavior_Vehicle_TransitionIn_C::ActionComponent' has a wrong offset!");
static_assert(offsetof(UCameraBehavior_Vehicle_TransitionIn_C, PlayerMesh) == 0x000040, "Member 'UCameraBehavior_Vehicle_TransitionIn_C::PlayerMesh' has a wrong offset!");

}

