#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CE_Siren_Confuse

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function CE_Siren_Confuse.CE_Siren_Confuse_C.ExecuteUbergraph_CE_Siren_Confuse
// 0x0028 (0x0028 - 0x0000)
struct CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            K2Node_Event_ActionEndState;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor1;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse) == 0x000008, "Wrong alignment on CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse");
static_assert(sizeof(CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse) == 0x000028, "Wrong size on CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse");
static_assert(offsetof(CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse, EntryPoint) == 0x000000, "Member 'CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse::EntryPoint' has a wrong offset!");
static_assert(offsetof(CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse, K2Node_Event_ActionEndState) == 0x000004, "Member 'CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse::K2Node_Event_ActionEndState' has a wrong offset!");
static_assert(offsetof(CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse, K2Node_Event_Actor) == 0x000008, "Member 'CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000010, "Member 'CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse, K2Node_Event_Actor1) == 0x000018, "Member 'CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse::K2Node_Event_Actor1' has a wrong offset!");
static_assert(offsetof(CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse, CallFunc_RemoveGameplayTag_ReturnValue) == 0x000020, "Member 'CE_Siren_Confuse_C_ExecuteUbergraph_CE_Siren_Confuse::CallFunc_RemoveGameplayTag_ReturnValue' has a wrong offset!");

// Function CE_Siren_Confuse.CE_Siren_Confuse_C.OnEnd
// 0x0010 (0x0010 - 0x0000)
struct CE_Siren_Confuse_C_OnEnd final
{
public:
	EGbxActionEndState                            ActionEndState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CE_Siren_Confuse_C_OnEnd) == 0x000008, "Wrong alignment on CE_Siren_Confuse_C_OnEnd");
static_assert(sizeof(CE_Siren_Confuse_C_OnEnd) == 0x000010, "Wrong size on CE_Siren_Confuse_C_OnEnd");
static_assert(offsetof(CE_Siren_Confuse_C_OnEnd, ActionEndState) == 0x000000, "Member 'CE_Siren_Confuse_C_OnEnd::ActionEndState' has a wrong offset!");
static_assert(offsetof(CE_Siren_Confuse_C_OnEnd, Actor) == 0x000008, "Member 'CE_Siren_Confuse_C_OnEnd::Actor' has a wrong offset!");

// Function CE_Siren_Confuse.CE_Siren_Confuse_C.OnBegin
// 0x0008 (0x0008 - 0x0000)
struct CE_Siren_Confuse_C_OnBegin final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CE_Siren_Confuse_C_OnBegin) == 0x000008, "Wrong alignment on CE_Siren_Confuse_C_OnBegin");
static_assert(sizeof(CE_Siren_Confuse_C_OnBegin) == 0x000008, "Wrong size on CE_Siren_Confuse_C_OnBegin");
static_assert(offsetof(CE_Siren_Confuse_C_OnBegin, Actor) == 0x000000, "Member 'CE_Siren_Confuse_C_OnBegin::Actor' has a wrong offset!");

}

