#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CE_Siren_Confuse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "CE_PlayerShared_Skills_Confuse_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CE_Siren_Confuse.CE_Siren_Confuse_C
// 0x0028 (0x0190 - 0x0168)
class UCE_Siren_Confuse_C final : public UCE_PlayerShared_Skills_Confuse_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CE_Siren_Confuse_C;                 // 0x0168(0x0008)(Transient, DuplicateTransient)
	class AOakCharacter_Default*                  ImConfused;                                        // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableValueHandle                  Confuse_Duration;                                  // 0x0178(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_CE_Siren_Confuse(int32 EntryPoint);
	void OnEnd(EGbxActionEndState ActionEndState, class AActor* Actor);
	void OnBegin(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CE_Siren_Confuse_C">();
	}
	static class UCE_Siren_Confuse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCE_Siren_Confuse_C>();
	}
};
static_assert(alignof(UCE_Siren_Confuse_C) == 0x000008, "Wrong alignment on UCE_Siren_Confuse_C");
static_assert(sizeof(UCE_Siren_Confuse_C) == 0x000190, "Wrong size on UCE_Siren_Confuse_C");
static_assert(offsetof(UCE_Siren_Confuse_C, UberGraphFrame_CE_Siren_Confuse_C) == 0x000168, "Member 'UCE_Siren_Confuse_C::UberGraphFrame_CE_Siren_Confuse_C' has a wrong offset!");
static_assert(offsetof(UCE_Siren_Confuse_C, ImConfused) == 0x000170, "Member 'UCE_Siren_Confuse_C::ImConfused' has a wrong offset!");
static_assert(offsetof(UCE_Siren_Confuse_C, Confuse_Duration) == 0x000178, "Member 'UCE_Siren_Confuse_C::Confuse_Duration' has a wrong offset!");

}

