#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Challenge_EridianWriting_Planet

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"


namespace SDK::Params
{

// Function Challenge_EridianWriting_Planet.Challenge_EridianWriting_Planet_C.ExecuteUbergraph_Challenge_EridianWriting_Planet
// 0x04A8 (0x04A8 - 0x0000)
struct Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         K2Node_MakeStruct_DialogContext;                   // 0x0008(0x0218)()
	const class AGbxPlayerController*             K2Node_Event_CompletedPlayer;                      // 0x0220(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDialogTimeSlotData*                    CallFunc_ResolveDialogTimeSlotReference_TimeSlot;  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDialogScriptData*                      CallFunc_ResolveDialogTimeSlotReference_Script;    // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         K2Node_MakeStruct_DialogContext1;                  // 0x0238(0x0218)()
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChallengesComponent*                   K2Node_Event_OwningChallenges;                     // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_Event_AssociatedCharacter;                  // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0470(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0484(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogTimeSlotData*                    CallFunc_ResolveDialogTimeSlotReference_TimeSlot1; // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDialogScriptData*                      CallFunc_ResolveDialogTimeSlotReference_Script1;   // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet) == 0x000008, "Wrong alignment on Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet");
static_assert(sizeof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet) == 0x0004A8, "Wrong size on Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, EntryPoint) == 0x000000, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::EntryPoint' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, K2Node_MakeStruct_DialogContext) == 0x000008, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::K2Node_MakeStruct_DialogContext' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, K2Node_Event_CompletedPlayer) == 0x000220, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::K2Node_Event_CompletedPlayer' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_ResolveDialogTimeSlotReference_TimeSlot) == 0x000228, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_ResolveDialogTimeSlotReference_TimeSlot' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_ResolveDialogTimeSlotReference_Script) == 0x000230, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_ResolveDialogTimeSlotReference_Script' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, K2Node_MakeStruct_DialogContext1) == 0x000238, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::K2Node_MakeStruct_DialogContext1' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_GetOwner_ReturnValue) == 0x000450, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, K2Node_Event_OwningChallenges) == 0x000458, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::K2Node_Event_OwningChallenges' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, K2Node_Event_AssociatedCharacter) == 0x000460, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::K2Node_Event_AssociatedCharacter' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_GetOwner_ReturnValue1) == 0x000468, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_FinishSpeak_Conversation) == 0x000470, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_FinishSpeak_SequenceID) == 0x00047C, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_FinishSpeak_ReturnValue) == 0x000480, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_FinishSpeak_Conversation1) == 0x000484, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_FinishSpeak_Conversation1' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_FinishSpeak_SequenceID1) == 0x000490, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_FinishSpeak_SequenceID1' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_FinishSpeak_ReturnValue1) == 0x000494, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_FinishSpeak_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_ResolveDialogTimeSlotReference_TimeSlot1) == 0x000498, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_ResolveDialogTimeSlotReference_TimeSlot1' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet, CallFunc_ResolveDialogTimeSlotReference_Script1) == 0x0004A0, "Member 'Challenge_EridianWriting_Planet_C_ExecuteUbergraph_Challenge_EridianWriting_Planet::CallFunc_ResolveDialogTimeSlotReference_Script1' has a wrong offset!");

// Function Challenge_EridianWriting_Planet.Challenge_EridianWriting_Planet_C.CompletedChallenge
// 0x0008 (0x0008 - 0x0000)
struct Challenge_EridianWriting_Planet_C_CompletedChallenge final
{
public:
	const class AGbxPlayerController*             CompletedPlayer;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_EridianWriting_Planet_C_CompletedChallenge) == 0x000008, "Wrong alignment on Challenge_EridianWriting_Planet_C_CompletedChallenge");
static_assert(sizeof(Challenge_EridianWriting_Planet_C_CompletedChallenge) == 0x000008, "Wrong size on Challenge_EridianWriting_Planet_C_CompletedChallenge");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_CompletedChallenge, CompletedPlayer) == 0x000000, "Member 'Challenge_EridianWriting_Planet_C_CompletedChallenge::CompletedPlayer' has a wrong offset!");

// Function Challenge_EridianWriting_Planet.Challenge_EridianWriting_Planet_C.OnInitChallengeInstance
// 0x0010 (0x0010 - 0x0000)
struct Challenge_EridianWriting_Planet_C_OnInitChallengeInstance final
{
public:
	class UChallengesComponent*                   OwningChallenges;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          AssociatedCharacter;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_EridianWriting_Planet_C_OnInitChallengeInstance) == 0x000008, "Wrong alignment on Challenge_EridianWriting_Planet_C_OnInitChallengeInstance");
static_assert(sizeof(Challenge_EridianWriting_Planet_C_OnInitChallengeInstance) == 0x000010, "Wrong size on Challenge_EridianWriting_Planet_C_OnInitChallengeInstance");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_OnInitChallengeInstance, OwningChallenges) == 0x000000, "Member 'Challenge_EridianWriting_Planet_C_OnInitChallengeInstance::OwningChallenges' has a wrong offset!");
static_assert(offsetof(Challenge_EridianWriting_Planet_C_OnInitChallengeInstance, AssociatedCharacter) == 0x000008, "Member 'Challenge_EridianWriting_Planet_C_OnInitChallengeInstance::AssociatedCharacter' has a wrong offset!");

}

