#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Challenge_VaultReward_TrueGuardian

#include "Basic.hpp"


namespace SDK::Params
{

// Function Challenge_VaultReward_TrueGuardian.Challenge_VaultReward_TrueGuardian_C.ExecuteUbergraph_Challenge_VaultReward_TrueGuardian
// 0x0028 (0x0028 - 0x0000)
struct Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChallengesComponent*                   K2Node_Event_OwningChallenges;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_Event_AssociatedCharacter;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AGbxPlayerController*             K2Node_Event_CompletedPlayer;                      // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerGuardianRankComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian) == 0x000008, "Wrong alignment on Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian");
static_assert(sizeof(Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian) == 0x000028, "Wrong size on Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian, EntryPoint) == 0x000000, "Member 'Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian::EntryPoint' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian, K2Node_Event_OwningChallenges) == 0x000008, "Member 'Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian::K2Node_Event_OwningChallenges' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian, K2Node_Event_AssociatedCharacter) == 0x000010, "Member 'Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian::K2Node_Event_AssociatedCharacter' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian, K2Node_Event_CompletedPlayer) == 0x000018, "Member 'Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian::K2Node_Event_CompletedPlayer' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'Challenge_VaultReward_TrueGuardian_C_ExecuteUbergraph_Challenge_VaultReward_TrueGuardian::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function Challenge_VaultReward_TrueGuardian.Challenge_VaultReward_TrueGuardian_C.OnInitChallengeInstance
// 0x0010 (0x0010 - 0x0000)
struct Challenge_VaultReward_TrueGuardian_C_OnInitChallengeInstance final
{
public:
	class UChallengesComponent*                   OwningChallenges;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          AssociatedCharacter;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_VaultReward_TrueGuardian_C_OnInitChallengeInstance) == 0x000008, "Wrong alignment on Challenge_VaultReward_TrueGuardian_C_OnInitChallengeInstance");
static_assert(sizeof(Challenge_VaultReward_TrueGuardian_C_OnInitChallengeInstance) == 0x000010, "Wrong size on Challenge_VaultReward_TrueGuardian_C_OnInitChallengeInstance");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_OnInitChallengeInstance, OwningChallenges) == 0x000000, "Member 'Challenge_VaultReward_TrueGuardian_C_OnInitChallengeInstance::OwningChallenges' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_OnInitChallengeInstance, AssociatedCharacter) == 0x000008, "Member 'Challenge_VaultReward_TrueGuardian_C_OnInitChallengeInstance::AssociatedCharacter' has a wrong offset!");

// Function Challenge_VaultReward_TrueGuardian.Challenge_VaultReward_TrueGuardian_C.CompletedChallenge
// 0x0008 (0x0008 - 0x0000)
struct Challenge_VaultReward_TrueGuardian_C_CompletedChallenge final
{
public:
	const class AGbxPlayerController*             CompletedPlayer;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_VaultReward_TrueGuardian_C_CompletedChallenge) == 0x000008, "Wrong alignment on Challenge_VaultReward_TrueGuardian_C_CompletedChallenge");
static_assert(sizeof(Challenge_VaultReward_TrueGuardian_C_CompletedChallenge) == 0x000008, "Wrong size on Challenge_VaultReward_TrueGuardian_C_CompletedChallenge");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_CompletedChallenge, CompletedPlayer) == 0x000000, "Member 'Challenge_VaultReward_TrueGuardian_C_CompletedChallenge::CompletedPlayer' has a wrong offset!");

// Function Challenge_VaultReward_TrueGuardian.Challenge_VaultReward_TrueGuardian_C.SetBinds
// 0x0030 (0x0030 - 0x0000)
struct Challenge_VaultReward_TrueGuardian_C_SetBinds final
{
public:
	class UChallengesComponent*                   ChallengeComponent;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerMissionComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Challenge_VaultReward_TrueGuardian_C_SetBinds) == 0x000008, "Wrong alignment on Challenge_VaultReward_TrueGuardian_C_SetBinds");
static_assert(sizeof(Challenge_VaultReward_TrueGuardian_C_SetBinds) == 0x000030, "Wrong size on Challenge_VaultReward_TrueGuardian_C_SetBinds");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_SetBinds, ChallengeComponent) == 0x000000, "Member 'Challenge_VaultReward_TrueGuardian_C_SetBinds::ChallengeComponent' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_SetBinds, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Challenge_VaultReward_TrueGuardian_C_SetBinds::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_SetBinds, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'Challenge_VaultReward_TrueGuardian_C_SetBinds::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_SetBinds, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'Challenge_VaultReward_TrueGuardian_C_SetBinds::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_TrueGuardian_C_SetBinds, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Challenge_VaultReward_TrueGuardian_C_SetBinds::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

