#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Challenge_BloodyHarvest_13_AnointedLegendary

#include "Basic.hpp"


namespace SDK::Params
{

// Function Challenge_BloodyHarvest_13_AnointedLegendary.Challenge_BloodyHarvest_13_AnointedLegendary_C.ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary
// 0x0050 (0x0050 - 0x0000)
struct Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChallengesComponent*                   K2Node_Event_OwningChallenges;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_Event_AssociatedCharacter;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* EquippedActor, class UInventorySlotData* SlotData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AGbxPlayerController*             K2Node_Event_CompletedPlayer;                      // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary) == 0x000008, "Wrong alignment on Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary");
static_assert(sizeof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary) == 0x000050, "Wrong size on Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary, EntryPoint) == 0x000000, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary::EntryPoint' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary, K2Node_Event_OwningChallenges) == 0x000008, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary::K2Node_Event_OwningChallenges' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary, K2Node_Event_AssociatedCharacter) == 0x000010, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary::K2Node_Event_AssociatedCharacter' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000020, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary, K2Node_Event_CompletedPlayer) == 0x000048, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_ExecuteUbergraph_Challenge_BloodyHarvest_13_AnointedLegendary::K2Node_Event_CompletedPlayer' has a wrong offset!");

// Function Challenge_BloodyHarvest_13_AnointedLegendary.Challenge_BloodyHarvest_13_AnointedLegendary_C.CompletedChallenge
// 0x0008 (0x0008 - 0x0000)
struct Challenge_BloodyHarvest_13_AnointedLegendary_C_CompletedChallenge final
{
public:
	const class AGbxPlayerController*             CompletedPlayer;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CompletedChallenge) == 0x000008, "Wrong alignment on Challenge_BloodyHarvest_13_AnointedLegendary_C_CompletedChallenge");
static_assert(sizeof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CompletedChallenge) == 0x000008, "Wrong size on Challenge_BloodyHarvest_13_AnointedLegendary_C_CompletedChallenge");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CompletedChallenge, CompletedPlayer) == 0x000000, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CompletedChallenge::CompletedPlayer' has a wrong offset!");

// Function Challenge_BloodyHarvest_13_AnointedLegendary.Challenge_BloodyHarvest_13_AnointedLegendary_C.OnInitChallengeInstance
// 0x0010 (0x0010 - 0x0000)
struct Challenge_BloodyHarvest_13_AnointedLegendary_C_OnInitChallengeInstance final
{
public:
	class UChallengesComponent*                   OwningChallenges;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          AssociatedCharacter;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_BloodyHarvest_13_AnointedLegendary_C_OnInitChallengeInstance) == 0x000008, "Wrong alignment on Challenge_BloodyHarvest_13_AnointedLegendary_C_OnInitChallengeInstance");
static_assert(sizeof(Challenge_BloodyHarvest_13_AnointedLegendary_C_OnInitChallengeInstance) == 0x000010, "Wrong size on Challenge_BloodyHarvest_13_AnointedLegendary_C_OnInitChallengeInstance");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_OnInitChallengeInstance, OwningChallenges) == 0x000000, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_OnInitChallengeInstance::OwningChallenges' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_OnInitChallengeInstance, AssociatedCharacter) == 0x000008, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_OnInitChallengeInstance::AssociatedCharacter' has a wrong offset!");

// Function Challenge_BloodyHarvest_13_AnointedLegendary.Challenge_BloodyHarvest_13_AnointedLegendary_C.CheckInvSlotIsFromLeague
// 0x0040 (0x0040 - 0x0000)
struct Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague final
{
public:
	class UInventorySlotData*                     InvSlot;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBHAnointedGear;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetEquippedInventoryForSlot_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBalanceStateComponent*        CallFunc_GetInventoryBalanceState_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInventoryFromLeague_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryRarityData*                   CallFunc_GetInventoryRarityData_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague) == 0x000008, "Wrong alignment on Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague");
static_assert(sizeof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague) == 0x000040, "Wrong size on Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague, InvSlot) == 0x000000, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague::InvSlot' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague, IsBHAnointedGear) == 0x000008, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague::IsBHAnointedGear' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague, CallFunc_GetEquippedInventoryForSlot_ReturnValue) == 0x000010, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague::CallFunc_GetEquippedInventoryForSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague, CallFunc_GetInventoryBalanceState_ReturnValue) == 0x000020, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague::CallFunc_GetInventoryBalanceState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague, CallFunc_IsInventoryFromLeague_ReturnValue) == 0x000028, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague::CallFunc_IsInventoryFromLeague_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague, CallFunc_GetInventoryRarityData_ReturnValue) == 0x000030, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague::CallFunc_GetInventoryRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckInvSlotIsFromLeague::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Challenge_BloodyHarvest_13_AnointedLegendary.Challenge_BloodyHarvest_13_AnointedLegendary_C.CheckAllSlots
// 0x0018 (0x0018 - 0x0000)
struct Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots final
{
public:
	class AActor*                                 EquippedActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventorySlotData*                     SlotData;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInvSlotIsFromLeague_IsBHAnointedGear; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots) == 0x000008, "Wrong alignment on Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots");
static_assert(sizeof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots) == 0x000018, "Wrong size on Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots, EquippedActor) == 0x000000, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots::EquippedActor' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots, SlotData) == 0x000008, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots::SlotData' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots, CallFunc_CheckInvSlotIsFromLeague_IsBHAnointedGear) == 0x000010, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots::CallFunc_CheckInvSlotIsFromLeague_IsBHAnointedGear' has a wrong offset!");
static_assert(offsetof(Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots, CallFunc_Array_Contains_ReturnValue) == 0x000011, "Member 'Challenge_BloodyHarvest_13_AnointedLegendary_C_CheckAllSlots::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

}

