#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Challenge_VaultReward_ArtifactSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function Challenge_VaultReward_ArtifactSlot.Challenge_VaultReward_ArtifactSlot_C.ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot
// 0x0040 (0x0040 - 0x0000)
struct Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AGbxPlayerController*             K2Node_Event_CompletedPlayer;                      // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxCharacter*                          CallFunc_GetAssociatedPrimaryCharacter_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot) == 0x000008, "Wrong alignment on Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot");
static_assert(sizeof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot) == 0x000040, "Wrong size on Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot");
static_assert(offsetof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot, EntryPoint) == 0x000000, "Member 'Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot, K2Node_Event_CompletedPlayer) == 0x000008, "Member 'Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot::K2Node_Event_CompletedPlayer' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000010, "Member 'Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot, CallFunc_GetAssociatedPrimaryCharacter_ReturnValue) == 0x000020, "Member 'Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot::CallFunc_GetAssociatedPrimaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot, K2Node_DynamicCast_AsOak_Character) == 0x000030, "Member 'Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'Challenge_VaultReward_ArtifactSlot_C_ExecuteUbergraph_Challenge_VaultReward_ArtifactSlot::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function Challenge_VaultReward_ArtifactSlot.Challenge_VaultReward_ArtifactSlot_C.CompletedChallenge
// 0x0008 (0x0008 - 0x0000)
struct Challenge_VaultReward_ArtifactSlot_C_CompletedChallenge final
{
public:
	const class AGbxPlayerController*             CompletedPlayer;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Challenge_VaultReward_ArtifactSlot_C_CompletedChallenge) == 0x000008, "Wrong alignment on Challenge_VaultReward_ArtifactSlot_C_CompletedChallenge");
static_assert(sizeof(Challenge_VaultReward_ArtifactSlot_C_CompletedChallenge) == 0x000008, "Wrong size on Challenge_VaultReward_ArtifactSlot_C_CompletedChallenge");
static_assert(offsetof(Challenge_VaultReward_ArtifactSlot_C_CompletedChallenge, CompletedPlayer) == 0x000000, "Member 'Challenge_VaultReward_ArtifactSlot_C_CompletedChallenge::CompletedPlayer' has a wrong offset!");

}

