#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Challenge_Sabotage_RewardStat_DLC1

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxDialog_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Challenge_Sabotage_RewardStat_DLC1.Challenge_Sabotage_RewardStat_DLC1_C
// 0x0058 (0x02B8 - 0x0260)
class UChallenge_Sabotage_RewardStat_DLC1_C : public UOakChallenge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(Transient, DuplicateTransient)
	struct FDataTableRowHandle                    NPCMailRow;                                        // 0x0268(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FDialogTimeSlotReference               CrewCompletionDialog;                              // 0x0278(0x0040)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_Challenge_Sabotage_RewardStat_DLC1(int32 EntryPoint);
	void CompletedChallenge(const class AGbxPlayerController* CompletedPlayer);
	void OnInitChallengeInstance(class UChallengesComponent* OwningChallenges, class AGbxCharacter* AssociatedCharacter);
	void PlayCompletionVO(class AGbxPlayerController* PlayerController, bool* Played);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Challenge_Sabotage_RewardStat_DLC1_C">();
	}
	static class UChallenge_Sabotage_RewardStat_DLC1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallenge_Sabotage_RewardStat_DLC1_C>();
	}
};
static_assert(alignof(UChallenge_Sabotage_RewardStat_DLC1_C) == 0x000008, "Wrong alignment on UChallenge_Sabotage_RewardStat_DLC1_C");
static_assert(sizeof(UChallenge_Sabotage_RewardStat_DLC1_C) == 0x0002B8, "Wrong size on UChallenge_Sabotage_RewardStat_DLC1_C");
static_assert(offsetof(UChallenge_Sabotage_RewardStat_DLC1_C, UberGraphFrame) == 0x000260, "Member 'UChallenge_Sabotage_RewardStat_DLC1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallenge_Sabotage_RewardStat_DLC1_C, NPCMailRow) == 0x000268, "Member 'UChallenge_Sabotage_RewardStat_DLC1_C::NPCMailRow' has a wrong offset!");
static_assert(offsetof(UChallenge_Sabotage_RewardStat_DLC1_C, CrewCompletionDialog) == 0x000278, "Member 'UChallenge_Sabotage_RewardStat_DLC1_C::CrewCompletionDialog' has a wrong offset!");

}

