#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cond_AIBlackboardIntCheck

#include "Basic.hpp"


namespace SDK::Params
{

// Function Cond_AIBlackboardIntCheck.Cond_AIBlackboardIntCheck_C.EvaluateCondition
// 0x0050 (0x0050 - 0x0000)
struct Cond_AIBlackboardIntCheck_C_EvaluateCondition final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalContext;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetAssociatedController_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValueAsInt_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue5;              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cond_AIBlackboardIntCheck_C_EvaluateCondition) == 0x000008, "Wrong alignment on Cond_AIBlackboardIntCheck_C_EvaluateCondition");
static_assert(sizeof(Cond_AIBlackboardIntCheck_C_EvaluateCondition) == 0x000050, "Wrong size on Cond_AIBlackboardIntCheck_C_EvaluateCondition");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, Context) == 0x000000, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::Context' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, OptionalContext) == 0x000008, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::OptionalContext' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, ReturnValue) == 0x000010, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, K2Node_DynamicCast_AsActor) == 0x000018, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_GetAssociatedController_ReturnValue) == 0x000028, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_GetAssociatedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_GetBlackboard_ReturnValue) == 0x000030, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_GetValueAsInt_ReturnValue) == 0x00003C, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_GetValueAsInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Greater_IntInt_ReturnValue) == 0x000041, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Less_IntInt_ReturnValue1) == 0x000042, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Greater_IntInt_ReturnValue1) == 0x000043, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Less_IntInt_ReturnValue2) == 0x000044, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Greater_IntInt_ReturnValue2) == 0x000045, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Less_IntInt_ReturnValue3) == 0x000046, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Greater_IntInt_ReturnValue3) == 0x000047, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Less_IntInt_ReturnValue4) == 0x000048, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Greater_IntInt_ReturnValue4) == 0x000049, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Greater_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Less_IntInt_ReturnValue5) == 0x00004A, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Cond_AIBlackboardIntCheck_C_EvaluateCondition, CallFunc_Greater_IntInt_ReturnValue5) == 0x00004B, "Member 'Cond_AIBlackboardIntCheck_C_EvaluateCondition::CallFunc_Greater_IntInt_ReturnValue5' has a wrong offset!");

}

