#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_Operative_BarrierBash

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_Operative_BarrierBash.Condition_Operative_BarrierBash_C.EvaluateCondition
// 0x0068 (0x0068 - 0x0000)
struct Condition_Operative_BarrierBash_C_EvaluateCondition final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalContext;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterface_Operative_Character_C> K2Node_DynamicCast_AsInterface_Operative_Character; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility_Barrier*              CallFunc_GetBarrierActionAbility_Res;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRuntimeMod_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInterface_Operative_DeployBarrier_C> K2Node_DynamicCast_AsInterface_Operative_Deploy_Barrier; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHoldingBarrier_Res;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_Operative_BarrierBash_C_EvaluateCondition) == 0x000008, "Wrong alignment on Condition_Operative_BarrierBash_C_EvaluateCondition");
static_assert(sizeof(Condition_Operative_BarrierBash_C_EvaluateCondition) == 0x000068, "Wrong size on Condition_Operative_BarrierBash_C_EvaluateCondition");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, Context) == 0x000000, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::Context' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, OptionalContext) == 0x000008, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::OptionalContext' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, ReturnValue) == 0x000010, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, K2Node_DynamicCast_AsActor) == 0x000018, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, K2Node_DynamicCast_AsInterface_Operative_Character) == 0x000028, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::K2Node_DynamicCast_AsInterface_Operative_Character' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, CallFunc_GetBarrierActionAbility_Res) == 0x000040, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::CallFunc_GetBarrierActionAbility_Res' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, CallFunc_HasRuntimeMod_ReturnValue) == 0x000048, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::CallFunc_HasRuntimeMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, K2Node_DynamicCast_AsInterface_Operative_Deploy_Barrier) == 0x000050, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::K2Node_DynamicCast_AsInterface_Operative_Deploy_Barrier' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, CallFunc_IsHoldingBarrier_Res) == 0x000061, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::CallFunc_IsHoldingBarrier_Res' has a wrong offset!");
static_assert(offsetof(Condition_Operative_BarrierBash_C_EvaluateCondition, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'Condition_Operative_BarrierBash_C_EvaluateCondition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

