#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cond_AiCheckCoverStyle

#include "Basic.hpp"


namespace SDK::Params
{

// Function Cond_AiCheckCoverStyle.Cond_AICheckCoverStyle_C.EvaluateCondition
// 0x0090 (0x0090 - 0x0000)
struct Cond_AICheckCoverStyle_C_EvaluateCondition final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalContext;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxAIController*                       K2Node_DynamicCast_AsGbx_AIController;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          CallFunc_GetGbxCharacter_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCoverUserComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCoverUserComponent*                    CallFunc_GetComponentByClass_ReturnValue1;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCoverStyleData*                        CallFunc_GetStyle_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCoverStyleData*                        CallFunc_GetStyle_ReturnValue1;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          K2Node_DynamicCast_AsGbx_Character;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoverUserComponent*                    CallFunc_GetComponentByClass_ReturnValue2;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCoverStyleData*                        CallFunc_GetStyle_ReturnValue2;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue1;     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cond_AICheckCoverStyle_C_EvaluateCondition) == 0x000008, "Wrong alignment on Cond_AICheckCoverStyle_C_EvaluateCondition");
static_assert(sizeof(Cond_AICheckCoverStyle_C_EvaluateCondition) == 0x000090, "Wrong size on Cond_AICheckCoverStyle_C_EvaluateCondition");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, Context) == 0x000000, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::Context' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, OptionalContext) == 0x000008, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::OptionalContext' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, ReturnValue) == 0x000010, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, K2Node_DynamicCast_AsActor) == 0x000018, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, K2Node_DynamicCast_AsGbx_AIController) == 0x000028, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::K2Node_DynamicCast_AsGbx_AIController' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_GetGbxCharacter_ReturnValue) == 0x000040, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_GetGbxCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_GetComponentByClass_ReturnValue1) == 0x000050, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_GetStyle_ReturnValue) == 0x000058, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_GetStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_GetStyle_ReturnValue1) == 0x000060, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_GetStyle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, K2Node_DynamicCast_AsGbx_Character) == 0x000068, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::K2Node_DynamicCast_AsGbx_Character' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000071, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_GetComponentByClass_ReturnValue2) == 0x000078, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_GetStyle_ReturnValue2) == 0x000080, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_GetStyle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_EqualEqual_ObjectObject_ReturnValue1) == 0x000088, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_EqualEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Cond_AICheckCoverStyle_C_EvaluateCondition, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000089, "Member 'Cond_AICheckCoverStyle_C_EvaluateCondition::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");

}

