#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cond_SpawnedAlliesBelowThreshold

#include "Basic.hpp"

#include "GbxGameSystemCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Cond_SpawnedAlliesBelowThreshold.Cond_SpawnedAlliesBelowThreshold_C
// 0x0008 (0x0090 - 0x0088)
class UCond_SpawnedAlliesBelowThreshold_C final : public UGbxCondition_Blueprint
{
public:
	int32                                         ThresholdValue;                                    // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IncludeExternal;                                   // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IncludeGroup;                                      // 0x008D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IncludeSelf;                                       // 0x008E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool EvaluateCondition(class UObject* Context, class UObject* OptionalContext) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cond_SpawnedAlliesBelowThreshold_C">();
	}
	static class UCond_SpawnedAlliesBelowThreshold_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCond_SpawnedAlliesBelowThreshold_C>();
	}
};
static_assert(alignof(UCond_SpawnedAlliesBelowThreshold_C) == 0x000008, "Wrong alignment on UCond_SpawnedAlliesBelowThreshold_C");
static_assert(sizeof(UCond_SpawnedAlliesBelowThreshold_C) == 0x000090, "Wrong size on UCond_SpawnedAlliesBelowThreshold_C");
static_assert(offsetof(UCond_SpawnedAlliesBelowThreshold_C, ThresholdValue) == 0x000088, "Member 'UCond_SpawnedAlliesBelowThreshold_C::ThresholdValue' has a wrong offset!");
static_assert(offsetof(UCond_SpawnedAlliesBelowThreshold_C, IncludeExternal) == 0x00008C, "Member 'UCond_SpawnedAlliesBelowThreshold_C::IncludeExternal' has a wrong offset!");
static_assert(offsetof(UCond_SpawnedAlliesBelowThreshold_C, IncludeGroup) == 0x00008D, "Member 'UCond_SpawnedAlliesBelowThreshold_C::IncludeGroup' has a wrong offset!");
static_assert(offsetof(UCond_SpawnedAlliesBelowThreshold_C, IncludeSelf) == 0x00008E, "Member 'UCond_SpawnedAlliesBelowThreshold_C::IncludeSelf' has a wrong offset!");

}

