#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_TargetIsForward

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_TargetIsForward.Condition_TargetIsForward_C.EvaluateCondition
// 0x0068 (0x0068 - 0x0000)
struct Condition_TargetIsForward_C_EvaluateCondition final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalContext;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Controller;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetAssociatedPawn_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTargetingComponent*                    CallFunc_FindActorTargetingComponent_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBestTargetActor_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetAssociatedController_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDotProductTo_ReturnValue;    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_TargetIsForward_C_EvaluateCondition) == 0x000008, "Wrong alignment on Condition_TargetIsForward_C_EvaluateCondition");
static_assert(sizeof(Condition_TargetIsForward_C_EvaluateCondition) == 0x000068, "Wrong size on Condition_TargetIsForward_C_EvaluateCondition");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, Context) == 0x000000, "Member 'Condition_TargetIsForward_C_EvaluateCondition::Context' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, OptionalContext) == 0x000008, "Member 'Condition_TargetIsForward_C_EvaluateCondition::OptionalContext' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, ReturnValue) == 0x000010, "Member 'Condition_TargetIsForward_C_EvaluateCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, Controller) == 0x000018, "Member 'Condition_TargetIsForward_C_EvaluateCondition::Controller' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, Target) == 0x000020, "Member 'Condition_TargetIsForward_C_EvaluateCondition::Target' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, Actor) == 0x000028, "Member 'Condition_TargetIsForward_C_EvaluateCondition::Actor' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, K2Node_DynamicCast_AsActor) == 0x000030, "Member 'Condition_TargetIsForward_C_EvaluateCondition::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Condition_TargetIsForward_C_EvaluateCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, CallFunc_GetAssociatedPawn_ReturnValue) == 0x000040, "Member 'Condition_TargetIsForward_C_EvaluateCondition::CallFunc_GetAssociatedPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, CallFunc_FindActorTargetingComponent_ReturnValue) == 0x000048, "Member 'Condition_TargetIsForward_C_EvaluateCondition::CallFunc_FindActorTargetingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, CallFunc_GetBestTargetActor_ReturnValue) == 0x000050, "Member 'Condition_TargetIsForward_C_EvaluateCondition::CallFunc_GetBestTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, CallFunc_GetAssociatedController_ReturnValue) == 0x000058, "Member 'Condition_TargetIsForward_C_EvaluateCondition::CallFunc_GetAssociatedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, CallFunc_GetHorizontalDotProductTo_ReturnValue) == 0x000060, "Member 'Condition_TargetIsForward_C_EvaluateCondition::CallFunc_GetHorizontalDotProductTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000064, "Member 'Condition_TargetIsForward_C_EvaluateCondition::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsForward_C_EvaluateCondition, CallFunc_Less_FloatFloat_ReturnValue) == 0x000065, "Member 'Condition_TargetIsForward_C_EvaluateCondition::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

