#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_Inverse

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_Inverse.Condition_Inverse_C.EvaluateCondition
// 0x0018 (0x0018 - 0x0000)
struct Condition_Inverse_C_EvaluateCondition final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalContext;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_Inverse_C_EvaluateCondition) == 0x000008, "Wrong alignment on Condition_Inverse_C_EvaluateCondition");
static_assert(sizeof(Condition_Inverse_C_EvaluateCondition) == 0x000018, "Wrong size on Condition_Inverse_C_EvaluateCondition");
static_assert(offsetof(Condition_Inverse_C_EvaluateCondition, Context) == 0x000000, "Member 'Condition_Inverse_C_EvaluateCondition::Context' has a wrong offset!");
static_assert(offsetof(Condition_Inverse_C_EvaluateCondition, OptionalContext) == 0x000008, "Member 'Condition_Inverse_C_EvaluateCondition::OptionalContext' has a wrong offset!");
static_assert(offsetof(Condition_Inverse_C_EvaluateCondition, ReturnValue) == 0x000010, "Member 'Condition_Inverse_C_EvaluateCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Inverse_C_EvaluateCondition, CallFunc_K2_EvaluateCondition_ReturnValue) == 0x000011, "Member 'Condition_Inverse_C_EvaluateCondition::CallFunc_K2_EvaluateCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_Inverse_C_EvaluateCondition, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'Condition_Inverse_C_EvaluateCondition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

