#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cond_BarrierToggle

#include "Basic.hpp"


namespace SDK::Params
{

// Function Cond_BarrierToggle.Cond_BarrierToggle_C.EvaluateCondition
// 0x0038 (0x0038 - 0x0000)
struct Cond_BarrierToggle_C_EvaluateCondition final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalContext;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOperativeBarrier*                      K2Node_DynamicCast_AsOperative_Barrier;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakPlayerAbilitySlotData*              CallFunc_GetCurrentSlot_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cond_BarrierToggle_C_EvaluateCondition) == 0x000008, "Wrong alignment on Cond_BarrierToggle_C_EvaluateCondition");
static_assert(sizeof(Cond_BarrierToggle_C_EvaluateCondition) == 0x000038, "Wrong size on Cond_BarrierToggle_C_EvaluateCondition");
static_assert(offsetof(Cond_BarrierToggle_C_EvaluateCondition, Context) == 0x000000, "Member 'Cond_BarrierToggle_C_EvaluateCondition::Context' has a wrong offset!");
static_assert(offsetof(Cond_BarrierToggle_C_EvaluateCondition, OptionalContext) == 0x000008, "Member 'Cond_BarrierToggle_C_EvaluateCondition::OptionalContext' has a wrong offset!");
static_assert(offsetof(Cond_BarrierToggle_C_EvaluateCondition, ReturnValue) == 0x000010, "Member 'Cond_BarrierToggle_C_EvaluateCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_BarrierToggle_C_EvaluateCondition, K2Node_DynamicCast_AsOperative_Barrier) == 0x000018, "Member 'Cond_BarrierToggle_C_EvaluateCondition::K2Node_DynamicCast_AsOperative_Barrier' has a wrong offset!");
static_assert(offsetof(Cond_BarrierToggle_C_EvaluateCondition, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Cond_BarrierToggle_C_EvaluateCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cond_BarrierToggle_C_EvaluateCondition, CallFunc_GetCurrentSlot_ReturnValue) == 0x000028, "Member 'Cond_BarrierToggle_C_EvaluateCondition::CallFunc_GetCurrentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_BarrierToggle_C_EvaluateCondition, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'Cond_BarrierToggle_C_EvaluateCondition::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_BarrierToggle_C_EvaluateCondition, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'Cond_BarrierToggle_C_EvaluateCondition::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cond_BarrierToggle_C_EvaluateCondition, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'Cond_BarrierToggle_C_EvaluateCondition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

