#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_TargetIsLeft

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Condition_TargetIsLeft.Condition_TargetIsLeft_C.EvaluateCondition
// 0x00D0 (0x00D0 - 0x0000)
struct Condition_TargetIsLeft_C_EvaluateCondition final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalContext;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DeltaVector;                                       // 0x0020(0x000C)(Edit, BlueprintVisible, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Controller;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetAssociatedController_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDotProductTo_ReturnValue;    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTargetingComponent*                    CallFunc_FindActorTargetingComponent_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBestTargetActor_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_TargetIsLeft_C_EvaluateCondition) == 0x000008, "Wrong alignment on Condition_TargetIsLeft_C_EvaluateCondition");
static_assert(sizeof(Condition_TargetIsLeft_C_EvaluateCondition) == 0x0000D0, "Wrong size on Condition_TargetIsLeft_C_EvaluateCondition");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, Context) == 0x000000, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::Context' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, OptionalContext) == 0x000008, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::OptionalContext' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, ReturnValue) == 0x000010, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, Target) == 0x000018, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::Target' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, DeltaVector) == 0x000020, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::DeltaVector' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, Controller) == 0x000030, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::Controller' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, Actor) == 0x000038, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::Actor' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, K2Node_DynamicCast_AsActor) == 0x000040, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_GetAssociatedController_ReturnValue) == 0x000050, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_GetAssociatedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_GetAssociatedCharacter_ReturnValue) == 0x000058, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_GetAssociatedCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_GetHorizontalDotProductTo_ReturnValue) == 0x000060, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_GetHorizontalDotProductTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_Abs_ReturnValue) == 0x000064, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_FindActorTargetingComponent_ReturnValue) == 0x000068, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_FindActorTargetingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_Less_FloatFloat_ReturnValue) == 0x000070, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_GetBestTargetActor_ReturnValue) == 0x000078, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_GetBestTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00008C, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_GetActorForwardVector_ReturnValue) == 0x000090, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_Cross_VectorVector_ReturnValue) == 0x00009C, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0000A8, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_BreakVector_X) == 0x0000B4, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_BreakVector_Y) == 0x0000B8, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_BreakVector_Z) == 0x0000BC, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C0, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_Less_FloatFloat_ReturnValue1) == 0x0000CC, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Condition_TargetIsLeft_C_EvaluateCondition, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x0000CD, "Member 'Condition_TargetIsLeft_C_EvaluateCondition::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");

}

