#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_CoV_RepairStyle

#include "Basic.hpp"

#include "GbxGameSystemCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Condition_CoV_RepairStyle.Condition_CoV_RepairStyle_C
// 0x0008 (0x0090 - 0x0088)
class UCondition_CoV_RepairStyle_C final : public UGbxCondition_Blueprint
{
public:
	int32                                         RepairStyle;                                       // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         StarterType;                                       // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         BarrelType;                                        // 0x008D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBarrel_;                                        // 0x008E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool EvaluateCondition(class UObject* Context, class UObject* OptionalContext) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Condition_CoV_RepairStyle_C">();
	}
	static class UCondition_CoV_RepairStyle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondition_CoV_RepairStyle_C>();
	}
};
static_assert(alignof(UCondition_CoV_RepairStyle_C) == 0x000008, "Wrong alignment on UCondition_CoV_RepairStyle_C");
static_assert(sizeof(UCondition_CoV_RepairStyle_C) == 0x000090, "Wrong size on UCondition_CoV_RepairStyle_C");
static_assert(offsetof(UCondition_CoV_RepairStyle_C, RepairStyle) == 0x000088, "Member 'UCondition_CoV_RepairStyle_C::RepairStyle' has a wrong offset!");
static_assert(offsetof(UCondition_CoV_RepairStyle_C, StarterType) == 0x00008C, "Member 'UCondition_CoV_RepairStyle_C::StarterType' has a wrong offset!");
static_assert(offsetof(UCondition_CoV_RepairStyle_C, BarrelType) == 0x00008D, "Member 'UCondition_CoV_RepairStyle_C::BarrelType' has a wrong offset!");
static_assert(offsetof(UCondition_CoV_RepairStyle_C, UseBarrel_) == 0x00008E, "Member 'UCondition_CoV_RepairStyle_C::UseBarrel_' has a wrong offset!");

}

