#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_VendingMachine_CanUseHeal

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_VendingMachine_CanUseHeal.Condition_VendingMachine_CanUseHeal_C.EvaluateCondition
// 0x0058 (0x0058 - 0x0000)
struct Condition_VendingMachine_CanUseHeal_C_EvaluateCondition final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalContext;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CanUseSecondary;                                   // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxCharacter*                          NewUser;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          CallFunc_GetAssociatedPrimaryCharacter_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue2;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue3;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue4;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition) == 0x000008, "Wrong alignment on Condition_VendingMachine_CanUseHeal_C_EvaluateCondition");
static_assert(sizeof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition) == 0x000058, "Wrong size on Condition_VendingMachine_CanUseHeal_C_EvaluateCondition");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, Context) == 0x000000, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::Context' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, OptionalContext) == 0x000008, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::OptionalContext' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, ReturnValue) == 0x000010, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CanUseSecondary) == 0x000011, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CanUseSecondary' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, NewUser) == 0x000018, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::NewUser' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, K2Node_DynamicCast_AsOak_Player_Controller) == 0x000020, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::K2Node_DynamicCast_AsOak_Player_Controller' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CallFunc_GetValueOfAttribute_ReturnValue) == 0x00002C, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CallFunc_GetAssociatedPrimaryCharacter_ReturnValue) == 0x000030, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CallFunc_GetAssociatedPrimaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000038, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CallFunc_Less_FloatFloat_ReturnValue) == 0x00003C, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CallFunc_GetValueOfAttribute_ReturnValue2) == 0x000040, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CallFunc_GetValueOfAttribute_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000044, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CallFunc_GetValueOfAttribute_ReturnValue3) == 0x000048, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CallFunc_GetValueOfAttribute_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CallFunc_GetValueOfAttribute_ReturnValue4) == 0x00004C, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CallFunc_GetValueOfAttribute_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Condition_VendingMachine_CanUseHeal_C_EvaluateCondition, CallFunc_Less_FloatFloat_ReturnValue1) == 0x000050, "Member 'Condition_VendingMachine_CanUseHeal_C_EvaluateCondition::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");

}

