#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Condition_OverrideManufacturerDescription

#include "Basic.hpp"


namespace SDK::Params
{

// Function Condition_OverrideManufacturerDescription.Condition_OverrideManufacturerDescription_C.EvaluateCondition
// 0x0028 (0x0028 - 0x0000)
struct Condition_OverrideManufacturerDescription_C_EvaluateCondition final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalContext;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPWeap_BaseWeapon_C*                   K2Node_DynamicCast_AsBPWeap_Base_Weapon;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Condition_OverrideManufacturerDescription_C_EvaluateCondition) == 0x000008, "Wrong alignment on Condition_OverrideManufacturerDescription_C_EvaluateCondition");
static_assert(sizeof(Condition_OverrideManufacturerDescription_C_EvaluateCondition) == 0x000028, "Wrong size on Condition_OverrideManufacturerDescription_C_EvaluateCondition");
static_assert(offsetof(Condition_OverrideManufacturerDescription_C_EvaluateCondition, Context) == 0x000000, "Member 'Condition_OverrideManufacturerDescription_C_EvaluateCondition::Context' has a wrong offset!");
static_assert(offsetof(Condition_OverrideManufacturerDescription_C_EvaluateCondition, OptionalContext) == 0x000008, "Member 'Condition_OverrideManufacturerDescription_C_EvaluateCondition::OptionalContext' has a wrong offset!");
static_assert(offsetof(Condition_OverrideManufacturerDescription_C_EvaluateCondition, ReturnValue) == 0x000010, "Member 'Condition_OverrideManufacturerDescription_C_EvaluateCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(Condition_OverrideManufacturerDescription_C_EvaluateCondition, K2Node_DynamicCast_AsBPWeap_Base_Weapon) == 0x000018, "Member 'Condition_OverrideManufacturerDescription_C_EvaluateCondition::K2Node_DynamicCast_AsBPWeap_Base_Weapon' has a wrong offset!");
static_assert(offsetof(Condition_OverrideManufacturerDescription_C_EvaluateCondition, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Condition_OverrideManufacturerDescription_C_EvaluateCondition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Condition_OverrideManufacturerDescription_C_EvaluateCondition, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000021, "Member 'Condition_OverrideManufacturerDescription_C_EvaluateCondition::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

