#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlledMove_PhaseLock_Paralysis

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ControlledMove_PhaseLock_Paralysis.ControlledMove_PhaseLock_Paralysis_C.ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis
// 0x0178 (0x0178 - 0x0000)
struct ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamageReceiver, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_MoveDuration;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_TargetActor;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Instigator;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageComponent*                       K2Node_CustomEvent_DamageReceiver1;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_CustomEvent_DamageCauser1;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_CustomEvent_Details;                        // 0x0070(0x0058)(ContainsInstancedReference)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue1;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue1;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue2;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue2;              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UDamageComponent* DamageReceiver, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, const struct FReceivedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue1;         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStayInParalysis_bRes;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAbility_ReturnValue;                   // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue3;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0130(0x0008)(NoDestructor)
	class UDamageComponent*                       CallFunc_GetComponentByClass_ReturnValue2;         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDamageComponent* DamageReceiver, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, const struct FReceivedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DamageReceiver;                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamageReceiver, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis) == 0x000008, "Wrong alignment on ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis");
static_assert(sizeof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis) == 0x000178, "Wrong size on ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, EntryPoint) == 0x000000, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::EntryPoint' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, Temp_bool_IsClosed_Variable) == 0x000021, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_Event_MoveDuration) == 0x000024, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_Event_MoveDuration' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_Event_TargetActor) == 0x000028, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_Event_TargetActor' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_Event_Instigator) == 0x000030, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_Event_Instigator' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CustomEvent_DamageReceiver1) == 0x000040, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CustomEvent_DamageReceiver1' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CustomEvent_Damage) == 0x000048, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CustomEvent_DamageType) == 0x000050, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CustomEvent_DamageSource) == 0x000058, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CustomEvent_InstigatedBy) == 0x000060, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CustomEvent_DamageCauser1) == 0x000068, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CustomEvent_DamageCauser1' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CustomEvent_Details) == 0x000070, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_GetObjectClass_ReturnValue) == 0x0000C8, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_GetObjectClass_ReturnValue1) == 0x0000D0, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_GetObjectClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_ClassIsChildOf_ReturnValue) == 0x0000D8, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_ClassIsChildOf_ReturnValue1) == 0x0000D9, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_ClassIsChildOf_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_GetObjectClass_ReturnValue2) == 0x0000E0, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_GetObjectClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_Event_bInterrupted) == 0x0000E8, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_ClassIsChildOf_ReturnValue2) == 0x0000E9, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_ClassIsChildOf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_BooleanOR_ReturnValue) == 0x0000EA, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CreateDelegate_OutputDelegate1) == 0x0000F0, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_GetComponentByClass_ReturnValue1) == 0x000100, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_CanStayInParalysis_bRes) == 0x000108, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_CanStayInParalysis_bRes' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_MatchesAnyTags_ReturnValue) == 0x000109, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_BooleanOR_ReturnValue1) == 0x00010A, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_BooleanOR_ReturnValue2) == 0x00010B, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_HasAbility_ReturnValue) == 0x00010C, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_HasAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_BooleanAND_ReturnValue) == 0x00010D, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_GetObjectClass_ReturnValue3) == 0x000110, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_GetObjectClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000118, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CreateDelegate_OutputDelegate2) == 0x000120, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000130, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_GetComponentByClass_ReturnValue2) == 0x000138, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CreateDelegate_OutputDelegate3) == 0x000140, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CustomEvent_DamageReceiver) == 0x000150, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CustomEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CustomEvent_DamageCauser) == 0x000158, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, K2Node_CreateDelegate_OutputDelegate4) == 0x000160, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000170, "Member 'ControlledMove_PhaseLock_Paralysis_C_ExecuteUbergraph_ControlledMove_PhaseLock_Paralysis::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function ControlledMove_PhaseLock_Paralysis.ControlledMove_PhaseLock_Paralysis_C.OnDeath
// 0x0010 (0x0010 - 0x0000)
struct ControlledMove_PhaseLock_Paralysis_C_OnDeath final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControlledMove_PhaseLock_Paralysis_C_OnDeath) == 0x000008, "Wrong alignment on ControlledMove_PhaseLock_Paralysis_C_OnDeath");
static_assert(sizeof(ControlledMove_PhaseLock_Paralysis_C_OnDeath) == 0x000010, "Wrong size on ControlledMove_PhaseLock_Paralysis_C_OnDeath");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnDeath, DamageReceiver) == 0x000000, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnDeath::DamageReceiver' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnDeath, DamageCauser) == 0x000008, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnDeath::DamageCauser' has a wrong offset!");

// Function ControlledMove_PhaseLock_Paralysis.ControlledMove_PhaseLock_Paralysis_C.OnServerStop
// 0x0001 (0x0001 - 0x0000)
struct ControlledMove_PhaseLock_Paralysis_C_OnServerStop final
{
public:
	bool                                          bInterrupted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ControlledMove_PhaseLock_Paralysis_C_OnServerStop) == 0x000001, "Wrong alignment on ControlledMove_PhaseLock_Paralysis_C_OnServerStop");
static_assert(sizeof(ControlledMove_PhaseLock_Paralysis_C_OnServerStop) == 0x000001, "Wrong size on ControlledMove_PhaseLock_Paralysis_C_OnServerStop");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnServerStop, bInterrupted) == 0x000000, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnServerStop::bInterrupted' has a wrong offset!");

// Function ControlledMove_PhaseLock_Paralysis.ControlledMove_PhaseLock_Paralysis_C.OnTakeDamage
// 0x0088 (0x0088 - 0x0000)
struct ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0030(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage) == 0x000008, "Wrong alignment on ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage");
static_assert(sizeof(ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage) == 0x000088, "Wrong size on ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage, DamageReceiver) == 0x000000, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage::DamageReceiver' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage, Damage) == 0x000008, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage::Damage' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage, DamageType) == 0x000010, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage::DamageType' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage, DamageSource) == 0x000018, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage::DamageSource' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage, InstigatedBy) == 0x000020, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage, DamageCauser) == 0x000028, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage, Details) == 0x000030, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnTakeDamage::Details' has a wrong offset!");

// Function ControlledMove_PhaseLock_Paralysis.ControlledMove_PhaseLock_Paralysis_C.CanStayInParalysis
// 0x0002 (0x0002 - 0x0000)
struct ControlledMove_PhaseLock_Paralysis_C_CanStayInParalysis final
{
public:
	bool                                          bRes;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ControlledMove_PhaseLock_Paralysis_C_CanStayInParalysis) == 0x000001, "Wrong alignment on ControlledMove_PhaseLock_Paralysis_C_CanStayInParalysis");
static_assert(sizeof(ControlledMove_PhaseLock_Paralysis_C_CanStayInParalysis) == 0x000002, "Wrong size on ControlledMove_PhaseLock_Paralysis_C_CanStayInParalysis");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_CanStayInParalysis, bRes) == 0x000000, "Member 'ControlledMove_PhaseLock_Paralysis_C_CanStayInParalysis::bRes' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_CanStayInParalysis, CallFunc_IsAlive_ReturnValue) == 0x000001, "Member 'ControlledMove_PhaseLock_Paralysis_C_CanStayInParalysis::CallFunc_IsAlive_ReturnValue' has a wrong offset!");

// Function ControlledMove_PhaseLock_Paralysis.ControlledMove_PhaseLock_Paralysis_C.OnServerStart
// 0x0018 (0x0018 - 0x0000)
struct ControlledMove_PhaseLock_Paralysis_C_OnServerStart final
{
public:
	float                                         MoveDuration;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Instigator;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControlledMove_PhaseLock_Paralysis_C_OnServerStart) == 0x000008, "Wrong alignment on ControlledMove_PhaseLock_Paralysis_C_OnServerStart");
static_assert(sizeof(ControlledMove_PhaseLock_Paralysis_C_OnServerStart) == 0x000018, "Wrong size on ControlledMove_PhaseLock_Paralysis_C_OnServerStart");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnServerStart, MoveDuration) == 0x000000, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnServerStart::MoveDuration' has a wrong offset!");
static_assert(offsetof(ControlledMove_PhaseLock_Paralysis_C_OnServerStart, TargetActor) == 0x000008, "Member 'ControlledMove_PhaseLock_Paralysis_C_OnServerStart::TargetActor' has a wrong offset!");
