#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlledMove_Siren_PhaseSlam_Fall

#include "Basic.hpp"


namespace SDK::Params
{

// Function ControlledMove_Siren_PhaseSlam_Fall.ControlledMove_Siren_PhaseSlam_Fall_C.ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall
// 0x0008 (0x0008 - 0x0000)
struct ControlledMove_Siren_PhaseSlam_Fall_C_ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Distance;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControlledMove_Siren_PhaseSlam_Fall_C_ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall) == 0x000004, "Wrong alignment on ControlledMove_Siren_PhaseSlam_Fall_C_ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall");
static_assert(sizeof(ControlledMove_Siren_PhaseSlam_Fall_C_ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall) == 0x000008, "Wrong size on ControlledMove_Siren_PhaseSlam_Fall_C_ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall");
static_assert(offsetof(ControlledMove_Siren_PhaseSlam_Fall_C_ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall, EntryPoint) == 0x000000, "Member 'ControlledMove_Siren_PhaseSlam_Fall_C_ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall::EntryPoint' has a wrong offset!");
static_assert(offsetof(ControlledMove_Siren_PhaseSlam_Fall_C_ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall, K2Node_Event_Distance) == 0x000004, "Member 'ControlledMove_Siren_PhaseSlam_Fall_C_ExecuteUbergraph_ControlledMove_Siren_PhaseSlam_Fall::K2Node_Event_Distance' has a wrong offset!");

// Function ControlledMove_Siren_PhaseSlam_Fall.ControlledMove_Siren_PhaseSlam_Fall_C.GroundSlam_End
// 0x0004 (0x0004 - 0x0000)
struct ControlledMove_Siren_PhaseSlam_Fall_C_GroundSlam_End final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControlledMove_Siren_PhaseSlam_Fall_C_GroundSlam_End) == 0x000004, "Wrong alignment on ControlledMove_Siren_PhaseSlam_Fall_C_GroundSlam_End");
static_assert(sizeof(ControlledMove_Siren_PhaseSlam_Fall_C_GroundSlam_End) == 0x000004, "Wrong size on ControlledMove_Siren_PhaseSlam_Fall_C_GroundSlam_End");
static_assert(offsetof(ControlledMove_Siren_PhaseSlam_Fall_C_GroundSlam_End, Distance) == 0x000000, "Member 'ControlledMove_Siren_PhaseSlam_Fall_C_GroundSlam_End::Distance' has a wrong offset!");

}

