#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_NPC_MissionDeco

#include "Basic.hpp"

#include "Struct_NPC_MissionDeco_structs.hpp"
#include "GbxRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_NPC_MissionDeco.DA_NPC_MissionDeco_C
// 0x0280 (0x02B0 - 0x0030)
class UDA_NPC_MissionDeco_C final : public UGbxDataAssetBlueprintable
{
public:
	struct FStruct_NPC_MissionDeco                AnimationInfo_DefaultState_01;                     // 0x0030(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FStruct_NPC_MissionDeco                AnimationInfo_DefaultState_02;                     // 0x00B0(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FStruct_NPC_MissionDeco                AnimationInfo_DefaultState_03;                     // 0x0130(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FStruct_NPC_MissionDeco                AnimationInfo_DefaultState_04;                     // 0x01B0(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FStruct_NPC_MissionDeco                AnimationInfo_DefaultState_05;                     // 0x0230(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_NPC_MissionDeco_C">();
	}
	static class UDA_NPC_MissionDeco_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDA_NPC_MissionDeco_C>();
	}
};
static_assert(alignof(UDA_NPC_MissionDeco_C) == 0x000010, "Wrong alignment on UDA_NPC_MissionDeco_C");
static_assert(sizeof(UDA_NPC_MissionDeco_C) == 0x0002B0, "Wrong size on UDA_NPC_MissionDeco_C");
static_assert(offsetof(UDA_NPC_MissionDeco_C, AnimationInfo_DefaultState_01) == 0x000030, "Member 'UDA_NPC_MissionDeco_C::AnimationInfo_DefaultState_01' has a wrong offset!");
static_assert(offsetof(UDA_NPC_MissionDeco_C, AnimationInfo_DefaultState_02) == 0x0000B0, "Member 'UDA_NPC_MissionDeco_C::AnimationInfo_DefaultState_02' has a wrong offset!");
static_assert(offsetof(UDA_NPC_MissionDeco_C, AnimationInfo_DefaultState_03) == 0x000130, "Member 'UDA_NPC_MissionDeco_C::AnimationInfo_DefaultState_03' has a wrong offset!");
static_assert(offsetof(UDA_NPC_MissionDeco_C, AnimationInfo_DefaultState_04) == 0x0001B0, "Member 'UDA_NPC_MissionDeco_C::AnimationInfo_DefaultState_04' has a wrong offset!");
static_assert(offsetof(UDA_NPC_MissionDeco_C, AnimationInfo_DefaultState_05) == 0x000230, "Member 'UDA_NPC_MissionDeco_C::AnimationInfo_DefaultState_05' has a wrong offset!");

}

