#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Damage_VersionOmNom

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Damage_VersionOmNom.Damage_VersionOmNom_C.OnHitFriendly
// 0x00B0 (0x00B0 - 0x0000)
struct Damage_VersionOmNom_C_OnHitFriendly final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageTarget;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageDataEventDetails                Details;                                           // 0x0018(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0060(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0098(0x0018)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Damage_VersionOmNom_C_OnHitFriendly) == 0x000008, "Wrong alignment on Damage_VersionOmNom_C_OnHitFriendly");
static_assert(sizeof(Damage_VersionOmNom_C_OnHitFriendly) == 0x0000B0, "Wrong size on Damage_VersionOmNom_C_OnHitFriendly");
static_assert(offsetof(Damage_VersionOmNom_C_OnHitFriendly, DamageInstigator) == 0x000000, "Member 'Damage_VersionOmNom_C_OnHitFriendly::DamageInstigator' has a wrong offset!");
static_assert(offsetof(Damage_VersionOmNom_C_OnHitFriendly, DamageCauser) == 0x000008, "Member 'Damage_VersionOmNom_C_OnHitFriendly::DamageCauser' has a wrong offset!");
static_assert(offsetof(Damage_VersionOmNom_C_OnHitFriendly, DamageTarget) == 0x000010, "Member 'Damage_VersionOmNom_C_OnHitFriendly::DamageTarget' has a wrong offset!");
static_assert(offsetof(Damage_VersionOmNom_C_OnHitFriendly, Details) == 0x000018, "Member 'Damage_VersionOmNom_C_OnHitFriendly::Details' has a wrong offset!");
static_assert(offsetof(Damage_VersionOmNom_C_OnHitFriendly, K2Node_MakeStruct_StatusEffectSpec) == 0x000060, "Member 'Damage_VersionOmNom_C_OnHitFriendly::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Damage_VersionOmNom_C_OnHitFriendly, CallFunc_AddStatusEffect_ReturnValue) == 0x000098, "Member 'Damage_VersionOmNom_C_OnHitFriendly::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");

}

