#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DroneProj_TED_Earthbound

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxWeapon_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DroneProj_TED_Earthbound.DroneProj_TED_Earthbound_C.ExecuteUbergraph_DroneProj_TED_Earthbound
// 0x02B8 (0x02B8 - 0x0000)
struct DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AWeapon* EventWeapon)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor)
	class AWeapon*                                K2Node_CustomEvent_EventWeapon;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0048(0x0008)(NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue1;                 // 0x0050(0x0008)(NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0058(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPWeap_Tediore_BaseWeapon_C*           K2Node_DynamicCast_AsBPWeap_Tediore_Base_Weapon;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakDroneProjectile*                    K2Node_ComponentBoundEvent_Drone;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHostile_ReturnValue;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxCharacter*                          CallFunc_GetAssociatedPrimaryCharacter_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_RunEnvQueryForAllActors_ResultActors;     // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_RunEnvQueryForAllActors_ReturnValue;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0140(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageReceiver;                 // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamageReceiver, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate2;             // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DamageReceiver, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxCharacter*                          CallFunc_GetAssociatedPrimaryCharacter_ReturnValue1; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0228(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound) == 0x000008, "Wrong alignment on DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound");
static_assert(sizeof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound) == 0x0002B8, "Wrong size on DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, EntryPoint) == 0x000000, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::EntryPoint' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_GetDataTableValue_OutValue) == 0x000004, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_GetDataTableValue_ReturnValue) == 0x000008, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_GetDefaultWwiseComponent_ReturnValue) == 0x000020, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_GetDefaultWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_CustomEvent_EventWeapon) == 0x000040, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_CustomEvent_EventWeapon' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_K2_SetTimer_ReturnValue) == 0x000048, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_K2_SetTimer_ReturnValue1) == 0x000050, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_K2_SetTimer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000058, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_GetOwner_ReturnValue) == 0x0000E8, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F0, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_DynamicCast_AsBPWeap_Tediore_Base_Weapon) == 0x0000F8, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_DynamicCast_AsBPWeap_Tediore_Base_Weapon' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_ComponentBoundEvent_Drone) == 0x000108, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_ComponentBoundEvent_Drone' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_IsHostile_ReturnValue) == 0x000110, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_IsHostile_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_GetAssociatedPrimaryCharacter_ReturnValue) == 0x000118, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_GetAssociatedPrimaryCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_RunEnvQueryForAllActors_ResultActors) == 0x000128, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_RunEnvQueryForAllActors_ResultActors' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_RunEnvQueryForAllActors_ReturnValue) == 0x000138, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_RunEnvQueryForAllActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_Event_Hit) == 0x000140, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_CustomEvent_DamageReceiver) == 0x0001D8, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_CustomEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_CustomEvent_DamageCauser) == 0x0001E0, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001E8, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0001EC, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_Array_Get_Item) == 0x0001F0, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_CreateDelegate_OutputDelegate2) == 0x0001F8, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, K2Node_CreateDelegate_OutputDelegate3) == 0x000208, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_IsValid_ReturnValue1) == 0x000218, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, CallFunc_GetAssociatedPrimaryCharacter_ReturnValue1) == 0x000220, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::CallFunc_GetAssociatedPrimaryCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound, Temp_struct_Variable) == 0x000228, "Member 'DroneProj_TED_Earthbound_C_ExecuteUbergraph_DroneProj_TED_Earthbound::Temp_struct_Variable' has a wrong offset!");

// Function DroneProj_TED_Earthbound.DroneProj_TED_Earthbound_C.RebindMoveTarget
// 0x0010 (0x0010 - 0x0000)
struct DroneProj_TED_Earthbound_C_RebindMoveTarget final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DroneProj_TED_Earthbound_C_RebindMoveTarget) == 0x000008, "Wrong alignment on DroneProj_TED_Earthbound_C_RebindMoveTarget");
static_assert(sizeof(DroneProj_TED_Earthbound_C_RebindMoveTarget) == 0x000010, "Wrong size on DroneProj_TED_Earthbound_C_RebindMoveTarget");
static_assert(offsetof(DroneProj_TED_Earthbound_C_RebindMoveTarget, DamageReceiver) == 0x000000, "Member 'DroneProj_TED_Earthbound_C_RebindMoveTarget::DamageReceiver' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_RebindMoveTarget, DamageCauser) == 0x000008, "Member 'DroneProj_TED_Earthbound_C_RebindMoveTarget::DamageCauser' has a wrong offset!");

// Function DroneProj_TED_Earthbound.DroneProj_TED_Earthbound_C.OnHitEnemy
// 0x0090 (0x0090 - 0x0000)
struct DroneProj_TED_Earthbound_C_OnHitEnemy final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(DroneProj_TED_Earthbound_C_OnHitEnemy) == 0x000008, "Wrong alignment on DroneProj_TED_Earthbound_C_OnHitEnemy");
static_assert(sizeof(DroneProj_TED_Earthbound_C_OnHitEnemy) == 0x000090, "Wrong size on DroneProj_TED_Earthbound_C_OnHitEnemy");
static_assert(offsetof(DroneProj_TED_Earthbound_C_OnHitEnemy, Hit) == 0x000000, "Member 'DroneProj_TED_Earthbound_C_OnHitEnemy::Hit' has a wrong offset!");

// Function DroneProj_TED_Earthbound.DroneProj_TED_Earthbound_C.BndEvt__DroneMovement_K2Node_ComponentBoundEvent_0_OakDroneProjectileFacingTargetChangedDelegate__DelegateSignature_DroneProj_TED_TenGallon
// 0x0008 (0x0008 - 0x0000)
struct DroneProj_TED_Earthbound_C_BndEvt__DroneMovement_K2Node_ComponentBoundEvent_0_OakDroneProjectileFacingTargetChangedDelegate__DelegateSignature_DroneProj_TED_TenGallon final
{
public:
	class AOakDroneProjectile*                    Drone;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DroneProj_TED_Earthbound_C_BndEvt__DroneMovement_K2Node_ComponentBoundEvent_0_OakDroneProjectileFacingTargetChangedDelegate__DelegateSignature_DroneProj_TED_TenGallon) == 0x000008, "Wrong alignment on DroneProj_TED_Earthbound_C_BndEvt__DroneMovement_K2Node_ComponentBoundEvent_0_OakDroneProjectileFacingTargetChangedDelegate__DelegateSignature_DroneProj_TED_TenGallon");
static_assert(sizeof(DroneProj_TED_Earthbound_C_BndEvt__DroneMovement_K2Node_ComponentBoundEvent_0_OakDroneProjectileFacingTargetChangedDelegate__DelegateSignature_DroneProj_TED_TenGallon) == 0x000008, "Wrong size on DroneProj_TED_Earthbound_C_BndEvt__DroneMovement_K2Node_ComponentBoundEvent_0_OakDroneProjectileFacingTargetChangedDelegate__DelegateSignature_DroneProj_TED_TenGallon");
static_assert(offsetof(DroneProj_TED_Earthbound_C_BndEvt__DroneMovement_K2Node_ComponentBoundEvent_0_OakDroneProjectileFacingTargetChangedDelegate__DelegateSignature_DroneProj_TED_TenGallon, Drone) == 0x000000, "Member 'DroneProj_TED_Earthbound_C_BndEvt__DroneMovement_K2Node_ComponentBoundEvent_0_OakDroneProjectileFacingTargetChangedDelegate__DelegateSignature_DroneProj_TED_TenGallon::Drone' has a wrong offset!");

// Function DroneProj_TED_Earthbound.DroneProj_TED_Earthbound_C.PutDownNotify
// 0x0008 (0x0008 - 0x0000)
struct DroneProj_TED_Earthbound_C_PutDownNotify final
{
public:
	class AWeapon*                                EventWeapon;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DroneProj_TED_Earthbound_C_PutDownNotify) == 0x000008, "Wrong alignment on DroneProj_TED_Earthbound_C_PutDownNotify");
static_assert(sizeof(DroneProj_TED_Earthbound_C_PutDownNotify) == 0x000008, "Wrong size on DroneProj_TED_Earthbound_C_PutDownNotify");
static_assert(offsetof(DroneProj_TED_Earthbound_C_PutDownNotify, EventWeapon) == 0x000000, "Member 'DroneProj_TED_Earthbound_C_PutDownNotify::EventWeapon' has a wrong offset!");

// Function DroneProj_TED_Earthbound.DroneProj_TED_Earthbound_C.FireWeapon
// 0x0188 (0x0188 - 0x0000)
struct DroneProj_TED_Earthbound_C_FireWeapon final
{
public:
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment;             // 0x0010(0x0028)(NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightBeamInitializationData           K2Node_MakeStruct_LightBeamInitializationData;     // 0x0048(0x0128)(ContainsInstancedReference)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0170(0x0018)()
};
static_assert(alignof(DroneProj_TED_Earthbound_C_FireWeapon) == 0x000008, "Wrong alignment on DroneProj_TED_Earthbound_C_FireWeapon");
static_assert(sizeof(DroneProj_TED_Earthbound_C_FireWeapon) == 0x000188, "Wrong size on DroneProj_TED_Earthbound_C_FireWeapon");
static_assert(offsetof(DroneProj_TED_Earthbound_C_FireWeapon, CallFunc_GetDataTableValue_OutValue) == 0x000000, "Member 'DroneProj_TED_Earthbound_C_FireWeapon::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_FireWeapon, CallFunc_GetDataTableValue_ReturnValue) == 0x000004, "Member 'DroneProj_TED_Earthbound_C_FireWeapon::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_FireWeapon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'DroneProj_TED_Earthbound_C_FireWeapon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_FireWeapon, K2Node_MakeStruct_LightBeamAttachment) == 0x000010, "Member 'DroneProj_TED_Earthbound_C_FireWeapon::K2Node_MakeStruct_LightBeamAttachment' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_FireWeapon, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'DroneProj_TED_Earthbound_C_FireWeapon::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_FireWeapon, CallFunc_GetDefaultWwiseComponent_ReturnValue) == 0x000040, "Member 'DroneProj_TED_Earthbound_C_FireWeapon::CallFunc_GetDefaultWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_FireWeapon, K2Node_MakeStruct_LightBeamInitializationData) == 0x000048, "Member 'DroneProj_TED_Earthbound_C_FireWeapon::K2Node_MakeStruct_LightBeamInitializationData' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_FireWeapon, CallFunc_PostWwiseEvent_ReturnValue) == 0x000170, "Member 'DroneProj_TED_Earthbound_C_FireWeapon::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");

// Function DroneProj_TED_Earthbound.DroneProj_TED_Earthbound_C.NoFriends
// 0x00B0 (0x00B0 - 0x0000)
struct DroneProj_TED_Earthbound_C_NoFriends final
{
public:
	struct FHitResult                             Temp_struct_Variable;                              // 0x0000(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DroneProj_TED_Earthbound_C_NoFriends) == 0x000008, "Wrong alignment on DroneProj_TED_Earthbound_C_NoFriends");
static_assert(sizeof(DroneProj_TED_Earthbound_C_NoFriends) == 0x0000B0, "Wrong size on DroneProj_TED_Earthbound_C_NoFriends");
static_assert(offsetof(DroneProj_TED_Earthbound_C_NoFriends, Temp_struct_Variable) == 0x000000, "Member 'DroneProj_TED_Earthbound_C_NoFriends::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_NoFriends, K2Node_DynamicCast_AsOak_Character) == 0x000090, "Member 'DroneProj_TED_Earthbound_C_NoFriends::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_NoFriends, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'DroneProj_TED_Earthbound_C_NoFriends::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_NoFriends, CallFunc_GetWeapon_ReturnValue) == 0x0000A0, "Member 'DroneProj_TED_Earthbound_C_NoFriends::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_NoFriends, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A8, "Member 'DroneProj_TED_Earthbound_C_NoFriends::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function DroneProj_TED_Earthbound.DroneProj_TED_Earthbound_C.DistanceCHeck
// 0x0020 (0x0020 - 0x0000)
struct DroneProj_TED_Earthbound_C_DistanceCHeck final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceBetweenVectors_Distance;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DroneProj_TED_Earthbound_C_DistanceCHeck) == 0x000004, "Wrong alignment on DroneProj_TED_Earthbound_C_DistanceCHeck");
static_assert(sizeof(DroneProj_TED_Earthbound_C_DistanceCHeck) == 0x000020, "Wrong size on DroneProj_TED_Earthbound_C_DistanceCHeck");
static_assert(offsetof(DroneProj_TED_Earthbound_C_DistanceCHeck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'DroneProj_TED_Earthbound_C_DistanceCHeck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneProj_TED_Earthbound_C_DistanceCHeck, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x00000C, "Member 'DroneProj_TED_Earthbound_C_DistanceCHeck::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
