#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElementalEffectCollection_Railgun_Tracer

#include "Basic.hpp"


namespace SDK::Params
{

// Function ElementalEffectCollection_Railgun_Tracer.ElementalEffectCollection_Railgun_Tracer_C.GetParticleEffectAndWwiseEvent
// 0x0050 (0x0050 - 0x0000)
struct ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent final
{
public:
	class UObject*                                ContextObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ParticleEffect;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            WwiseEvent;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_GetParticleEffectAndWwiseEvent_ParticleEffect; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            CallFunc_GetParticleEffectAndWwiseEvent_WwiseEvent; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakLightProjectile*                    K2Node_DynamicCast_AsOak_Light_Projectile;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent) == 0x000008, "Wrong alignment on ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent");
static_assert(sizeof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent) == 0x000050, "Wrong size on ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, ContextObject) == 0x000000, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::ContextObject' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, ParticleEffect) == 0x000008, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::ParticleEffect' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, WwiseEvent) == 0x000010, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::WwiseEvent' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, CallFunc_GetParticleEffectAndWwiseEvent_ParticleEffect) == 0x000018, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::CallFunc_GetParticleEffectAndWwiseEvent_ParticleEffect' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, CallFunc_GetParticleEffectAndWwiseEvent_WwiseEvent) == 0x000020, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::CallFunc_GetParticleEffectAndWwiseEvent_WwiseEvent' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, K2Node_DynamicCast_AsOak_Light_Projectile) == 0x000028, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::K2Node_DynamicCast_AsOak_Light_Projectile' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, CallFunc_GetInstigator_ReturnValue) == 0x000038, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, CallFunc_GetObjectClass_ReturnValue) == 0x000040, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000048, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000049, "Member 'ElementalEffectCollection_Railgun_Tracer_C_GetParticleEffectAndWwiseEvent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

