#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FastTravelStationObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ResurrectTravelStationObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FastTravelStationObject.FastTravelStationObject_C
// 0x0040 (0x06E8 - 0x06A8)
class AFastTravelStationObject_C final : public AResurrectTravelStationObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_FastTravelStationObject_C;          // 0x06A8(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               NearbyPlayerFX_Deactivate;                         // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NearbyPlayerFX_StartAndLoop;                       // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOutOfMapWaypointComponent*             OutOfMapWaypoint1;                                 // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakMinimapIconComponent*               OakMinimapIconComponent;                           // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUsableComponent*                       Usable;                                            // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFastTravelStationComponent*            FastTravelStation;                                 // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void OnEnabled();
	void OnDisabled();
	void OnDisabling();
	void SetLevelNameText(class UTravelStationData* Target);
	void BndEvt__Usable_K2Node_ComponentBoundEvent_1_UsableUsedOnChannelSignature__DelegateSignature_FastTravelStationObject(class AController* UserController, class UPrimitiveComponent* UsedComponent);
	void BndEvt__ActivationArea_K2Node_ComponentBoundEvent_0_AreaPlayerEvent__DelegateSignature_FastTravelStationObject(class AGbxPlayerController* Player);
	void BndEvt__ActivationArea_K2Node_ComponentBoundEvent_2_AreaPlayerEvent__DelegateSignature_FastTravelStationObject(class AGbxPlayerController* Player);
	void ExecuteUbergraph_FastTravelStationObject(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FastTravelStationObject_C">();
	}
	static class AFastTravelStationObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFastTravelStationObject_C>();
	}
};
static_assert(alignof(AFastTravelStationObject_C) == 0x000008, "Wrong alignment on AFastTravelStationObject_C");
static_assert(sizeof(AFastTravelStationObject_C) == 0x0006E8, "Wrong size on AFastTravelStationObject_C");
static_assert(offsetof(AFastTravelStationObject_C, UberGraphFrame_FastTravelStationObject_C) == 0x0006A8, "Member 'AFastTravelStationObject_C::UberGraphFrame_FastTravelStationObject_C' has a wrong offset!");
static_assert(offsetof(AFastTravelStationObject_C, NearbyPlayerFX_Deactivate) == 0x0006B0, "Member 'AFastTravelStationObject_C::NearbyPlayerFX_Deactivate' has a wrong offset!");
static_assert(offsetof(AFastTravelStationObject_C, NearbyPlayerFX_StartAndLoop) == 0x0006B8, "Member 'AFastTravelStationObject_C::NearbyPlayerFX_StartAndLoop' has a wrong offset!");
static_assert(offsetof(AFastTravelStationObject_C, TextRender) == 0x0006C0, "Member 'AFastTravelStationObject_C::TextRender' has a wrong offset!");
static_assert(offsetof(AFastTravelStationObject_C, OutOfMapWaypoint1) == 0x0006C8, "Member 'AFastTravelStationObject_C::OutOfMapWaypoint1' has a wrong offset!");
static_assert(offsetof(AFastTravelStationObject_C, OakMinimapIconComponent) == 0x0006D0, "Member 'AFastTravelStationObject_C::OakMinimapIconComponent' has a wrong offset!");
static_assert(offsetof(AFastTravelStationObject_C, Usable) == 0x0006D8, "Member 'AFastTravelStationObject_C::Usable' has a wrong offset!");
static_assert(offsetof(AFastTravelStationObject_C, FastTravelStation) == 0x0006E0, "Member 'AFastTravelStationObject_C::FastTravelStation' has a wrong offset!");

}

