#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxFluidSurface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GbxFluidSurface.FluidSurface.PerturbSurface
// 0x0014 (0x0014 - 0x0000)
struct FluidSurface_PerturbSurface final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Force;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FluidSurface_PerturbSurface) == 0x000004, "Wrong alignment on FluidSurface_PerturbSurface");
static_assert(sizeof(FluidSurface_PerturbSurface) == 0x000014, "Wrong size on FluidSurface_PerturbSurface");
static_assert(offsetof(FluidSurface_PerturbSurface, Position) == 0x000000, "Member 'FluidSurface_PerturbSurface::Position' has a wrong offset!");
static_assert(offsetof(FluidSurface_PerturbSurface, Radius) == 0x00000C, "Member 'FluidSurface_PerturbSurface::Radius' has a wrong offset!");
static_assert(offsetof(FluidSurface_PerturbSurface, Force) == 0x000010, "Member 'FluidSurface_PerturbSurface::Force' has a wrong offset!");

}

