#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxFeedback

#include "Basic.hpp"

#include "GbxFeedback_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GbxFeedback.GbxRumbleRemapping
// 0x0A50 (0x0A78 - 0x0028)
class UGbxRumbleRemapping final : public UObject
{
public:
	struct FRemapByConsole                        WindowsMapping;                                    // 0x0028(0x0210)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRemapByConsole                        XBoxOneMapping;                                    // 0x0238(0x0210)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRemapByConsole                        PS4Mapping;                                        // 0x0448(0x0210)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRemapByConsole                        XBoxSeriesXMapping;                                // 0x0658(0x0210)(Edit, Config, NativeAccessSpecifierPublic)
	struct FRemapByConsole                        PS5Mapping;                                        // 0x0868(0x0210)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxRumbleRemapping">();
	}
	static class UGbxRumbleRemapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxRumbleRemapping>();
	}
};
static_assert(alignof(UGbxRumbleRemapping) == 0x000008, "Wrong alignment on UGbxRumbleRemapping");
static_assert(sizeof(UGbxRumbleRemapping) == 0x000A78, "Wrong size on UGbxRumbleRemapping");
static_assert(offsetof(UGbxRumbleRemapping, WindowsMapping) == 0x000028, "Member 'UGbxRumbleRemapping::WindowsMapping' has a wrong offset!");
static_assert(offsetof(UGbxRumbleRemapping, XBoxOneMapping) == 0x000238, "Member 'UGbxRumbleRemapping::XBoxOneMapping' has a wrong offset!");
static_assert(offsetof(UGbxRumbleRemapping, PS4Mapping) == 0x000448, "Member 'UGbxRumbleRemapping::PS4Mapping' has a wrong offset!");
static_assert(offsetof(UGbxRumbleRemapping, XBoxSeriesXMapping) == 0x000658, "Member 'UGbxRumbleRemapping::XBoxSeriesXMapping' has a wrong offset!");
static_assert(offsetof(UGbxRumbleRemapping, PS5Mapping) == 0x000868, "Member 'UGbxRumbleRemapping::PS5Mapping' has a wrong offset!");

}

