#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxPerfScope

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GbxPerfScope.GbxPerfScopePerfSampleData.GetMapGPUHotspots
// 0x0028 (0x0028 - 0x0000)
struct GbxPerfScopePerfSampleData_GetMapGPUHotspots final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSamples;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0010(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GbxPerfScopePerfSampleData_GetMapGPUHotspots) == 0x000008, "Wrong alignment on GbxPerfScopePerfSampleData_GetMapGPUHotspots");
static_assert(sizeof(GbxPerfScopePerfSampleData_GetMapGPUHotspots) == 0x000028, "Wrong size on GbxPerfScopePerfSampleData_GetMapGPUHotspots");
static_assert(offsetof(GbxPerfScopePerfSampleData_GetMapGPUHotspots, WorldContext) == 0x000000, "Member 'GbxPerfScopePerfSampleData_GetMapGPUHotspots::WorldContext' has a wrong offset!");
static_assert(offsetof(GbxPerfScopePerfSampleData_GetMapGPUHotspots, NumSamples) == 0x000008, "Member 'GbxPerfScopePerfSampleData_GetMapGPUHotspots::NumSamples' has a wrong offset!");
static_assert(offsetof(GbxPerfScopePerfSampleData_GetMapGPUHotspots, LatentInfo) == 0x000010, "Member 'GbxPerfScopePerfSampleData_GetMapGPUHotspots::LatentInfo' has a wrong offset!");

}

