#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxUI

#include "Basic.hpp"

#include "GbxRuntime_classes.hpp"
#include "GbxUI_structs.hpp"
#include "ScaleformUI_structs.hpp"
#include "ScaleformUI_classes.hpp"
#include "GbxGameSystemCore_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class GbxUI.GbxUserWidget
// 0x00B0 (0x02B8 - 0x0208)
class UGbxUserWidget : public UUserWidget
{
public:
	uint8                                         Pad_208[0x10];                                     // 0x0208(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             LabelTextBlock;                                    // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             ValueTextBlock;                                    // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 SelectedImage;                                     // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisterAsFocusableWidget;                        // 0x0230(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxFocusableWidgetMouseBehavior              MouseFocusBehavior;                                // 0x0231(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxFocusableWidgetStyleData*           FocusableWidgetStyleData;                          // 0x0238(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OnFocusedAudioEventName;                           // 0x0240(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OnClickedAudioEventName;                           // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeverCreateMouseFocusButton;                      // 0x0250(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBUTTON*                                MouseFocusButton;                                  // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UGbxUserWidget* Widget, struct FGbxMenuInputEvent& InputInfo)> OnWidgetClicked;                                   // 0x0260(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class UGbxUserWidget* Widget, struct FGbxMenuInputEvent& InputInfo)> OnWidgetFocused;                                   // 0x0270(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   FocusableWidgetNavUp;                              // 0x0280(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FocusableWidgetNavDown;                            // 0x0288(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FocusableWidgetNavLeft;                            // 0x0290(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FocusableWidgetNavRight;                           // 0x0298(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFocusOnMenuCreation;                              // 0x02A0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UGbxUmgMenu>             MenuThatOwnsFocus;                                 // 0x02A4(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             AudioDataTable;                                    // 0x02B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static bool IsFocusableWidgetStateFocused(EGbxFocusableWidgetState State);
	static bool IsFocusableWidgetStateHovered(EGbxFocusableWidgetState State);

	void GetAllChildWidgetsOfClass(TSubclassOf<class UWidget> TargetClass, TArray<class UWidget*>& OutputArray);
	void GotoAndStop(const struct FFrameTime& StopTime, const class UWidgetAnimation* InAnimation);
	void HandleFocusableWidgetStateChanged(EGbxFocusableWidgetState NewState, bool bBecameFocused, bool bLostFocus);
	void OnFocusableWidgetClicked();
	void OnFocusableWidgetHovered();
	void OnFocusableWidgetPressed();
	void OnFocusableWidgetReleased();
	void OnFocusableWidgetUnhovered();
	void SetLabelText(const class FText& LabelText);

	bool IsRegisteredAsFocusableWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxUserWidget">();
	}
	static class UGbxUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUserWidget>();
	}
};
static_assert(alignof(UGbxUserWidget) == 0x000008, "Wrong alignment on UGbxUserWidget");
static_assert(sizeof(UGbxUserWidget) == 0x0002B8, "Wrong size on UGbxUserWidget");
static_assert(offsetof(UGbxUserWidget, LabelTextBlock) == 0x000218, "Member 'UGbxUserWidget::LabelTextBlock' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, ValueTextBlock) == 0x000220, "Member 'UGbxUserWidget::ValueTextBlock' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, SelectedImage) == 0x000228, "Member 'UGbxUserWidget::SelectedImage' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, bRegisterAsFocusableWidget) == 0x000230, "Member 'UGbxUserWidget::bRegisterAsFocusableWidget' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, MouseFocusBehavior) == 0x000231, "Member 'UGbxUserWidget::MouseFocusBehavior' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, FocusableWidgetStyleData) == 0x000238, "Member 'UGbxUserWidget::FocusableWidgetStyleData' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, OnFocusedAudioEventName) == 0x000240, "Member 'UGbxUserWidget::OnFocusedAudioEventName' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, OnClickedAudioEventName) == 0x000248, "Member 'UGbxUserWidget::OnClickedAudioEventName' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, bNeverCreateMouseFocusButton) == 0x000250, "Member 'UGbxUserWidget::bNeverCreateMouseFocusButton' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, MouseFocusButton) == 0x000258, "Member 'UGbxUserWidget::MouseFocusButton' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, OnWidgetClicked) == 0x000260, "Member 'UGbxUserWidget::OnWidgetClicked' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, OnWidgetFocused) == 0x000270, "Member 'UGbxUserWidget::OnWidgetFocused' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, FocusableWidgetNavUp) == 0x000280, "Member 'UGbxUserWidget::FocusableWidgetNavUp' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, FocusableWidgetNavDown) == 0x000288, "Member 'UGbxUserWidget::FocusableWidgetNavDown' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, FocusableWidgetNavLeft) == 0x000290, "Member 'UGbxUserWidget::FocusableWidgetNavLeft' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, FocusableWidgetNavRight) == 0x000298, "Member 'UGbxUserWidget::FocusableWidgetNavRight' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, bFocusOnMenuCreation) == 0x0002A0, "Member 'UGbxUserWidget::bFocusOnMenuCreation' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, MenuThatOwnsFocus) == 0x0002A4, "Member 'UGbxUserWidget::MenuThatOwnsFocus' has a wrong offset!");
static_assert(offsetof(UGbxUserWidget, AudioDataTable) == 0x0002B0, "Member 'UGbxUserWidget::AudioDataTable' has a wrong offset!");

// Class GbxUI.GbxUmgMenu
// 0x0038 (0x02F0 - 0x02B8)
class UGbxUmgMenu : public UGbxUserWidget
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxUmgMenuData*                        MenuData;                                          // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGbxPlayerController*                   PCOwner;                                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxMenuStack*                          MenuStackOwner;                                    // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxWidgetFocusManager*                 FocusManager;                                      // 0x02D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxHintBar*                            HintBar;                                           // 0x02E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E8[0x5];                                      // 0x02E8(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	EGbxFocusableWidgetMouseBehavior              DefaultMouseFocusBehavior;                         // 0x02ED(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2EE[0x2];                                      // 0x02EE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleMenuActivate();
	void HandleMenuAspectRatioChanged(float NewAspectRatio);
	void HandleMenuDeactivate();
	void HandleMenuDeinit();
	void HandleMenuInit();
	void HandleMenuInputAction(const class FName& InputAction, int32 ControllerId);
	void HandleMenuInputDeviceChanged(EGbxMenuInputDevice NewInputDevice);
	void MenuStack_Clear();
	void MenuStack_Pop();
	void MenuStack_PopTo(const class UObject* Menu);
	class UObject* MenuStack_PopToSwitchTo(const class UObject* Menu, class UGbxMenuData* MenuDataIn);
	class UObject* MenuStack_Push(class UGbxMenuData* MenuDataIn);
	class UObject* MenuStack_SwitchTo(class UGbxMenuData* MenuDataIn);
	void NavigateBack();
	void PopulateHintBar();
	void RegisterFocusableWidget(class UObject* Widget, const struct FGbxFocusableWidgetAdjacencyInfo& AdjacencyInfo);
	void RegisterFocusableWidgetWithAdjacency(class UObject* Widget, class UObject* AdjacentUp, class UObject* AdjacentDown, class UObject* AdjacentLeft, class UObject* AdjacentRight);
	void RegisterStagePlacedHint(const TScriptInterface<class IGbxHintWidget>& InHintWidget, const class FName InInputAction);
	void SetFocusableWidgetAdjancency(class UObject* Widget, class UObject* AdjacentUp, class UObject* AdjacentDown, class UObject* AdjacentLeft, class UObject* AdjacentRight);
	void SetFocusedWidget(class UObject* Widget, bool bFromMouse);
	void SetHintBarContainer(const TScriptInterface<class IGbxHintBarWidgetContainer>& InContainer);
	void SetSlateFocusedWidget(class UWidget* Widget);
	void SetWidgetAdjacency(class UObject* Widget, const struct FGbxFocusableWidgetAdjacencyInfo& AdjacencyInfo);

	EGbxMenuInputDevice GetCurrentInputDevice() const;
	class UObject* GetFocusedWidget() const;
	class UGbxListItemFactory* GetListItemFactory() const;
	bool IsActiveMenuOnStack() const;
	bool IsWidgetFocused(const class UObject* WidgetInQuestion) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxUmgMenu">();
	}
	static class UGbxUmgMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUmgMenu>();
	}
};
static_assert(alignof(UGbxUmgMenu) == 0x000008, "Wrong alignment on UGbxUmgMenu");
static_assert(sizeof(UGbxUmgMenu) == 0x0002F0, "Wrong size on UGbxUmgMenu");
static_assert(offsetof(UGbxUmgMenu, MenuData) == 0x0002C0, "Member 'UGbxUmgMenu::MenuData' has a wrong offset!");
static_assert(offsetof(UGbxUmgMenu, PCOwner) == 0x0002C8, "Member 'UGbxUmgMenu::PCOwner' has a wrong offset!");
static_assert(offsetof(UGbxUmgMenu, MenuStackOwner) == 0x0002D0, "Member 'UGbxUmgMenu::MenuStackOwner' has a wrong offset!");
static_assert(offsetof(UGbxUmgMenu, FocusManager) == 0x0002D8, "Member 'UGbxUmgMenu::FocusManager' has a wrong offset!");
static_assert(offsetof(UGbxUmgMenu, HintBar) == 0x0002E0, "Member 'UGbxUmgMenu::HintBar' has a wrong offset!");
static_assert(offsetof(UGbxUmgMenu, DefaultMouseFocusBehavior) == 0x0002ED, "Member 'UGbxUmgMenu::DefaultMouseFocusBehavior' has a wrong offset!");

// Class GbxUI.GbxGFxObject
// 0x0138 (0x0170 - 0x0038)
class UGbxGFxObject : public UGFxObject
{
public:
	class UGbxGFxMovie*                           OwningMovie;                                       // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x130];                                     // 0x0040(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RotateAboutPoint(const float Degrees, const struct FVector2D& Point);
	void SetBaseDisplayTransform(const struct FTransform& Transform);
	void SetOffsetDisplayTransform(const struct FTransform& Transform);

	struct FTransform GetBaseDisplayTransform() const;
	struct FTransform GetOffsetDisplayTransform() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxGFxObject">();
	}
	static class UGbxGFxObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGFxObject>();
	}
};
static_assert(alignof(UGbxGFxObject) == 0x000008, "Wrong alignment on UGbxGFxObject");
static_assert(sizeof(UGbxGFxObject) == 0x000170, "Wrong size on UGbxGFxObject");
static_assert(offsetof(UGbxGFxObject, OwningMovie) == 0x000038, "Member 'UGbxGFxObject::OwningMovie' has a wrong offset!");

// Class GbxUI.GbxGFxGridScrollingList
// 0x01B0 (0x0320 - 0x0170)
class UGbxGFxGridScrollingList : public UGbxGFxObject
{
public:
	uint8                                         Pad_170[0x10];                                     // 0x0170(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   SelectionChangedDelegate;                          // 0x0180(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   ItemPressedDelegate;                               // 0x0190(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0[0x8];                                      // 0x01A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   ItemClickedDelegate;                               // 0x01A8(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   ItemSecondaryClickedDelegate;                      // 0x01B8(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C8[0x18];                                     // 0x01C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxGFxListConfig                      Config;                                            // 0x01E0(0x0090)(Transient, NativeAccessSpecifierPublic)
	int32                                         SelectedIndex;                                     // 0x0270(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectedIndexWhenFocusWasLost;                     // 0x0274(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGbxScrollingListCellInfo>      AllCells;                                          // 0x0278(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FGbxScrollingListCellInfo>      UnusedCellPool;                                    // 0x0288(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class UGbxGFxObject*                          GridArea;                                          // 0x0298(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxGFxObject*                          GridMask;                                          // 0x02A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PositionOfFirstItem;                               // 0x02A8(0x0008)(Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextUniqueId;                                      // 0x02B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ViewWindowSize;                                    // 0x02B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxUIScroller                         UiScroller;                                        // 0x02B8(0x0034)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsContentDirty;                                   // 0x02EC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              AverageItemDims;                                   // 0x02F0(0x0008)(Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxGFxSlider*                          ScrollBar;                                         // 0x02F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScrollbarIsChildOfThis;                           // 0x0300(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x1F];                                     // 0x0301(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnScrollBarPositionUpdated(float SliderPercentage);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxGFxGridScrollingList">();
	}
	static class UGbxGFxGridScrollingList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGFxGridScrollingList>();
	}
};
static_assert(alignof(UGbxGFxGridScrollingList) == 0x000008, "Wrong alignment on UGbxGFxGridScrollingList");
static_assert(sizeof(UGbxGFxGridScrollingList) == 0x000320, "Wrong size on UGbxGFxGridScrollingList");
static_assert(offsetof(UGbxGFxGridScrollingList, SelectionChangedDelegate) == 0x000180, "Member 'UGbxGFxGridScrollingList::SelectionChangedDelegate' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, ItemPressedDelegate) == 0x000190, "Member 'UGbxGFxGridScrollingList::ItemPressedDelegate' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, ItemClickedDelegate) == 0x0001A8, "Member 'UGbxGFxGridScrollingList::ItemClickedDelegate' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, ItemSecondaryClickedDelegate) == 0x0001B8, "Member 'UGbxGFxGridScrollingList::ItemSecondaryClickedDelegate' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, Config) == 0x0001E0, "Member 'UGbxGFxGridScrollingList::Config' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, SelectedIndex) == 0x000270, "Member 'UGbxGFxGridScrollingList::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, SelectedIndexWhenFocusWasLost) == 0x000274, "Member 'UGbxGFxGridScrollingList::SelectedIndexWhenFocusWasLost' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, AllCells) == 0x000278, "Member 'UGbxGFxGridScrollingList::AllCells' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, UnusedCellPool) == 0x000288, "Member 'UGbxGFxGridScrollingList::UnusedCellPool' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, GridArea) == 0x000298, "Member 'UGbxGFxGridScrollingList::GridArea' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, GridMask) == 0x0002A0, "Member 'UGbxGFxGridScrollingList::GridMask' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, PositionOfFirstItem) == 0x0002A8, "Member 'UGbxGFxGridScrollingList::PositionOfFirstItem' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, NextUniqueId) == 0x0002B0, "Member 'UGbxGFxGridScrollingList::NextUniqueId' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, ViewWindowSize) == 0x0002B4, "Member 'UGbxGFxGridScrollingList::ViewWindowSize' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, UiScroller) == 0x0002B8, "Member 'UGbxGFxGridScrollingList::UiScroller' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, bIsContentDirty) == 0x0002EC, "Member 'UGbxGFxGridScrollingList::bIsContentDirty' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, AverageItemDims) == 0x0002F0, "Member 'UGbxGFxGridScrollingList::AverageItemDims' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, ScrollBar) == 0x0002F8, "Member 'UGbxGFxGridScrollingList::ScrollBar' has a wrong offset!");
static_assert(offsetof(UGbxGFxGridScrollingList, bScrollbarIsChildOfThis) == 0x000300, "Member 'UGbxGFxGridScrollingList::bScrollbarIsChildOfThis' has a wrong offset!");

// Class GbxUI.GbxGFxHintBarContainer
// 0x0020 (0x0340 - 0x0320)
class UGbxGFxHintBarContainer final : public UGbxGFxGridScrollingList
{
public:
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UGbxHintBar>             HintBarOwningBar;                                  // 0x0328(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AGbxPlayerController>    HintBarOwnerPC;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxGFxHintBarContainer">();
	}
	static class UGbxGFxHintBarContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGFxHintBarContainer>();
	}
};
static_assert(alignof(UGbxGFxHintBarContainer) == 0x000008, "Wrong alignment on UGbxGFxHintBarContainer");
static_assert(sizeof(UGbxGFxHintBarContainer) == 0x000340, "Wrong size on UGbxGFxHintBarContainer");
static_assert(offsetof(UGbxGFxHintBarContainer, HintBarOwningBar) == 0x000328, "Member 'UGbxGFxHintBarContainer::HintBarOwningBar' has a wrong offset!");
static_assert(offsetof(UGbxGFxHintBarContainer, HintBarOwnerPC) == 0x000330, "Member 'UGbxGFxHintBarContainer::HintBarOwnerPC' has a wrong offset!");

// Class GbxUI.GbxGFxMovie
// 0x02C8 (0x04D8 - 0x0210)
#pragma pack(push, 0x1)
class alignas(0x08) UGbxGFxMovie : public UGFxMoviePlayer
{
public:
	class USwfMovie*                              MovieData;                                         // 0x0210(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGFxScaleMode                                 ScaleModeType;                                     // 0x0218(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGFxAlign                                     AlignmentType;                                     // 0x0219(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnchorToViewport;                                 // 0x021A(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21B[0x1];                                      // 0x021B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxGFxAnchor                          AnchorData;                                        // 0x021C(0x0018)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_234[0xC];                                      // 0x0234(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             AudioDataTable;                                    // 0x0240(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxGFxMovieClipAppendix               GetChildAppendix;                                  // 0x0248(0x0060)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EGbxGFxMovieGetChildStrategy                  GetChildStrategy;                                  // 0x02A8(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxGFxObject*                          CachedStage;                                       // 0x02B0(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxGFxObject*                          GbxRoot;                                           // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxGFxObject*                          GetChildRoot;                                      // 0x02C0(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CachedGbxRootPosition;                             // 0x02C8(0x0008)(BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D0[0x18];                                     // 0x02D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsTransitioning;                                  // 0x02E8(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransitionTimeout;                                 // 0x02EC(0x0004)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F0[0x140];                                    // 0x02F0(0x0140)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxPlayerController*                   OwningGPC;                                         // 0x0430(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_438[0x68];                                     // 0x0438(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGbxGFxObject*>                  Tickables;                                         // 0x04A0(0x0010)(BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B0[0x11];                                     // 0x04B0(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bGbxMovieStarted;                                  // 0x04C1(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C2[0x16];                                     // 0x04C2(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static const class UGbxGFxMovie* SpawnGbxGFxMovie(class AGbxPlayerController* GbxPlayerController, TSubclassOf<class UGbxGFxMovie> MovieClass);

	void ApplyNewAudioSettings(class UDataTable* NewDataTable, EUIAudioSettingOperation MergeOperation) const;
	void ExtAnimationFinished(const class FString& TargetName) const;
	void ExtTransitionComplete() const;
	struct FTransform GetBaseDisplayTransform() const;
	struct FVector2D GetMovieDimensions() const;
	struct FTransform GetOffsetDisplayTransform() const;
	class AGbxPlayerController* GetOwningPlayerController() const;
	class APawn* GetOwningPlayerPawn() const;
	struct FVector2D GetStageDimensions() const;
	struct FVector2D GetViewportDimensions() const;
	struct FVector2D GetViewportOffset() const;
	bool RunUIEventAudio(class FName EventName, const class FString& ProviderHistory) const;
	void SetAnchor(const struct FGbxGFxAnchor& Anchor) const;
	void SetAudioEnabled(bool bEnabled) const;
	void SetBaseDisplayTransform(const struct FTransform& Transform) const;
	void SetOffsetDisplayTransform(const struct FTransform& Transform) const;
	void SetViewportToPlayerScreen(class AGbxPlayerController* Pc) const;
	void SpawnMovie(class AGbxPlayerController* NewGPCOwner, class UTextureRenderTarget2D* RenderTarget) const;
	struct FBox2D TranslateRectToScreen(const struct FBox2D& Rect) const;
	struct FVector2D TranslateScreenToLocal(const struct FVector2D& Point, bool bUseMovieDimensions) const;
	struct FVector2D TranslateToScreen(const struct FVector2D& Point) const;
	bool TranslateWorldToLocal(const struct FVector& LocationWorldSpace, struct FVector2D* OutPositionLocal, bool bPlayerViewportRelative, bool bUseMovieDimensions) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxGFxMovie">();
	}
	static class UGbxGFxMovie* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGFxMovie>();
	}
};
#pragma pack(pop)
static_assert(alignof(UGbxGFxMovie) == 0x000008, "Wrong alignment on UGbxGFxMovie");
static_assert(sizeof(UGbxGFxMovie) == 0x0004D8, "Wrong size on UGbxGFxMovie");
static_assert(offsetof(UGbxGFxMovie, MovieData) == 0x000210, "Member 'UGbxGFxMovie::MovieData' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, ScaleModeType) == 0x000218, "Member 'UGbxGFxMovie::ScaleModeType' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, AlignmentType) == 0x000219, "Member 'UGbxGFxMovie::AlignmentType' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, bAnchorToViewport) == 0x00021A, "Member 'UGbxGFxMovie::bAnchorToViewport' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, AnchorData) == 0x00021C, "Member 'UGbxGFxMovie::AnchorData' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, AudioDataTable) == 0x000240, "Member 'UGbxGFxMovie::AudioDataTable' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, GetChildAppendix) == 0x000248, "Member 'UGbxGFxMovie::GetChildAppendix' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, GetChildStrategy) == 0x0002A8, "Member 'UGbxGFxMovie::GetChildStrategy' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, CachedStage) == 0x0002B0, "Member 'UGbxGFxMovie::CachedStage' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, GbxRoot) == 0x0002B8, "Member 'UGbxGFxMovie::GbxRoot' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, GetChildRoot) == 0x0002C0, "Member 'UGbxGFxMovie::GetChildRoot' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, CachedGbxRootPosition) == 0x0002C8, "Member 'UGbxGFxMovie::CachedGbxRootPosition' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, bIsTransitioning) == 0x0002E8, "Member 'UGbxGFxMovie::bIsTransitioning' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, TransitionTimeout) == 0x0002EC, "Member 'UGbxGFxMovie::TransitionTimeout' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, OwningGPC) == 0x000430, "Member 'UGbxGFxMovie::OwningGPC' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, Tickables) == 0x0004A0, "Member 'UGbxGFxMovie::Tickables' has a wrong offset!");
static_assert(offsetof(UGbxGFxMovie, bGbxMovieStarted) == 0x0004C1, "Member 'UGbxGFxMovie::bGbxMovieStarted' has a wrong offset!");

// Class GbxUI.GbxGFxComboBoxScrollingList
// 0x0010 (0x0330 - 0x0320)
class UGbxGFxComboBoxScrollingList final : public UGbxGFxGridScrollingList
{
public:
	uint8                                         Pad_320[0x10];                                     // 0x0320(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxGFxComboBoxScrollingList">();
	}
	static class UGbxGFxComboBoxScrollingList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGFxComboBoxScrollingList>();
	}
};
static_assert(alignof(UGbxGFxComboBoxScrollingList) == 0x000008, "Wrong alignment on UGbxGFxComboBoxScrollingList");
static_assert(sizeof(UGbxGFxComboBoxScrollingList) == 0x000330, "Wrong size on UGbxGFxComboBoxScrollingList");

// Class GbxUI.GbxGFxMenu
// 0x01A8 (0x0680 - 0x04D8)
class UGbxGFxMenu : public UGbxGFxMovie
{
public:
	uint8                                         Pad_4D8[0x8];                                      // 0x04D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EGbxFocusableWidgetMouseBehavior              DefaultMouseFocusBehavior;                         // 0x04E0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxGFxMenuData*                        MenuData;                                          // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ButtonFocusedAudioEventName;                       // 0x04F0(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ButtonClickedAudioEventName;                       // 0x0500(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SliderAudioEventName;                              // 0x0510(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpinnerAudioEventName;                             // 0x0520(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NavigateBackAudioEventName;                        // 0x0530(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OpenMenuAudioEventName;                            // 0x0540(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CloseMenuAudioEventName;                           // 0x0548(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMenuTransitionOutCompleted;                      // 0x0550(0x0010)(BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMenuInputChanged;                                // 0x0560(0x0010)(BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EGbxGFxListAlignment                          HintBarAlignment;                                  // 0x0570(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallMenuTickOnlyIfMenuIsStarted;                  // 0x0571(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_572[0x2];                                      // 0x0572(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SplitscreenRootOffset;                             // 0x0574(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxGFxContextualMenu*                  OwnedContextualMenu;                               // 0x0578(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxGFxMenu*                            ActiveDialog;                                      // 0x0580(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_588[0x4];                                      // 0x0588(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AGbxPlayerController>    PCOwner;                                           // 0x058C(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AGbxCharacter>           PrimaryCharacterOwner;                             // 0x0594(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UGbxMenuStack>           MenuStackOwner;                                    // 0x059C(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DrawPriority;                                      // 0x05A4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxWidgetFocusManager*                 FocusManager;                                      // 0x05A8(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxHintBar*                            HintBar;                                           // 0x05B0(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxGFxHintBarContainer*                HintBarContainer;                                  // 0x05B8(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxGFxMouseBlocker*                    MouseBlockerClip;                                  // 0x05C0(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWantsDismiss;                                     // 0x05C8(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C9[0x3];                                      // 0x05C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UGbxGameInstance>        GameInstanceRef;                                   // 0x05CC(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UGbxUIGlobals>           UIGlobalsRef;                                      // 0x05D4(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5DC[0x2];                                      // 0x05DC(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCachedLastInputFromMouse;                         // 0x05DE(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReceiveMouseEvenIfNotActive;                      // 0x05DF(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInitedFromStash;                                // 0x05E0(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMouseHitsAllowedYet;                              // 0x05E1(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGotFirstMouseMove;                                // 0x05E2(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E3[0xD];                                      // 0x05E3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxGFxObject*                          MenuContentClip;                                   // 0x05F0(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxGFxObject*                          MenuLayoutsClip;                                   // 0x05F8(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxGFxObject*                          MenuLayoutClip;                                    // 0x0600(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSplitScreenLayout;                              // 0x0608(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_609[0x17];                                     // 0x0609(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBlockPauseMenu;                                   // 0x0620(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bGFxMenuWasStarted;                                // 0x0621(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_622[0x6];                                      // 0x0622(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxGFxButton*                          LastFocusedButton;                                 // 0x0628(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_630[0x50];                                     // 0x0630(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UObject* GetFocusedWidget() const;
	bool IsWidgetFocused(const class UObject* WidgetInQuestion) const;
	void MenuStack_Clear() const;
	void RegisterFocusableWidget(TScriptInterface<class IGbxFocusableWidget> Widget, const struct FGbxFocusableWidgetAdjacencyInfo& AdjacencyInfo) const;
	void RegisterFocusableWidgetWithAdjacency(TScriptInterface<class IGbxFocusableWidget> Widget, class UObject* AdjacentUp, class UObject* AdjacentDown, class UObject* AdjacentLeft, class UObject* AdjacentRight) const;
	void SetFocusableWidgetAdjancency(TScriptInterface<class IGbxFocusableWidget> Widget, class UObject* AdjacentUp, class UObject* AdjacentDown, class UObject* AdjacentLeft, class UObject* AdjacentRight) const;
	void SetFocusedWidget(TScriptInterface<class IGbxFocusableWidget> WidgetToFocus, bool bFromMouse) const;
	void SetWidgetAdjacency(TScriptInterface<class IGbxFocusableWidget> Widget, const struct FGbxFocusableWidgetAdjacencyInfo& AdjacencyInfo) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxGFxMenu">();
	}
	static class UGbxGFxMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGFxMenu>();
	}
};
static_assert(alignof(UGbxGFxMenu) == 0x000008, "Wrong alignment on UGbxGFxMenu");
static_assert(sizeof(UGbxGFxMenu) == 0x000680, "Wrong size on UGbxGFxMenu");
static_assert(offsetof(UGbxGFxMenu, DefaultMouseFocusBehavior) == 0x0004E0, "Member 'UGbxGFxMenu::DefaultMouseFocusBehavior' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, MenuData) == 0x0004E8, "Member 'UGbxGFxMenu::MenuData' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, ButtonFocusedAudioEventName) == 0x0004F0, "Member 'UGbxGFxMenu::ButtonFocusedAudioEventName' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, ButtonClickedAudioEventName) == 0x000500, "Member 'UGbxGFxMenu::ButtonClickedAudioEventName' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, SliderAudioEventName) == 0x000510, "Member 'UGbxGFxMenu::SliderAudioEventName' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, SpinnerAudioEventName) == 0x000520, "Member 'UGbxGFxMenu::SpinnerAudioEventName' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, NavigateBackAudioEventName) == 0x000530, "Member 'UGbxGFxMenu::NavigateBackAudioEventName' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, OpenMenuAudioEventName) == 0x000540, "Member 'UGbxGFxMenu::OpenMenuAudioEventName' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, CloseMenuAudioEventName) == 0x000548, "Member 'UGbxGFxMenu::CloseMenuAudioEventName' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, OnMenuTransitionOutCompleted) == 0x000550, "Member 'UGbxGFxMenu::OnMenuTransitionOutCompleted' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, OnMenuInputChanged) == 0x000560, "Member 'UGbxGFxMenu::OnMenuInputChanged' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, HintBarAlignment) == 0x000570, "Member 'UGbxGFxMenu::HintBarAlignment' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bCallMenuTickOnlyIfMenuIsStarted) == 0x000571, "Member 'UGbxGFxMenu::bCallMenuTickOnlyIfMenuIsStarted' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, SplitscreenRootOffset) == 0x000574, "Member 'UGbxGFxMenu::SplitscreenRootOffset' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, OwnedContextualMenu) == 0x000578, "Member 'UGbxGFxMenu::OwnedContextualMenu' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, ActiveDialog) == 0x000580, "Member 'UGbxGFxMenu::ActiveDialog' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, PCOwner) == 0x00058C, "Member 'UGbxGFxMenu::PCOwner' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, PrimaryCharacterOwner) == 0x000594, "Member 'UGbxGFxMenu::PrimaryCharacterOwner' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, MenuStackOwner) == 0x00059C, "Member 'UGbxGFxMenu::MenuStackOwner' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, DrawPriority) == 0x0005A4, "Member 'UGbxGFxMenu::DrawPriority' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, FocusManager) == 0x0005A8, "Member 'UGbxGFxMenu::FocusManager' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, HintBar) == 0x0005B0, "Member 'UGbxGFxMenu::HintBar' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, HintBarContainer) == 0x0005B8, "Member 'UGbxGFxMenu::HintBarContainer' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, MouseBlockerClip) == 0x0005C0, "Member 'UGbxGFxMenu::MouseBlockerClip' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bWantsDismiss) == 0x0005C8, "Member 'UGbxGFxMenu::bWantsDismiss' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, GameInstanceRef) == 0x0005CC, "Member 'UGbxGFxMenu::GameInstanceRef' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, UIGlobalsRef) == 0x0005D4, "Member 'UGbxGFxMenu::UIGlobalsRef' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bCachedLastInputFromMouse) == 0x0005DE, "Member 'UGbxGFxMenu::bCachedLastInputFromMouse' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bReceiveMouseEvenIfNotActive) == 0x0005DF, "Member 'UGbxGFxMenu::bReceiveMouseEvenIfNotActive' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bIsInitedFromStash) == 0x0005E0, "Member 'UGbxGFxMenu::bIsInitedFromStash' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bMouseHitsAllowedYet) == 0x0005E1, "Member 'UGbxGFxMenu::bMouseHitsAllowedYet' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bGotFirstMouseMove) == 0x0005E2, "Member 'UGbxGFxMenu::bGotFirstMouseMove' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, MenuContentClip) == 0x0005F0, "Member 'UGbxGFxMenu::MenuContentClip' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, MenuLayoutsClip) == 0x0005F8, "Member 'UGbxGFxMenu::MenuLayoutsClip' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, MenuLayoutClip) == 0x000600, "Member 'UGbxGFxMenu::MenuLayoutClip' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bIsSplitScreenLayout) == 0x000608, "Member 'UGbxGFxMenu::bIsSplitScreenLayout' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bBlockPauseMenu) == 0x000620, "Member 'UGbxGFxMenu::bBlockPauseMenu' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, bGFxMenuWasStarted) == 0x000621, "Member 'UGbxGFxMenu::bGFxMenuWasStarted' has a wrong offset!");
static_assert(offsetof(UGbxGFxMenu, LastFocusedButton) == 0x000628, "Member 'UGbxGFxMenu::LastFocusedButton' has a wrong offset!");

// Class GbxUI.GbxCoreDialogBoxHelpers
// 0x0000 (0x0028 - 0x0028)
class UGbxCoreDialogBoxHelpers final : public UBlueprintFunctionLibrary
{
public:
	static class UGbxDialogBox* ShowBlockingDialog(class AGbxPlayerController* Pc, const class FText& HeaderText, const class FText& MessageText, bool bBlocksAllUsers);
	static class UGbxDialogBox* ShowConfirmCancelDialog(class AGbxPlayerController* Pc, const class FText& HeaderText, const class FText& MessageText, bool bAnyUserCanInteract);
	static class UGbxDialogBox* ShowDialog(class AGbxPlayerController* Pc, const struct FGbxDialogBoxInfo& DialogBoxInfo);
	static class UGbxDialogBox* ShowOkayDialog(class AGbxPlayerController* Pc, const class FText& HeaderText, const class FText& MessageText, bool bAnyUserCanInteract, EGbxDialogBoxHelpersDialogTemplate Template);
	static class UGbxDialogBox* ShowYesNoDialog(class AGbxPlayerController* Pc, const class FText& HeaderText, const class FText& MessageText, bool bAnyUserCanInteract);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxCoreDialogBoxHelpers">();
	}
	static class UGbxCoreDialogBoxHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxCoreDialogBoxHelpers>();
	}
};
static_assert(alignof(UGbxCoreDialogBoxHelpers) == 0x000008, "Wrong alignment on UGbxCoreDialogBoxHelpers");
static_assert(sizeof(UGbxCoreDialogBoxHelpers) == 0x000028, "Wrong size on UGbxCoreDialogBoxHelpers");

// Class GbxUI.GbxGFxHUDWidget
// 0x0158 (0x0630 - 0x04D8)
class UGbxGFxHUDWidget : public UGbxGFxMovie
{
public:
	uint8                                         Pad_4D8[0x68];                                     // 0x04D8(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	EGFxHUDWidgetAnchorType                       AnchorType;                                        // 0x0540(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LayoutInstanceStringOverride;                      // 0x0548(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnchorBoneName;                                    // 0x0558(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxContextSensitivePromptTime;                     // 0x0560(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeUntilStopAdvancing;                         // 0x0564(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ShowFrameName;                                     // 0x0570(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 HideFrameName;                                     // 0x0580(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 OnFrameName;                                       // 0x0590(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 OffFrameName;                                      // 0x05A0(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxGFxHintWidget*                      ContextSensitivePrompt;                            // 0x05B0(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
