#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxWeapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// Enum GbxWeapon.EGbxTrajectoryTraceShape
// NumValues: 0x0005
enum class EGbxTrajectoryTraceShape : uint8
{
	Line                                     = 0,
	Sphere                                   = 1,
	Capsule                                  = 2,
	Box                                      = 3,
	EGbxTrajectoryTraceShape_MAX             = 4,
};

// Enum GbxWeapon.EWeaponEquipType
// NumValues: 0x0004
enum class EWeaponEquipType : uint8
{
	Default                                  = 0,
	Instant                                  = 1,
	Custom                                   = 2,
	EWeaponEquipType_MAX                     = 3,
};

// Enum GbxWeapon.EWeaponPutDownType
// NumValues: 0x0003
enum class EWeaponPutDownType : uint8
{
	Default                                  = 0,
	Instant                                  = 1,
	EWeaponPutDownType_MAX                   = 2,
};

// Enum GbxWeapon.EWeaponShotModifierType
// NumValues: 0x0012
enum class EWeaponShotModifierType : uint8
{
	None                                     = 0,
	EngineType1                              = 1,
	EngineType2                              = 2,
	EngineType3                              = 3,
	EngineType4                              = 4,
	EngineType5                              = 5,
	EngineType6                              = 6,
	EngineType7                              = 7,
	EngineType8                              = 8,
	GameType1                                = 9,
	GameType2                                = 10,
	GameType3                                = 11,
	GameType4                                = 12,
	GameType5                                = 13,
	GameType6                                = 14,
	GameType7                                = 15,
	GameType8                                = 16,
	EWeaponShotModifierType_MAX              = 17,
};

// Enum GbxWeapon.ELightBeamQueryActorType
// NumValues: 0x0008
enum class ELightBeamQueryActorType : uint8
{
	Unfiltered                               = 0,
	DamageCauser                             = 1,
	Instigator                               = 2,
	Source                                   = 3,
	Target                                   = 4,
	SourceOrTarget                           = 5,
	SourceAndTarget                          = 6,
	ELightBeamQueryActorType_MAX             = 7,
};

// Enum GbxWeapon.ELightBeamLock
// NumValues: 0x0004
enum class ELightBeamLock : uint8
{
	Never                                    = 0,
	Always                                   = 1,
	LockOn                                   = 2,
	ELightBeamLock_MAX                       = 3,
};

// Enum GbxWeapon.ELightBeamFlag
// NumValues: 0x0010
enum class ELightBeamFlag : uint8
{
	ViewDependent                            = 0,
	Locked                                   = 1,
	FollowViewPoint                          = 2,
	DisableChaining                          = 3,
	LagCompensation                          = 4,
	EngineFlag3                              = 5,
	EngineFlag4                              = 6,
	EngineFlag5                              = 7,
	EngineFlag6                              = 8,
	EngineFlag7                              = 9,
	EngineFlag8                              = 10,
	GameFlag1                                = 11,
	GameFlag2                                = 12,
	GameFlag3                                = 13,
	GameFlag4                                = 14,
	ELightBeamFlag_MAX                       = 15,
};

// Enum GbxWeapon.ELightProjectileQueryActorType
// NumValues: 0x0007
enum class ELightProjectileQueryActorType : uint8
{
	Unfiltered                               = 0,
	DamageCauser                             = 1,
	Instigator                               = 2,
	Source                                   = 3,
	Target                                   = 4,
	Attached                                 = 5,
	ELightProjectileQueryActorType_MAX       = 6,
};

// Enum GbxWeapon.ELightProjectileSubdivisionMode
// NumValues: 0x0005
enum class ELightProjectileSubdivisionMode : uint32
{
	Distance                                 = 0,
	Seconds                                  = 1,
	Width                                    = 2,
	Count                                    = 3,
	ELightProjectileSubdivisionMode_MAX      = 4,
};

// Enum GbxWeapon.ELightProjectileTracerThrottleLevel
// NumValues: 0x0005
enum class ELightProjectileTracerThrottleLevel : uint8
{
	None                                     = 0,
	NPC                                      = 1,
	RemotePlayer                             = 2,
	LocalPlayer                              = 3,
	ELightProjectileTracerThrottleLevel_MAX  = 4,
};

// Enum GbxWeapon.ELightProjectileFlag
// NumValues: 0x0011
enum class ELightProjectileFlag : uint8
{
	OverrideStartRotation                    = 0,
	Homing                                   = 1,
	StartFromLocalSource                     = 2,
	BounceTowardsEnemy                       = 3,
	Magnetism                                = 4,
	Reflected                                = 5,
	Penetrated                               = 6,
	HideTracer                               = 7,
	LagCompensation                          = 8,
	TargetActorSet                           = 9,
	DisableTracerThrottling                  = 10,
	EngineFlag1                              = 11,
	GameFlag1                                = 12,
	GameFlag2                                = 13,
	GameFlag3                                = 14,
	GameFlag4                                = 15,
	ELightProjectileFlag_MAX                 = 16,
};

// Enum GbxWeapon.ELightProjectileSplitPattern
// NumValues: 0x0003
enum class ELightProjectileSplitPattern : uint8
{
	Cone                                     = 0,
	Fan                                      = 1,
	ELightProjectileSplitPattern_MAX         = 2,
};

// Enum GbxWeapon.EHitTypeEnum
// NumValues: 0x0004
enum class EHitTypeEnum : uint8
{
	Friendly                                 = 0,
	Enemy                                    = 1,
	Neutral                                  = 2,
	EHitTypeEnum_MAX                         = 3,
};

// Enum GbxWeapon.ERecoilEndOfPatternAction
// NumValues: 0x0005
enum class ERecoilEndOfPatternAction : uint8
{
	None                                     = 0,
	PingPong                                 = 1,
	Loop                                     = 2,
	Reset                                    = 3,
	ERecoilEndOfPatternAction_MAX            = 4,
};

// Enum GbxWeapon.EWeaponReloadEvent
// NumValues: 0x0003
enum class EWeaponReloadEvent : uint8
{
	Started                                  = 0,
	Ended                                    = 1,
	EWeaponReloadEvent_MAX                   = 2,
};

// Enum GbxWeapon.EWeaponUseEvent
// NumValues: 0x0004
enum class EWeaponUseEvent : uint8
{
	UseStarted                               = 0,
	Used                                     = 1,
	UseFinished                              = 2,
	EWeaponUseEvent_MAX                      = 3,
};

// Enum GbxWeapon.EWeaponActionType
// NumValues: 0x0017
enum class EWeaponActionType : uint8
{
	EWAT_Default                             = 0,
	EWAT_Use                                 = 1,
	EWAT_Reload                              = 2,
	EWAT_Equip                               = 3,
	EWAT_PutDown                             = 4,
	EWAT_UseModeSwitch                       = 5,
	EWAT_Charge                              = 6,
	EWAT_Charged                             = 7,
	EWAT_Overcharged                         = 8,
	EWAT_ResetFireSequence                   = 9,
	EWAT_Discharge                           = 10,
	EWAT_EngineWeaponActionType6             = 11,
	EWAT_EngineWeaponActionType7             = 12,
	EWAT_EngineWeaponActionType8             = 13,
	EWAT_GameWeaponActionType1               = 14,
	EWAT_GameWeaponActionType2               = 15,
	EWAT_GameWeaponActionType3               = 16,
	EWAT_GameWeaponActionType4               = 17,
	EWAT_GameWeaponActionType5               = 18,
	EWAT_GameWeaponActionType6               = 19,
	EWAT_GameWeaponActionType7               = 20,
	EWAT_GameWeaponActionType8               = 21,
	EWAT_MAX                                 = 22,
};

// Enum GbxWeapon.EAmmoRegenType
// NumValues: 0x0004
enum class EAmmoRegenType : uint32
{
	Disabled                                 = 0,
	GenerateAmmo                             = 1,
	RefillLoadedAmmo                         = 2,
	EAmmoRegenType_MAX                       = 3,
};

// Enum GbxWeapon.EWeaponChargeEventType
// NumValues: 0x0004
enum class EWeaponChargeEventType : uint8
{
	BlueprintEvent                           = 0,
	EnableParticleEmitter                    = 1,
	DisableParticleEmitter                   = 2,
	EWeaponChargeEventType_MAX               = 3,
};

// Enum GbxWeapon.EWeaponChargeComparisonOperatorType
// NumValues: 0x0005
enum class EWeaponChargeComparisonOperatorType : uint8
{
	LessThan                                 = 0,
	LessThanOrEqual                          = 1,
	GreaterThan                              = 2,
	GreaterThanOrEqual                       = 3,
	EWeaponChargeComparisonOperatorType_MAX  = 4,
};

// Enum GbxWeapon.EWeaponChargeState
// NumValues: 0x0006
enum class EWeaponChargeState : uint8
{
	None                                     = 0,
	Discharging                              = 1,
	Charging                                 = 2,
	Charged                                  = 3,
	Overcharged                              = 4,
	EWeaponChargeState_MAX                   = 5,
};

// Enum GbxWeapon.EWeaponSkeletalControlEvent
// NumValues: 0x000B
enum class EWeaponSkeletalControlEvent : uint8
{
	Pause                                    = 0,
	Resume                                   = 1,
	Reset                                    = 2,
	CacheState                               = 3,
	RestoreState                             = 4,
	CacheStateAndReset                       = 5,
	ResetAndPause                            = 6,
	SetInput                                 = 7,
	AddInput                                 = 8,
	ReturnToDefault                          = 9,
	EWeaponSkeletalControlEvent_MAX          = 10,
};

// Enum GbxWeapon.EWeaponMaterialEffectBlendMode
// NumValues: 0x0006
enum class EWeaponMaterialEffectBlendMode : uint8
{
	Multiply                                 = 0,
	Add                                      = 1,
	Replace                                  = 2,
	AddReplace                               = 3,
	EWAVT_MAX                                = 4,
	EWeaponMaterialEffectBlendMode_MAX       = 5,
};

// Enum GbxWeapon.EWeaponEffectFlag
// NumValues: 0x0007
enum class EWeaponEffectFlag : uint8
{
	AutoActivate                             = 0,
	PlayOnlyOnActiveSlot                     = 1,
	IgnoredByFXCoordinator                   = 2,
	HideWhenScoped                           = 3,
	SpawnOnlyWhenVisible                     = 4,
	PlayersOnly                              = 5,
	EWeaponEffectFlag_MAX                    = 6,
};

// Enum GbxWeapon.EWeaponTextureMipsSetting
// NumValues: 0x0004
enum class EWeaponTextureMipsSetting : uint8
{
	Default                                  = 0,
	High                                     = 1,
	VeryHigh                                 = 2,
	EWeaponTextureMipsSetting_MAX            = 3,
};

// Enum GbxWeapon.EWeaponAttachmentVisibilityType
// NumValues: 0x0004
enum class EWeaponAttachmentVisibilityType : uint8
{
	EWAVT_Both                               = 0,
	EWAVT_FirstPerson                        = 1,
	EWAVT_ThirdPerson                        = 2,
	EWAVT_MAX                                = 3,
};

// Enum GbxWeapon.EWeaponEffectType
// NumValues: 0x001C
enum class EWeaponEffectType : uint8
{
	EWET_Default                             = 0,
	EWET_Use                                 = 1,
	EWET_Charge                              = 2,
	EWET_Sight                               = 3,
	EWET_Charged                             = 4,
	EWET_Overcharged                         = 5,
	EWET_Discharge                           = 6,
	EWET_EngineWeaponEffectType4             = 7,
	EWET_EngineWeaponEffectType5             = 8,
	EWET_EngineWeaponEffectType6             = 9,
	EWET_EngineWeaponEffectType7             = 10,
	EWET_EngineWeaponEffectType8             = 11,
	EWET_GameWeaponEffectType1               = 12,
	EWET_GameWeaponEffectType2               = 13,
	EWET_GameWeaponEffectType3               = 14,
	EWET_GameWeaponEffectType4               = 15,
	EWET_GameWeaponEffectType5               = 16,
	EWET_GameWeaponEffectType6               = 17,
	EWET_GameWeaponEffectType7               = 18,
	EWET_GameWeaponEffectType8               = 19,
	EWET_GameWeaponEffectType9               = 20,
	EWET_GameWeaponEffectType10              = 21,
	EWET_GameWeaponEffectType11              = 22,
	EWET_GameWeaponEffectType12              = 23,
	EWET_GameWeaponEffectType13              = 24,
	EWET_GameWeaponEffectType14              = 25,
	EWET_GameWeaponEffectType15              = 26,
	EWET_MAX                                 = 27,
};

// Enum GbxWeapon.EWeaponFireRateState
// NumValues: 0x0004
enum class EWeaponFireRateState : uint32
{
	None                                     = 0,
	Accelerating                             = 1,
	Decelerating                             = 2,
	EWeaponFireRateState_MAX                 = 3,
};

// Enum GbxWeapon.EWeaponHeatComparisonOperatorType
// NumValues: 0x0005
enum class EWeaponHeatComparisonOperatorType : uint8
{
	LessThan                                 = 0,
	LessThanOrEqual                          = 1,
	GreaterThan                              = 2,
	GreaterThanOrEqual                       = 3,
	EWeaponHeatComparisonOperatorType_MAX    = 4,
};

// Enum GbxWeapon.EWeaponShotDamageModifierType
// NumValues: 0x0004
enum class EWeaponShotDamageModifierType : uint32
{
	Scale                                    = 0,
	Add                                      = 1,
	SimpleScale                              = 2,
	EWeaponShotDamageModifierType_MAX        = 3,
};

// Enum GbxWeapon.ESimpleMotionInputHandler
// NumValues: 0x0003
enum class ESimpleMotionInputHandler : uint8
{
	None                                     = 0,
	Set                                      = 1,
	ESimpleMotionInputHandler_MAX            = 2,
};

// Enum GbxWeapon.EWeaponTriggerFeedbackMode
// NumValues: 0x0005
enum class EWeaponTriggerFeedbackMode : uint8
{
	Off                                      = 0,
	Feedback                                 = 1,
	Weapon                                   = 2,
	Vibration                                = 3,
	EWeaponTriggerFeedbackMode_MAX           = 4,
};

// Enum GbxWeapon.EWeaponTypeDataTableType
// NumValues: 0x0003
enum class EWeaponTypeDataTableType : uint8
{
	BaseWeaponBalance                        = 0,
	ManufacturerDamageScale                  = 1,
	EWeaponTypeDataTableType_MAX             = 2,
};

// Enum GbxWeapon.EWeaponVisibleAmmoUpdateMethod
// NumValues: 0x0005
enum class EWeaponVisibleAmmoUpdateMethod : uint8
{
	Auto                                     = 0,
	Manual                                   = 1,
	AutoAdd                                  = 2,
	AutoRemove                               = 3,
	EWeaponVisibleAmmoUpdateMethod_MAX       = 4,
};

// Enum GbxWeapon.EWeaponVisibleAmmoState
// NumValues: 0x0004
enum class EWeaponVisibleAmmoState : uint8
{
	LoadedAmmo                               = 0,
	PendingLoadedAmmo                        = 1,
	Disabled                                 = 2,
	EWeaponVisibleAmmoState_MAX              = 3,
};

// Enum GbxWeapon.EWeaponZoomState
// NumValues: 0x0005
enum class EWeaponZoomState : uint8
{
	NotZoomed                                = 0,
	ZoomingIn                                = 1,
	Zoomed                                   = 2,
	ZoomingOut                               = 3,
	EWeaponZoomState_MAX                     = 4,
};

// ScriptStruct GbxWeapon.LightProjectileFlagName
// 0x0020 (0x0020 - 0x0000)
struct FLightProjectileFlagName final
{
public:
	ELightProjectileFlag                          Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Tooltip;                                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLightProjectileFlagName) == 0x000008, "Wrong alignment on FLightProjectileFlagName");
static_assert(sizeof(FLightProjectileFlagName) == 0x000020, "Wrong size on FLightProjectileFlagName");
static_assert(offsetof(FLightProjectileFlagName, Type) == 0x000000, "Member 'FLightProjectileFlagName::Type' has a wrong offset!");
static_assert(offsetof(FLightProjectileFlagName, Name) == 0x000008, "Member 'FLightProjectileFlagName::Name' has a wrong offset!");
static_assert(offsetof(FLightProjectileFlagName, Tooltip) == 0x000010, "Member 'FLightProjectileFlagName::Tooltip' has a wrong offset!");

// ScriptStruct GbxWeapon.LightBeamAttachment
// 0x0028 (0x0028 - 0x0000)
struct FLightBeamAttachment final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Socket;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize100                 LocationOffset;                                    // 0x0018(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLightBeamAttachment) == 0x000008, "Wrong alignment on FLightBeamAttachment");
static_assert(sizeof(FLightBeamAttachment) == 0x000028, "Wrong size on FLightBeamAttachment");
static_assert(offsetof(FLightBeamAttachment, Actor) == 0x000000, "Member 'FLightBeamAttachment::Actor' has a wrong offset!");
static_assert(offsetof(FLightBeamAttachment, Component) == 0x000008, "Member 'FLightBeamAttachment::Component' has a wrong offset!");
static_assert(offsetof(FLightBeamAttachment, Socket) == 0x000010, "Member 'FLightBeamAttachment::Socket' has a wrong offset!");
static_assert(offsetof(FLightBeamAttachment, LocationOffset) == 0x000018, "Member 'FLightBeamAttachment::LocationOffset' has a wrong offset!");

// ScriptStruct GbxWeapon.LightBeamInitializationData
// 0x0128 (0x0128 - 0x0000)
struct FLightBeamInitializationData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULightBeamData>             DataBlueprint;                                     // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLightBeamAttachment                   Source;                                            // 0x0010(0x0028)(BlueprintVisible, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FLightBeamAttachment                   Target;                                            // 0x0038(0x0028)(BlueprintVisible, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         Flags;                                             // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Instigator;                                        // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageIntervalOverride;                            // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            DamageRampCurve;                                   // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageRampScale;                                   // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGbxDamageType>             DamageType;                                        // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageSource>              DamageSource;                                      // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageRadius;                                      // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FForceSelection                        ImpactForce;                                       // 0x00A8(0x0020)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class UImpactData*                            ImpactDataOverride;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameId;                                            // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spread;                                            // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LifetimeOverride;                                  // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponShotModifierType                       ModifierType;                                      // 0x00E0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x17];                                      // 0x00E1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ModifierValue;                                     // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCriticalHitDamageOverrides            CriticalHitOverrides;                              // 0x00FC(0x0008)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FDamageGoreModifiers                   GoreModifiers;                                     // 0x0104(0x0008)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightBeam*                             ParentBeam;                                        // 0x0110(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLightBeamInitializationData) == 0x000008, "Wrong alignment on FLightBeamInitializationData");
static_assert(sizeof(FLightBeamInitializationData) == 0x000128, "Wrong size on FLightBeamInitializationData");
static_assert(offsetof(FLightBeamInitializationData, DataBlueprint) == 0x000008, "Member 'FLightBeamInitializationData::DataBlueprint' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, Source) == 0x000010, "Member 'FLightBeamInitializationData::Source' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, Target) == 0x000038, "Member 'FLightBeamInitializationData::Target' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, Flags) == 0x000060, "Member 'FLightBeamInitializationData::Flags' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, Instigator) == 0x000068, "Member 'FLightBeamInitializationData::Instigator' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, DamageCauser) == 0x000070, "Member 'FLightBeamInitializationData::DamageCauser' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, Damage) == 0x000078, "Member 'FLightBeamInitializationData::Damage' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, DamageIntervalOverride) == 0x00007C, "Member 'FLightBeamInitializationData::DamageIntervalOverride' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, DamageRampCurve) == 0x000080, "Member 'FLightBeamInitializationData::DamageRampCurve' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, DamageRampScale) == 0x000088, "Member 'FLightBeamInitializationData::DamageRampScale' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, DamageType) == 0x000090, "Member 'FLightBeamInitializationData::DamageType' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, DamageSource) == 0x000098, "Member 'FLightBeamInitializationData::DamageSource' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, DamageRadius) == 0x0000A0, "Member 'FLightBeamInitializationData::DamageRadius' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, ImpactForce) == 0x0000A8, "Member 'FLightBeamInitializationData::ImpactForce' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, ImpactDataOverride) == 0x0000C8, "Member 'FLightBeamInitializationData::ImpactDataOverride' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, NameId) == 0x0000D0, "Member 'FLightBeamInitializationData::NameId' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, Spread) == 0x0000D8, "Member 'FLightBeamInitializationData::Spread' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, LifetimeOverride) == 0x0000DC, "Member 'FLightBeamInitializationData::LifetimeOverride' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, ModifierType) == 0x0000E0, "Member 'FLightBeamInitializationData::ModifierType' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, ModifierValue) == 0x0000F8, "Member 'FLightBeamInitializationData::ModifierValue' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, CriticalHitOverrides) == 0x0000FC, "Member 'FLightBeamInitializationData::CriticalHitOverrides' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, GoreModifiers) == 0x000104, "Member 'FLightBeamInitializationData::GoreModifiers' has a wrong offset!");
static_assert(offsetof(FLightBeamInitializationData, ParentBeam) == 0x000110, "Member 'FLightBeamInitializationData::ParentBeam' has a wrong offset!");

// ScriptStruct GbxWeapon.WeaponTriggerVibrationData
// 0x000C (0x000C - 0x0000)
struct FWeaponTriggerVibrationData final
{
public:
	float                                         Position;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Frequency;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Amplitude;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWeaponTriggerVibrationData) == 0x000004, "Wrong alignment on FWeaponTriggerVibrationData");
static_assert(sizeof(FWeaponTriggerVibrationData) == 0x00000C, "Wrong size on FWeaponTriggerVibrationData");
static_assert(offsetof(FWeaponTriggerVibrationData, Position) == 0x000000, "Member 'FWeaponTriggerVibrationData::Position' has a wrong offset!");
static_assert(offsetof(FWeaponTriggerVibrationData, Frequency) == 0x000004, "Member 'FWeaponTriggerVibrationData::Frequency' has a wrong offset!");
static_assert(offsetof(FWeaponTriggerVibrationData, Amplitude) == 0x000008, "Member 'FWeaponTriggerVibrationData::Amplitude' has a wrong offset!");

// ScriptStruct GbxWeapon.GbxTrajectometerTraceData
// 0x0020 (0x0020 - 0x0000)
struct FGbxTrajectometerTraceData final
{
public:
	ECollisionChannel                             Channel;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxTrajectoryTraceShape                      Shape;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExtentX;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentY;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentZ;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGbxTrajectometerTraceData) == 0x000004, "Wrong alignment on FGbxTrajectometerTraceData");
static_assert(sizeof(FGbxTrajectometerTraceData) == 0x000020, "Wrong size on FGbxTrajectometerTraceData");
static_assert(offsetof(FGbxTrajectometerTraceData, Channel) == 0x000000, "Member 'FGbxTrajectometerTraceData::Channel' has a wrong offset!");
static_assert(offsetof(FGbxTrajectometerTraceData, Shape) == 0x000001, "Member 'FGbxTrajectometerTraceData::Shape' has a wrong offset!");
static_assert(offsetof(FGbxTrajectometerTraceData, ExtentX) == 0x000004, "Member 'FGbxTrajectometerTraceData::ExtentX' has a wrong offset!");
static_assert(offsetof(FGbxTrajectometerTraceData, ExtentY) == 0x000008, "Member 'FGbxTrajectometerTraceData::ExtentY' has a wrong offset!");
static_assert(offsetof(FGbxTrajectometerTraceData, ExtentZ) == 0x00000C, "Member 'FGbxTrajectometerTraceData::ExtentZ' has a wrong offset!");

// ScriptStruct GbxWeapon.PredictProjectilePathAsyncRequest
// 0x0020 (0x0080 - 0x0060)
struct FPredictProjectilePathAsyncRequest final : public FPredictProjectilePathParams
{
public:
	EGbxTraceAsyncMode                            TraceMode;                                         // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectTypeQuery                              ObjectType;                                        // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TraceName;                                         // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(struct FPredictProjectilePathResult& Result)> Finished;                                          // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPredictProjectilePathAsyncRequest) == 0x000008, "Wrong alignment on FPredictProjectilePathAsyncRequest");
static_assert(sizeof(FPredictProjectilePathAsyncRequest) == 0x000080, "Wrong size on FPredictProjectilePathAsyncRequest");
static_assert(offsetof(FPredictProjectilePathAsyncRequest, TraceMode) == 0x000060, "Member 'FPredictProjectilePathAsyncRequest::TraceMode' has a wrong offset!");
static_assert(offsetof(FPredictProjectilePathAsyncRequest, ObjectType) == 0x000061, "Member 'FPredictProjectilePathAsyncRequest::ObjectType' has a wrong offset!");
static_assert(offsetof(FPredictProjectilePathAsyncRequest, TraceName) == 0x000068, "Member 'FPredictProjectilePathAsyncRequest::TraceName' has a wrong offset!");
static_assert(offsetof(FPredictProjectilePathAsyncRequest, Finished) == 0x000070, "Member 'FPredictProjectilePathAsyncRequest::Finished' has a wrong offset!");

// ScriptStruct GbxWeapon.WeaponShotModifierData
// 0x0048 (0x0048 - 0x0000)
struct FWeaponShotModifierData final
{
public:
	EWeaponShotModifierType                       ModifierType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Damage;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxDamageType>             DamageType;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImpactData*                            ImpactData;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProjectilesPerShot;                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCriticalHitDamageOverrides            CriticalHitOverrides;                              // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ModifierValue;                                     // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDamageGoreModifiers                   GoreModifiers;                                     // 0x002C(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x14];                                      // 0x0034(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWeaponShotModifierData) == 0x000008, "Wrong alignment on FWeaponShotModifierData");
static_assert(sizeof(FWeaponShotModifierData) == 0x000048, "Wrong size on FWeaponShotModifierData");
static_assert(offsetof(FWeaponShotModifierData, ModifierType) == 0x000000, "Member 'FWeaponShotModifierData::ModifierType' has a wrong offset!");
static_assert(offsetof(FWeaponShotModifierData, Damage) == 0x000004, "Member 'FWeaponShotModifierData::Damage' has a wrong offset!");
static_assert(offsetof(FWeaponShotModifierData, DamageType) == 0x000008, "Member 'FWeaponShotModifierData::DamageType' has a wrong offset!");
static_assert(offsetof(FWeaponShotModifierData, ImpactData) == 0x000010, "Member 'FWeaponShotModifierData::ImpactData' has a wrong offset!");
static_assert(offsetof(FWeaponShotModifierData, ProjectilesPerShot) == 0x000018, "Member 'FWeaponShotModifierData::ProjectilesPerShot' has a wrong offset!");
static_assert(offsetof(FWeaponShotModifierData, CriticalHitOverrides) == 0x000020, "Member 'FWeaponShotModifierData::CriticalHitOverrides' has a wrong offset!");
static_assert(offsetof(FWeaponShotModifierData, ModifierValue) == 0x000028, "Member 'FWeaponShotModifierData::ModifierValue' has a wrong offset!");
static_assert(offsetof(FWeaponShotModifierData, GoreModifiers) == 0x00002C, "Member 'FWeaponShotModifierData::GoreModifiers' has a wrong offset!");

// ScriptStruct GbxWeapon.FiringPatternSample
// 0x001C (0x001C - 0x0000)
struct FFiringPatternSample final
{
public:
	struct FRotator                               StartRotation;                                     // 0x0000(0x000C)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               EndRotation;                                       // 0x000C(0x000C)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseEndRotation;                                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseID;                                            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ID;                                                // 0x001A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFiringPatternSample) == 0x000004, "Wrong alignment on FFiringPatternSample");
static_assert(sizeof(FFiringPatternSample) == 0x00001C, "Wrong size on FFiringPatternSample");
static_assert(offsetof(FFiringPatternSample, StartRotation) == 0x000000, "Member 'FFiringPatternSample::StartRotation' has a wrong offset!");
static_assert(offsetof(FFiringPatternSample, EndRotation) == 0x00000C, "Member 'FFiringPatternSample::EndRotation' has a wrong offset!");
static_assert(offsetof(FFiringPatternSample, bUseEndRotation) == 0x000018, "Member 'FFiringPatternSample::bUseEndRotation' has a wrong offset!");
static_assert(offsetof(FFiringPatternSample, bUseID) == 0x000019, "Member 'FFiringPatternSample::bUseID' has a wrong offset!");
static_assert(offsetof(FFiringPatternSample, ID) == 0x00001A, "Member 'FFiringPatternSample::ID' has a wrong offset!");

// ScriptStruct GbxWeapon.WeaponSkeletalControlInstance
// 0x0038 (0x0038 - 0x0000)
struct FWeaponSkeletalControlInstance final
{
public:
	class UWeaponSkeletalControlBase*             Data;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x30];                                       // 0x0008(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWeaponSkeletalControlInstance) == 0x000008, "Wrong alignment on FWeaponSkeletalControlInstance");
static_assert(sizeof(FWeaponSkeletalControlInstance) == 0x000038, "Wrong size on FWeaponSkeletalControlInstance");
static_assert(offsetof(FWeaponSkeletalControlInstance, Data) == 0x000000, "Member 'FWeaponSkeletalControlInstance::Data' has a wrong offset!");

// ScriptStruct GbxWeapon.LightProjectileAttachment
// 0x0040 (0x0040 - 0x0000)
struct FLightProjectileAttachment final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Socket;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize100                 RelativeLocation;                                  // 0x0018(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotation;                                  // 0x0024(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              RelativeImpactNormal;                              // 0x0030(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLightProjectileAttachment) == 0x000008, "Wrong alignment on FLightProjectileAttachment");
static_assert(sizeof(FLightProjectileAttachment) == 0x000040, "Wrong size on FLightProjectileAttachment");
static_assert(offsetof(FLightProjectileAttachment, Actor) == 0x000000, "Member 'FLightProjectileAttachment::Actor' has a wrong offset!");
static_assert(offsetof(FLightProjectileAttachment, Component) == 0x000008, "Member 'FLightProjectileAttachment::Component' has a wrong offset!");
static_assert(offsetof(FLightProjectileAttachment, Socket) == 0x000010, "Member 'FLightProjectileAttachment::Socket' has a wrong offset!");
static_assert(offsetof(FLightProjectileAttachment, RelativeLocation) == 0x000018, "Member 'FLightProjectileAttachment::RelativeLocation' has a wrong offset!");
static_assert(offsetof(FLightProjectileAttachment, RelativeRotation) == 0x000024, "Member 'FLightProjectileAttachment::RelativeRotation' has a wrong offset!");
static_assert(offsetof(FLightProjectileAttachment, RelativeImpactNormal) == 0x000030, "Member 'FLightProjectileAttachment::RelativeImpactNormal' has a wrong offset!");

// ScriptStruct GbxWeapon.LightProjectileRingData
// 0x0034 (0x0034 - 0x0000)
struct alignas(0x04) FLightProjectileRingData final
{
public:
	uint8                                         Pad_0[0x34];                                       // 0x0000(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLightProjectileRingData) == 0x000004, "Wrong alignment on FLightProjectileRingData");
static_assert(sizeof(FLightProjectileRingData) == 0x000034, "Wrong size on FLightProjectileRingData");

// ScriptStruct GbxWeapon.LightProjectileInitializationData
// 0x0140 (0x0140 - 0x0000)
struct FLightProjectileInitializationData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULightProjectileData>       DataBlueprint;                                     // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartLocation;                                     // 0x0010(0x000C)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndLocation;                                       // 0x001C(0x000C)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Flags;                                             // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               StartRotationOverride;                             // 0x002C(0x000C)(BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class APawn*                                  Instigator;                                        // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Source;                                            // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Target;                                            // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetOffset;                                      // 0x0050(0x000C)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxDamageType>             DamageType;                                        // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageSource>              DamageSource;                                      // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageRadius;                                      // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FForceSelection                        ImpactForce;                                       // 0x0080(0x0020)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class UImpactData*                            ImpactDataOverride;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedScale;                                        // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityScaleOverride;                              // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         FiringPatternID;                                   // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         FireSocketID;                                      // 0x00B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageModifierComponent*               DamageModifierComp;                                // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameId;                                            // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponShotModifierType                       ModifierType;                                      // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x17];                                      // 0x00C9(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ModifierValue;                                     // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCriticalHitDamageOverrides            CriticalHitOverrides;                              // 0x00E4(0x0008)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FDamageGoreModifiers                   GoreModifiers;                                     // 0x00EC(0x0008)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FLightProjectileRingData               RingData;                                          // 0x00F4(0x0034)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x18];                                     // 0x0128(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLightProjectileInitializationData) == 0x000008, "Wrong alignment on FLightProjectileInitializationData");
static_assert(sizeof(FLightProjectileInitializationData) == 0x000140, "Wrong size on FLightProjectileInitializationData");
static_assert(offsetof(FLightProjectileInitializationData, DataBlueprint) == 0x000008, "Member 'FLightProjectileInitializationData::DataBlueprint' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, StartLocation) == 0x000010, "Member 'FLightProjectileInitializationData::StartLocation' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, EndLocation) == 0x00001C, "Member 'FLightProjectileInitializationData::EndLocation' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, Flags) == 0x000028, "Member 'FLightProjectileInitializationData::Flags' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, StartRotationOverride) == 0x00002C, "Member 'FLightProjectileInitializationData::StartRotationOverride' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, Instigator) == 0x000038, "Member 'FLightProjectileInitializationData::Instigator' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, Source) == 0x000040, "Member 'FLightProjectileInitializationData::Source' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, Target) == 0x000048, "Member 'FLightProjectileInitializationData::Target' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, TargetOffset) == 0x000050, "Member 'FLightProjectileInitializationData::TargetOffset' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, Damage) == 0x00005C, "Member 'FLightProjectileInitializationData::Damage' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, DamageCauser) == 0x000060, "Member 'FLightProjectileInitializationData::DamageCauser' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, DamageType) == 0x000068, "Member 'FLightProjectileInitializationData::DamageType' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, DamageSource) == 0x000070, "Member 'FLightProjectileInitializationData::DamageSource' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, DamageRadius) == 0x000078, "Member 'FLightProjectileInitializationData::DamageRadius' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, ImpactForce) == 0x000080, "Member 'FLightProjectileInitializationData::ImpactForce' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, ImpactDataOverride) == 0x0000A0, "Member 'FLightProjectileInitializationData::ImpactDataOverride' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, SpeedScale) == 0x0000A8, "Member 'FLightProjectileInitializationData::SpeedScale' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, GravityScaleOverride) == 0x0000AC, "Member 'FLightProjectileInitializationData::GravityScaleOverride' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, FiringPatternID) == 0x0000B0, "Member 'FLightProjectileInitializationData::FiringPatternID' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, FireSocketID) == 0x0000B1, "Member 'FLightProjectileInitializationData::FireSocketID' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, DamageModifierComp) == 0x0000B8, "Member 'FLightProjectileInitializationData::DamageModifierComp' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, NameId) == 0x0000C0, "Member 'FLightProjectileInitializationData::NameId' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, ModifierType) == 0x0000C8, "Member 'FLightProjectileInitializationData::ModifierType' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, ModifierValue) == 0x0000E0, "Member 'FLightProjectileInitializationData::ModifierValue' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, CriticalHitOverrides) == 0x0000E4, "Member 'FLightProjectileInitializationData::CriticalHitOverrides' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, GoreModifiers) == 0x0000EC, "Member 'FLightProjectileInitializationData::GoreModifiers' has a wrong offset!");
static_assert(offsetof(FLightProjectileInitializationData, RingData) == 0x0000F4, "Member 'FLightProjectileInitializationData::RingData' has a wrong offset!");

// ScriptStruct GbxWeapon.LightProjectileImpactData
// 0x0010 (0x0010 - 0x0000)
struct FLightProjectileImpactData final
{
public:
	bool                                          bPlayEffect;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantize                    Location;                                          // 0x0004(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLightProjectileImpactData) == 0x000004, "Wrong alignment on FLightProjectileImpactData");
static_assert(sizeof(FLightProjectileImpactData) == 0x000010, "Wrong size on FLightProjectileImpactData");
