#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Grenade_Balance_Struct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Grenade_Balance_Struct.Grenade_Balance_Struct
// 0x0010 (0x0010 - 0x0000)
struct FGrenade_Balance_Struct final
{
public:
	float                                         Damage_12_F33DA0994756D761207677A51A156787;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius_13_9DDB780D4981106D3843E19FAC0856D3;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElementalChance_27_7937D4CF4A8DD22697D5E4B2D4C91A2C; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElementalDamage_29_5B61CFB144632591AA0579A20584A549; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FGrenade_Balance_Struct) == 0x000004, "Wrong alignment on FGrenade_Balance_Struct");
static_assert(sizeof(FGrenade_Balance_Struct) == 0x000010, "Wrong size on FGrenade_Balance_Struct");
static_assert(offsetof(FGrenade_Balance_Struct, Damage_12_F33DA0994756D761207677A51A156787) == 0x000000, "Member 'FGrenade_Balance_Struct::Damage_12_F33DA0994756D761207677A51A156787' has a wrong offset!");
static_assert(offsetof(FGrenade_Balance_Struct, Radius_13_9DDB780D4981106D3843E19FAC0856D3) == 0x000004, "Member 'FGrenade_Balance_Struct::Radius_13_9DDB780D4981106D3843E19FAC0856D3' has a wrong offset!");
static_assert(offsetof(FGrenade_Balance_Struct, ElementalChance_27_7937D4CF4A8DD22697D5E4B2D4C91A2C) == 0x000008, "Member 'FGrenade_Balance_Struct::ElementalChance_27_7937D4CF4A8DD22697D5E4B2D4C91A2C' has a wrong offset!");
static_assert(offsetof(FGrenade_Balance_Struct, ElementalDamage_29_5B61CFB144632591AA0579A20584A549) == 0x00000C, "Member 'FGrenade_Balance_Struct::ElementalDamage_29_5B61CFB144632591AA0579A20584A549' has a wrong offset!");

}

