#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HangingLightMaterialProperties

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct HangingLightMaterialProperties.HangingLightMaterialProperties
// 0x0020 (0x0020 - 0x0000)
struct FHangingLightMaterialProperties final
{
public:
	class UMaterialInstance*                      MaterialInstance_5_9E3A98084DF94A3835C61799ED394C94; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor_8_9AD04521404E92AF51BCB0B1F1E35567;     // 0x0008(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightIntensity_12_9BDD47DB4EFF99265A96EA83C23CDDB2; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attenuation_14_86C6A3654E3F4685EEC3E7B3A097BB17;   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FHangingLightMaterialProperties) == 0x000008, "Wrong alignment on FHangingLightMaterialProperties");
static_assert(sizeof(FHangingLightMaterialProperties) == 0x000020, "Wrong size on FHangingLightMaterialProperties");
static_assert(offsetof(FHangingLightMaterialProperties, MaterialInstance_5_9E3A98084DF94A3835C61799ED394C94) == 0x000000, "Member 'FHangingLightMaterialProperties::MaterialInstance_5_9E3A98084DF94A3835C61799ED394C94' has a wrong offset!");
static_assert(offsetof(FHangingLightMaterialProperties, LightColor_8_9AD04521404E92AF51BCB0B1F1E35567) == 0x000008, "Member 'FHangingLightMaterialProperties::LightColor_8_9AD04521404E92AF51BCB0B1F1E35567' has a wrong offset!");
static_assert(offsetof(FHangingLightMaterialProperties, LightIntensity_12_9BDD47DB4EFF99265A96EA83C23CDDB2) == 0x000018, "Member 'FHangingLightMaterialProperties::LightIntensity_12_9BDD47DB4EFF99265A96EA83C23CDDB2' has a wrong offset!");
static_assert(offsetof(FHangingLightMaterialProperties, Attenuation_14_86C6A3654E3F4685EEC3E7B3A097BB17) == 0x00001C, "Member 'FHangingLightMaterialProperties::Attenuation_14_86C6A3654E3F4685EEC3E7B3A097BB17' has a wrong offset!");

}

