#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init_Vehicle_Weapon_Rotation

#include "Basic.hpp"

#include "Struct_VehicleMainWeaponRotation_structs.hpp"


namespace SDK::Params
{

// Function Init_Vehicle_Weapon_Rotation.Init_Vehicle_Weapon_Rotation_C.CalculateAttributeInitialValue
// 0x0040 (0x0040 - 0x0000)
struct Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetAssociatedVehicle_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakVehicle*                            K2Node_DynamicCast_AsOak_Vehicle;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_VehicleMainWeaponRotation      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0034(0x0004)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue");
static_assert(sizeof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue) == 0x000040, "Wrong size on Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, K2Node_DynamicCast_AsActor) == 0x000010, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, CallFunc_GetAssociatedVehicle_ReturnValue) == 0x000020, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::CallFunc_GetAssociatedVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, K2Node_DynamicCast_AsOak_Vehicle) == 0x000028, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::K2Node_DynamicCast_AsOak_Vehicle' has a wrong offset!");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, CallFunc_GetDataTableRowFromName_OutRow) == 0x000034, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000038, "Member 'Init_Vehicle_Weapon_Rotation_C_CalculateAttributeInitialValue::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

