#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init_BH_MissionDropCondition_Intro

#include "Basic.hpp"


namespace SDK::Params
{

// Function Init_BH_MissionDropCondition_Intro.Init_BH_MissionDropCondition_Intro_C.CalculateAttributeInitialValue
// 0x0038 (0x0038 - 0x0000)
struct Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                NewContext;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue1;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue");
static_assert(sizeof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue) == 0x000038, "Wrong size on Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, NewContext) == 0x000010, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::NewContext' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, Temp_float_Variable) == 0x000018, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, Temp_float_Variable1) == 0x00001C, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, Temp_bool_Variable) == 0x000020, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, Temp_float_Variable2) == 0x000024, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000028, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, Temp_bool_Variable1) == 0x00002C, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, CallFunc_K2_EvaluateCondition_ReturnValue) == 0x00002D, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::CallFunc_K2_EvaluateCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, CallFunc_K2_EvaluateCondition_ReturnValue1) == 0x00002E, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::CallFunc_K2_EvaluateCondition_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, K2Node_Select_Default) == 0x000030, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue, K2Node_Select1_Default) == 0x000034, "Member 'Init_BH_MissionDropCondition_Intro_C_CalculateAttributeInitialValue::K2Node_Select1_Default' has a wrong offset!");

}

