#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init_Barrier_HoldScalar

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Init_Barrier_HoldScalar.Init_Barrier_HoldScalar_C.CalculateAttributeInitialValue
// 0x0078 (0x0078 - 0x0000)
struct Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  Scalar;                                            // 0x0010(0x0018)(Edit, BlueprintVisible, NoDestructor)
	struct FDataTableValueHandle                  HealthScalar;                                      // 0x0028(0x0018)(Edit, BlueprintVisible, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInterface_Operative_DeployBarrier_C> K2Node_DynamicCast_AsInterface_Operative_Deploy_Barrier; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHoldingBarrier_Res;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue");
static_assert(sizeof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue) == 0x000078, "Wrong size on Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, Scalar) == 0x000010, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::Scalar' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, HealthScalar) == 0x000028, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::HealthScalar' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, Temp_bool_Variable) == 0x000040, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, K2Node_DynamicCast_AsActor) == 0x000048, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, Temp_float_Variable) == 0x000054, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, K2Node_DynamicCast_AsInterface_Operative_Deploy_Barrier) == 0x000058, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::K2Node_DynamicCast_AsInterface_Operative_Deploy_Barrier' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, K2Node_DynamicCast_bSuccess1) == 0x000068, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, CallFunc_IsHoldingBarrier_Res) == 0x000069, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::CallFunc_IsHoldingBarrier_Res' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x00006C, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue, K2Node_Select_Default) == 0x000070, "Member 'Init_Barrier_HoldScalar_C_CalculateAttributeInitialValue::K2Node_Select_Default' has a wrong offset!");

}

