#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init_RadiationExplosionDamage

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Init_RadiationExplosionDamage.Init_RadiationExplosionDamage_C.CalculateAttributeInitialValue
// 0x0050 (0x0050 - 0x0000)
struct Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectQuery                     K2Node_MakeStruct_StatusEffectQuery;               // 0x0010(0x0018)(NoDestructor)
	class AOakCharacter_Default*                  K2Node_DynamicCast_AsOak_Character_Default;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectQueryResult               CallFunc_QueryStatusEffect_ReturnValue;            // 0x0038(0x0010)(NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue");
static_assert(sizeof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue) == 0x000050, "Wrong size on Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue");
static_assert(offsetof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue, K2Node_MakeStruct_StatusEffectQuery) == 0x000010, "Member 'Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue::K2Node_MakeStruct_StatusEffectQuery' has a wrong offset!");
static_assert(offsetof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue, K2Node_DynamicCast_AsOak_Character_Default) == 0x000028, "Member 'Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue::K2Node_DynamicCast_AsOak_Character_Default' has a wrong offset!");
static_assert(offsetof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000034, "Member 'Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue, CallFunc_QueryStatusEffect_ReturnValue) == 0x000038, "Member 'Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue::CallFunc_QueryStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'Init_RadiationExplosionDamage_C_CalculateAttributeInitialValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

