#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init_Gunner_ExperimentalMunitions_IB

#include "Basic.hpp"


namespace SDK::Params
{

// Function Init_Gunner_ExperimentalMunitions_IB.Init_Gunner_ExperimentalMunitions_IB_C.CalculateAttributeInitialValue
// 0x0030 (0x0030 - 0x0000)
struct Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPassiveSkillGrade_Grade;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue");
static_assert(sizeof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue) == 0x000030, "Wrong size on Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue");
static_assert(offsetof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue, K2Node_DynamicCast_AsOak_Character) == 0x000010, "Member 'Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValue_OutValue) == 0x00001C, "Member 'Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValue_ReturnValue) == 0x000020, "Member 'Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue, CallFunc_GetPassiveSkillGrade_Grade) == 0x000024, "Member 'Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue::CallFunc_GetPassiveSkillGrade_Grade' has a wrong offset!");
static_assert(offsetof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'Init_Gunner_ExperimentalMunitions_IB_C_CalculateAttributeInitialValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

