#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init_Salamander_DamageCalc

#include "Basic.hpp"

#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function Init_Salamander_DamageCalc.Init_Salamander_DamageCalc_C.CalculateAttributeInitialValue
// 0x0070 (0x0070 - 0x0000)
struct Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageScalar;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakWeapon_IronBearHardPoint*           Hardpoint;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_IronBear*                 Iron_Bear;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StrengthThroughBalanceScalar;                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakWeapon_IronBearHardPoint*           K2Node_DynamicCast_AsOak_Weapon_Iron_Bear_Hard_Point; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_IronBear*                 K2Node_DynamicCast_AsOak_Character_Iron_Bear;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EIronBearModType                              CallFunc_GetMod_ReturnValue;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStrengthThroughBalanceScalar_Res;      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValue_OutValue1;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue1;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue");
static_assert(sizeof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue) == 0x000070, "Wrong size on Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, DamageScalar) == 0x00000C, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::DamageScalar' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, Hardpoint) == 0x000010, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::Hardpoint' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, Iron_Bear) == 0x000018, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::Iron_Bear' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, StrengthThroughBalanceScalar) == 0x000020, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::StrengthThroughBalanceScalar' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, K2Node_DynamicCast_AsOak_Weapon_Iron_Bear_Hard_Point) == 0x000028, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::K2Node_DynamicCast_AsOak_Weapon_Iron_Bear_Hard_Point' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, K2Node_DynamicCast_AsOak_Character_Iron_Bear) == 0x000040, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::K2Node_DynamicCast_AsOak_Character_Iron_Bear' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, K2Node_DynamicCast_bSuccess1) == 0x000048, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetMod_ReturnValue) == 0x000049, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, K2Node_SwitchEnum_CmpSuccess) == 0x00004A, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetValueOfAttribute_ReturnValue) == 0x00004C, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValue_OutValue) == 0x000050, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValue_ReturnValue) == 0x000054, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetStrengthThroughBalanceScalar_Res) == 0x00005C, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetStrengthThroughBalanceScalar_Res' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValue_OutValue1) == 0x000060, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValue_OutValue1' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValue_ReturnValue1) == 0x000064, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000068, "Member 'Init_Salamander_DamageCalc_C_CalculateAttributeInitialValue::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");

}

