#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init_Siren_Phasetrance_Presentation_Base

#include "Basic.hpp"

#include "GbxGameSystemCore_classes.hpp"
#include "OakGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Init_Siren_Phasetrance_Presentation_Base.Init_Siren_Phasetrance_Presentation_Base_C
// 0x0018 (0x0048 - 0x0030)
class UInit_Siren_Phasetrance_Presentation_Base_C : public UAttributeInitializer
{
public:
	class UOakActionAbilityAugmentData_PhaseTrance_Attack* AttackData;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbilityAugmentData_PhaseTrance_Effect* EffectData;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbilityAugmentData_PhaseTrance_Element* ElementData;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	float CalculateAttributeInitialValue(const class UObject* Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Init_Siren_Phasetrance_Presentation_Base_C">();
	}
	static class UInit_Siren_Phasetrance_Presentation_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInit_Siren_Phasetrance_Presentation_Base_C>();
	}
};
static_assert(alignof(UInit_Siren_Phasetrance_Presentation_Base_C) == 0x000008, "Wrong alignment on UInit_Siren_Phasetrance_Presentation_Base_C");
static_assert(sizeof(UInit_Siren_Phasetrance_Presentation_Base_C) == 0x000048, "Wrong size on UInit_Siren_Phasetrance_Presentation_Base_C");
static_assert(offsetof(UInit_Siren_Phasetrance_Presentation_Base_C, AttackData) == 0x000030, "Member 'UInit_Siren_Phasetrance_Presentation_Base_C::AttackData' has a wrong offset!");
static_assert(offsetof(UInit_Siren_Phasetrance_Presentation_Base_C, EffectData) == 0x000038, "Member 'UInit_Siren_Phasetrance_Presentation_Base_C::EffectData' has a wrong offset!");
static_assert(offsetof(UInit_Siren_Phasetrance_Presentation_Base_C, ElementData) == 0x000040, "Member 'UInit_Siren_Phasetrance_Presentation_Base_C::ElementData' has a wrong offset!");

}

