#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init_PetSkag_Phase_HealthRegen

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Init_PetSkag_Phase_HealthRegen.Init_PetSkag_Phase_HealthRegen_C.CalculateAttributeInitialValue
// 0x0050 (0x0050 - 0x0000)
struct Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0010(0x0018)(NoDestructor)
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle1;           // 0x0028(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue");
static_assert(sizeof(Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue) == 0x000050, "Wrong size on Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue");
static_assert(offsetof(Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue, K2Node_MakeStruct_DataTableValueHandle) == 0x000010, "Member 'Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue, K2Node_MakeStruct_DataTableValueHandle1) == 0x000028, "Member 'Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue::K2Node_MakeStruct_DataTableValueHandle1' has a wrong offset!");
static_assert(offsetof(Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000040, "Member 'Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValueFromHandle_ReturnValue1) == 0x000044, "Member 'Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValueFromHandle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'Init_PetSkag_Phase_HealthRegen_C_CalculateAttributeInitialValue::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

