#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Init_Drone_MachineGunDamageCalc

#include "Basic.hpp"


namespace SDK::Params
{

// Function Init_Drone_MachineGunDamageCalc.Init_Drone_MachineGunDamageCalc_C.CalculateAttributeInitialValue
// 0x0040 (0x0040 - 0x0000)
struct Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityAugmentSlotted_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue) == 0x000008, "Wrong alignment on Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue");
static_assert(sizeof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue) == 0x000040, "Wrong size on Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, Context) == 0x000000, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::Context' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, ReturnValue) == 0x000008, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, Temp_bool_Variable) == 0x00000C, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, K2Node_DynamicCast_AsActor) == 0x000010, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, Temp_float_Variable) == 0x00001C, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, CallFunc_IsAbilityAugmentSlotted_ReturnValue) == 0x000028, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::CallFunc_IsAbilityAugmentSlotted_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x00002C, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, K2Node_Select_Default) == 0x000030, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, CallFunc_GetDataTableValueFromHandle_ReturnValue1) == 0x000034, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::CallFunc_GetDataTableValueFromHandle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'Init_Drone_MachineGunDamageCalc_C_CalculateAttributeInitialValue::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

