#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputComponent_Player2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxInput_structs.hpp"
#include "GbxInput_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass InputComponent_Player2.InputComponent_Player2_C
// 0x0DD0 (0x10C0 - 0x02F0)
class UInputComponent_Player2_C final : public UGbxInputComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(Transient, DuplicateTransient)
	class AOakCharacter_Player*                   Player;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxInputEvent_Button_PressHoldRelease GbxInputEvent__27;                                 // 0x0300(0x0080)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__36;                                 // 0x0380(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__37;                                 // 0x03F8(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__38;                                 // 0x0470(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__5;                                  // 0x04E8(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__6;                                  // 0x0560(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__1;                                  // 0x05D8(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__13;                                 // 0x0650(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__7;                                  // 0x06C8(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__14;                                 // 0x0740(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__15;                                 // 0x07B8(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__16;                                 // 0x0830(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__22;                                 // 0x08A8(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__2;                                  // 0x0920(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__0;                                  // 0x0998(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressHoldRelease GbxInputEvent__9;                                  // 0x0A10(0x0080)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressHoldRelease GbxInputEvent__11;                                 // 0x0A90(0x0080)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__8;                                  // 0x0B10(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_OakMoveAxis             GbxInputEvent__3;                                  // 0x0B88(0x0070)(ContainsInstancedReference)
	struct FGbxInputEvent_OakLookAxis             GbxInputEvent__4;                                  // 0x0BF8(0x0080)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressHoldRelease GbxInputEvent__12;                                 // 0x0C78(0x0080)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__17;                                 // 0x0CF8(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressHoldRelease GbxInputEvent__21;                                 // 0x0D70(0x0080)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__10;                                 // 0x0DF0(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__19;                                 // 0x0E68(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__18;                                 // 0x0EE0(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__20;                                 // 0x0F58(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__24;                                 // 0x0FD0(0x0078)(ContainsInstancedReference)
	struct FGbxInputEvent_Button_PressRelease     GbxInputEvent__23;                                 // 0x1048(0x0078)(ContainsInstancedReference)

public:
	void ExecuteUbergraph_InputComponent_Player2(int32 EntryPoint);
	void ReceiveBeginPlay();
	void K2Node_GbxInputEvent_Button_PressRelease();
	void K2Node_GbxInputEvent_Button_PressRelease1();
	void GbxInputEvent_21();
	void GbxInputEvent_27();
	void GbxInputEvent_24();
	void K2Node_GbxInputEvent_Button_PressRelease2();
	void K2Node_GbxInputEvent_Button_PressRelease3();
	void K2Node_GbxInputEvent_Button_PressRelease4();
	void K2Node_GbxInputEvent_Button_PressHoldRelease();
	void GbxInputEvent_4();
	void GbxInputEvent_6();
	void GbxInputEvent_1();
	void GbxInputEvent_13();
	void K2Node_GbxInputEvent_Button_PressHoldRelease1();
	void GbxInputEvent_5(const struct FVector& Val, bool bGamePad);
	void GbxInputEvent_3(const struct FVector& Val, bool bGamePad);
	void GbxInputEvent_0();
	void GbxInputEvent_2();
	void GbxInputEvent_34();
	void GbxInputEvent_33();
	void GbxInputEvent_32();
	void GbxInputEvent_31();
	void GbxInputEvent_38();
	void GbxInputEvent_37();
	void GbxInputEvent_36();
	void K2Node_GbxInputEvent_Button_PressRelease5();
	void GbxInputEvent_8();
	void GbxInputEvent_9();
	void GbxInputEvent_7();
	void K2Node_GbxInputEvent_Button_PressRelease_1_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_0_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_0_Released_exec();
	void GbxInpActEvt_InputAction_Discrete_MarkTarget_K2Node_GbxInputActionEvent_Discrete_3(class UGbxInputActionData_Discrete* Action);
	void K2Node_GbxInputEvent_Button_PressRelease_40_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_40_Released_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_51_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_51_Held_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_51_Released_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_19_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_19_Held_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_19_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_3_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_3_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_6_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_6_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_4_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_4_Released_exec();
	void GbxInpActEvt_InputAction_Discrete_TrackNextMission_K2Node_GbxInputActionEvent_Discrete_4(class UGbxInputActionData_Discrete* Action);
	void GbxInpActEvt_InputAction_Discrete_TrackPreviousMission_K2Node_GbxInputActionEvent_Discrete_5(class UGbxInputActionData_Discrete* Action);
	void K2Node_GbxInputEvent_Button_PressHoldRelease_1_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_1_Held_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_1_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_446_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_446_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_514_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_514_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_858_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_858_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_943_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_943_Released_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_2_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_2_Held_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_2_Released_exec();
	void K2Node_GbxInputEvent_OakLookAxis_6_def_exec(const struct FVector& Val, bool bGamePad);
	void K2Node_GbxInputEvent_OakMoveAxis_0_def_exec(const struct FVector& Val, bool bGamePad);
	void K2Node_GbxInputEvent_Button_PressRelease_1672_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1672_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1410_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1410_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1157_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1157_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1128_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1128_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1127_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1127_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1072_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1072_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_210_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_210_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_141_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_141_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_201_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_201_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_2_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_2_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_97_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_97_Released_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_0_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_0_Held_exec();
	void K2Node_GbxInputEvent_Button_PressHoldRelease_0_Released_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1176_Pressed_exec();
	void K2Node_GbxInputEvent_Button_PressRelease_1176_Released_exec();
	void IsInFFYL(bool* InFFYL);
	void IsUsePromptEnabled(EUsabilityType Type, bool* Res);
	void ShouldAttemptSecondaryActionSkill(bool* bRes);
	void IsPawnAttached(bool* bRes);
	void UsesActionSkillOverride(bool* bRes);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InputComponent_Player2_C">();
	}
	static class UInputComponent_Player2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputComponent_Player2_C>();
	}
};
static_assert(alignof(UInputComponent_Player2_C) == 0x000008, "Wrong alignment on UInputComponent_Player2_C");
static_assert(sizeof(UInputComponent_Player2_C) == 0x0010C0, "Wrong size on UInputComponent_Player2_C");
static_assert(offsetof(UInputComponent_Player2_C, UberGraphFrame) == 0x0002F0, "Member 'UInputComponent_Player2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, Player) == 0x0002F8, "Member 'UInputComponent_Player2_C::Player' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__27) == 0x000300, "Member 'UInputComponent_Player2_C::GbxInputEvent__27' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__36) == 0x000380, "Member 'UInputComponent_Player2_C::GbxInputEvent__36' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__37) == 0x0003F8, "Member 'UInputComponent_Player2_C::GbxInputEvent__37' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__38) == 0x000470, "Member 'UInputComponent_Player2_C::GbxInputEvent__38' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__5) == 0x0004E8, "Member 'UInputComponent_Player2_C::GbxInputEvent__5' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__6) == 0x000560, "Member 'UInputComponent_Player2_C::GbxInputEvent__6' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__1) == 0x0005D8, "Member 'UInputComponent_Player2_C::GbxInputEvent__1' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__13) == 0x000650, "Member 'UInputComponent_Player2_C::GbxInputEvent__13' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__7) == 0x0006C8, "Member 'UInputComponent_Player2_C::GbxInputEvent__7' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__14) == 0x000740, "Member 'UInputComponent_Player2_C::GbxInputEvent__14' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__15) == 0x0007B8, "Member 'UInputComponent_Player2_C::GbxInputEvent__15' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__16) == 0x000830, "Member 'UInputComponent_Player2_C::GbxInputEvent__16' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__22) == 0x0008A8, "Member 'UInputComponent_Player2_C::GbxInputEvent__22' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__2) == 0x000920, "Member 'UInputComponent_Player2_C::GbxInputEvent__2' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__0) == 0x000998, "Member 'UInputComponent_Player2_C::GbxInputEvent__0' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__9) == 0x000A10, "Member 'UInputComponent_Player2_C::GbxInputEvent__9' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__11) == 0x000A90, "Member 'UInputComponent_Player2_C::GbxInputEvent__11' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__8) == 0x000B10, "Member 'UInputComponent_Player2_C::GbxInputEvent__8' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__3) == 0x000B88, "Member 'UInputComponent_Player2_C::GbxInputEvent__3' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__4) == 0x000BF8, "Member 'UInputComponent_Player2_C::GbxInputEvent__4' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__12) == 0x000C78, "Member 'UInputComponent_Player2_C::GbxInputEvent__12' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__17) == 0x000CF8, "Member 'UInputComponent_Player2_C::GbxInputEvent__17' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__21) == 0x000D70, "Member 'UInputComponent_Player2_C::GbxInputEvent__21' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__10) == 0x000DF0, "Member 'UInputComponent_Player2_C::GbxInputEvent__10' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__19) == 0x000E68, "Member 'UInputComponent_Player2_C::GbxInputEvent__19' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__18) == 0x000EE0, "Member 'UInputComponent_Player2_C::GbxInputEvent__18' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__20) == 0x000F58, "Member 'UInputComponent_Player2_C::GbxInputEvent__20' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__24) == 0x000FD0, "Member 'UInputComponent_Player2_C::GbxInputEvent__24' has a wrong offset!");
static_assert(offsetof(UInputComponent_Player2_C, GbxInputEvent__23) == 0x001048, "Member 'UInputComponent_Player2_C::GbxInputEvent__23' has a wrong offset!");

}

