#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interface_ActionSkill_Operative_ShoulderCannon

#include "Basic.hpp"

#include "EShoulderCannonMods_structs.hpp"


namespace SDK::Params
{

// Function Interface_ActionSkill_Operative_ShoulderCannon.Interface_ActionSkill_Operative_ShoulderCannon_C.IsShouldCannonModSlotted
// 0x0002 (0x0002 - 0x0000)
struct Interface_ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted final
{
public:
	EShoulderCannonMods                           Mod;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Res;                                               // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Interface_ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted) == 0x000001, "Wrong alignment on Interface_ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted");
static_assert(sizeof(Interface_ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted) == 0x000002, "Wrong size on Interface_ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted");
static_assert(offsetof(Interface_ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Mod) == 0x000000, "Member 'Interface_ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Mod' has a wrong offset!");
static_assert(offsetof(Interface_ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted, Res) == 0x000001, "Member 'Interface_ActionSkill_Operative_ShoulderCannon_C_IsShouldCannonModSlotted::Res' has a wrong offset!");

// Function Interface_ActionSkill_Operative_ShoulderCannon.Interface_ActionSkill_Operative_ShoulderCannon_C.GetCannonRef
// 0x0008 (0x0008 - 0x0000)
struct Interface_ActionSkill_Operative_ShoulderCannon_C_GetCannonRef final
{
public:
	class AActor*                                 Ref;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interface_ActionSkill_Operative_ShoulderCannon_C_GetCannonRef) == 0x000008, "Wrong alignment on Interface_ActionSkill_Operative_ShoulderCannon_C_GetCannonRef");
static_assert(sizeof(Interface_ActionSkill_Operative_ShoulderCannon_C_GetCannonRef) == 0x000008, "Wrong size on Interface_ActionSkill_Operative_ShoulderCannon_C_GetCannonRef");
static_assert(offsetof(Interface_ActionSkill_Operative_ShoulderCannon_C_GetCannonRef, Ref) == 0x000000, "Member 'Interface_ActionSkill_Operative_ShoulderCannon_C_GetCannonRef::Ref' has a wrong offset!");

// Function Interface_ActionSkill_Operative_ShoulderCannon.Interface_ActionSkill_Operative_ShoulderCannon_C.StartShoulderCannonMod3Timer
// 0x0001 (0x0001 - 0x0000)
struct Interface_ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer final
{
public:
	bool                                          Res;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Interface_ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer) == 0x000001, "Wrong alignment on Interface_ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer");
static_assert(sizeof(Interface_ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer) == 0x000001, "Wrong size on Interface_ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer");
static_assert(offsetof(Interface_ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer, Res) == 0x000000, "Member 'Interface_ActionSkill_Operative_ShoulderCannon_C_StartShoulderCannonMod3Timer::Res' has a wrong offset!");

}

