#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionScripted_HyperspeedTunnel

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WwiseAudio_structs.hpp"


namespace SDK::Params
{

// Function IO_MissionScripted_HyperspeedTunnel.IO_MissionScripted_HyperspeedTunnel_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct IO_MissionScripted_HyperspeedTunnel_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IO_MissionScripted_HyperspeedTunnel_C_UserConstructionScript) == 0x000008, "Wrong alignment on IO_MissionScripted_HyperspeedTunnel_C_UserConstructionScript");
static_assert(sizeof(IO_MissionScripted_HyperspeedTunnel_C_UserConstructionScript) == 0x000010, "Wrong size on IO_MissionScripted_HyperspeedTunnel_C_UserConstructionScript");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'IO_MissionScripted_HyperspeedTunnel_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'IO_MissionScripted_HyperspeedTunnel_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function IO_MissionScripted_HyperspeedTunnel.IO_MissionScripted_HyperspeedTunnel_C.__UserState_UserStates_0
// 0x0001 (0x0001 - 0x0000)
struct IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_0 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_0) == 0x000001, "Wrong alignment on IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_0");
static_assert(sizeof(IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_0) == 0x000001, "Wrong size on IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_0");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_0, bFromLoad) == 0x000000, "Member 'IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_0::bFromLoad' has a wrong offset!");

// Function IO_MissionScripted_HyperspeedTunnel.IO_MissionScripted_HyperspeedTunnel_C.__UserState_UserStates_1
// 0x0001 (0x0001 - 0x0000)
struct IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_1) == 0x000001, "Wrong alignment on IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_1");
static_assert(sizeof(IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_1) == 0x000001, "Wrong size on IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_1");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_1, bFromLoad) == 0x000000, "Member 'IO_MissionScripted_HyperspeedTunnel_C___UserState_UserStates_1::bFromLoad' has a wrong offset!");

// Function IO_MissionScripted_HyperspeedTunnel.IO_MissionScripted_HyperspeedTunnel_C.ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel
// 0x00B8 (0x00B8 - 0x0000)
struct IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0008(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x0020(0x0018)()
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRangedDistanceOverrides               K2Node_MakeStruct_RangedDistanceOverrides;         // 0x0050(0x000C)(NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRangedDistanceOverrides               K2Node_MakeStruct_RangedDistanceOverrides1;        // 0x0068(0x000C)(NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRangedDistanceOverrides               K2Node_MakeStruct_RangedDistanceOverrides2;        // 0x0080(0x000C)(NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad1;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad;                   // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPrimaryPlayerController_ReturnValue;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScreenParticleManagerComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel) == 0x000008, "Wrong alignment on IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel");
static_assert(sizeof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel) == 0x0000B8, "Wrong size on IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, EntryPoint) == 0x000000, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::EntryPoint' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_PostWwiseEvent_ReturnValue) == 0x000008, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_PostWwiseEvent_ReturnValue1) == 0x000020, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x00003C, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00004C, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, K2Node_MakeStruct_RangedDistanceOverrides) == 0x000050, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::K2Node_MakeStruct_RangedDistanceOverrides' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x00005C, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, K2Node_MakeStruct_RangedDistanceOverrides1) == 0x000068, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::K2Node_MakeStruct_RangedDistanceOverrides1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000074, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, K2Node_MakeStruct_RangedDistanceOverrides2) == 0x000080, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::K2Node_MakeStruct_RangedDistanceOverrides2' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, K2Node_UserStateEvent_bFromLoad1) == 0x00008C, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::K2Node_UserStateEvent_bFromLoad1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, K2Node_UserStateEvent_bFromLoad) == 0x00008D, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::K2Node_UserStateEvent_bFromLoad' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_Not_PreBool_ReturnValue) == 0x00008E, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_BooleanAND_ReturnValue) == 0x00008F, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_GetPrimaryPlayerController_ReturnValue) == 0x000090, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_GetPrimaryPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_BooleanAND_ReturnValue1) == 0x000098, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_GetComponentByClass_ReturnValue) == 0x0000A0, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000A8, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel, CallFunc_SpawnEmitterAttached_ReturnValue1) == 0x0000B0, "Member 'IO_MissionScripted_HyperspeedTunnel_C_ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel::CallFunc_SpawnEmitterAttached_ReturnValue1' has a wrong offset!");

}

