#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionScripted_SnowyRoom

#include "Basic.hpp"


namespace SDK::Params
{

// Function IO_MissionScripted_SnowyRoom.IO_MissionScripted_SnowyRoom_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct IO_MissionScripted_SnowyRoom_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_DynamicCast_AsDecal_Actor;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       K2Node_DynamicCast_AsStatic_Mesh_Actor;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript) == 0x000008, "Wrong alignment on IO_MissionScripted_SnowyRoom_C_UserConstructionScript");
static_assert(sizeof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript) == 0x000040, "Wrong size on IO_MissionScripted_SnowyRoom_C_UserConstructionScript");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000010, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, K2Node_DynamicCast_AsDecal_Actor) == 0x000018, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::K2Node_DynamicCast_AsDecal_Actor' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, K2Node_DynamicCast_AsStatic_Mesh_Actor) == 0x000028, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::K2Node_DynamicCast_AsStatic_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'IO_MissionScripted_SnowyRoom_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function IO_MissionScripted_SnowyRoom.IO_MissionScripted_SnowyRoom_C.Play_Feedback_Default
// 0x0001 (0x0001 - 0x0000)
struct IO_MissionScripted_SnowyRoom_C_Play_Feedback_Default final
{
public:
	bool                                          FromLoad;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_SnowyRoom_C_Play_Feedback_Default) == 0x000001, "Wrong alignment on IO_MissionScripted_SnowyRoom_C_Play_Feedback_Default");
static_assert(sizeof(IO_MissionScripted_SnowyRoom_C_Play_Feedback_Default) == 0x000001, "Wrong size on IO_MissionScripted_SnowyRoom_C_Play_Feedback_Default");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_Play_Feedback_Default, FromLoad) == 0x000000, "Member 'IO_MissionScripted_SnowyRoom_C_Play_Feedback_Default::FromLoad' has a wrong offset!");

// Function IO_MissionScripted_SnowyRoom.IO_MissionScripted_SnowyRoom_C.HideActors
// 0x0018 (0x0018 - 0x0000)
struct IO_MissionScripted_SnowyRoom_C_HideActors final
{
public:
	TArray<class AActor*>                         HideShowActors_0;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          RightNow;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_SnowyRoom_C_HideActors) == 0x000008, "Wrong alignment on IO_MissionScripted_SnowyRoom_C_HideActors");
static_assert(sizeof(IO_MissionScripted_SnowyRoom_C_HideActors) == 0x000018, "Wrong size on IO_MissionScripted_SnowyRoom_C_HideActors");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_HideActors, HideShowActors_0) == 0x000000, "Member 'IO_MissionScripted_SnowyRoom_C_HideActors::HideShowActors_0' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_HideActors, RightNow) == 0x000010, "Member 'IO_MissionScripted_SnowyRoom_C_HideActors::RightNow' has a wrong offset!");

// Function IO_MissionScripted_SnowyRoom.IO_MissionScripted_SnowyRoom_C.ShowActors
// 0x0010 (0x0010 - 0x0000)
struct IO_MissionScripted_SnowyRoom_C_ShowActors final
{
public:
	TArray<class AActor*>                         HideShowActors_0;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(IO_MissionScripted_SnowyRoom_C_ShowActors) == 0x000008, "Wrong alignment on IO_MissionScripted_SnowyRoom_C_ShowActors");
static_assert(sizeof(IO_MissionScripted_SnowyRoom_C_ShowActors) == 0x000010, "Wrong size on IO_MissionScripted_SnowyRoom_C_ShowActors");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ShowActors, HideShowActors_0) == 0x000000, "Member 'IO_MissionScripted_SnowyRoom_C_ShowActors::HideShowActors_0' has a wrong offset!");

// Function IO_MissionScripted_SnowyRoom.IO_MissionScripted_SnowyRoom_C.ExecuteUbergraph_IO_MissionScripted_SnowyRoom
// 0x00B0 (0x00B0 - 0x0000)
struct IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FromLoad;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_CustomEvent_HideShowActors1;                // 0x0028(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          K2Node_CustomEvent_RightNow;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_CustomEvent_HideShowActors;                 // 0x0040(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADecalActor*                            K2Node_DynamicCast_AsDecal_Actor;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       K2Node_DynamicCast_AsStatic_Mesh_Actor;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_DynamicCast_AsDecal_Actor1;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       K2Node_DynamicCast_AsStatic_Mesh_Actor1;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom) == 0x000008, "Wrong alignment on IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom");
static_assert(sizeof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom) == 0x0000B0, "Wrong size on IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, EntryPoint) == 0x000000, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::EntryPoint' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_IsValid_ReturnValue1) == 0x000005, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_IsValid_ReturnValue2) == 0x000006, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, Temp_int_Array_Index_Variable) == 0x000008, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, Temp_int_Array_Index_Variable1) == 0x000014, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_Event_FromLoad) == 0x000018, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_Event_FromLoad' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, Temp_int_Loop_Counter_Variable1) == 0x00001C, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_Add_IntInt_ReturnValue1) == 0x000020, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_CustomEvent_HideShowActors1) == 0x000028, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_CustomEvent_HideShowActors1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_CustomEvent_RightNow) == 0x000038, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_CustomEvent_RightNow' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_CustomEvent_HideShowActors) == 0x000040, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_CustomEvent_HideShowActors' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_Array_Get_Item) == 0x000050, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_DynamicCast_AsDecal_Actor) == 0x000060, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_DynamicCast_AsDecal_Actor' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_DynamicCast_AsStatic_Mesh_Actor) == 0x000070, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_DynamicCast_AsStatic_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_Array_Get_Item1) == 0x000080, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_DynamicCast_AsDecal_Actor1) == 0x000088, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_DynamicCast_AsDecal_Actor1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_DynamicCast_bSuccess2) == 0x000090, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_DynamicCast_AsStatic_Mesh_Actor1) == 0x000098, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_DynamicCast_AsStatic_Mesh_Actor1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, K2Node_DynamicCast_bSuccess3) == 0x0000A0, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_Array_Length_ReturnValue1) == 0x0000A4, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_Less_IntInt_ReturnValue1) == 0x0000A8, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom, CallFunc_GetTimelineLength_ReturnValue) == 0x0000AC, "Member 'IO_MissionScripted_SnowyRoom_C_ExecuteUbergraph_IO_MissionScripted_SnowyRoom::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");

}

