#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionPlaceable_ElectricPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "IO_MissionPlaceable_Static_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_MissionPlaceable_ElectricPanel.IO_MissionPlaceable_ElectricPanel_C
// 0x0020 (0x07B8 - 0x0798)
class AIO_MissionPlaceable_ElectricPanel_C final : public AIO_MissionPlaceable_Static_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IO_MissionPlaceable_ElectricPanel_C; // 0x0798(0x0008)(Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxChildActorComponent*                IO_Combat_Panel_Electric;                          // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AIO_Combat_Panel_Electric_C*            ElectricPanel;                                     // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Play_Feedback_PlaceableDefault();
	void Play_Feedback_Placeable();
	void Play_Feedback_Placing();
	void Play_Feedback_Placed();
	void ExecuteUbergraph_IO_MissionPlaceable_ElectricPanel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_MissionPlaceable_ElectricPanel_C">();
	}
	static class AIO_MissionPlaceable_ElectricPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_MissionPlaceable_ElectricPanel_C>();
	}
};
static_assert(alignof(AIO_MissionPlaceable_ElectricPanel_C) == 0x000008, "Wrong alignment on AIO_MissionPlaceable_ElectricPanel_C");
static_assert(sizeof(AIO_MissionPlaceable_ElectricPanel_C) == 0x0007B8, "Wrong size on AIO_MissionPlaceable_ElectricPanel_C");
static_assert(offsetof(AIO_MissionPlaceable_ElectricPanel_C, UberGraphFrame_IO_MissionPlaceable_ElectricPanel_C) == 0x000798, "Member 'AIO_MissionPlaceable_ElectricPanel_C::UberGraphFrame_IO_MissionPlaceable_ElectricPanel_C' has a wrong offset!");
static_assert(offsetof(AIO_MissionPlaceable_ElectricPanel_C, Box) == 0x0007A0, "Member 'AIO_MissionPlaceable_ElectricPanel_C::Box' has a wrong offset!");
static_assert(offsetof(AIO_MissionPlaceable_ElectricPanel_C, IO_Combat_Panel_Electric) == 0x0007A8, "Member 'AIO_MissionPlaceable_ElectricPanel_C::IO_Combat_Panel_Electric' has a wrong offset!");
static_assert(offsetof(AIO_MissionPlaceable_ElectricPanel_C, ElectricPanel) == 0x0007B0, "Member 'AIO_MissionPlaceable_ElectricPanel_C::ElectricPanel' has a wrong offset!");

}

