#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionGiver_DLCDiscovery_Takedown2

#include "Basic.hpp"

#include "IO_MissionGiver_DLCDiscovery_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_MissionGiver_DLCDiscovery_Takedown2.IO_MissionGiver_DLCDiscovery_Takedown2_C
// 0x0048 (0x0618 - 0x05D0)
class AIO_MissionGiver_DLCDiscovery_Takedown2_C final : public AIO_MissionGiver_DLCDiscovery_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IO_MissionGiver_DLCDiscovery_Takedown2_C; // 0x05D0(0x0008)(Transient, DuplicateTransient)
	class UOakTriggerComponent*                   OakTrigger1;                                       // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UDialogScriptData>       DialogScript;                                      // 0x05E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         DelayBeforeVO;                                     // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HeardVONumTimes;                                   // 0x0614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IO_MissionGiver_DLCDiscovery_Takedown2(int32 EntryPoint);
	void BndEvt__OakTrigger1_K2Node_ComponentBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature_IO_MissionGiver_DLCDiscovery_Takedown2(class AActor* TouchingActor, bool bIsPlayer, class UActorComponent* ComponentTouched);
	void OnDialogSequenceFinished_2();
	void Play_Feedback_MissionsAvailable();
	void Play_Feedback_NoMissionsAvailable();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_MissionGiver_DLCDiscovery_Takedown2_C">();
	}
	static class AIO_MissionGiver_DLCDiscovery_Takedown2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_MissionGiver_DLCDiscovery_Takedown2_C>();
	}
};
static_assert(alignof(AIO_MissionGiver_DLCDiscovery_Takedown2_C) == 0x000008, "Wrong alignment on AIO_MissionGiver_DLCDiscovery_Takedown2_C");
static_assert(sizeof(AIO_MissionGiver_DLCDiscovery_Takedown2_C) == 0x000618, "Wrong size on AIO_MissionGiver_DLCDiscovery_Takedown2_C");
static_assert(offsetof(AIO_MissionGiver_DLCDiscovery_Takedown2_C, UberGraphFrame_IO_MissionGiver_DLCDiscovery_Takedown2_C) == 0x0005D0, "Member 'AIO_MissionGiver_DLCDiscovery_Takedown2_C::UberGraphFrame_IO_MissionGiver_DLCDiscovery_Takedown2_C' has a wrong offset!");
static_assert(offsetof(AIO_MissionGiver_DLCDiscovery_Takedown2_C, OakTrigger1) == 0x0005D8, "Member 'AIO_MissionGiver_DLCDiscovery_Takedown2_C::OakTrigger1' has a wrong offset!");
static_assert(offsetof(AIO_MissionGiver_DLCDiscovery_Takedown2_C, Box) == 0x0005E0, "Member 'AIO_MissionGiver_DLCDiscovery_Takedown2_C::Box' has a wrong offset!");
static_assert(offsetof(AIO_MissionGiver_DLCDiscovery_Takedown2_C, DialogScript) == 0x0005E8, "Member 'AIO_MissionGiver_DLCDiscovery_Takedown2_C::DialogScript' has a wrong offset!");
static_assert(offsetof(AIO_MissionGiver_DLCDiscovery_Takedown2_C, DelayBeforeVO) == 0x000610, "Member 'AIO_MissionGiver_DLCDiscovery_Takedown2_C::DelayBeforeVO' has a wrong offset!");
static_assert(offsetof(AIO_MissionGiver_DLCDiscovery_Takedown2_C, HeardVONumTimes) == 0x000614, "Member 'AIO_MissionGiver_DLCDiscovery_Takedown2_C::HeardVONumTimes' has a wrong offset!");

}

