#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionUsable_Poster_KickMe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "IO_MissionUsable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_MissionUsable_Poster_KickMe.IO_MissionUsable_Poster_KickMe_C
// 0x0020 (0x0750 - 0x0730)
class AIO_MissionUsable_Poster_KickMe_C final : public AIO_MissionUsable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IO_MissionUsable_Poster_KickMe_C;   // 0x0730(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnUsed;                                            // 0x0740(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UserConstructionScript();
	void Play_Feedback_Used();
	void Play_Feedback_UsableDefault();
	void Play_Feedback_Usable();
	void Play_Feedback_InUse();
	void PickedUp(class AActor* WasPickedUpBy);
	void AttachPosterToClaptrap(class ABPChar_Claptrap_C* BP_Char);
	void ExecuteUbergraph_IO_MissionUsable_Poster_KickMe(int32 EntryPoint);
	void OnUsed__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_MissionUsable_Poster_KickMe_C">();
	}
	static class AIO_MissionUsable_Poster_KickMe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_MissionUsable_Poster_KickMe_C>();
	}
};
static_assert(alignof(AIO_MissionUsable_Poster_KickMe_C) == 0x000008, "Wrong alignment on AIO_MissionUsable_Poster_KickMe_C");
static_assert(sizeof(AIO_MissionUsable_Poster_KickMe_C) == 0x000750, "Wrong size on AIO_MissionUsable_Poster_KickMe_C");
static_assert(offsetof(AIO_MissionUsable_Poster_KickMe_C, UberGraphFrame_IO_MissionUsable_Poster_KickMe_C) == 0x000730, "Member 'AIO_MissionUsable_Poster_KickMe_C::UberGraphFrame_IO_MissionUsable_Poster_KickMe_C' has a wrong offset!");
static_assert(offsetof(AIO_MissionUsable_Poster_KickMe_C, StaticMesh) == 0x000738, "Member 'AIO_MissionUsable_Poster_KickMe_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AIO_MissionUsable_Poster_KickMe_C, OnUsed) == 0x000740, "Member 'AIO_MissionUsable_Poster_KickMe_C::OnUsed' has a wrong offset!");

}

