#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionScripted_GlitchedHyperspeedTunnel

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "EnumState_HyperspeedDome_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_MissionScripted_GlitchedHyperspeedTunnel.IO_MissionScripted_GlitchedHyperspeedTunnel_C
// 0x0670 (0x0BC0 - 0x0550)
class AIO_MissionScripted_GlitchedHyperspeedTunnel_C final : public AInteractiveObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   Wwise_audio_hyperspeed;                            // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HyperspeedDome;                                 // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EnumState_HyperspeedDome                      UserStates;                                        // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               HyperspeedMaterial;                                // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   HyperspeedBubble_Disabled;                         // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   HyperspeedBubble_Enabled;                          // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	uint8                                         Pad_5A8[0x8];                                      // 0x05A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   WarpPostProcessSettings;                           // 0x05B0(0x0600)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UGbxLevelSequencePlayer*                SEQ_HyperspeedPostWarpFX;                          // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxCondition*                          Cond_UserStates_NewEnumerator1;                    // 0x0BB8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void __UserState_UserStates_1(bool bFromLoad);
	void __UserState_UserStates_0(bool bFromLoad);
	void ExecuteUbergraph_IO_MissionScripted_GlitchedHyperspeedTunnel(int32 EntryPoint);
	void HyperspeedBubble_Enabled__DelegateSignature();
	void HyperspeedBubble_Disabled__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_MissionScripted_GlitchedHyperspeedTunnel_C">();
	}
	static class AIO_MissionScripted_GlitchedHyperspeedTunnel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_MissionScripted_GlitchedHyperspeedTunnel_C>();
	}
};
static_assert(alignof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C) == 0x000010, "Wrong alignment on AIO_MissionScripted_GlitchedHyperspeedTunnel_C");
static_assert(sizeof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C) == 0x000BC0, "Wrong size on AIO_MissionScripted_GlitchedHyperspeedTunnel_C");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, UberGraphFrame) == 0x000550, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, Arrow) == 0x000558, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::Arrow' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, Wwise_audio_hyperspeed) == 0x000560, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::Wwise_audio_hyperspeed' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, SM_HyperspeedDome) == 0x000568, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::SM_HyperspeedDome' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, Scene) == 0x000570, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::Scene' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, UserStates) == 0x000578, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::UserStates' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, HyperspeedMaterial) == 0x000580, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::HyperspeedMaterial' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, HyperspeedBubble_Disabled) == 0x000588, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::HyperspeedBubble_Disabled' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, HyperspeedBubble_Enabled) == 0x000598, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::HyperspeedBubble_Enabled' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, WarpPostProcessSettings) == 0x0005B0, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::WarpPostProcessSettings' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, SEQ_HyperspeedPostWarpFX) == 0x000BB0, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::SEQ_HyperspeedPostWarpFX' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_GlitchedHyperspeedTunnel_C, Cond_UserStates_NewEnumerator1) == 0x000BB8, "Member 'AIO_MissionScripted_GlitchedHyperspeedTunnel_C::Cond_UserStates_NewEnumerator1' has a wrong offset!");

}

