#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionScripted_HyperspeedTunnel

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "EnumState_HyperspeedDome_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_MissionScripted_HyperspeedTunnel.IO_MissionScripted_HyperspeedTunnel_C
// 0x06A0 (0x0BF0 - 0x0550)
class AIO_MissionScripted_HyperspeedTunnel_C final : public AInteractiveObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   Wwise_audio_hyperspeed;                            // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HyperspeedDome;                                 // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeBackToRegularSpeed_Material_Fade_6903248C4C8CC93959870794F1F01E43; // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeBackToRegularSpeed_Distortion_6903248C4C8CC93959870794F1F01E43; // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeBackToRegularSpeed__Direction_6903248C4C8CC93959870794F1F01E43; // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeBackToRegularSpeed;                            // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeToHyperSpeed_Material_Fade_38B7C88149DF13BF497B3ABEC4F181F2; // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeToHyperSpeed_Full_hyperspeed_38B7C88149DF13BF497B3ABEC4F181F2; // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeToHyperSpeed_Finish_ramp_up_38B7C88149DF13BF497B3ABEC4F181F2; // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeToHyperSpeed_Ramp_up_38B7C88149DF13BF497B3ABEC4F181F2; // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeToHyperSpeed__Direction_38B7C88149DF13BF497B3ABEC4F181F2; // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeToHyperSpeed;                                  // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnumState_HyperspeedDome                      UserStates;                                        // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               HyperspeedMaterial;                                // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   HyperspeedBubble_Disabled;                         // 0x05C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   HyperspeedBubble_Enabled;                          // 0x05D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FPostProcessSettings                   WarpPostProcessSettings;                           // 0x05E0(0x0600)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShowWarpFlash;                                     // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE1[0x7];                                      // 0x0BE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxCondition*                          Cond_UserStates_NewEnumerator1;                    // 0x0BE8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void FadeToHyperSpeed__UpdateFunc();
	void FadeToHyperSpeed__Started__EventFunc();
	void FadeToHyperSpeed__FinishedFunc();
	void FadeBackToRegularSpeed__UpdateFunc();
	void FadeBackToRegularSpeed__HyperspeedEnd__EventFunc();
	void FadeBackToRegularSpeed__FinishedFunc();
	void __UserState_UserStates_0(bool bFromLoad);
	void __UserState_UserStates_1(bool bFromLoad);
	void ExecuteUbergraph_IO_MissionScripted_HyperspeedTunnel(int32 EntryPoint);
	void HyperspeedBubble_Enabled__DelegateSignature();
	void HyperspeedBubble_Disabled__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_MissionScripted_HyperspeedTunnel_C">();
	}
	static class AIO_MissionScripted_HyperspeedTunnel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_MissionScripted_HyperspeedTunnel_C>();
	}
};
static_assert(alignof(AIO_MissionScripted_HyperspeedTunnel_C) == 0x000010, "Wrong alignment on AIO_MissionScripted_HyperspeedTunnel_C");
static_assert(sizeof(AIO_MissionScripted_HyperspeedTunnel_C) == 0x000BF0, "Wrong size on AIO_MissionScripted_HyperspeedTunnel_C");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, UberGraphFrame) == 0x000550, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, Arrow) == 0x000558, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::Arrow' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, Wwise_audio_hyperspeed) == 0x000560, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::Wwise_audio_hyperspeed' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, SM_HyperspeedDome) == 0x000568, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::SM_HyperspeedDome' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, Scene) == 0x000570, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::Scene' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeBackToRegularSpeed_Material_Fade_6903248C4C8CC93959870794F1F01E43) == 0x000578, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeBackToRegularSpeed_Material_Fade_6903248C4C8CC93959870794F1F01E43' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeBackToRegularSpeed_Distortion_6903248C4C8CC93959870794F1F01E43) == 0x00057C, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeBackToRegularSpeed_Distortion_6903248C4C8CC93959870794F1F01E43' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeBackToRegularSpeed__Direction_6903248C4C8CC93959870794F1F01E43) == 0x000580, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeBackToRegularSpeed__Direction_6903248C4C8CC93959870794F1F01E43' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeBackToRegularSpeed) == 0x000588, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeBackToRegularSpeed' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeToHyperSpeed_Material_Fade_38B7C88149DF13BF497B3ABEC4F181F2) == 0x000590, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeToHyperSpeed_Material_Fade_38B7C88149DF13BF497B3ABEC4F181F2' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeToHyperSpeed_Full_hyperspeed_38B7C88149DF13BF497B3ABEC4F181F2) == 0x000594, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeToHyperSpeed_Full_hyperspeed_38B7C88149DF13BF497B3ABEC4F181F2' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeToHyperSpeed_Finish_ramp_up_38B7C88149DF13BF497B3ABEC4F181F2) == 0x000598, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeToHyperSpeed_Finish_ramp_up_38B7C88149DF13BF497B3ABEC4F181F2' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeToHyperSpeed_Ramp_up_38B7C88149DF13BF497B3ABEC4F181F2) == 0x00059C, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeToHyperSpeed_Ramp_up_38B7C88149DF13BF497B3ABEC4F181F2' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeToHyperSpeed__Direction_38B7C88149DF13BF497B3ABEC4F181F2) == 0x0005A0, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeToHyperSpeed__Direction_38B7C88149DF13BF497B3ABEC4F181F2' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, FadeToHyperSpeed) == 0x0005A8, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::FadeToHyperSpeed' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, UserStates) == 0x0005B0, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::UserStates' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, HyperspeedMaterial) == 0x0005B8, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::HyperspeedMaterial' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, HyperspeedBubble_Disabled) == 0x0005C0, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::HyperspeedBubble_Disabled' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, HyperspeedBubble_Enabled) == 0x0005D0, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::HyperspeedBubble_Enabled' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, WarpPostProcessSettings) == 0x0005E0, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::WarpPostProcessSettings' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, ShowWarpFlash) == 0x000BE0, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::ShowWarpFlash' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_HyperspeedTunnel_C, Cond_UserStates_NewEnumerator1) == 0x000BE8, "Member 'AIO_MissionScripted_HyperspeedTunnel_C::Cond_UserStates_NewEnumerator1' has a wrong offset!");

}

