#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionDamageable

#include "Basic.hpp"

#include "Enum_MissionDamageableState_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function IO_MissionDamageable.IO_MissionDamageable_C.SetDamageableGlowValue
// 0x0050 (0x0050 - 0x0000)
struct IO_MissionDamageable_C_SetDamageableGlowValue final
{
public:
	float                                         Value__0Minus1_;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionDamageable_C_SetDamageableGlowValue) == 0x000008, "Wrong alignment on IO_MissionDamageable_C_SetDamageableGlowValue");
static_assert(sizeof(IO_MissionDamageable_C_SetDamageableGlowValue) == 0x000050, "Wrong size on IO_MissionDamageable_C_SetDamageableGlowValue");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, Value__0Minus1_) == 0x000000, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::Value__0Minus1_' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, Temp_int_Array_Index_Variable) == 0x000004, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, CallFunc_Array_Get_Item) == 0x000018, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000028, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000038, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, K2Node_DynamicCast_bSuccess1) == 0x000040, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, CallFunc_Array_Length_ReturnValue1) == 0x000044, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetDamageableGlowValue, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'IO_MissionDamageable_C_SetDamageableGlowValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.SetMissionDamageableState
// 0x0002 (0x0002 - 0x0000)
struct IO_MissionDamageable_C_SetMissionDamageableState final
{
public:
	Enum_MissionDamageableState                   DamageableState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionDamageable_C_SetMissionDamageableState) == 0x000001, "Wrong alignment on IO_MissionDamageable_C_SetMissionDamageableState");
static_assert(sizeof(IO_MissionDamageable_C_SetMissionDamageableState) == 0x000002, "Wrong size on IO_MissionDamageable_C_SetMissionDamageableState");
static_assert(offsetof(IO_MissionDamageable_C_SetMissionDamageableState, DamageableState) == 0x000000, "Member 'IO_MissionDamageable_C_SetMissionDamageableState::DamageableState' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_SetMissionDamageableState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'IO_MissionDamageable_C_SetMissionDamageableState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct IO_MissionDamageable_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetComponentsByClass_ReturnValue;         // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IO_MissionDamageable_C_UserConstructionScript) == 0x000008, "Wrong alignment on IO_MissionDamageable_C_UserConstructionScript");
static_assert(sizeof(IO_MissionDamageable_C_UserConstructionScript) == 0x000038, "Wrong size on IO_MissionDamageable_C_UserConstructionScript");
static_assert(offsetof(IO_MissionDamageable_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'IO_MissionDamageable_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'IO_MissionDamageable_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'IO_MissionDamageable_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_UserConstructionScript, CallFunc_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'IO_MissionDamageable_C_UserConstructionScript::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'IO_MissionDamageable_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000028, "Member 'IO_MissionDamageable_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'IO_MissionDamageable_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x000034, "Member 'IO_MissionDamageable_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable
// 0x0088 (0x0088 - 0x0000)
struct IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0030(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable) == 0x000008, "Wrong alignment on IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable");
static_assert(sizeof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable) == 0x000088, "Wrong size on IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable");
static_assert(offsetof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable, DamageReceiver) == 0x000000, "Member 'IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable::DamageReceiver' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable, Damage) == 0x000008, "Member 'IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable::Damage' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable, DamageType) == 0x000010, "Member 'IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable::DamageType' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable, DamageSource) == 0x000018, "Member 'IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable::DamageSource' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable, InstigatedBy) == 0x000020, "Member 'IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable::InstigatedBy' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable, DamageCauser) == 0x000028, "Member 'IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable::DamageCauser' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable, Details) == 0x000030, "Member 'IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_TakeAnyPipelineDamageDelegate__DelegateSignature_BP_IO_Switch_Parent_V1_Damageable::Details' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730
// 0x0010 (0x0010 - 0x0000)
struct IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730 final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730) == 0x000008, "Wrong alignment on IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730");
static_assert(sizeof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730) == 0x000010, "Wrong size on IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730");
static_assert(offsetof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730, DamageReceiver) == 0x000000, "Member 'IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730::DamageReceiver' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730, DamageCauser) == 0x000008, "Member 'IO_MissionDamageable_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_IO_MissionDamageable_UNIX1533573730::DamageCauser' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.__UserState_MissionDamageableState_0
// 0x0001 (0x0001 - 0x0000)
struct IO_MissionDamageable_C___UserState_MissionDamageableState_0 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionDamageable_C___UserState_MissionDamageableState_0) == 0x000001, "Wrong alignment on IO_MissionDamageable_C___UserState_MissionDamageableState_0");
static_assert(sizeof(IO_MissionDamageable_C___UserState_MissionDamageableState_0) == 0x000001, "Wrong size on IO_MissionDamageable_C___UserState_MissionDamageableState_0");
static_assert(offsetof(IO_MissionDamageable_C___UserState_MissionDamageableState_0, bFromLoad) == 0x000000, "Member 'IO_MissionDamageable_C___UserState_MissionDamageableState_0::bFromLoad' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.__UserState_MissionDamageableState_1
// 0x0001 (0x0001 - 0x0000)
struct IO_MissionDamageable_C___UserState_MissionDamageableState_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionDamageable_C___UserState_MissionDamageableState_1) == 0x000001, "Wrong alignment on IO_MissionDamageable_C___UserState_MissionDamageableState_1");
static_assert(sizeof(IO_MissionDamageable_C___UserState_MissionDamageableState_1) == 0x000001, "Wrong size on IO_MissionDamageable_C___UserState_MissionDamageableState_1");
static_assert(offsetof(IO_MissionDamageable_C___UserState_MissionDamageableState_1, bFromLoad) == 0x000000, "Member 'IO_MissionDamageable_C___UserState_MissionDamageableState_1::bFromLoad' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.__UserState_MissionDamageableState_2
// 0x0001 (0x0001 - 0x0000)
struct IO_MissionDamageable_C___UserState_MissionDamageableState_2 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionDamageable_C___UserState_MissionDamageableState_2) == 0x000001, "Wrong alignment on IO_MissionDamageable_C___UserState_MissionDamageableState_2");
static_assert(sizeof(IO_MissionDamageable_C___UserState_MissionDamageableState_2) == 0x000001, "Wrong size on IO_MissionDamageable_C___UserState_MissionDamageableState_2");
static_assert(offsetof(IO_MissionDamageable_C___UserState_MissionDamageableState_2, bFromLoad) == 0x000000, "Member 'IO_MissionDamageable_C___UserState_MissionDamageableState_2::bFromLoad' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.MissionDamageableTookNonZeroDamage_Multicast
// 0x0004 (0x0004 - 0x0000)
struct IO_MissionDamageable_C_MissionDamageableTookNonZeroDamage_Multicast final
{
public:
	int32                                         NumberOfTimesHit;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IO_MissionDamageable_C_MissionDamageableTookNonZeroDamage_Multicast) == 0x000004, "Wrong alignment on IO_MissionDamageable_C_MissionDamageableTookNonZeroDamage_Multicast");
static_assert(sizeof(IO_MissionDamageable_C_MissionDamageableTookNonZeroDamage_Multicast) == 0x000004, "Wrong size on IO_MissionDamageable_C_MissionDamageableTookNonZeroDamage_Multicast");
static_assert(offsetof(IO_MissionDamageable_C_MissionDamageableTookNonZeroDamage_Multicast, NumberOfTimesHit) == 0x000000, "Member 'IO_MissionDamageable_C_MissionDamageableTookNonZeroDamage_Multicast::NumberOfTimesHit' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.ExecuteUbergraph_IO_MissionDamageable
// 0x0138 (0x0138 - 0x0000)
struct IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UConditionalDamageModifier*       Temp_object_Variable;                              // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Damage;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_ComponentBoundEvent_DamageType;             // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_ComponentBoundEvent_DamageSource;           // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_ComponentBoundEvent_InstigatedBy;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser1;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_ComponentBoundEvent_Details;                // 0x0050(0x0058)(ContainsInstancedReference)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConditionalDamageModifier*             CallFunc_Array_Get_Item1;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver;         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_UserStateEvent_bFromLoad2;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad1;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad;                   // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NumberOfTimesHit;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable) == 0x000008, "Wrong alignment on IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable");
static_assert(sizeof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable) == 0x000138, "Wrong size on IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, EntryPoint) == 0x000000, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::EntryPoint' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, Temp_int_Array_Index_Variable) == 0x000004, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, Temp_int_Array_Index_Variable1) == 0x000010, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, Temp_object_Variable) == 0x000018, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_ComponentBoundEvent_DamageReceiver1) == 0x000020, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_ComponentBoundEvent_DamageReceiver1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_ComponentBoundEvent_Damage) == 0x000028, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_ComponentBoundEvent_Damage' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_ComponentBoundEvent_DamageType) == 0x000030, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_ComponentBoundEvent_DamageType' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_ComponentBoundEvent_DamageSource) == 0x000038, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_ComponentBoundEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_ComponentBoundEvent_InstigatedBy) == 0x000040, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_ComponentBoundEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_ComponentBoundEvent_DamageCauser1) == 0x000048, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_ComponentBoundEvent_DamageCauser1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_ComponentBoundEvent_Details) == 0x000050, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_ComponentBoundEvent_Details' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000A8, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x0000C0, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x0000D0, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_DynamicCast_bSuccess1) == 0x0000D8, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_IsValid_ReturnValue) == 0x0000D9, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Array_Length_ReturnValue1) == 0x0000DC, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E0, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Array_Get_Item1) == 0x0000E8, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Array_Length_ReturnValue2) == 0x0000F0, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Add_IntInt_ReturnValue1) == 0x0000F8, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000FC, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, Temp_int_Loop_Counter_Variable1) == 0x000100, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Less_IntInt_ReturnValue1) == 0x000104, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Add_IntInt_ReturnValue2) == 0x000108, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_ComponentBoundEvent_DamageReceiver) == 0x000110, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_ComponentBoundEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_ComponentBoundEvent_DamageCauser) == 0x000118, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_UserStateEvent_bFromLoad2) == 0x000120, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_UserStateEvent_bFromLoad2' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_UserStateEvent_bFromLoad1) == 0x000121, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_UserStateEvent_bFromLoad1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_UserStateEvent_bFromLoad) == 0x000122, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_UserStateEvent_bFromLoad' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_IsValidClass_ReturnValue) == 0x000123, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_IsValidClass_ReturnValue1) == 0x000124, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_IsValidClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Add_IntInt_ReturnValue3) == 0x000128, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_GetMaxHealth_ReturnValue) == 0x00012C, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, K2Node_CustomEvent_NumberOfTimesHit) == 0x000130, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::K2Node_CustomEvent_NumberOfTimesHit' has a wrong offset!");
static_assert(offsetof(IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable, CallFunc_Array_Contains_ReturnValue) == 0x000134, "Member 'IO_MissionDamageable_C_ExecuteUbergraph_IO_MissionDamageable::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function IO_MissionDamageable.IO_MissionDamageable_C.MissionDamageableTookDamage__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct IO_MissionDamageable_C_MissionDamageableTookDamage__DelegateSignature final
{
public:
	int32                                         NumberOfTimesHit;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IO_MissionDamageable_C_MissionDamageableTookDamage__DelegateSignature) == 0x000004, "Wrong alignment on IO_MissionDamageable_C_MissionDamageableTookDamage__DelegateSignature");
static_assert(sizeof(IO_MissionDamageable_C_MissionDamageableTookDamage__DelegateSignature) == 0x000004, "Wrong size on IO_MissionDamageable_C_MissionDamageableTookDamage__DelegateSignature");
static_assert(offsetof(IO_MissionDamageable_C_MissionDamageableTookDamage__DelegateSignature, NumberOfTimesHit) == 0x000000, "Member 'IO_MissionDamageable_C_MissionDamageableTookDamage__DelegateSignature::NumberOfTimesHit' has a wrong offset!");

}

