#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionScripted_CargoHoldVacuum

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "IO_MissionScripted_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_MissionScripted_CargoHoldVacuum.IO_MissionScripted_CargoHoldVacuum_C
// 0x0020 (0x06E0 - 0x06C0)
class AIO_MissionScripted_CargoHoldVacuum_C final : public AIO_MissionScripted_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IO_MissionScripted_CargoHoldVacuum_C; // 0x06C0(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          OnFire;                                            // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void Play_Feedback_ScriptedActionStarted();
	void Play_Feedback_ScriptedActionFinished();
	void BndEvt__MissionObserver_K2Node_ComponentBoundEvent_2_MissionObserverMissionsInitialized__DelegateSignature_IO_MissionScripted_CargoHoldVacuum();
	void BndEvt__MissionObserver_K2Node_ComponentBoundEvent_3_MissionObserverMissionObjectiveUpdate__DelegateSignature_IO_MissionScripted_CargoHoldVacuum(const struct FMissionObjectiveReference& Objective, EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void ExecuteUbergraph_IO_MissionScripted_CargoHoldVacuum(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_MissionScripted_CargoHoldVacuum_C">();
	}
	static class AIO_MissionScripted_CargoHoldVacuum_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_MissionScripted_CargoHoldVacuum_C>();
	}
};
static_assert(alignof(AIO_MissionScripted_CargoHoldVacuum_C) == 0x000008, "Wrong alignment on AIO_MissionScripted_CargoHoldVacuum_C");
static_assert(sizeof(AIO_MissionScripted_CargoHoldVacuum_C) == 0x0006E0, "Wrong size on AIO_MissionScripted_CargoHoldVacuum_C");
static_assert(offsetof(AIO_MissionScripted_CargoHoldVacuum_C, UberGraphFrame_IO_MissionScripted_CargoHoldVacuum_C) == 0x0006C0, "Member 'AIO_MissionScripted_CargoHoldVacuum_C::UberGraphFrame_IO_MissionScripted_CargoHoldVacuum_C' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_CargoHoldVacuum_C, ParticleSystem) == 0x0006C8, "Member 'AIO_MissionScripted_CargoHoldVacuum_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_CargoHoldVacuum_C, Cube) == 0x0006D0, "Member 'AIO_MissionScripted_CargoHoldVacuum_C::Cube' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_CargoHoldVacuum_C, OnFire) == 0x0006D8, "Member 'AIO_MissionScripted_CargoHoldVacuum_C::OnFire' has a wrong offset!");

}

