#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionScripted_SnowyRoom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "IO_MissionScripted_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_MissionScripted_SnowyRoom.IO_MissionScripted_SnowyRoom_C
// 0x0060 (0x0720 - 0x06C0)
class AIO_MissionScripted_SnowyRoom_C final : public AIO_MissionScripted_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IO_MissionScripted_SnowyRoom_C;     // 0x06C0(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_DryIce;                                         // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Snow;                                           // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BlendWeight_BlendWeight_4C7E2F954B72482F87D2EAB5FDECE976; // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BlendWeight__Direction_4C7E2F954B72482F87D2EAB5FDECE976; // 0x06EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED[0x3];                                      // 0x06ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BlendWeight;                                       // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     PostProcessVolume;                                 // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessTransitionTime;                         // 0x0700(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         HideShowActors;                                    // 0x0708(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	bool                                          Preview;                                           // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecalFadeDuration;                                 // 0x071C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void BlendWeight__FinishedFunc();
	void BlendWeight__UpdateFunc();
	void Play_Feedback_ScriptedActionStarted();
	void Play_Feedback_Default(bool FromLoad);
	void Play_Feedback_ScriptedActionFinished();
	void FadeOutPostProcess();
	void FadeInPostProcess();
	void ReceiveBeginPlay();
	void HideActors(const TArray<class AActor*>& HideShowActors_0, bool RightNow);
	void ShowActors(const TArray<class AActor*>& HideShowActors_0);
	void ExecuteUbergraph_IO_MissionScripted_SnowyRoom(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_MissionScripted_SnowyRoom_C">();
	}
	static class AIO_MissionScripted_SnowyRoom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_MissionScripted_SnowyRoom_C>();
	}
};
static_assert(alignof(AIO_MissionScripted_SnowyRoom_C) == 0x000008, "Wrong alignment on AIO_MissionScripted_SnowyRoom_C");
static_assert(sizeof(AIO_MissionScripted_SnowyRoom_C) == 0x000720, "Wrong size on AIO_MissionScripted_SnowyRoom_C");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, UberGraphFrame_IO_MissionScripted_SnowyRoom_C) == 0x0006C0, "Member 'AIO_MissionScripted_SnowyRoom_C::UberGraphFrame_IO_MissionScripted_SnowyRoom_C' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, PS_DryIce) == 0x0006C8, "Member 'AIO_MissionScripted_SnowyRoom_C::PS_DryIce' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, TextRender) == 0x0006D0, "Member 'AIO_MissionScripted_SnowyRoom_C::TextRender' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, Cube) == 0x0006D8, "Member 'AIO_MissionScripted_SnowyRoom_C::Cube' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, PS_Snow) == 0x0006E0, "Member 'AIO_MissionScripted_SnowyRoom_C::PS_Snow' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, BlendWeight_BlendWeight_4C7E2F954B72482F87D2EAB5FDECE976) == 0x0006E8, "Member 'AIO_MissionScripted_SnowyRoom_C::BlendWeight_BlendWeight_4C7E2F954B72482F87D2EAB5FDECE976' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, BlendWeight__Direction_4C7E2F954B72482F87D2EAB5FDECE976) == 0x0006EC, "Member 'AIO_MissionScripted_SnowyRoom_C::BlendWeight__Direction_4C7E2F954B72482F87D2EAB5FDECE976' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, BlendWeight) == 0x0006F0, "Member 'AIO_MissionScripted_SnowyRoom_C::BlendWeight' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, PostProcessVolume) == 0x0006F8, "Member 'AIO_MissionScripted_SnowyRoom_C::PostProcessVolume' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, PostProcessTransitionTime) == 0x000700, "Member 'AIO_MissionScripted_SnowyRoom_C::PostProcessTransitionTime' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, HideShowActors) == 0x000708, "Member 'AIO_MissionScripted_SnowyRoom_C::HideShowActors' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, Preview) == 0x000718, "Member 'AIO_MissionScripted_SnowyRoom_C::Preview' has a wrong offset!");
static_assert(offsetof(AIO_MissionScripted_SnowyRoom_C, DecalFadeDuration) == 0x00071C, "Member 'AIO_MissionScripted_SnowyRoom_C::DecalFadeDuration' has a wrong offset!");

}

