#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionScripted

#include "Basic.hpp"

#include "Enum_MissionScriptedState_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function IO_MissionScripted.IO_MissionScripted_C.CheckForMissionSequenceFailsafe
// 0x0003 (0x0003 - 0x0000)
struct IO_MissionScripted_C_CheckForMissionSequenceFailsafe final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_C_CheckForMissionSequenceFailsafe) == 0x000001, "Wrong alignment on IO_MissionScripted_C_CheckForMissionSequenceFailsafe");
static_assert(sizeof(IO_MissionScripted_C_CheckForMissionSequenceFailsafe) == 0x000003, "Wrong size on IO_MissionScripted_C_CheckForMissionSequenceFailsafe");
static_assert(offsetof(IO_MissionScripted_C_CheckForMissionSequenceFailsafe, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'IO_MissionScripted_C_CheckForMissionSequenceFailsafe::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_CheckForMissionSequenceFailsafe, CallFunc_IsValidClass_ReturnValue) == 0x000001, "Member 'IO_MissionScripted_C_CheckForMissionSequenceFailsafe::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_CheckForMissionSequenceFailsafe, CallFunc_IsValidClass_ReturnValue1) == 0x000002, "Member 'IO_MissionScripted_C_CheckForMissionSequenceFailsafe::CallFunc_IsValidClass_ReturnValue1' has a wrong offset!");

// Function IO_MissionScripted.IO_MissionScripted_C.SetMissionScriptedState
// 0x0002 (0x0002 - 0x0000)
struct IO_MissionScripted_C_SetMissionScriptedState final
{
public:
	Enum_MissionScriptedState                     State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_C_SetMissionScriptedState) == 0x000001, "Wrong alignment on IO_MissionScripted_C_SetMissionScriptedState");
static_assert(sizeof(IO_MissionScripted_C_SetMissionScriptedState) == 0x000002, "Wrong size on IO_MissionScripted_C_SetMissionScriptedState");
static_assert(offsetof(IO_MissionScripted_C_SetMissionScriptedState, State) == 0x000000, "Member 'IO_MissionScripted_C_SetMissionScriptedState::State' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_SetMissionScriptedState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'IO_MissionScripted_C_SetMissionScriptedState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function IO_MissionScripted.IO_MissionScripted_C.Play_Feedback_Default
// 0x0001 (0x0001 - 0x0000)
struct IO_MissionScripted_C_Play_Feedback_Default final
{
public:
	bool                                          FromLoad;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_C_Play_Feedback_Default) == 0x000001, "Wrong alignment on IO_MissionScripted_C_Play_Feedback_Default");
static_assert(sizeof(IO_MissionScripted_C_Play_Feedback_Default) == 0x000001, "Wrong size on IO_MissionScripted_C_Play_Feedback_Default");
static_assert(offsetof(IO_MissionScripted_C_Play_Feedback_Default, FromLoad) == 0x000000, "Member 'IO_MissionScripted_C_Play_Feedback_Default::FromLoad' has a wrong offset!");

// Function IO_MissionScripted.IO_MissionScripted_C.__UserState_MissionScriptedState_0
// 0x0001 (0x0001 - 0x0000)
struct IO_MissionScripted_C___UserState_MissionScriptedState_0 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_C___UserState_MissionScriptedState_0) == 0x000001, "Wrong alignment on IO_MissionScripted_C___UserState_MissionScriptedState_0");
static_assert(sizeof(IO_MissionScripted_C___UserState_MissionScriptedState_0) == 0x000001, "Wrong size on IO_MissionScripted_C___UserState_MissionScriptedState_0");
static_assert(offsetof(IO_MissionScripted_C___UserState_MissionScriptedState_0, bFromLoad) == 0x000000, "Member 'IO_MissionScripted_C___UserState_MissionScriptedState_0::bFromLoad' has a wrong offset!");

// Function IO_MissionScripted.IO_MissionScripted_C.__UserState_MissionScriptedState_1
// 0x0001 (0x0001 - 0x0000)
struct IO_MissionScripted_C___UserState_MissionScriptedState_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_C___UserState_MissionScriptedState_1) == 0x000001, "Wrong alignment on IO_MissionScripted_C___UserState_MissionScriptedState_1");
static_assert(sizeof(IO_MissionScripted_C___UserState_MissionScriptedState_1) == 0x000001, "Wrong size on IO_MissionScripted_C___UserState_MissionScriptedState_1");
static_assert(offsetof(IO_MissionScripted_C___UserState_MissionScriptedState_1, bFromLoad) == 0x000000, "Member 'IO_MissionScripted_C___UserState_MissionScriptedState_1::bFromLoad' has a wrong offset!");

// Function IO_MissionScripted.IO_MissionScripted_C.ExecuteUbergraph_IO_MissionScripted
// 0x0010 (0x0010 - 0x0000)
struct IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_FromLoad;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad1;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue; // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue1;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue2;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted) == 0x000004, "Wrong alignment on IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted");
static_assert(sizeof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted) == 0x000010, "Wrong size on IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, EntryPoint) == 0x000000, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::EntryPoint' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, CallFunc_HasAuthority_ReturnValue1) == 0x000005, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, K2Node_CustomEvent_FromLoad) == 0x000006, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::K2Node_CustomEvent_FromLoad' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, CallFunc_IsValidClass_ReturnValue) == 0x000007, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, K2Node_UserStateEvent_bFromLoad1) == 0x000008, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::K2Node_UserStateEvent_bFromLoad1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, K2Node_UserStateEvent_bFromLoad) == 0x000009, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::K2Node_UserStateEvent_bFromLoad' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, CallFunc_GetMissionObjectiveStatusRef_ReturnValue) == 0x00000A, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::CallFunc_GetMissionObjectiveStatusRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, K2Node_SwitchEnum_CmpSuccess) == 0x00000B, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, CallFunc_IsValidClass_ReturnValue1) == 0x00000C, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::CallFunc_IsValidClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted, CallFunc_IsValidClass_ReturnValue2) == 0x00000D, "Member 'IO_MissionScripted_C_ExecuteUbergraph_IO_MissionScripted::CallFunc_IsValidClass_ReturnValue2' has a wrong offset!");

}

