#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_MissionScripted_SanctuaryEngine

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function IO_MissionScripted_SanctuaryEngine.IO_MissionScripted_SanctuaryEngine_C.ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine
// 0x0100 (0x0100 - 0x0000)
struct IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0028(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x00B8(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x00D0(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue2;              // 0x00E8(0x0018)()
};
static_assert(alignof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine) == 0x000008, "Wrong alignment on IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine");
static_assert(sizeof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine) == 0x000100, "Wrong size on IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine");
static_assert(offsetof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine, EntryPoint) == 0x000000, "Member 'IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine::EntryPoint' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine, CallFunc_GetTimelineLength_ReturnValue) == 0x000014, "Member 'IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000028, "Member 'IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine, CallFunc_PostWwiseEvent_ReturnValue) == 0x0000B8, "Member 'IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine, CallFunc_PostWwiseEvent_ReturnValue1) == 0x0000D0, "Member 'IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine, CallFunc_PostWwiseEvent_ReturnValue2) == 0x0000E8, "Member 'IO_MissionScripted_SanctuaryEngine_C_ExecuteUbergraph_IO_MissionScripted_SanctuaryEngine::CallFunc_PostWwiseEvent_ReturnValue2' has a wrong offset!");

}

