#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_Operative_Barrier

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_Operative_Barrier.IO_Operative_Barrier_C
// 0x0108 (0x0AB0 - 0x09A8)
class AIO_Operative_Barrier_C final : public AOperativeBarrier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A8(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               BarrierFX_Held;                                    // 0x09B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AllRounderCollision;                               // 0x09B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AllRounderCollision_Held;                          // 0x09C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HeldCollision;                                     // 0x09C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UViewAttachmentComponent*               CarriedBase;                                       // 0x09D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       BarrierAuraCollision;                              // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   WwiseAudio;                                        // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BarrierFX;                                         // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakUsableComponent*                    OakUsable;                                         // 0x09F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              BarrierMesh;                                       // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakStatusEffectManagerComponent*       OakStatusEffectManager;                            // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxActionComponent*                    GbxAction;                                         // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTargetableComponent*                   Targetable;                                        // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BarrierScan;                                       // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ZzzapParticle;                                     // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakHitRegionComponent*                 OakHitRegion;                                      // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TurboTimeline_Param_042884694A85E04FE861F0998BD289C6; // 0x0A40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TurboTimeline__Direction_042884694A85E04FE861F0998BD289C6; // 0x0A44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A45[0x3];                                      // 0x0A45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TurboTimeline;                                     // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              BarrierMesh1stPerson;                              // 0x0A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BarrierDeployedFXTemplate;                         // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BarrierUndeployedFXTemplate;                       // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicsAsset*                          HeldPhysicsAsset;                                  // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicsAsset*                          GroundPhysicsAsset;                                // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BarrierHeldFXTemplate;                             // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BarrierUnheldFXTemplate;                           // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      GroundIdleAnimation;                               // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      HoldIdleAnimation;                                 // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      GroundUndeployAnimation;                           // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      HoldUndeployAnimation;                             // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDigistructingOut;                               // 0x0AA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_IO_Operative_Barrier(int32 EntryPoint);
	void DigistructOut();
	void ApplyDeterrenceFieldToEnemy(class AActor* Enemy);
	void OnStartState_ShuttingDown();
	void OnTurbochargedStateChanged(bool InbIsTurbocharged);
	void StartNextBarrierState();
	void UpdateFX();
	void SetupBarrierMods();
	void HandleBarrierStateChange(EOperativeBarrierState OldState, EOperativeBarrierState NewState);
	void ReceiveBeginPlay();
	void OnEndState_Deployed();
	void OnStartState_Deployed();
	void UpdateFX_OnDeployed();
	void OnEndState_Activating();
	void OnEndState_Carried();
	void OnStartState_Carried();
	void UpdateFX_OnCarried();
	void TurboTimeline__UpdateFunc();
	void TurboTimeline__FinishedFunc();
	void UserConstructionScript();
	void SetBarrierHoldScalar(bool Enable);
	void SetupDeterrenceField();
	void SetupChargedRelay();
	void SetupElectromagneticTherapy();
	void SetupModMaterial(class FName ParamName, float Val);
	void ConfigureTemplates();
	void TryActivateSystem(class UParticleSystemComponent* Component);
	void SetupStressTest();
	void GetDamageRTPCValue(float* Res);
	void SetupMultiModBarrierFX();
	void SetupPhysicsAssetOverride(class UPhysicsAsset* InAssetOverride);
	void IsShuttingDown(bool* Res);
	void AttachToPlayer();
	void DetachFromPlayer();
	void OnStateTransitionBegin();
	void OnStateTransitionEnd();
	void SetBarrierHidden(bool bIsHidden);

	void GetDeterrenceFieldDamageForCharacter(class AOakCharacter* Enemy, float* Val) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_Operative_Barrier_C">();
	}
	static class AIO_Operative_Barrier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_Operative_Barrier_C>();
	}
};
static_assert(alignof(AIO_Operative_Barrier_C) == 0x000008, "Wrong alignment on AIO_Operative_Barrier_C");
static_assert(sizeof(AIO_Operative_Barrier_C) == 0x000AB0, "Wrong size on AIO_Operative_Barrier_C");
static_assert(offsetof(AIO_Operative_Barrier_C, UberGraphFrame) == 0x0009A8, "Member 'AIO_Operative_Barrier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierFX_Held) == 0x0009B0, "Member 'AIO_Operative_Barrier_C::BarrierFX_Held' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, AllRounderCollision) == 0x0009B8, "Member 'AIO_Operative_Barrier_C::AllRounderCollision' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, AllRounderCollision_Held) == 0x0009C0, "Member 'AIO_Operative_Barrier_C::AllRounderCollision_Held' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, HeldCollision) == 0x0009C8, "Member 'AIO_Operative_Barrier_C::HeldCollision' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, CarriedBase) == 0x0009D0, "Member 'AIO_Operative_Barrier_C::CarriedBase' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierAuraCollision) == 0x0009D8, "Member 'AIO_Operative_Barrier_C::BarrierAuraCollision' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, WwiseAudio) == 0x0009E0, "Member 'AIO_Operative_Barrier_C::WwiseAudio' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierFX) == 0x0009E8, "Member 'AIO_Operative_Barrier_C::BarrierFX' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, OakUsable) == 0x0009F0, "Member 'AIO_Operative_Barrier_C::OakUsable' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierMesh) == 0x0009F8, "Member 'AIO_Operative_Barrier_C::BarrierMesh' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, Scene) == 0x000A00, "Member 'AIO_Operative_Barrier_C::Scene' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, OakStatusEffectManager) == 0x000A08, "Member 'AIO_Operative_Barrier_C::OakStatusEffectManager' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, GbxAction) == 0x000A10, "Member 'AIO_Operative_Barrier_C::GbxAction' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, Targetable) == 0x000A18, "Member 'AIO_Operative_Barrier_C::Targetable' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, AIPerceptionStimuliSource) == 0x000A20, "Member 'AIO_Operative_Barrier_C::AIPerceptionStimuliSource' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierScan) == 0x000A28, "Member 'AIO_Operative_Barrier_C::BarrierScan' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, ZzzapParticle) == 0x000A30, "Member 'AIO_Operative_Barrier_C::ZzzapParticle' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, OakHitRegion) == 0x000A38, "Member 'AIO_Operative_Barrier_C::OakHitRegion' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, TurboTimeline_Param_042884694A85E04FE861F0998BD289C6) == 0x000A40, "Member 'AIO_Operative_Barrier_C::TurboTimeline_Param_042884694A85E04FE861F0998BD289C6' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, TurboTimeline__Direction_042884694A85E04FE861F0998BD289C6) == 0x000A44, "Member 'AIO_Operative_Barrier_C::TurboTimeline__Direction_042884694A85E04FE861F0998BD289C6' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, TurboTimeline) == 0x000A48, "Member 'AIO_Operative_Barrier_C::TurboTimeline' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierMesh1stPerson) == 0x000A50, "Member 'AIO_Operative_Barrier_C::BarrierMesh1stPerson' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierDeployedFXTemplate) == 0x000A58, "Member 'AIO_Operative_Barrier_C::BarrierDeployedFXTemplate' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierUndeployedFXTemplate) == 0x000A60, "Member 'AIO_Operative_Barrier_C::BarrierUndeployedFXTemplate' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, HeldPhysicsAsset) == 0x000A68, "Member 'AIO_Operative_Barrier_C::HeldPhysicsAsset' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, GroundPhysicsAsset) == 0x000A70, "Member 'AIO_Operative_Barrier_C::GroundPhysicsAsset' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierHeldFXTemplate) == 0x000A78, "Member 'AIO_Operative_Barrier_C::BarrierHeldFXTemplate' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, BarrierUnheldFXTemplate) == 0x000A80, "Member 'AIO_Operative_Barrier_C::BarrierUnheldFXTemplate' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, GroundIdleAnimation) == 0x000A88, "Member 'AIO_Operative_Barrier_C::GroundIdleAnimation' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, HoldIdleAnimation) == 0x000A90, "Member 'AIO_Operative_Barrier_C::HoldIdleAnimation' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, GroundUndeployAnimation) == 0x000A98, "Member 'AIO_Operative_Barrier_C::GroundUndeployAnimation' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, HoldUndeployAnimation) == 0x000AA0, "Member 'AIO_Operative_Barrier_C::HoldUndeployAnimation' has a wrong offset!");
static_assert(offsetof(AIO_Operative_Barrier_C, bIsDigistructingOut) == 0x000AA8, "Member 'AIO_Operative_Barrier_C::bIsDigistructingOut' has a wrong offset!");

}

