#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_Sanctuary_TannisSaurian

#include "Basic.hpp"


namespace SDK::Params
{

// Function IO_Sanctuary_TannisSaurian.IO_Sanctuary_TannisSaurian_C.__UserState_UserStates_0
// 0x0001 (0x0001 - 0x0000)
struct IO_Sanctuary_TannisSaurian_C___UserState_UserStates_0 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_Sanctuary_TannisSaurian_C___UserState_UserStates_0) == 0x000001, "Wrong alignment on IO_Sanctuary_TannisSaurian_C___UserState_UserStates_0");
static_assert(sizeof(IO_Sanctuary_TannisSaurian_C___UserState_UserStates_0) == 0x000001, "Wrong size on IO_Sanctuary_TannisSaurian_C___UserState_UserStates_0");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C___UserState_UserStates_0, bFromLoad) == 0x000000, "Member 'IO_Sanctuary_TannisSaurian_C___UserState_UserStates_0::bFromLoad' has a wrong offset!");

// Function IO_Sanctuary_TannisSaurian.IO_Sanctuary_TannisSaurian_C.__UserState_UserStates_1
// 0x0001 (0x0001 - 0x0000)
struct IO_Sanctuary_TannisSaurian_C___UserState_UserStates_1 final
{
public:
	bool                                          bFromLoad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_Sanctuary_TannisSaurian_C___UserState_UserStates_1) == 0x000001, "Wrong alignment on IO_Sanctuary_TannisSaurian_C___UserState_UserStates_1");
static_assert(sizeof(IO_Sanctuary_TannisSaurian_C___UserState_UserStates_1) == 0x000001, "Wrong size on IO_Sanctuary_TannisSaurian_C___UserState_UserStates_1");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C___UserState_UserStates_1, bFromLoad) == 0x000000, "Member 'IO_Sanctuary_TannisSaurian_C___UserState_UserStates_1::bFromLoad' has a wrong offset!");

// Function IO_Sanctuary_TannisSaurian.IO_Sanctuary_TannisSaurian_C.ExecuteUbergraph_IO_Sanctuary_TannisSaurian
// 0x0050 (0x0050 - 0x0000)
struct IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_DynamicCast_AsDecal_Actor;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_UserStateEvent_bFromLoad1;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_UserStateEvent_bFromLoad;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkeletalMeshActor*                     K2Node_DynamicCast_AsSkeletal_Mesh_Actor;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkeletalMeshActor*                     K2Node_DynamicCast_AsSkeletal_Mesh_Actor1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian) == 0x000008, "Wrong alignment on IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian");
static_assert(sizeof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian) == 0x000050, "Wrong size on IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, EntryPoint) == 0x000000, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::EntryPoint' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, Temp_int_Array_Index_Variable) == 0x000008, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, CallFunc_Array_Get_Item) == 0x000010, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, K2Node_DynamicCast_AsDecal_Actor) == 0x000018, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::K2Node_DynamicCast_AsDecal_Actor' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, CallFunc_Less_IntInt_ReturnValue) == 0x000021, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, K2Node_UserStateEvent_bFromLoad1) == 0x000028, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::K2Node_UserStateEvent_bFromLoad1' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, K2Node_UserStateEvent_bFromLoad) == 0x000029, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::K2Node_UserStateEvent_bFromLoad' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, K2Node_DynamicCast_AsSkeletal_Mesh_Actor) == 0x000030, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::K2Node_DynamicCast_AsSkeletal_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, K2Node_DynamicCast_AsSkeletal_Mesh_Actor1) == 0x000040, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::K2Node_DynamicCast_AsSkeletal_Mesh_Actor1' has a wrong offset!");
static_assert(offsetof(IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'IO_Sanctuary_TannisSaurian_C_ExecuteUbergraph_IO_Sanctuary_TannisSaurian::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

}

