#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_Switch_IndustrialSwitch_V1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_IO_Switch_Parent_V1_classes.hpp"
#include "Enum_Switch_ReasonForMoving_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_Switch_IndustrialSwitch_V1.IO_Switch_IndustrialSwitch_V1_C
// 0x0070 (0x0798 - 0x0728)
class AIO_Switch_IndustrialSwitch_V1_C final : public ABP_IO_Switch_Parent_V1_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IO_Switch_IndustrialSwitch_V1_C;    // 0x0728(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Switch_Handle;                                  // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Base;                                              // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   DisabledLight;                                     // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Handle_Pitch_110633C8477A3B73EB276780C6314214; // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_HandleZ_110633C8477A3B73EB276780C6314214; // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_110633C8477A3B73EB276780C6314214; // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Handle_Pitch_AE25373447EBAAE46B85AB8D41F14DF5; // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_HandleZ_AE25373447EBAAE46B85AB8D41F14DF5; // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_AE25373447EBAAE46B85AB8D41F14DF5; // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Handle_Pitch_4B215AE847A4322214730181E4E5A6B7; // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_HandleZ_4B215AE847A4322214730181E4E5A6B7; // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_4B215AE847A4322214730181E4E5A6B7; // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndSwitchMovementDelay;                            // 0x0790(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void PlaySwitchMovement(Enum_Switch_ReasonForMoving Reason);
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void ExecuteUbergraph_IO_Switch_IndustrialSwitch_V1(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_Switch_IndustrialSwitch_V1_C">();
	}
	static class AIO_Switch_IndustrialSwitch_V1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_Switch_IndustrialSwitch_V1_C>();
	}
};
static_assert(alignof(AIO_Switch_IndustrialSwitch_V1_C) == 0x000008, "Wrong alignment on AIO_Switch_IndustrialSwitch_V1_C");
static_assert(sizeof(AIO_Switch_IndustrialSwitch_V1_C) == 0x000798, "Wrong size on AIO_Switch_IndustrialSwitch_V1_C");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, UberGraphFrame_IO_Switch_IndustrialSwitch_V1_C) == 0x000728, "Member 'AIO_Switch_IndustrialSwitch_V1_C::UberGraphFrame_IO_Switch_IndustrialSwitch_V1_C' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, SM_Switch_Handle) == 0x000730, "Member 'AIO_Switch_IndustrialSwitch_V1_C::SM_Switch_Handle' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Base) == 0x000738, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Base' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, DisabledLight) == 0x000740, "Member 'AIO_Switch_IndustrialSwitch_V1_C::DisabledLight' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_1_Handle_Pitch_110633C8477A3B73EB276780C6314214) == 0x000748, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_1_Handle_Pitch_110633C8477A3B73EB276780C6314214' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_1_HandleZ_110633C8477A3B73EB276780C6314214) == 0x00074C, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_1_HandleZ_110633C8477A3B73EB276780C6314214' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_1__Direction_110633C8477A3B73EB276780C6314214) == 0x000750, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_1__Direction_110633C8477A3B73EB276780C6314214' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_1) == 0x000758, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_0_Handle_Pitch_AE25373447EBAAE46B85AB8D41F14DF5) == 0x000760, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_0_Handle_Pitch_AE25373447EBAAE46B85AB8D41F14DF5' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_0_HandleZ_AE25373447EBAAE46B85AB8D41F14DF5) == 0x000764, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_0_HandleZ_AE25373447EBAAE46B85AB8D41F14DF5' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_0__Direction_AE25373447EBAAE46B85AB8D41F14DF5) == 0x000768, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_0__Direction_AE25373447EBAAE46B85AB8D41F14DF5' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_0) == 0x000770, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_2_Handle_Pitch_4B215AE847A4322214730181E4E5A6B7) == 0x000778, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_2_Handle_Pitch_4B215AE847A4322214730181E4E5A6B7' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_2_HandleZ_4B215AE847A4322214730181E4E5A6B7) == 0x00077C, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_2_HandleZ_4B215AE847A4322214730181E4E5A6B7' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_2__Direction_4B215AE847A4322214730181E4E5A6B7) == 0x000780, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_2__Direction_4B215AE847A4322214730181E4E5A6B7' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, Timeline_2) == 0x000788, "Member 'AIO_Switch_IndustrialSwitch_V1_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(AIO_Switch_IndustrialSwitch_V1_C, EndSwitchMovementDelay) == 0x000790, "Member 'AIO_Switch_IndustrialSwitch_V1_C::EndSwitchMovementDelay' has a wrong offset!");

}

