#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_Sanctuary_CreditsComputer

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Enum_CreditsComputer_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_Sanctuary_CreditsComputer.IO_Sanctuary_CreditsComputer_C
// 0x0048 (0x0650 - 0x0608)
class AIO_Sanctuary_CreditsComputer_C final : public AMission_InteractiveObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUsableComponent*                       Usable;                                            // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FXOn;                                              // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneBodySwitchComponent*              UsabilityFXSwitch;                                 // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerMesh;                                      // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	Enum_CreditsComputer                          NewVar_0;                                          // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxCondition*                          Cond_NewVar_0_NewEnumerator1;                      // 0x0648(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void __UserState_NewVar_0_1(bool bFromLoad);
	void __UserState_NewVar_0_0(bool bFromLoad);
	void BndEvt__Usable_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_IO_Sanctuary_CreditsComputer(class AController* UserController, class UPrimitiveComponent* UsedComponent);
	void ExecuteUbergraph_IO_Sanctuary_CreditsComputer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_Sanctuary_CreditsComputer_C">();
	}
	static class AIO_Sanctuary_CreditsComputer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_Sanctuary_CreditsComputer_C>();
	}
};
static_assert(alignof(AIO_Sanctuary_CreditsComputer_C) == 0x000008, "Wrong alignment on AIO_Sanctuary_CreditsComputer_C");
static_assert(sizeof(AIO_Sanctuary_CreditsComputer_C) == 0x000650, "Wrong size on AIO_Sanctuary_CreditsComputer_C");
static_assert(offsetof(AIO_Sanctuary_CreditsComputer_C, UberGraphFrame) == 0x000608, "Member 'AIO_Sanctuary_CreditsComputer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AIO_Sanctuary_CreditsComputer_C, TextRender) == 0x000610, "Member 'AIO_Sanctuary_CreditsComputer_C::TextRender' has a wrong offset!");
static_assert(offsetof(AIO_Sanctuary_CreditsComputer_C, Usable) == 0x000618, "Member 'AIO_Sanctuary_CreditsComputer_C::Usable' has a wrong offset!");
static_assert(offsetof(AIO_Sanctuary_CreditsComputer_C, FXOn) == 0x000620, "Member 'AIO_Sanctuary_CreditsComputer_C::FXOn' has a wrong offset!");
static_assert(offsetof(AIO_Sanctuary_CreditsComputer_C, UsabilityFXSwitch) == 0x000628, "Member 'AIO_Sanctuary_CreditsComputer_C::UsabilityFXSwitch' has a wrong offset!");
static_assert(offsetof(AIO_Sanctuary_CreditsComputer_C, ComputerMesh) == 0x000630, "Member 'AIO_Sanctuary_CreditsComputer_C::ComputerMesh' has a wrong offset!");
static_assert(offsetof(AIO_Sanctuary_CreditsComputer_C, DefaultSceneRoot) == 0x000638, "Member 'AIO_Sanctuary_CreditsComputer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AIO_Sanctuary_CreditsComputer_C, NewVar_0) == 0x000640, "Member 'AIO_Sanctuary_CreditsComputer_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AIO_Sanctuary_CreditsComputer_C, Cond_NewVar_0_NewEnumerator1) == 0x000648, "Member 'AIO_Sanctuary_CreditsComputer_C::Cond_NewVar_0_NewEnumerator1' has a wrong offset!");

}

