#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IO_TargetDummy

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Enum_TargetDummy_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass IO_TargetDummy.IO_TargetDummy_C
// 0x0078 (0x05C8 - 0x0550)
class AIO_TargetDummy_C final : public AInteractiveObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(Transient, DuplicateTransient)
	class UOakHitRegionComponent*                 OakHitRegion;                                      // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CritBox;                                           // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene1;                                            // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakDamageComponent*                    OakDamage;                                         // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTargetableComponent*                   Targetable;                                        // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MoveDummy_Percent_881AEAF9454450D97DD7E197ED968116; // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveDummy__Direction_881AEAF9454450D97DD7E197ED968116; // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveDummy;                                         // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_TargetDummy                              DummyState;                                        // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AIO_Switch_ShootingRange_C*             BUTTON;                                            // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxCondition*                          Cond_DummyState_NewEnumerator1;                    // 0x05C0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IO_TargetDummy(int32 EntryPoint);
	void __UserState_DummyState_0(bool bFromLoad);
	void __UserState_DummyState_1(bool bFromLoad);
	void DummyOff(class AActor* SwitchUser);
	void DummyOn(class AActor* SwitchUser);
	void MoveDummy__FinishedFunc();
	void MoveDummy__UpdateFunc();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IO_TargetDummy_C">();
	}
	static class AIO_TargetDummy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIO_TargetDummy_C>();
	}
};
static_assert(alignof(AIO_TargetDummy_C) == 0x000008, "Wrong alignment on AIO_TargetDummy_C");
static_assert(sizeof(AIO_TargetDummy_C) == 0x0005C8, "Wrong size on AIO_TargetDummy_C");
static_assert(offsetof(AIO_TargetDummy_C, UberGraphFrame) == 0x000550, "Member 'AIO_TargetDummy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, OakHitRegion) == 0x000558, "Member 'AIO_TargetDummy_C::OakHitRegion' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, CritBox) == 0x000560, "Member 'AIO_TargetDummy_C::CritBox' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, StaticMesh2) == 0x000568, "Member 'AIO_TargetDummy_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, Scene1) == 0x000570, "Member 'AIO_TargetDummy_C::Scene1' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, StaticMesh1) == 0x000578, "Member 'AIO_TargetDummy_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, StaticMesh) == 0x000580, "Member 'AIO_TargetDummy_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, Scene) == 0x000588, "Member 'AIO_TargetDummy_C::Scene' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, OakDamage) == 0x000590, "Member 'AIO_TargetDummy_C::OakDamage' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, Targetable) == 0x000598, "Member 'AIO_TargetDummy_C::Targetable' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, MoveDummy_Percent_881AEAF9454450D97DD7E197ED968116) == 0x0005A0, "Member 'AIO_TargetDummy_C::MoveDummy_Percent_881AEAF9454450D97DD7E197ED968116' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, MoveDummy__Direction_881AEAF9454450D97DD7E197ED968116) == 0x0005A4, "Member 'AIO_TargetDummy_C::MoveDummy__Direction_881AEAF9454450D97DD7E197ED968116' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, MoveDummy) == 0x0005A8, "Member 'AIO_TargetDummy_C::MoveDummy' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, DummyState) == 0x0005B0, "Member 'AIO_TargetDummy_C::DummyState' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, BUTTON) == 0x0005B8, "Member 'AIO_TargetDummy_C::BUTTON' has a wrong offset!");
static_assert(offsetof(AIO_TargetDummy_C, Cond_DummyState_NewEnumerator1) == 0x0005C0, "Member 'AIO_TargetDummy_C::Cond_DummyState_NewEnumerator1' has a wrong offset!");

}

