#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelTravelStationBillboard

#include "Basic.hpp"


namespace SDK::Params
{

// Function LevelTravelStationBillboard.LevelTravelStationBillboard_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LevelTravelStationBillboard_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelTravelStationBillboard_C_ReceiveTick) == 0x000004, "Wrong alignment on LevelTravelStationBillboard_C_ReceiveTick");
static_assert(sizeof(LevelTravelStationBillboard_C_ReceiveTick) == 0x000004, "Wrong size on LevelTravelStationBillboard_C_ReceiveTick");
static_assert(offsetof(LevelTravelStationBillboard_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LevelTravelStationBillboard_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function LevelTravelStationBillboard.LevelTravelStationBillboard_C.ExecuteUbergraph_LevelTravelStationBillboard
// 0x0008 (0x0008 - 0x0000)
struct LevelTravelStationBillboard_C_ExecuteUbergraph_LevelTravelStationBillboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelTravelStationBillboard_C_ExecuteUbergraph_LevelTravelStationBillboard) == 0x000004, "Wrong alignment on LevelTravelStationBillboard_C_ExecuteUbergraph_LevelTravelStationBillboard");
static_assert(sizeof(LevelTravelStationBillboard_C_ExecuteUbergraph_LevelTravelStationBillboard) == 0x000008, "Wrong size on LevelTravelStationBillboard_C_ExecuteUbergraph_LevelTravelStationBillboard");
static_assert(offsetof(LevelTravelStationBillboard_C_ExecuteUbergraph_LevelTravelStationBillboard, EntryPoint) == 0x000000, "Member 'LevelTravelStationBillboard_C_ExecuteUbergraph_LevelTravelStationBillboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(LevelTravelStationBillboard_C_ExecuteUbergraph_LevelTravelStationBillboard, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'LevelTravelStationBillboard_C_ExecuteUbergraph_LevelTravelStationBillboard::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

