#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelTravelStationObject

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Enum_LevelTravelStationObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LevelTravelStationObject.LevelTravelStationObject_C
// 0x0100 (0x06D0 - 0x05D0)
class ALevelTravelStationObject_C final : public ATravelStationObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(Transient, DuplicateTransient)
	class UUsableComponent*                       Usable_Unavailable;                                // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem_Leave;                              // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem_Approach;                           // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USocketComponent*                       StandinSocket;                                     // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InteractPromptFX;                                  // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakMinimapIconComponent*               OakMinimapIcon;                                    // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionAndTraceBox;                              // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ArrowMesh;                                         // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TransitionArrowAdjustments;                        // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOutOfMapWaypointComponent*             OutOfMapWaypoint1;                                 // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationVehicleSpawnPointComponent* TravelStationVehicleSpawnPoint1;                   // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationVehicleSpawnPointComponent* TravelStationVehicleSpawnPoint3;                   // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationVehicleSpawnPointComponent* TravelStationVehicleSpawnPoint2;                   // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationVehicleSpawnPointComponent* TravelStationVehicleSpawnPoint;                    // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxAreaComponent*                      GbxArea;                                           // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULevelTravelStationBillboard_C*         LevelTravelStationBillboard;                       // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUsableComponent*                       Usable;                                            // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULevelTravelStationComponent*           LevelTravelStation;                                // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakTravelStationResurrectComponent_C*  OakTravelStationResurrectComponent;                // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationSpawnPointComponent*      TravelStationSpawnPoint4;                          // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationSpawnPointComponent*      TravelStationSpawnPoint3;                          // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationSpawnPointComponent*      TravelStationSpawnPoint2;                          // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationSpawnPointComponent*      TravelStationSpawnPoint1;                          // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          InteractFX;                                        // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         NearbyCharacters;                                  // 0x06B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	Enum_LevelTravelStationObject                 LevelTravel;                                       // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxCondition*                          Cond_LevelTravel_NewEnumerator2;                   // 0x06C8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void IsInAnOverlappingVehicle(class AOakCharacter_Player* PlayerChar, bool* PlayerIsInOverlappingVehicle);
	void SetLevelNameTextRender(class UTravelStationData*& TravelData);
	void UserConstructionScript();
	void BndEvt__Usable_K2Node_ComponentBoundEvent_4_UsableUsedOnChannelSignature__DelegateSignature_LevelTravelStationObject(class AController* UserController, class UPrimitiveComponent* UsedComponent);
	void BndEvt__Box_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature_LevelTravelStationObject(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__InteractPromptFX_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature_LevelTravelStationObject(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__LevelTravelStation_K2Node_ComponentBoundEvent_0_LevelTravelOnDestinationForTextRenderChanged__DelegateSignature_LevelTravelStationObject(class ULevelTravelStationData* Destination);
	void ReceiveBeginPlay();
	void __UserState_LevelTravel_0(bool bFromLoad);
	void __UserState_LevelTravel_1(bool bFromLoad);
	void SetLevelTravelVisibilityState(Enum_LevelTravelStationObject VisiblilityState);
	void ExecuteUbergraph_LevelTravelStationObject(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LevelTravelStationObject_C">();
	}
	static class ALevelTravelStationObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelTravelStationObject_C>();
	}
};
static_assert(alignof(ALevelTravelStationObject_C) == 0x000008, "Wrong alignment on ALevelTravelStationObject_C");
static_assert(sizeof(ALevelTravelStationObject_C) == 0x0006D0, "Wrong size on ALevelTravelStationObject_C");
static_assert(offsetof(ALevelTravelStationObject_C, UberGraphFrame) == 0x0005D0, "Member 'ALevelTravelStationObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, Usable_Unavailable) == 0x0005D8, "Member 'ALevelTravelStationObject_C::Usable_Unavailable' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, Camera) == 0x0005E0, "Member 'ALevelTravelStationObject_C::Camera' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, ParticleSystem_Leave) == 0x0005E8, "Member 'ALevelTravelStationObject_C::ParticleSystem_Leave' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, ParticleSystem_Approach) == 0x0005F0, "Member 'ALevelTravelStationObject_C::ParticleSystem_Approach' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, StandinSocket) == 0x0005F8, "Member 'ALevelTravelStationObject_C::StandinSocket' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, InteractPromptFX) == 0x000600, "Member 'ALevelTravelStationObject_C::InteractPromptFX' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TextRender) == 0x000608, "Member 'ALevelTravelStationObject_C::TextRender' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, OakMinimapIcon) == 0x000610, "Member 'ALevelTravelStationObject_C::OakMinimapIcon' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, CollisionAndTraceBox) == 0x000618, "Member 'ALevelTravelStationObject_C::CollisionAndTraceBox' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, ArrowMesh) == 0x000620, "Member 'ALevelTravelStationObject_C::ArrowMesh' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TransitionArrowAdjustments) == 0x000628, "Member 'ALevelTravelStationObject_C::TransitionArrowAdjustments' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, OutOfMapWaypoint1) == 0x000630, "Member 'ALevelTravelStationObject_C::OutOfMapWaypoint1' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TravelStationVehicleSpawnPoint1) == 0x000638, "Member 'ALevelTravelStationObject_C::TravelStationVehicleSpawnPoint1' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TravelStationVehicleSpawnPoint3) == 0x000640, "Member 'ALevelTravelStationObject_C::TravelStationVehicleSpawnPoint3' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TravelStationVehicleSpawnPoint2) == 0x000648, "Member 'ALevelTravelStationObject_C::TravelStationVehicleSpawnPoint2' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TravelStationVehicleSpawnPoint) == 0x000650, "Member 'ALevelTravelStationObject_C::TravelStationVehicleSpawnPoint' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, GbxArea) == 0x000658, "Member 'ALevelTravelStationObject_C::GbxArea' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, LevelTravelStationBillboard) == 0x000660, "Member 'ALevelTravelStationObject_C::LevelTravelStationBillboard' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, Usable) == 0x000668, "Member 'ALevelTravelStationObject_C::Usable' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, LevelTravelStation) == 0x000670, "Member 'ALevelTravelStationObject_C::LevelTravelStation' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, OakTravelStationResurrectComponent) == 0x000678, "Member 'ALevelTravelStationObject_C::OakTravelStationResurrectComponent' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TravelStationSpawnPoint4) == 0x000680, "Member 'ALevelTravelStationObject_C::TravelStationSpawnPoint4' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TravelStationSpawnPoint3) == 0x000688, "Member 'ALevelTravelStationObject_C::TravelStationSpawnPoint3' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TravelStationSpawnPoint2) == 0x000690, "Member 'ALevelTravelStationObject_C::TravelStationSpawnPoint2' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, TravelStationSpawnPoint1) == 0x000698, "Member 'ALevelTravelStationObject_C::TravelStationSpawnPoint1' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, SkeletalMesh) == 0x0006A0, "Member 'ALevelTravelStationObject_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, InteractFX) == 0x0006A8, "Member 'ALevelTravelStationObject_C::InteractFX' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, NearbyCharacters) == 0x0006B0, "Member 'ALevelTravelStationObject_C::NearbyCharacters' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, LevelTravel) == 0x0006C0, "Member 'ALevelTravelStationObject_C::LevelTravel' has a wrong offset!");
static_assert(offsetof(ALevelTravelStationObject_C, Cond_LevelTravel_NewEnumerator2) == 0x0006C8, "Member 'ALevelTravelStationObject_C::Cond_LevelTravel_NewEnumerator2' has a wrong offset!");

}

