#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_CalledShot_DurationReturn

#include "Basic.hpp"


namespace SDK::Params
{

// Function LightProjectile_CalledShot_DurationReturn.LightProjectile_CalledShot_DurationReturn_C.EnableProjectileHoming
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_CalledShot_DurationReturn_C_EnableProjectileHoming final
{
public:
	class UOakLightProjectile*                    LightProjectile;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_CalledShot_DurationReturn_C_EnableProjectileHoming) == 0x000008, "Wrong alignment on LightProjectile_CalledShot_DurationReturn_C_EnableProjectileHoming");
static_assert(sizeof(LightProjectile_CalledShot_DurationReturn_C_EnableProjectileHoming) == 0x000008, "Wrong size on LightProjectile_CalledShot_DurationReturn_C_EnableProjectileHoming");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_EnableProjectileHoming, LightProjectile) == 0x000000, "Member 'LightProjectile_CalledShot_DurationReturn_C_EnableProjectileHoming::LightProjectile' has a wrong offset!");

// Function LightProjectile_CalledShot_DurationReturn.LightProjectile_CalledShot_DurationReturn_C.TryEnableProjectileHoming
// 0x0010 (0x0010 - 0x0000)
struct LightProjectile_CalledShot_DurationReturn_C_TryEnableProjectileHoming final
{
public:
	class UOakLightProjectile*                    Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LightProjectile_CalledShot_DurationReturn_C_TryEnableProjectileHoming) == 0x000008, "Wrong alignment on LightProjectile_CalledShot_DurationReturn_C_TryEnableProjectileHoming");
static_assert(sizeof(LightProjectile_CalledShot_DurationReturn_C_TryEnableProjectileHoming) == 0x000010, "Wrong size on LightProjectile_CalledShot_DurationReturn_C_TryEnableProjectileHoming");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_TryEnableProjectileHoming, Projectile) == 0x000000, "Member 'LightProjectile_CalledShot_DurationReturn_C_TryEnableProjectileHoming::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_TryEnableProjectileHoming, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000008, "Member 'LightProjectile_CalledShot_DurationReturn_C_TryEnableProjectileHoming::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

// Function LightProjectile_CalledShot_DurationReturn.LightProjectile_CalledShot_DurationReturn_C.OnExplode
// 0x0060 (0x0060 - 0x0000)
struct LightProjectile_CalledShot_DurationReturn_C_OnExplode final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility*                      CallFunc_FindActionAbility_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActionSkill_Operative_Drone_C*         K2Node_DynamicCast_AsAction_Skill_Operative_Drone; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADrone_Operative_SNTRY_C*               K2Node_DynamicCast_AsDrone_Operative_SNTRY;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue1; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_CalledShot_DurationReturn_C_OnExplode) == 0x000008, "Wrong alignment on LightProjectile_CalledShot_DurationReturn_C_OnExplode");
static_assert(sizeof(LightProjectile_CalledShot_DurationReturn_C_OnExplode) == 0x000060, "Wrong size on LightProjectile_CalledShot_DurationReturn_C_OnExplode");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, Projectile) == 0x000000, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000010, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, CallFunc_FindActionAbility_ReturnValue) == 0x000028, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::CallFunc_FindActionAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, K2Node_DynamicCast_AsAction_Skill_Operative_Drone) == 0x000038, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::K2Node_DynamicCast_AsAction_Skill_Operative_Drone' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, K2Node_DynamicCast_AsDrone_Operative_SNTRY) == 0x000048, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::K2Node_DynamicCast_AsDrone_Operative_SNTRY' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, K2Node_DynamicCast_bSuccess1) == 0x000050, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, CallFunc_GetDataTableValueFromHandle_ReturnValue1) == 0x000054, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::CallFunc_GetDataTableValueFromHandle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LightProjectile_CalledShot_DurationReturn_C_OnExplode, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'LightProjectile_CalledShot_DurationReturn_C_OnExplode::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

