#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_Gargoyle_Trashball

#include "Basic.hpp"


namespace SDK::Params
{

// Function LightProjectile_Gargoyle_Trashball.LightProjectile_Gargoyle_Trashball_C.OnLifetimeExpired
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_Gargoyle_Trashball_C_OnLifetimeExpired final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_Gargoyle_Trashball_C_OnLifetimeExpired) == 0x000008, "Wrong alignment on LightProjectile_Gargoyle_Trashball_C_OnLifetimeExpired");
static_assert(sizeof(LightProjectile_Gargoyle_Trashball_C_OnLifetimeExpired) == 0x000008, "Wrong size on LightProjectile_Gargoyle_Trashball_C_OnLifetimeExpired");
static_assert(offsetof(LightProjectile_Gargoyle_Trashball_C_OnLifetimeExpired, Projectile) == 0x000000, "Member 'LightProjectile_Gargoyle_Trashball_C_OnLifetimeExpired::Projectile' has a wrong offset!");

// Function LightProjectile_Gargoyle_Trashball.LightProjectile_Gargoyle_Trashball_C.OnExplode
// 0x0018 (0x0018 - 0x0000)
struct LightProjectile_Gargoyle_Trashball_C_OnExplode final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_StaticGetParticleEffect_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_Gargoyle_Trashball_C_OnExplode) == 0x000008, "Wrong alignment on LightProjectile_Gargoyle_Trashball_C_OnExplode");
static_assert(sizeof(LightProjectile_Gargoyle_Trashball_C_OnExplode) == 0x000018, "Wrong size on LightProjectile_Gargoyle_Trashball_C_OnExplode");
static_assert(offsetof(LightProjectile_Gargoyle_Trashball_C_OnExplode, Projectile) == 0x000000, "Member 'LightProjectile_Gargoyle_Trashball_C_OnExplode::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_Gargoyle_Trashball_C_OnExplode, CallFunc_StaticGetParticleEffect_ReturnValue) == 0x000008, "Member 'LightProjectile_Gargoyle_Trashball_C_OnExplode::CallFunc_StaticGetParticleEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_Gargoyle_Trashball_C_OnExplode, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000010, "Member 'LightProjectile_Gargoyle_Trashball_C_OnExplode::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

