#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_TOR_SG_CriticalThug

#include "Basic.hpp"

#include "GbxWeapon_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LightProjectile_TOR_SG_CriticalThug.LightProjectile_TOR_SG_CriticalThug_C.OnLifetimeExpired
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_TOR_SG_CriticalThug_C_OnLifetimeExpired final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_TOR_SG_CriticalThug_C_OnLifetimeExpired) == 0x000008, "Wrong alignment on LightProjectile_TOR_SG_CriticalThug_C_OnLifetimeExpired");
static_assert(sizeof(LightProjectile_TOR_SG_CriticalThug_C_OnLifetimeExpired) == 0x000008, "Wrong size on LightProjectile_TOR_SG_CriticalThug_C_OnLifetimeExpired");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnLifetimeExpired, Projectile) == 0x000000, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnLifetimeExpired::Projectile' has a wrong offset!");

// Function LightProjectile_TOR_SG_CriticalThug.LightProjectile_TOR_SG_CriticalThug_C.OnDamage
// 0x02B0 (0x02B0 - 0x0000)
struct LightProjectile_TOR_SG_CriticalThug_C_OnDamage final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bCritical;                                         // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_RunEnvQueryForAllActors_ResultActors;     // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_RunEnvQueryForAllActors_ReturnValue;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponShotModifierType                       CallFunc_GetModifierType_ReturnValue;              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x014C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x0170(0x0140)(ContainsInstancedReference)
};
static_assert(alignof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage) == 0x000008, "Wrong alignment on LightProjectile_TOR_SG_CriticalThug_C_OnDamage");
static_assert(sizeof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage) == 0x0002B0, "Wrong size on LightProjectile_TOR_SG_CriticalThug_C_OnDamage");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, Projectile) == 0x000000, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, Hit) == 0x000008, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::Hit' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, bCritical) == 0x000098, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::bCritical' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_bBlockingHit) == 0x000099, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_bInitialOverlap) == 0x00009A, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_Time) == 0x00009C, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_Distance) == 0x0000A0, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_Location) == 0x0000A4, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_ImpactPoint) == 0x0000B0, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_Normal) == 0x0000BC, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_ImpactNormal) == 0x0000C8, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_PhysMat) == 0x0000D8, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_HitActor) == 0x0000E0, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_HitComponent) == 0x0000E8, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_HitBoneName) == 0x0000F0, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_HitItem) == 0x0000F8, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_FaceIndex) == 0x0000FC, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_TraceStart) == 0x000100, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_BreakHitResult_TraceEnd) == 0x00010C, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, Temp_int_Array_Index_Variable) == 0x000118, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, Temp_int_Loop_Counter_Variable) == 0x00011C, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_Add_IntInt_ReturnValue) == 0x000120, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_RunEnvQueryForAllActors_ResultActors) == 0x000128, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_RunEnvQueryForAllActors_ResultActors' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_RunEnvQueryForAllActors_ReturnValue) == 0x000138, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_RunEnvQueryForAllActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_GetModifierType_ReturnValue) == 0x000139, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_GetModifierType_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_Array_Get_Item) == 0x000140, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00014C, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_Less_IntInt_ReturnValue) == 0x000158, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_GetInstigator_ReturnValue) == 0x000160, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000168, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00016C, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnDamage, K2Node_MakeStruct_LightProjectileInitializationData) == 0x000170, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnDamage::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");

// Function LightProjectile_TOR_SG_CriticalThug.LightProjectile_TOR_SG_CriticalThug_C.OnImpact
// 0x0128 (0x0128 - 0x0000)
struct LightProjectile_TOR_SG_CriticalThug_C_OnImpact final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact) == 0x000008, "Wrong alignment on LightProjectile_TOR_SG_CriticalThug_C_OnImpact");
static_assert(sizeof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact) == 0x000128, "Wrong size on LightProjectile_TOR_SG_CriticalThug_C_OnImpact");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, Projectile) == 0x000000, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, Hit) == 0x000008, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::Hit' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_bBlockingHit) == 0x000098, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_bInitialOverlap) == 0x000099, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_Time) == 0x00009C, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_Distance) == 0x0000A0, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_Location) == 0x0000A4, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_ImpactPoint) == 0x0000B0, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_Normal) == 0x0000BC, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_ImpactNormal) == 0x0000C8, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_PhysMat) == 0x0000D8, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_HitActor) == 0x0000E0, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_HitComponent) == 0x0000E8, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_HitBoneName) == 0x0000F0, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_HitItem) == 0x0000F8, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_FaceIndex) == 0x0000FC, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_TraceStart) == 0x000100, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, CallFunc_BreakHitResult_TraceEnd) == 0x00010C, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, K2Node_DynamicCast_AsOak_Character) == 0x000118, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::K2Node_DynamicCast_AsOak_Character' has a wrong offset!");
static_assert(offsetof(LightProjectile_TOR_SG_CriticalThug_C_OnImpact, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'LightProjectile_TOR_SG_CriticalThug_C_OnImpact::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

