#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_MAL_SG_Recursion

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "GbxWeapon_structs.hpp"
#include "OakGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LightProjectile_MAL_SG_Recursion.LightProjectile_MAL_SG_Recursion_C
// 0x00D0 (0x0410 - 0x0340)
class ULightProjectile_MAL_SG_Recursion_C final : public UOakLightProjectileData
{
public:
	struct FEnvQueryParams                        Query;                                             // 0x0340(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	uint8                                         NumRecursions;                                     // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 LightProjData;                                     // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StopHoming(class ULightProjectile* Projectile);

	void OnDamage(class ULightProjectile* Projectile, const struct FHitResult& Hit, bool bCritical) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LightProjectile_MAL_SG_Recursion_C">();
	}
	static class ULightProjectile_MAL_SG_Recursion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULightProjectile_MAL_SG_Recursion_C>();
	}
};
static_assert(alignof(ULightProjectile_MAL_SG_Recursion_C) == 0x000010, "Wrong alignment on ULightProjectile_MAL_SG_Recursion_C");
static_assert(sizeof(ULightProjectile_MAL_SG_Recursion_C) == 0x000410, "Wrong size on ULightProjectile_MAL_SG_Recursion_C");
static_assert(offsetof(ULightProjectile_MAL_SG_Recursion_C, Query) == 0x000340, "Member 'ULightProjectile_MAL_SG_Recursion_C::Query' has a wrong offset!");
static_assert(offsetof(ULightProjectile_MAL_SG_Recursion_C, NumRecursions) == 0x0003F8, "Member 'ULightProjectile_MAL_SG_Recursion_C::NumRecursions' has a wrong offset!");
static_assert(offsetof(ULightProjectile_MAL_SG_Recursion_C, LightProjData) == 0x000400, "Member 'ULightProjectile_MAL_SG_Recursion_C::LightProjData' has a wrong offset!");

}

