#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_MAL_SMG_TiggsBoom

#include "Basic.hpp"

#include "GbxWeapon_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LightProjectile_MAL_SMG_TiggsBoom.LightProjectile_MAL_SMG_TiggsBoom_C.OnImpact
// 0x0340 (0x0340 - 0x0000)
struct LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         StarfallChance;                                    // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_EvaluateConditionType_ReturnValue;     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnFan_ReturnValue;          // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetDamageCauser_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValue_OutValue1;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue1;           // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0xF];                                      // 0x0151(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0190(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x019C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x01F8(0x0140)(ContainsInstancedReference)
};
static_assert(alignof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact) == 0x000010, "Wrong alignment on LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact");
static_assert(sizeof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact) == 0x000340, "Wrong size on LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, Projectile) == 0x000000, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, Hit) == 0x000008, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::Hit' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, StarfallChance) == 0x000098, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::StarfallChance' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_bBlockingHit) == 0x00009C, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_bInitialOverlap) == 0x00009D, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_Time) == 0x0000A0, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_Distance) == 0x0000A4, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_Location) == 0x0000A8, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_ImpactPoint) == 0x0000B4, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_Normal) == 0x0000C0, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_ImpactNormal) == 0x0000CC, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_PhysMat) == 0x0000D8, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_HitActor) == 0x0000E0, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_HitComponent) == 0x0000E8, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_HitBoneName) == 0x0000F0, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_HitItem) == 0x0000F8, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_FaceIndex) == 0x0000FC, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_TraceStart) == 0x000100, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakHitResult_TraceEnd) == 0x00010C, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_K2_EvaluateConditionType_ReturnValue) == 0x000118, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_K2_EvaluateConditionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000119, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_GeneratePointsOnFan_ReturnValue) == 0x000120, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_GeneratePointsOnFan_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_GetDataTableValue_OutValue) == 0x000130, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_GetDataTableValue_ReturnValue) == 0x000134, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_GetDamageCauser_ReturnValue) == 0x000138, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_GetDamageCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_GetInstigator_ReturnValue) == 0x000140, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_RandomInteger_ReturnValue) == 0x000148, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_GetDataTableValue_OutValue1) == 0x00014C, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_GetDataTableValue_OutValue1' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_GetDataTableValue_ReturnValue1) == 0x000150, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_GetDataTableValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_Array_Get_Item) == 0x000160, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakTransform_Location) == 0x000190, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakTransform_Rotation) == 0x00019C, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakTransform_Scale) == 0x0001A8, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001B4, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_GetForwardVector_ReturnValue) == 0x0001B8, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C4, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_Add_VectorVector_ReturnValue) == 0x0001D0, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakVector_X) == 0x0001DC, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakVector_Y) == 0x0001E0, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_BreakVector_Z) == 0x0001E4, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001E8, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, CallFunc_MakeVector_ReturnValue) == 0x0001EC, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact, K2Node_MakeStruct_LightProjectileInitializationData) == 0x0001F8, "Member 'LightProjectile_MAL_SMG_TiggsBoom_C_OnImpact::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");

}

