#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_HW_COV_SplatBall_AI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LightProjectile_HW_COV_SplatBall_AI.LightProjectile_HW_COV_SplatBall_AI_C.OnLifetimeExpired
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_HW_COV_SplatBall_AI_C_OnLifetimeExpired final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_HW_COV_SplatBall_AI_C_OnLifetimeExpired) == 0x000008, "Wrong alignment on LightProjectile_HW_COV_SplatBall_AI_C_OnLifetimeExpired");
static_assert(sizeof(LightProjectile_HW_COV_SplatBall_AI_C_OnLifetimeExpired) == 0x000008, "Wrong size on LightProjectile_HW_COV_SplatBall_AI_C_OnLifetimeExpired");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnLifetimeExpired, Projectile) == 0x000000, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnLifetimeExpired::Projectile' has a wrong offset!");

// Function LightProjectile_HW_COV_SplatBall_AI.LightProjectile_HW_COV_SplatBall_AI_C.OnExplode
// 0x02A0 (0x02A0 - 0x0000)
struct LightProjectile_HW_COV_SplatBall_AI_C_OnExplode final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplatData*                             SplatData;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSource_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue1;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue2;       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue3;       // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue4;       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0060(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode) == 0x000010, "Wrong alignment on LightProjectile_HW_COV_SplatBall_AI_C_OnExplode");
static_assert(sizeof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode) == 0x0002A0, "Wrong size on LightProjectile_HW_COV_SplatBall_AI_C_OnExplode");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, Projectile) == 0x000000, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, SplatData) == 0x000008, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::SplatData' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, CallFunc_GetSource_ReturnValue) == 0x000010, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::CallFunc_GetSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000018, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, CallFunc_EqualEqual_ClassClass_ReturnValue1) == 0x000019, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::CallFunc_EqualEqual_ClassClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, CallFunc_EqualEqual_ClassClass_ReturnValue2) == 0x00001A, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::CallFunc_EqualEqual_ClassClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, CallFunc_EqualEqual_ClassClass_ReturnValue3) == 0x00001B, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::CallFunc_EqualEqual_ClassClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, CallFunc_EqualEqual_ClassClass_ReturnValue4) == 0x00001C, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::CallFunc_EqualEqual_ClassClass_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, CallFunc_GetInstigator_ReturnValue) == 0x000020, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000030, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000060, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(LightProjectile_HW_COV_SplatBall_AI_C_OnExplode, CallFunc_SpawnActorAsync_ReturnValue) == 0x000290, "Member 'LightProjectile_HW_COV_SplatBall_AI_C_OnExplode::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");

}

