#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_Gargoyle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LightProjectile_Gargoyle.LightProjectile_Gargoyle_C.OnRicochet
// 0x0148 (0x0148 - 0x0000)
struct LightProjectile_Gargoyle_C_OnRicochet final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x0098(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x00A8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_Gargoyle_C_OnRicochet) == 0x000008, "Wrong alignment on LightProjectile_Gargoyle_C_OnRicochet");
static_assert(sizeof(LightProjectile_Gargoyle_C_OnRicochet) == 0x000148, "Wrong size on LightProjectile_Gargoyle_C_OnRicochet");
static_assert(offsetof(LightProjectile_Gargoyle_C_OnRicochet, Projectile) == 0x000000, "Member 'LightProjectile_Gargoyle_C_OnRicochet::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_Gargoyle_C_OnRicochet, Hit) == 0x000008, "Member 'LightProjectile_Gargoyle_C_OnRicochet::Hit' has a wrong offset!");
static_assert(offsetof(LightProjectile_Gargoyle_C_OnRicochet, ImpactVelocity) == 0x000098, "Member 'LightProjectile_Gargoyle_C_OnRicochet::ImpactVelocity' has a wrong offset!");
static_assert(offsetof(LightProjectile_Gargoyle_C_OnRicochet, Temp_struct_Variable) == 0x0000A8, "Member 'LightProjectile_Gargoyle_C_OnRicochet::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(LightProjectile_Gargoyle_C_OnRicochet, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000138, "Member 'LightProjectile_Gargoyle_C_OnRicochet::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_Gargoyle_C_OnRicochet, CallFunc_GetInstigator_ReturnValue) == 0x000140, "Member 'LightProjectile_Gargoyle_C_OnRicochet::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");

}

