#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_HW_TOR_Swarmer

#include "Basic.hpp"


namespace SDK::Params
{

// Function LightProjectile_HW_TOR_Swarmer.LightProjectile_HW_TOR_Swarmer_C.StopHoming
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_HW_TOR_Swarmer_C_StopHoming final
{
public:
	class UOakLightProjectile*                    Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_HW_TOR_Swarmer_C_StopHoming) == 0x000008, "Wrong alignment on LightProjectile_HW_TOR_Swarmer_C_StopHoming");
static_assert(sizeof(LightProjectile_HW_TOR_Swarmer_C_StopHoming) == 0x000008, "Wrong size on LightProjectile_HW_TOR_Swarmer_C_StopHoming");
static_assert(offsetof(LightProjectile_HW_TOR_Swarmer_C_StopHoming, Projectile) == 0x000000, "Member 'LightProjectile_HW_TOR_Swarmer_C_StopHoming::Projectile' has a wrong offset!");

// Function LightProjectile_HW_TOR_Swarmer.LightProjectile_HW_TOR_Swarmer_C.OnLifetimeExpired
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_HW_TOR_Swarmer_C_OnLifetimeExpired final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_HW_TOR_Swarmer_C_OnLifetimeExpired) == 0x000008, "Wrong alignment on LightProjectile_HW_TOR_Swarmer_C_OnLifetimeExpired");
static_assert(sizeof(LightProjectile_HW_TOR_Swarmer_C_OnLifetimeExpired) == 0x000008, "Wrong size on LightProjectile_HW_TOR_Swarmer_C_OnLifetimeExpired");
static_assert(offsetof(LightProjectile_HW_TOR_Swarmer_C_OnLifetimeExpired, Projectile) == 0x000000, "Member 'LightProjectile_HW_TOR_Swarmer_C_OnLifetimeExpired::Projectile' has a wrong offset!");

}

