#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_ImaginaryNumber

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LightProjectile_ImaginaryNumber.LightProjectile_ImaginaryNumber_C.SpawnOffshoots
// 0x0010 (0x0010 - 0x0000)
struct LightProjectile_ImaginaryNumber_C_SpawnOffshoots final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots) == 0x000008, "Wrong alignment on LightProjectile_ImaginaryNumber_C_SpawnOffshoots");
static_assert(sizeof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots) == 0x000010, "Wrong size on LightProjectile_ImaginaryNumber_C_SpawnOffshoots");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots, Projectile) == 0x000000, "Member 'LightProjectile_ImaginaryNumber_C_SpawnOffshoots::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000008, "Member 'LightProjectile_ImaginaryNumber_C_SpawnOffshoots::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00000C, "Member 'LightProjectile_ImaginaryNumber_C_SpawnOffshoots::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

// Function LightProjectile_ImaginaryNumber.LightProjectile_ImaginaryNumber_C.SpawnOffshoots2
// 0x0010 (0x0010 - 0x0000)
struct LightProjectile_ImaginaryNumber_C_SpawnOffshoots2 final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots2) == 0x000008, "Wrong alignment on LightProjectile_ImaginaryNumber_C_SpawnOffshoots2");
static_assert(sizeof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots2) == 0x000010, "Wrong size on LightProjectile_ImaginaryNumber_C_SpawnOffshoots2");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots2, Projectile) == 0x000000, "Member 'LightProjectile_ImaginaryNumber_C_SpawnOffshoots2::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots2, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000008, "Member 'LightProjectile_ImaginaryNumber_C_SpawnOffshoots2::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_SpawnOffshoots2, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00000C, "Member 'LightProjectile_ImaginaryNumber_C_SpawnOffshoots2::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

// Function LightProjectile_ImaginaryNumber.LightProjectile_ImaginaryNumber_C.OnDamage
// 0x0350 (0x0350 - 0x0000)
struct LightProjectile_ImaginaryNumber_C_OnDamage final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bCritical;                                         // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EndLoc;                                            // 0x009C(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         NextFiringID;                                      // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0124(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetDamageCauser_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakLightProjectileInitializationData  K2Node_MakeStruct_OakLightProjectileInitializationData; // 0x0160(0x0158)(ContainsInstancedReference)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnCone_ReturnValue;         // 0x02C0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x02D0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0304(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0310(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x031C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x032C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0338(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0344(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LightProjectile_ImaginaryNumber_C_OnDamage) == 0x000010, "Wrong alignment on LightProjectile_ImaginaryNumber_C_OnDamage");
static_assert(sizeof(LightProjectile_ImaginaryNumber_C_OnDamage) == 0x000350, "Wrong size on LightProjectile_ImaginaryNumber_C_OnDamage");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, Projectile) == 0x000000, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, Hit) == 0x000008, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::Hit' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, bCritical) == 0x000098, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::bCritical' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, EndLoc) == 0x00009C, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::EndLoc' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, NextFiringID) == 0x0000A8, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::NextFiringID' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, Temp_int_Variable) == 0x0000AC, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B0, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B1, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_Time) == 0x0000B4, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_Distance) == 0x0000B8, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_Location) == 0x0000BC, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_ImpactPoint) == 0x0000C8, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_Normal) == 0x0000D4, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_ImpactNormal) == 0x0000E0, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_PhysMat) == 0x0000F0, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_HitActor) == 0x0000F8, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_HitComponent) == 0x000100, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_HitBoneName) == 0x000108, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_HitItem) == 0x000110, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_FaceIndex) == 0x000114, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_TraceStart) == 0x000118, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakHitResult_TraceEnd) == 0x000124, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, Temp_int_Variable1) == 0x000130, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, Temp_int_Array_Index_Variable) == 0x000134, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, Temp_int_Loop_Counter_Variable) == 0x000138, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_Add_IntInt_ReturnValue) == 0x00013C, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, Temp_bool_Variable) == 0x000140, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, K2Node_Select_Default) == 0x000144, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_GetDamageCauser_ReturnValue) == 0x000148, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_GetDamageCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_GetInstigator_ReturnValue) == 0x000150, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000158, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, K2Node_MakeStruct_OakLightProjectileInitializationData) == 0x000160, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::K2Node_MakeStruct_OakLightProjectileInitializationData' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0002B8, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_GeneratePointsOnCone_ReturnValue) == 0x0002C0, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_GeneratePointsOnCone_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_Array_Get_Item) == 0x0002D0, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_Array_Length_ReturnValue) == 0x000300, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakTransform_Location) == 0x000304, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakTransform_Rotation) == 0x000310, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_BreakTransform_Scale) == 0x00031C, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_Less_IntInt_ReturnValue) == 0x000328, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_GetForwardVector_ReturnValue) == 0x00032C, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000338, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_ImaginaryNumber_C_OnDamage, CallFunc_Add_VectorVector_ReturnValue) == 0x000344, "Member 'LightProjectile_ImaginaryNumber_C_OnDamage::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

}

