#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProj_Railgun_Mod2

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "GbxWeapon_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LightProj_Railgun_Mod2.LightProj_Railgun_Mod2_C.OnDamage
// 0x0300 (0x0300 - 0x0000)
struct LightProj_Railgun_Mod2_C_OnDamage final
{
public:
	class ULightProjectile*                       Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bCritical;                                         // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NewEQSTarget;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x00A8(0x0018)(NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0128(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0134(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetComponentByClass_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment;             // 0x0150(0x0028)(NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetComponentByClass_ReturnValue1;         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_RunEnvQueryForBestActor_ResultActor;      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunEnvQueryForBestActor_ReturnValue;      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment1;            // 0x01A0(0x0028)(NoDestructor, ContainsInstancedReference)
	struct FOakLightBeamInitializationData        K2Node_MakeStruct_OakLightBeamInitializationData;  // 0x01C8(0x0138)(ContainsInstancedReference)
};
static_assert(alignof(LightProj_Railgun_Mod2_C_OnDamage) == 0x000008, "Wrong alignment on LightProj_Railgun_Mod2_C_OnDamage");
static_assert(sizeof(LightProj_Railgun_Mod2_C_OnDamage) == 0x000300, "Wrong size on LightProj_Railgun_Mod2_C_OnDamage");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, Projectile) == 0x000000, "Member 'LightProj_Railgun_Mod2_C_OnDamage::Projectile' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, Hit) == 0x000008, "Member 'LightProj_Railgun_Mod2_C_OnDamage::Hit' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, bCritical) == 0x000098, "Member 'LightProj_Railgun_Mod2_C_OnDamage::bCritical' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, NewEQSTarget) == 0x0000A0, "Member 'LightProj_Railgun_Mod2_C_OnDamage::NewEQSTarget' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, K2Node_MakeStruct_DataTableValueHandle) == 0x0000A8, "Member 'LightProj_Railgun_Mod2_C_OnDamage::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_bBlockingHit) == 0x0000C0, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000C1, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_Time) == 0x0000C4, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_Distance) == 0x0000C8, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_Location) == 0x0000CC, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_ImpactPoint) == 0x0000D8, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_Normal) == 0x0000E4, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_ImpactNormal) == 0x0000F0, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_PhysMat) == 0x000100, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_HitActor) == 0x000108, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_HitComponent) == 0x000110, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_HitBoneName) == 0x000118, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_HitItem) == 0x000120, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_FaceIndex) == 0x000124, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_TraceStart) == 0x000128, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_BreakHitResult_TraceEnd) == 0x000134, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000140, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_GetComponentByClass_ReturnValue) == 0x000148, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, K2Node_MakeStruct_LightBeamAttachment) == 0x000150, "Member 'LightProj_Railgun_Mod2_C_OnDamage::K2Node_MakeStruct_LightBeamAttachment' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_GetInstigator_ReturnValue) == 0x000178, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000180, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_GetComponentByClass_ReturnValue1) == 0x000188, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_RunEnvQueryForBestActor_ResultActor) == 0x000190, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_RunEnvQueryForBestActor_ResultActor' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, CallFunc_RunEnvQueryForBestActor_ReturnValue) == 0x000198, "Member 'LightProj_Railgun_Mod2_C_OnDamage::CallFunc_RunEnvQueryForBestActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, K2Node_MakeStruct_LightBeamAttachment1) == 0x0001A0, "Member 'LightProj_Railgun_Mod2_C_OnDamage::K2Node_MakeStruct_LightBeamAttachment1' has a wrong offset!");
static_assert(offsetof(LightProj_Railgun_Mod2_C_OnDamage, K2Node_MakeStruct_OakLightBeamInitializationData) == 0x0001C8, "Member 'LightProj_Railgun_Mod2_C_OnDamage::K2Node_MakeStruct_OakLightBeamInitializationData' has a wrong offset!");

}

