#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightProjectile_Carrier_Child

#include "Basic.hpp"


namespace SDK::Params
{

// Function LightProjectile_Carrier_Child.LightProjectile_Carrier_Child_C.HomeIn
// 0x0028 (0x0028 - 0x0000)
struct LightProjectile_Carrier_Child_C_HomeIn final
{
public:
	class UOakLightProjectile*                    Projectile;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakLightProjectile*                    MyProjectile;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSource_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetTarget_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LightProjectile_Carrier_Child_C_HomeIn) == 0x000008, "Wrong alignment on LightProjectile_Carrier_Child_C_HomeIn");
static_assert(sizeof(LightProjectile_Carrier_Child_C_HomeIn) == 0x000028, "Wrong size on LightProjectile_Carrier_Child_C_HomeIn");
static_assert(offsetof(LightProjectile_Carrier_Child_C_HomeIn, Projectile) == 0x000000, "Member 'LightProjectile_Carrier_Child_C_HomeIn::Projectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_Carrier_Child_C_HomeIn, MyProjectile) == 0x000008, "Member 'LightProjectile_Carrier_Child_C_HomeIn::MyProjectile' has a wrong offset!");
static_assert(offsetof(LightProjectile_Carrier_Child_C_HomeIn, CallFunc_GetSource_ReturnValue) == 0x000010, "Member 'LightProjectile_Carrier_Child_C_HomeIn::CallFunc_GetSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_Carrier_Child_C_HomeIn, CallFunc_GetTarget_ReturnValue) == 0x000018, "Member 'LightProjectile_Carrier_Child_C_HomeIn::CallFunc_GetTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(LightProjectile_Carrier_Child_C_HomeIn, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'LightProjectile_Carrier_Child_C_HomeIn::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

