#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionGraph_GearUp

#include "Basic.hpp"


namespace SDK::Params
{

// Function MissionGraph_GearUp.MissionGraph_GearUp_C.[Shlooting Spree: Introduction]
// 0x0010 (0x0010 - 0x0000)
struct MissionGraph_GearUp_C__Shlooting_Spree__Introduction_ final
{
public:
	class UObject*                                Unlocks;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Next_Mission;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionGraph_GearUp_C__Shlooting_Spree__Introduction_) == 0x000008, "Wrong alignment on MissionGraph_GearUp_C__Shlooting_Spree__Introduction_");
static_assert(sizeof(MissionGraph_GearUp_C__Shlooting_Spree__Introduction_) == 0x000010, "Wrong size on MissionGraph_GearUp_C__Shlooting_Spree__Introduction_");
static_assert(offsetof(MissionGraph_GearUp_C__Shlooting_Spree__Introduction_, Unlocks) == 0x000000, "Member 'MissionGraph_GearUp_C__Shlooting_Spree__Introduction_::Unlocks' has a wrong offset!");
static_assert(offsetof(MissionGraph_GearUp_C__Shlooting_Spree__Introduction_, Next_Mission) == 0x000008, "Member 'MissionGraph_GearUp_C__Shlooting_Spree__Introduction_::Next_Mission' has a wrong offset!");

// Function MissionGraph_GearUp.MissionGraph_GearUp_C.[Shlooting Spree]
// 0x0010 (0x0010 - 0x0000)
struct MissionGraph_GearUp_C__Shlooting_Spree_ final
{
public:
	class UObject*                                Unlocks;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Next_Mission;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionGraph_GearUp_C__Shlooting_Spree_) == 0x000008, "Wrong alignment on MissionGraph_GearUp_C__Shlooting_Spree_");
static_assert(sizeof(MissionGraph_GearUp_C__Shlooting_Spree_) == 0x000010, "Wrong size on MissionGraph_GearUp_C__Shlooting_Spree_");
static_assert(offsetof(MissionGraph_GearUp_C__Shlooting_Spree_, Unlocks) == 0x000000, "Member 'MissionGraph_GearUp_C__Shlooting_Spree_::Unlocks' has a wrong offset!");
static_assert(offsetof(MissionGraph_GearUp_C__Shlooting_Spree_, Next_Mission) == 0x000008, "Member 'MissionGraph_GearUp_C__Shlooting_Spree_::Next_Mission' has a wrong offset!");

// Function MissionGraph_GearUp.MissionGraph_GearUp_C.ExecuteUbergraph_MissionGraph_GearUp
// 0x0028 (0x0028 - 0x0000)
struct MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionRefEvent_Unlocks;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionRefEvent_Next_Mission;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionRefEvent_Unlocks1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionRefEvent_Next_Mission1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp) == 0x000008, "Wrong alignment on MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp");
static_assert(sizeof(MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp) == 0x000028, "Wrong size on MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp");
static_assert(offsetof(MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp, EntryPoint) == 0x000000, "Member 'MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp, MissionK2Node_MissionRefEvent_Unlocks) == 0x000008, "Member 'MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp::MissionK2Node_MissionRefEvent_Unlocks' has a wrong offset!");
static_assert(offsetof(MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp, MissionK2Node_MissionRefEvent_Next_Mission) == 0x000010, "Member 'MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp::MissionK2Node_MissionRefEvent_Next_Mission' has a wrong offset!");
static_assert(offsetof(MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp, MissionK2Node_MissionRefEvent_Unlocks1) == 0x000018, "Member 'MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp::MissionK2Node_MissionRefEvent_Unlocks1' has a wrong offset!");
static_assert(offsetof(MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp, MissionK2Node_MissionRefEvent_Next_Mission1) == 0x000020, "Member 'MissionGraph_GearUp_C_ExecuteUbergraph_MissionGraph_GearUp::MissionK2Node_MissionRefEvent_Next_Mission1' has a wrong offset!");

}

