#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_BridgeInTheDark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_BridgeInTheDark.Mission_BridgeInTheDark_C
// 0x0180 (0x0690 - 0x0510)
class UMission_BridgeInTheDark_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_BridgeInTheDark_C;          // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   SET_FindBeeping_ObjSetVar;                         // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FindBeeping_ObjVar;                            // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_HitPoop_ObjSetVar;                             // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_HitPoop_ObjVar;                                // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_DeactivateAlarm_ObjSetVar;                     // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_DeactivateAlarm_ObjVar;                        // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GotoCamp_ObjSetVar;                            // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GotoCamp_ObjVar;                               // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_AlignRunes_ObjSetVar;                          // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      AlignLeftRune_ObjVar;                              // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_FollowTunnel_ObjSetVar;                        // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FollowTunnel_ObjVar;                           // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_LocateBot03_ObjSetVar;                         // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_LocateBot03_ObjVar;                            // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_DefeatDemonTink_ObjSetVar;                     // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_DefeatDemonTink_ObjVar;                        // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_InvestigateBotReading_ObjSetVar;               // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_InvestigateBotReading_ObjVar;                  // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      AlignCenterRune_ObjVar;                            // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      AlignRightRune_ObjVar;                             // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ReturnToBot01_ObjSetVar;                       // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ReturnToBot01_ObjVar;                          // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_FindPullEntranceSwitch_ObjSetVar;              // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FindPullEntranceSwitch_ObjVar;                 // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_PickUpBotHead_ObjSetVar;                       // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_PickUpBotHead_ObjVar;                          // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ReattachHead_ObjSetVar;                        // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ReattachHead_ObjVar;                           // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FollowBot1_ObjVar;                             // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_FindBeeping_Bot02_ObjSetVar;                   // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FindBeeping_Bot02_ObjVar;                      // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_RetrieveBot03Arm_ObjSetVar;                    // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_RetrieveBot03Arm_ObjVar;                       // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_FindAncestorBot_ObjSetVar;                     // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FindAncestorBot_ObjVar;                        // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_RetrieveBot04Head_ObjSetVar;                   // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_RetrieveBot04Head_ObjVar;                      // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_InvestigateDisturbance_ObjSetVar;              // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_InvestigateDisturbance_ObjVar;                 // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_SkullWellSequence_ObjVar;                      // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_FollowBot1_ObjSetVar;                          // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_OpenInnerDoor1_ObjVar;                         // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_OpenEridianDoor_ObjVar;                        // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ListenFirstSignal_ObjVar;                      // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_SpawnVarkids_ObjVar;                           // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ListenLostAlkonostLog_ObjVar;                  // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CompleteLoad_ReattachHead;                         // 0x0688(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Mission_BridgeInTheDark(int32 EntryPoint);
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_11();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_10();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_9();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_8();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_7();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_6();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_5();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_4();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_3();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_2();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_1();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY_0();
	void _OBJ_ListenLostAlkonostLog_Objective__PROXY();
	void OBJ_ListenLostAlkonostLog(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_SpawnVarkids(class UObject* Context);
	void OBJ_SpawnVarkids(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_ListenFirstSignal(class UObject* Context);
	void OBJ_ListenFirstSignal(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_OpenEridianDoor(class UObject* Context);
	void OBJ_OpenEridianDoor(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_OpenInnerDoor1(class UObject* Context);
	void OBJ_OpenInnerDoor1(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_FollowBot1(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MissionKickoff();
	void MCE_SkullWellSequence(class UObject* Context);
	void OBJ_SkullWellSequence(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_DefeatDemonTink(class UObject* Context);
	void MCE_InvestigateDisturbance(class UObject* Context);
	void OBJ_InvestigateDisturbance(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_InvestigateDisturbance(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_RetrieveBot04Head(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_RetrieveBot04Head(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_FindAncestorBot(class UObject* Context);
	void OBJ_FindAncestorBot(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_FindAncestorBot(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_RetrieveBot03Arm(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_RetrieveBot03Arm(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_FindBeeping_Bot02(class UObject* Context);
	void OBJ_FindBeeping_Bot02(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_FindBeeping_Bot02(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_FollowBot1(class UObject* Context);
	void OBJ_FollowBot1(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_ReattachHead(class UObject* Context);
	void OBJ_ReattachHead(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_ReattachHead(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_PickUpBotHead(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_PickUpBotHead(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_FindPullEntranceSwitch(class UObject* Context);
	void SET_FindPullEntranceSwitch(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_FindPullEntranceSwitch(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_ReturnToBot01(class UObject* Context);
	void OBJ_ReturnToBot01(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_ReturnToBot01(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_RightRuneAligned(class UObject* Context);
	void MCE_CenterRuneAligned(class UObject* Context);
	void AlignRightRune(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void AlignCenterRune(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_InvestigateBotReading(class UObject* Context);
	void OBJ_InvestigateBotReading(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_InvestigateBotReading(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_DefeatDemonTink(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_DefeatDemonTink(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_LocateBot03(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_LocateBot03(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_FollowTunnel(class UObject* Context);
	void OBJ_FollowTunnel(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_FollowTunnel(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_LeftRuneAligned(class UObject* Context);
	void AlignLeftRune(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_AlignRunes(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_GotoCamp(class UObject* Context);
	void OBJ_GotoCamp(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_GotoCamp(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_DeactivateAlarm(class UObject* Context);
	void MCE_HitPoop(class UObject* Context);
	void OBJ_DeactivateAlarm(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_DeactivateAlarm(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_HitPoop(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_HitPoop(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_FindBeeping(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_FindBeeping(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_FindBeeping(class UObject* Context);
	void OnDialogSequenceFinished_24();
	void OnDialogSequenceFinished_25();
	void OnDialogSequenceFinished_26();
	void OnDialogSequenceFinished_27();
	void OnDialogSequenceFinished_28();
	void OnDialogSequenceFinished_29();
	void OnDialogSequenceFinished_30();
	void OnDialogSequenceFinished_31();
	void OnDialogSequenceFinished_32();
	void OnDialogSequenceFinished_33();
	void OnDialogSequenceFinished_34();
	void OnDialogSequenceFinished_35();
	void OnDialogSequenceFinished_36();
	void OnDialogSequenceFinished_37();
	void OnDialogSequenceFinished_38();
	void OnDialogSequenceFinished_39();
	void OnDialogSequenceFinished_40();
	void OnDialogSequenceFinished_41();
	void OnDialogSequenceFinished_42();
	void OnDialogSequenceFinished_43();
	void OnDialogSequenceFinished_44();
	void OnDialogSequenceFinished_45();
	void OnDialogSequenceFinished_46();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_BridgeInTheDark_C">();
	}
	static class UMission_BridgeInTheDark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_BridgeInTheDark_C>();
	}
};
static_assert(alignof(UMission_BridgeInTheDark_C) == 0x000008, "Wrong alignment on UMission_BridgeInTheDark_C");
static_assert(sizeof(UMission_BridgeInTheDark_C) == 0x000690, "Wrong size on UMission_BridgeInTheDark_C");
static_assert(offsetof(UMission_BridgeInTheDark_C, UberGraphFrame_Mission_BridgeInTheDark_C) == 0x000510, "Member 'UMission_BridgeInTheDark_C::UberGraphFrame_Mission_BridgeInTheDark_C' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_FindBeeping_ObjSetVar) == 0x000518, "Member 'UMission_BridgeInTheDark_C::SET_FindBeeping_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_FindBeeping_ObjVar) == 0x000520, "Member 'UMission_BridgeInTheDark_C::OBJ_FindBeeping_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_HitPoop_ObjSetVar) == 0x000528, "Member 'UMission_BridgeInTheDark_C::SET_HitPoop_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_HitPoop_ObjVar) == 0x000530, "Member 'UMission_BridgeInTheDark_C::OBJ_HitPoop_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_DeactivateAlarm_ObjSetVar) == 0x000538, "Member 'UMission_BridgeInTheDark_C::SET_DeactivateAlarm_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_DeactivateAlarm_ObjVar) == 0x000540, "Member 'UMission_BridgeInTheDark_C::OBJ_DeactivateAlarm_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_GotoCamp_ObjSetVar) == 0x000548, "Member 'UMission_BridgeInTheDark_C::SET_GotoCamp_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_GotoCamp_ObjVar) == 0x000550, "Member 'UMission_BridgeInTheDark_C::OBJ_GotoCamp_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_AlignRunes_ObjSetVar) == 0x000558, "Member 'UMission_BridgeInTheDark_C::SET_AlignRunes_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, AlignLeftRune_ObjVar) == 0x000560, "Member 'UMission_BridgeInTheDark_C::AlignLeftRune_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_FollowTunnel_ObjSetVar) == 0x000568, "Member 'UMission_BridgeInTheDark_C::SET_FollowTunnel_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_FollowTunnel_ObjVar) == 0x000570, "Member 'UMission_BridgeInTheDark_C::OBJ_FollowTunnel_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_LocateBot03_ObjSetVar) == 0x000578, "Member 'UMission_BridgeInTheDark_C::SET_LocateBot03_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_LocateBot03_ObjVar) == 0x000580, "Member 'UMission_BridgeInTheDark_C::OBJ_LocateBot03_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_DefeatDemonTink_ObjSetVar) == 0x000588, "Member 'UMission_BridgeInTheDark_C::SET_DefeatDemonTink_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_DefeatDemonTink_ObjVar) == 0x000590, "Member 'UMission_BridgeInTheDark_C::OBJ_DefeatDemonTink_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_InvestigateBotReading_ObjSetVar) == 0x000598, "Member 'UMission_BridgeInTheDark_C::SET_InvestigateBotReading_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_InvestigateBotReading_ObjVar) == 0x0005A0, "Member 'UMission_BridgeInTheDark_C::OBJ_InvestigateBotReading_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, AlignCenterRune_ObjVar) == 0x0005A8, "Member 'UMission_BridgeInTheDark_C::AlignCenterRune_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, AlignRightRune_ObjVar) == 0x0005B0, "Member 'UMission_BridgeInTheDark_C::AlignRightRune_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_ReturnToBot01_ObjSetVar) == 0x0005B8, "Member 'UMission_BridgeInTheDark_C::SET_ReturnToBot01_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_ReturnToBot01_ObjVar) == 0x0005C0, "Member 'UMission_BridgeInTheDark_C::OBJ_ReturnToBot01_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_FindPullEntranceSwitch_ObjSetVar) == 0x0005C8, "Member 'UMission_BridgeInTheDark_C::SET_FindPullEntranceSwitch_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_FindPullEntranceSwitch_ObjVar) == 0x0005D0, "Member 'UMission_BridgeInTheDark_C::OBJ_FindPullEntranceSwitch_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_PickUpBotHead_ObjSetVar) == 0x0005D8, "Member 'UMission_BridgeInTheDark_C::SET_PickUpBotHead_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_PickUpBotHead_ObjVar) == 0x0005E0, "Member 'UMission_BridgeInTheDark_C::OBJ_PickUpBotHead_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_ReattachHead_ObjSetVar) == 0x0005E8, "Member 'UMission_BridgeInTheDark_C::SET_ReattachHead_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_ReattachHead_ObjVar) == 0x0005F0, "Member 'UMission_BridgeInTheDark_C::OBJ_ReattachHead_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_FollowBot1_ObjVar) == 0x0005F8, "Member 'UMission_BridgeInTheDark_C::OBJ_FollowBot1_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_FindBeeping_Bot02_ObjSetVar) == 0x000600, "Member 'UMission_BridgeInTheDark_C::SET_FindBeeping_Bot02_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_FindBeeping_Bot02_ObjVar) == 0x000608, "Member 'UMission_BridgeInTheDark_C::OBJ_FindBeeping_Bot02_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_RetrieveBot03Arm_ObjSetVar) == 0x000610, "Member 'UMission_BridgeInTheDark_C::SET_RetrieveBot03Arm_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_RetrieveBot03Arm_ObjVar) == 0x000618, "Member 'UMission_BridgeInTheDark_C::OBJ_RetrieveBot03Arm_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_FindAncestorBot_ObjSetVar) == 0x000620, "Member 'UMission_BridgeInTheDark_C::SET_FindAncestorBot_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_FindAncestorBot_ObjVar) == 0x000628, "Member 'UMission_BridgeInTheDark_C::OBJ_FindAncestorBot_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_RetrieveBot04Head_ObjSetVar) == 0x000630, "Member 'UMission_BridgeInTheDark_C::SET_RetrieveBot04Head_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_RetrieveBot04Head_ObjVar) == 0x000638, "Member 'UMission_BridgeInTheDark_C::OBJ_RetrieveBot04Head_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_InvestigateDisturbance_ObjSetVar) == 0x000640, "Member 'UMission_BridgeInTheDark_C::SET_InvestigateDisturbance_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_InvestigateDisturbance_ObjVar) == 0x000648, "Member 'UMission_BridgeInTheDark_C::OBJ_InvestigateDisturbance_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_SkullWellSequence_ObjVar) == 0x000650, "Member 'UMission_BridgeInTheDark_C::OBJ_SkullWellSequence_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, SET_FollowBot1_ObjSetVar) == 0x000658, "Member 'UMission_BridgeInTheDark_C::SET_FollowBot1_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_OpenInnerDoor1_ObjVar) == 0x000660, "Member 'UMission_BridgeInTheDark_C::OBJ_OpenInnerDoor1_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_OpenEridianDoor_ObjVar) == 0x000668, "Member 'UMission_BridgeInTheDark_C::OBJ_OpenEridianDoor_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_ListenFirstSignal_ObjVar) == 0x000670, "Member 'UMission_BridgeInTheDark_C::OBJ_ListenFirstSignal_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_SpawnVarkids_ObjVar) == 0x000678, "Member 'UMission_BridgeInTheDark_C::OBJ_SpawnVarkids_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, OBJ_ListenLostAlkonostLog_ObjVar) == 0x000680, "Member 'UMission_BridgeInTheDark_C::OBJ_ListenLostAlkonostLog_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BridgeInTheDark_C, CompleteLoad_ReattachHead) == 0x000688, "Member 'UMission_BridgeInTheDark_C::CompleteLoad_ReattachHead' has a wrong offset!");

}

