#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_RiseAndGrind

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "BP_OakMission_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_RiseAndGrind.Mission_RiseAndGrind_C
// 0x01A0 (0x06B0 - 0x0510)
class UMission_RiseAndGrind_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_RiseAndGrind_C;             // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_GoToRiseAndGrind_ObjSetVar;                    // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_RequestService_ObjSetVar;                      // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_KillPowerhouse_ObjSetVar;                      // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_InsertPowerCore_ObjSetVar;                     // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_TalkToCoffeeBotFirstTime_ObjSetVar;            // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_RequestService_ObjVar;                         // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_KillPowerhouse_ObjVar;                         // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_InsertPowerCore_ObjVar;                        // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_TalkToCoffeeBotFirstTime_ObjVar;               // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_StealThermoses_ObjSetVar;                      // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ReturnToRiseAndGrind_ObjSetVar;                // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_RescueBaristaBot_ObjSetVar;                    // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_PlaceThermos_ObjSetVar;                        // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TurnIn_ObjSetVar;                              // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_StealThermoses_ObjVar;                         // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ReturnToRiseAndGrind_ObjVar;                   // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_RescueBaristaBot_ObjVar;                       // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_PlaceThermos_ObjVar;                           // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TurnIn_ObjVar;                                 // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GoToRiseAndGrind_ObjVar;                       // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_BringCoffeeToAtlas_ObjSetVar;                  // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_HelpAtlasDefend_ObjSetVar;                     // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_HelpAtlasDefend_ObjVar;                        // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_BringCoffeeToAtlas_ObjVar;                     // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_TakeFilledThermos_ObjSetVar;                   // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_TakeFilledThermos_ObjVar;                      // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_RequestService_SecondTime_ObjSetVar;           // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_RequestService_SecondTime_ObjVar;              // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_PickUpPowerCore_ObjSetVar;                     // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_PickUpPowerCore_ObjVar;                        // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_BotPouredCoffee1_ObjVar;                       // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_BotInPosition_ObjVar;                          // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FuseExplodes_ObjVar;                           // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_LightsOff_ObjVar;                              // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ChangeWaypoints_ObjVar;                        // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_TalkToBot_ObjSetVar;                           // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TalkToBot_ObjVar;                              // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ExitAtlas_ObjVar;                              // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_EnteredRiseAndGrind_ObjVar;                    // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_Wave1_ObjVar;                                  // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ThermosFightWave1_ObjSetVar;                   // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ThermosFightWave2_ObjSetVar;                   // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_Wave2_ObjVar;                                  // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ThermosFightCommander_ObjSetVar;               // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_Wave3_ObjVar;                                  // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_SpawnCarl_ObjVar;                              // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    LoreleiBloodyClose;                                // 0x0688(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjectiveSet*                   Set_FindCommander_ObjSetVar;                       // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FindCommander_ObjVar;                          // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_CoffeeCupAttackWaves_ObjVar;                   // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_RiseAndGrind(int32 EntryPoint);
	void _Obj_CoffeeCupAttackWaves_Objective__PROXY_3();
	void _Obj_CoffeeCupAttackWaves_Objective__PROXY_2();
	void _Obj_CoffeeCupAttackWaves_Objective__PROXY_1();
	void Obj_CoffeeCupAttackWaves(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_FindCommander_Objective__PROXY_0();
	void _Obj_FindCommander_Objective__PROXY();
	void SET_RequestService(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void AdvanceTo_ThermosFightWave1(class UObject* Context);
	void Obj_FindCommander(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_FindCommander(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_SpawnCarl(class UObject* Context);
	void OBJ_SpawnCarl(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_Wave3Cleared(class UObject* Context);
	void OBJ_Wave3(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_ThermosFightCommander(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_ThermosFightWave2(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_ThermosFightWave1(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_Wave2Cleared(class UObject* Context);
	void OBJ_Wave2(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_Wave1Cleared(class UObject* Context);
	void OBJ_Wave1(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_EnteredRiseAndGrind(class UObject* Context);
	void OBJ_EnteredRiseAndGrind(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_ExitedAtlas(class UObject* Context);
	void OBJ_ExitAtlas(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_KillPowerhouse(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_TalkedToBot(class UObject* Context);
	void Obj_TalkToBot(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_TalkToBot(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_ChangeWaypoints(class UObject* Context);
	void OBJ_ChangeWaypoints(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_LightsOff(class UObject* Context);
	void OBJ_LightsOff(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_FuseExplodes(class UObject* Context);
	void OBJ_FuseExplodes(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_InsertPowerCore(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_BotInPosition(class UObject* Context);
	void OBJ_BotInPosition(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_PlacedCoffee(class UObject* Context);
	void Set_GoToRiseAndGrind(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_Coffee1Poured(class UObject* Context);
	void OBJ_BotPouredCoffee1(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_PickUpPowerCore(class UObject* Context);
	void SET_PickUpPowerCore(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_PickUpPowerCore(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_RequestService_SecondTime(class UObject* Context);
	void SET_RequestService_SecondTime(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_RequestService_SecondTime(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_TakeFilledThermos(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_TakeFilledThermos(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_BringCoffeeToAtlas(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_TurnIn(class UObject* Context);
	void Update_HelpAtlasDefend(class UObject* Context);
	void Update_PlaceThermos(class UObject* Context);
	void Update_RescueBaristaBot(class UObject* Context);
	void Update_ReturnToRiseAndGrind(class UObject* Context);
	void Update_StealThermos(class UObject* Context);
	void Update_TalkToCoffeeBotFirstTime(class UObject* Context);
	void Update_InsertPowerCore(class UObject* Context);
	void Update_KillPowerhouse(class UObject* Context);
	void Update_RequestService(class UObject* Context);
	void Update_GoToRiseAndGrind(class UObject* Context);
	void SET_TalkToCoffeeBotFirstTime(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_RequestService(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_HelpAtlasDefend(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_BringCoffeeToAtlas(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_HelpAtlasDefend(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_KillPowerhouse(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_InsertPowerCore(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_TalkToCoffeeBotFirstTime(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_StealThermoses(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_ReturnToRiseAndGrind(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_GoToRiseAndGrind(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_TurnIn(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_PlaceThermos(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_RescueBaristaBot(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_ReturnToRiseAndGrind(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_StealThermoses(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_TurnIn(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_PlaceThermos(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_RescueBaristaBot(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OnDialogSequenceFinished_38();
	void OnDialogSequenceFinished_39();
	void OnDialogSequenceFinished_40();
	void OnDialogSequenceFinished_41();
	void OnDialogSequenceFinished_42();
	void OnDialogSequenceFinished_43();
	void OnDialogSequenceFinished_44();
	void OnDialogSequenceFinished_45();
	void OnDialogSequenceFinished_46();
	void OnDialogSequenceFinished_47();
	void OnDialogSequenceFinished_48();
	void OnDialogSequenceFinished_49();
	void OnDialogSequenceFinished_50();
	void OnDialogSequenceFinished_51();
	void OnDialogSequenceFinished_52();
	void OnDialogSequenceFinished_53();
	void OnDialogSequenceFinished_54();
	void OnDialogSequenceFinished_55();
	void OnDialogSequenceFinished_56();
	void OnDialogSequenceFinished_57();
	void OnDialogSequenceFinished_58();
	void OnDialogSequenceFinished_59();
	void OnDialogSequenceFinished_60();
	void OnDialogSequenceFinished_61();
	void OnDialogSequenceFinished_62();
	void OnDialogSequenceFinished_63();
	void OnDialogSequenceFinished_64();
	void OnDialogSequenceFinished_65();
	void OnDialogSequenceFinished_66();
	void OnDialogSequenceFinished_67();
	void OnDialogSequenceFinished_68();
	void OnDialogSequenceFinished_69();
	void OnDialogSequenceFinished_70();
	void OnDialogSequenceFinished_71();
	void OnDialogSequenceFinished_72();
	void OnDialogSequenceFinished_73();
	void OnDialogSequenceFinished_74();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_RiseAndGrind_C">();
	}
	static class UMission_RiseAndGrind_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_RiseAndGrind_C>();
	}
};
static_assert(alignof(UMission_RiseAndGrind_C) == 0x000008, "Wrong alignment on UMission_RiseAndGrind_C");
static_assert(sizeof(UMission_RiseAndGrind_C) == 0x0006B0, "Wrong size on UMission_RiseAndGrind_C");
static_assert(offsetof(UMission_RiseAndGrind_C, UberGraphFrame_Mission_RiseAndGrind_C) == 0x000510, "Member 'UMission_RiseAndGrind_C::UberGraphFrame_Mission_RiseAndGrind_C' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, Set_GoToRiseAndGrind_ObjSetVar) == 0x000518, "Member 'UMission_RiseAndGrind_C::Set_GoToRiseAndGrind_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_RequestService_ObjSetVar) == 0x000520, "Member 'UMission_RiseAndGrind_C::SET_RequestService_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_KillPowerhouse_ObjSetVar) == 0x000528, "Member 'UMission_RiseAndGrind_C::SET_KillPowerhouse_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_InsertPowerCore_ObjSetVar) == 0x000530, "Member 'UMission_RiseAndGrind_C::SET_InsertPowerCore_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_TalkToCoffeeBotFirstTime_ObjSetVar) == 0x000538, "Member 'UMission_RiseAndGrind_C::SET_TalkToCoffeeBotFirstTime_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_RequestService_ObjVar) == 0x000540, "Member 'UMission_RiseAndGrind_C::OBJ_RequestService_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_KillPowerhouse_ObjVar) == 0x000548, "Member 'UMission_RiseAndGrind_C::OBJ_KillPowerhouse_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_InsertPowerCore_ObjVar) == 0x000550, "Member 'UMission_RiseAndGrind_C::OBJ_InsertPowerCore_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_TalkToCoffeeBotFirstTime_ObjVar) == 0x000558, "Member 'UMission_RiseAndGrind_C::OBJ_TalkToCoffeeBotFirstTime_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_StealThermoses_ObjSetVar) == 0x000560, "Member 'UMission_RiseAndGrind_C::SET_StealThermoses_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_ReturnToRiseAndGrind_ObjSetVar) == 0x000568, "Member 'UMission_RiseAndGrind_C::SET_ReturnToRiseAndGrind_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_RescueBaristaBot_ObjSetVar) == 0x000570, "Member 'UMission_RiseAndGrind_C::SET_RescueBaristaBot_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_PlaceThermos_ObjSetVar) == 0x000578, "Member 'UMission_RiseAndGrind_C::SET_PlaceThermos_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, Set_TurnIn_ObjSetVar) == 0x000580, "Member 'UMission_RiseAndGrind_C::Set_TurnIn_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_StealThermoses_ObjVar) == 0x000588, "Member 'UMission_RiseAndGrind_C::OBJ_StealThermoses_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_ReturnToRiseAndGrind_ObjVar) == 0x000590, "Member 'UMission_RiseAndGrind_C::OBJ_ReturnToRiseAndGrind_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_RescueBaristaBot_ObjVar) == 0x000598, "Member 'UMission_RiseAndGrind_C::OBJ_RescueBaristaBot_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_PlaceThermos_ObjVar) == 0x0005A0, "Member 'UMission_RiseAndGrind_C::OBJ_PlaceThermos_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, Obj_TurnIn_ObjVar) == 0x0005A8, "Member 'UMission_RiseAndGrind_C::Obj_TurnIn_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_GoToRiseAndGrind_ObjVar) == 0x0005B0, "Member 'UMission_RiseAndGrind_C::OBJ_GoToRiseAndGrind_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_BringCoffeeToAtlas_ObjSetVar) == 0x0005B8, "Member 'UMission_RiseAndGrind_C::SET_BringCoffeeToAtlas_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_HelpAtlasDefend_ObjSetVar) == 0x0005C0, "Member 'UMission_RiseAndGrind_C::SET_HelpAtlasDefend_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_HelpAtlasDefend_ObjVar) == 0x0005C8, "Member 'UMission_RiseAndGrind_C::OBJ_HelpAtlasDefend_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_BringCoffeeToAtlas_ObjVar) == 0x0005D0, "Member 'UMission_RiseAndGrind_C::OBJ_BringCoffeeToAtlas_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_TakeFilledThermos_ObjSetVar) == 0x0005D8, "Member 'UMission_RiseAndGrind_C::SET_TakeFilledThermos_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_TakeFilledThermos_ObjVar) == 0x0005E0, "Member 'UMission_RiseAndGrind_C::OBJ_TakeFilledThermos_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_RequestService_SecondTime_ObjSetVar) == 0x0005E8, "Member 'UMission_RiseAndGrind_C::SET_RequestService_SecondTime_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_RequestService_SecondTime_ObjVar) == 0x0005F0, "Member 'UMission_RiseAndGrind_C::OBJ_RequestService_SecondTime_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_PickUpPowerCore_ObjSetVar) == 0x0005F8, "Member 'UMission_RiseAndGrind_C::SET_PickUpPowerCore_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_PickUpPowerCore_ObjVar) == 0x000600, "Member 'UMission_RiseAndGrind_C::OBJ_PickUpPowerCore_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_BotPouredCoffee1_ObjVar) == 0x000608, "Member 'UMission_RiseAndGrind_C::OBJ_BotPouredCoffee1_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_BotInPosition_ObjVar) == 0x000610, "Member 'UMission_RiseAndGrind_C::OBJ_BotInPosition_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_FuseExplodes_ObjVar) == 0x000618, "Member 'UMission_RiseAndGrind_C::OBJ_FuseExplodes_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_LightsOff_ObjVar) == 0x000620, "Member 'UMission_RiseAndGrind_C::OBJ_LightsOff_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_ChangeWaypoints_ObjVar) == 0x000628, "Member 'UMission_RiseAndGrind_C::OBJ_ChangeWaypoints_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_TalkToBot_ObjSetVar) == 0x000630, "Member 'UMission_RiseAndGrind_C::SET_TalkToBot_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, Obj_TalkToBot_ObjVar) == 0x000638, "Member 'UMission_RiseAndGrind_C::Obj_TalkToBot_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_ExitAtlas_ObjVar) == 0x000640, "Member 'UMission_RiseAndGrind_C::OBJ_ExitAtlas_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_EnteredRiseAndGrind_ObjVar) == 0x000648, "Member 'UMission_RiseAndGrind_C::OBJ_EnteredRiseAndGrind_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_Wave1_ObjVar) == 0x000650, "Member 'UMission_RiseAndGrind_C::OBJ_Wave1_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_ThermosFightWave1_ObjSetVar) == 0x000658, "Member 'UMission_RiseAndGrind_C::SET_ThermosFightWave1_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_ThermosFightWave2_ObjSetVar) == 0x000660, "Member 'UMission_RiseAndGrind_C::SET_ThermosFightWave2_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_Wave2_ObjVar) == 0x000668, "Member 'UMission_RiseAndGrind_C::OBJ_Wave2_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, SET_ThermosFightCommander_ObjSetVar) == 0x000670, "Member 'UMission_RiseAndGrind_C::SET_ThermosFightCommander_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_Wave3_ObjVar) == 0x000678, "Member 'UMission_RiseAndGrind_C::OBJ_Wave3_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, OBJ_SpawnCarl_ObjVar) == 0x000680, "Member 'UMission_RiseAndGrind_C::OBJ_SpawnCarl_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, LoreleiBloodyClose) == 0x000688, "Member 'UMission_RiseAndGrind_C::LoreleiBloodyClose' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, Set_FindCommander_ObjSetVar) == 0x000698, "Member 'UMission_RiseAndGrind_C::Set_FindCommander_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, Obj_FindCommander_ObjVar) == 0x0006A0, "Member 'UMission_RiseAndGrind_C::Obj_FindCommander_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_RiseAndGrind_C, Obj_CoffeeCupAttackWaves_ObjVar) == 0x0006A8, "Member 'UMission_RiseAndGrind_C::Obj_CoffeeCupAttackWaves_ObjVar' has a wrong offset!");

}

