#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_Async_ZealotPilfer

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_Async_ZealotPilfer.Mission_Async_ZealotPilfer_C
// 0x0018 (0x0530 - 0x0518)
class UMission_Async_ZealotPilfer_C final : public UOakMissionRareSpawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_KillZealotPilfer_ObjSetVar;                    // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillZealotPilfer_ObjVar;                       // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_Async_ZealotPilfer(int32 EntryPoint);
	void MCE_ZealotPilferKilled(class UObject* Context);
	void Set_KillZealotPilfer(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_KillZealotPilfer(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_Async_ZealotPilfer_C">();
	}
	static class UMission_Async_ZealotPilfer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_Async_ZealotPilfer_C>();
	}
};
static_assert(alignof(UMission_Async_ZealotPilfer_C) == 0x000008, "Wrong alignment on UMission_Async_ZealotPilfer_C");
static_assert(sizeof(UMission_Async_ZealotPilfer_C) == 0x000530, "Wrong size on UMission_Async_ZealotPilfer_C");
static_assert(offsetof(UMission_Async_ZealotPilfer_C, UberGraphFrame) == 0x000518, "Member 'UMission_Async_ZealotPilfer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMission_Async_ZealotPilfer_C, Set_KillZealotPilfer_ObjSetVar) == 0x000520, "Member 'UMission_Async_ZealotPilfer_C::Set_KillZealotPilfer_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Async_ZealotPilfer_C, Obj_KillZealotPilfer_ObjVar) == 0x000528, "Member 'UMission_Async_ZealotPilfer_C::Obj_KillZealotPilfer_ObjVar' has a wrong offset!");

}

