#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_GhostStories

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "BP_OakMission_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_GhostStories.Mission_GhostStories_C
// 0x0180 (0x0690 - 0x0510)
class UMission_GhostStories_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_GhostStories_C;             // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_GrabFrame_ObjSetVar;                           // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GrabFrame_ObjVar;                              // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_PlaceFrame_ObjVar;                             // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlaceMeatmanFrame_ObjSetVar;                   // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_BuildMeatman_ObjSetVar;                        // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_BuildMeatman_ObjVar;                           // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_MeatmanParts_ObjVar;                           // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GetFuel_ObjSetVar;                             // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FindFuel_ObjVar;                               // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_AddFuel_ObjSetVar;                             // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_PlaceFuelCanister_ObjVar;                      // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GrabBanditHat_ObjSetVar;                       // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GrabBanditHat_ObjVar;                          // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_PlaceBanditHat_ObjSetVar;                      // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_PlaceBanditHat_ObjVar;                         // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_LightMeatman_ObjSetVar;                        // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_LightMeatman_ObjVar;                           // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_KillBandits_ObjSetVar;                         // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillBandits_ObjVar;                            // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ConsoleOrTorture_ObjSetVar;                    // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ReturnToBanditLeader_ObjSetVar;                // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ReturnToBanditLeader_ObjVar;                   // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ConsoleBanditLeader_ObjVar;                    // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_DisplayMeatmansWrath_ObjVar;                   // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ReassureBanditLeader_ObjVar;                   // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_IgniteFear_ObjVar;                             // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ReturnToMissionGiver_ObjSetVar;                // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ReturnToMissionGiver_ObjVar;                   // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_MeatmanGloves_ObjVar;                          // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_MeatmanPants_ObjVar;                           // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_MeatmanJacket_ObjVar;                          // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_MeatmanHead_ObjVar;                            // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_AdvanceMission_ObjVar;                         // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_CollectBanditParts_ObjSetVar;                  // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_CollectBanditParts_ObjVar;                     // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_CollectJacket_ObjVar;                          // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_CollectPants_ObjVar;                           // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_CollectGloves_ObjVar;                          // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_CollectBiobeastHead_ObjSetVar;                 // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_CollectBiobeastHead_ObjVar;                    // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GrabFrameForward_ObjVar;                       // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    HouseVO;                                           // 0x0660(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      OBJ_HouseVO_ObjVar;                                // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_KillBiobeast_ObjSetVar;                        // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_KillBiobeast_ObjVar;                           // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_BanditSpawn_ObjVar;                            // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_GhostStories(int32 EntryPoint);
	void Update_BanditSpawn(class UObject* Context);
	void OBJ_BanditSpawn(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_KilledBill(class UObject* Context);
	void OBJ_KillBiobeast(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_KillBiobeast(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void ___Set_an_Objective_in_the_Details___();
	void Play_HouseVO(class UObject* Context);
	void OBJ_HouseVO(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_GrabFrameForward(class UObject* Context);
	void OBJ_GrabFrameForward(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MRE_SwitchPulled(class UObject* Context);
	void SET_GrabFrame(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_GrabFrame(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_PlaceMeatmanFrame(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_PlaceFrame(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_FramePlaced(class UObject* Context);
	void OBJ_CollectBiobeastHead(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_CollectBiobeastHead(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_CollectGloves(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_CollectPants(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_CollectJacket(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_CollectBanditParts(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_CollectBanditParts(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MissionKickoff();
	void Update_ReturnedToMG(class UObject* Context);
	void Update_ReassuredBandit(class UObject* Context);
	void Update_ConsoledBandit(class UObject* Context);
	void Update_AdvanceBanditReturn(class UObject* Context);
	void OBJ_AdvanceMission(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_ReturnedToBandit(class UObject* Context);
	void Update_IgniteFear(class UObject* Context);
	void Update_DisplayWrath(class UObject* Context);
	void Update_MeatmanLit(class UObject* Context);
	void Update_AllBanditsKilled(class UObject* Context);
	void Update_PlacedHat(class UObject* Context);
	void Update_FuelAdded(class UObject* Context);
	void Update_PlaceHead(class UObject* Context);
	void Update_PlaceGloves(class UObject* Context);
	void Update_PlacePants(class UObject* Context);
	void Update_PlaceJacket(class UObject* Context);
	void OBJ_MeatmanHead(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_MeatmanGloves(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_MeatmanPants(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_MeatmanJacket(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_ReturnToMissionGiver(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_ReturnToMissionGiver(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_IgniteFear(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_ReassureBanditLeader(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_DisplayMeatmansWrath(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_ConsoleBanditLeader(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_ReturnToBanditLeader(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_ReturnToBanditLeader(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_ConsoleOrTorture(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_KillBandits(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_KillBandits(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_LightMeatman(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_LightMeatman(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_PlaceBanditHat(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_PlaceBanditHat(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_GrabBanditHat(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_GrabBanditHat(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_PlaceFuelCanister(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_AddFuel(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_FindFuel(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_GetFuel(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_MeatmanParts(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_BuildMeatman(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_BuildMeatman(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OnDialogSequenceFinished_20();
	void OnDialogSequenceFinished_21();
	void OnDialogSequenceFinished_22();
	void OnDialogSequenceFinished_23();
	void OnDialogSequenceFinished_24();
	void OnDialogSequenceFinished_25();
	void OnDialogSequenceFinished_26();
	void OnDialogSequenceFinished_27();
	void OnDialogSequenceFinished_28();
	void OnDialogSequenceFinished_29();
	void OnDialogSequenceFinished_30();
	void OnDialogSequenceFinished_31();
	void OnDialogSequenceFinished_32();
	void OnDialogSequenceFinished_33();
	void OnDialogSequenceFinished_34();
	void OnDialogSequenceFinished_35();
	void OnDialogSequenceFinished_36();
	void OnDialogSequenceFinished_37();
	void OnDialogSequenceFinished_38();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_GhostStories_C">();
	}
	static class UMission_GhostStories_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_GhostStories_C>();
	}
};
static_assert(alignof(UMission_GhostStories_C) == 0x000008, "Wrong alignment on UMission_GhostStories_C");
static_assert(sizeof(UMission_GhostStories_C) == 0x000690, "Wrong size on UMission_GhostStories_C");
static_assert(offsetof(UMission_GhostStories_C, UberGraphFrame_Mission_GhostStories_C) == 0x000510, "Member 'UMission_GhostStories_C::UberGraphFrame_Mission_GhostStories_C' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, Set_GrabFrame_ObjSetVar) == 0x000518, "Member 'UMission_GhostStories_C::Set_GrabFrame_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_GrabFrame_ObjVar) == 0x000520, "Member 'UMission_GhostStories_C::OBJ_GrabFrame_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_PlaceFrame_ObjVar) == 0x000528, "Member 'UMission_GhostStories_C::OBJ_PlaceFrame_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, Set_PlaceMeatmanFrame_ObjSetVar) == 0x000530, "Member 'UMission_GhostStories_C::Set_PlaceMeatmanFrame_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_BuildMeatman_ObjSetVar) == 0x000538, "Member 'UMission_GhostStories_C::SET_BuildMeatman_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_BuildMeatman_ObjVar) == 0x000540, "Member 'UMission_GhostStories_C::OBJ_BuildMeatman_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_MeatmanParts_ObjVar) == 0x000548, "Member 'UMission_GhostStories_C::OBJ_MeatmanParts_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_GetFuel_ObjSetVar) == 0x000550, "Member 'UMission_GhostStories_C::SET_GetFuel_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_FindFuel_ObjVar) == 0x000558, "Member 'UMission_GhostStories_C::OBJ_FindFuel_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_AddFuel_ObjSetVar) == 0x000560, "Member 'UMission_GhostStories_C::SET_AddFuel_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_PlaceFuelCanister_ObjVar) == 0x000568, "Member 'UMission_GhostStories_C::OBJ_PlaceFuelCanister_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_GrabBanditHat_ObjSetVar) == 0x000570, "Member 'UMission_GhostStories_C::SET_GrabBanditHat_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_GrabBanditHat_ObjVar) == 0x000578, "Member 'UMission_GhostStories_C::OBJ_GrabBanditHat_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_PlaceBanditHat_ObjSetVar) == 0x000580, "Member 'UMission_GhostStories_C::SET_PlaceBanditHat_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_PlaceBanditHat_ObjVar) == 0x000588, "Member 'UMission_GhostStories_C::OBJ_PlaceBanditHat_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_LightMeatman_ObjSetVar) == 0x000590, "Member 'UMission_GhostStories_C::SET_LightMeatman_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_LightMeatman_ObjVar) == 0x000598, "Member 'UMission_GhostStories_C::OBJ_LightMeatman_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, Set_KillBandits_ObjSetVar) == 0x0005A0, "Member 'UMission_GhostStories_C::Set_KillBandits_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, Obj_KillBandits_ObjVar) == 0x0005A8, "Member 'UMission_GhostStories_C::Obj_KillBandits_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_ConsoleOrTorture_ObjSetVar) == 0x0005B0, "Member 'UMission_GhostStories_C::SET_ConsoleOrTorture_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_ReturnToBanditLeader_ObjSetVar) == 0x0005B8, "Member 'UMission_GhostStories_C::SET_ReturnToBanditLeader_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_ReturnToBanditLeader_ObjVar) == 0x0005C0, "Member 'UMission_GhostStories_C::OBJ_ReturnToBanditLeader_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_ConsoleBanditLeader_ObjVar) == 0x0005C8, "Member 'UMission_GhostStories_C::OBJ_ConsoleBanditLeader_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_DisplayMeatmansWrath_ObjVar) == 0x0005D0, "Member 'UMission_GhostStories_C::OBJ_DisplayMeatmansWrath_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_ReassureBanditLeader_ObjVar) == 0x0005D8, "Member 'UMission_GhostStories_C::OBJ_ReassureBanditLeader_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_IgniteFear_ObjVar) == 0x0005E0, "Member 'UMission_GhostStories_C::OBJ_IgniteFear_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_ReturnToMissionGiver_ObjSetVar) == 0x0005E8, "Member 'UMission_GhostStories_C::SET_ReturnToMissionGiver_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_ReturnToMissionGiver_ObjVar) == 0x0005F0, "Member 'UMission_GhostStories_C::OBJ_ReturnToMissionGiver_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_MeatmanGloves_ObjVar) == 0x0005F8, "Member 'UMission_GhostStories_C::OBJ_MeatmanGloves_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_MeatmanPants_ObjVar) == 0x000600, "Member 'UMission_GhostStories_C::OBJ_MeatmanPants_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_MeatmanJacket_ObjVar) == 0x000608, "Member 'UMission_GhostStories_C::OBJ_MeatmanJacket_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_MeatmanHead_ObjVar) == 0x000610, "Member 'UMission_GhostStories_C::OBJ_MeatmanHead_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_AdvanceMission_ObjVar) == 0x000618, "Member 'UMission_GhostStories_C::OBJ_AdvanceMission_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_CollectBanditParts_ObjSetVar) == 0x000620, "Member 'UMission_GhostStories_C::SET_CollectBanditParts_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_CollectBanditParts_ObjVar) == 0x000628, "Member 'UMission_GhostStories_C::OBJ_CollectBanditParts_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_CollectJacket_ObjVar) == 0x000630, "Member 'UMission_GhostStories_C::OBJ_CollectJacket_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_CollectPants_ObjVar) == 0x000638, "Member 'UMission_GhostStories_C::OBJ_CollectPants_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_CollectGloves_ObjVar) == 0x000640, "Member 'UMission_GhostStories_C::OBJ_CollectGloves_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_CollectBiobeastHead_ObjSetVar) == 0x000648, "Member 'UMission_GhostStories_C::SET_CollectBiobeastHead_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_CollectBiobeastHead_ObjVar) == 0x000650, "Member 'UMission_GhostStories_C::OBJ_CollectBiobeastHead_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_GrabFrameForward_ObjVar) == 0x000658, "Member 'UMission_GhostStories_C::OBJ_GrabFrameForward_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, HouseVO) == 0x000660, "Member 'UMission_GhostStories_C::HouseVO' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_HouseVO_ObjVar) == 0x000670, "Member 'UMission_GhostStories_C::OBJ_HouseVO_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, SET_KillBiobeast_ObjSetVar) == 0x000678, "Member 'UMission_GhostStories_C::SET_KillBiobeast_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_KillBiobeast_ObjVar) == 0x000680, "Member 'UMission_GhostStories_C::OBJ_KillBiobeast_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GhostStories_C, OBJ_BanditSpawn_ObjVar) == 0x000688, "Member 'UMission_GhostStories_C::OBJ_BanditSpawn_ObjVar' has a wrong offset!");

}

