#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_FineDining

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "BP_OakMission_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_FineDining.Mission_FineDining_C
// 0x0100 (0x0610 - 0x0510)
class UMission_FineDining_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_FineDining_C;               // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_PickupGunGift_ObjSetVar;                       // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PickupGunGift_ObjVar;                          // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_FindCactusArea_ObjSetVar;                      // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FindCactusArea_ObjVar;                         // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_Breadcrumb_FindCactusArea_ObjVar;              // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   ObjSet_GetCactusFruit_ObjSetVar;                   // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetCactusFruit_ObjVar;                         // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   ObjSet_KillSkags_ObjSetVar;                        // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillTrainedSkags_ObjVar;                       // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_DestroyCactus1_Invis_ObjVar;                   // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_DestroyCactus3_Invis_ObjVar;                   // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_DestroyCactus2_Invis_ObjVar;                   // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_DestroyCactus4_Invis_ObjVar;                   // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_DestroyCactus5_Invis_ObjVar;                   // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   ObjSet_KillAlphaSkag_ObjSetVar;                    // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillAlphaSkag_ObjVar;                          // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   ObjSet_KillMincemeat_ObjSetVar;                    // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillMincemeat_ObjVar;                          // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillBadassSkags_ObjVar;                        // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillBadassSkags_Invis_ObjVar;                  // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_MincemeatObjTracker_Invis_ObjVar;              // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   ObjSet_IngedientDropOff_ObjSetVar;                 // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_IngedientDropOff_ObjVar;                       // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToBanditCamp_Invis_ObjVar;                   // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    Convo_IntroToSucc;                                 // 0x05D8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjectiveSet*                   ObjSet_PickupAlphaSkagMeat_ObjSetVar;              // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PickupAlphaSkagMeat_ObjVar;                    // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   ObjSet_CollectFinalMeat_ObjSetVar;                 // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj__CollectFinalMeat_ObjVar;                      // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillAlphaSkagWithSucc_Invis_ObjVar;            // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_FineDining(int32 EntryPoint);
	void Obj_KillAlphaSkagWithSucc_Invis(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_KillMincemeat_Objective__PROXY_7();
	void _Obj_KillBadassSkags_Objective__PROXY_6();
	void ObjSet_CollectFinalMeat(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj__CollectFinalMeat(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_ApproachMincemeatCamp(class UObject* Context);
	void _Obj_KillAlphaSkag_Objective__PROXY_5();
	void ObjSet_PickupAlphaSkagMeat(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_PickupAlphaSkagMeat(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_TrySpawnSuccSkags(class UObject* Context);
	void FirstFruitPickedUp();
	void Update_EnterGunArea(class UObject* Context);
	void Update_SuccSkagKilled(class UObject* Context);
	void Update_IngredientDropOff(class UObject* Context);
	void Obj_GoToBanditCamp_Invis(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_AdvanceObj_KillBadassSkags(class UObject* Context);
	void Obj_IngedientDropOff(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void ObjSet_IngedientDropOff(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_MincemeatObjTracker_Invis(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_KillBadassSkags_Invis(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_KillBadassSkags(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_KillMincemeat(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void ObjSet_KillMincemeat(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void ObjSet_KillAlphaSkag(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_KillAlphaSkag(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_DestroyCactus5_Invis_Objective__PROXY_4();
	void _Obj_DestroyCactus4_Invis_Objective__PROXY_3();
	void _Obj_DestroyCactus3_Invis_Objective__PROXY_2();
	void Obj_DestroyCactus5_Invis(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_DestroyCactus5_Invis(class UObject* Context);
	void Update_DestroyCactus4_Invis(class UObject* Context);
	void Update_DestroyCactus3_Invis(class UObject* Context);
	void Update_DestroyCactus2_Invis(class UObject* Context);
	void Obj_DestroyCactus4_Invis(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_DestroyCactus3_Invis(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_DestroyCactus2_Invis(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_DestroyCactus1_Invis_Objective__PROXY_1();
	void _Obj_DestroyCactus2_Invis_Objective__PROXY_0();
	void SpawnSuccSkags();
	void Update_DestroyCactus1_Invis(class UObject* Context);
	void Obj_DestroyCactus1_Invis(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_KillTrainedSkags(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_GetCactusFruit_Objective__PROXY();
	void ObjSet_KillSkags(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GetCactusFruit(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void ObjSet_GetCactusFruit(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_FindCactusArea_Breadcrumb(class UObject* Context);
	void Obj_Breadcrumb_FindCactusArea(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_FindCactusArea(class UObject* Context);
	void Obj_FindCactusArea(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_FindCactusArea(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_PickupGunGift(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_PickupGunGift(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OnDialogSequenceFinished_10();
	void OnDialogSequenceFinished_11();
	void OnDialogSequenceFinished_12();
	void OnDialogSequenceFinished_13();
	void OnDialogSequenceFinished_14();
	void OnDialogSequenceFinished_8();
	void OnDialogSequenceFinished_9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_FineDining_C">();
	}
	static class UMission_FineDining_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_FineDining_C>();
	}
};
static_assert(alignof(UMission_FineDining_C) == 0x000008, "Wrong alignment on UMission_FineDining_C");
static_assert(sizeof(UMission_FineDining_C) == 0x000610, "Wrong size on UMission_FineDining_C");
static_assert(offsetof(UMission_FineDining_C, UberGraphFrame_Mission_FineDining_C) == 0x000510, "Member 'UMission_FineDining_C::UberGraphFrame_Mission_FineDining_C' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Set_PickupGunGift_ObjSetVar) == 0x000518, "Member 'UMission_FineDining_C::Set_PickupGunGift_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_PickupGunGift_ObjVar) == 0x000520, "Member 'UMission_FineDining_C::Obj_PickupGunGift_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Set_FindCactusArea_ObjSetVar) == 0x000528, "Member 'UMission_FineDining_C::Set_FindCactusArea_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_FindCactusArea_ObjVar) == 0x000530, "Member 'UMission_FineDining_C::Obj_FindCactusArea_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_Breadcrumb_FindCactusArea_ObjVar) == 0x000538, "Member 'UMission_FineDining_C::Obj_Breadcrumb_FindCactusArea_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, ObjSet_GetCactusFruit_ObjSetVar) == 0x000540, "Member 'UMission_FineDining_C::ObjSet_GetCactusFruit_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_GetCactusFruit_ObjVar) == 0x000548, "Member 'UMission_FineDining_C::Obj_GetCactusFruit_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, ObjSet_KillSkags_ObjSetVar) == 0x000550, "Member 'UMission_FineDining_C::ObjSet_KillSkags_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_KillTrainedSkags_ObjVar) == 0x000558, "Member 'UMission_FineDining_C::Obj_KillTrainedSkags_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_DestroyCactus1_Invis_ObjVar) == 0x000560, "Member 'UMission_FineDining_C::Obj_DestroyCactus1_Invis_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_DestroyCactus3_Invis_ObjVar) == 0x000568, "Member 'UMission_FineDining_C::Obj_DestroyCactus3_Invis_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_DestroyCactus2_Invis_ObjVar) == 0x000570, "Member 'UMission_FineDining_C::Obj_DestroyCactus2_Invis_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_DestroyCactus4_Invis_ObjVar) == 0x000578, "Member 'UMission_FineDining_C::Obj_DestroyCactus4_Invis_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_DestroyCactus5_Invis_ObjVar) == 0x000580, "Member 'UMission_FineDining_C::Obj_DestroyCactus5_Invis_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, ObjSet_KillAlphaSkag_ObjSetVar) == 0x000588, "Member 'UMission_FineDining_C::ObjSet_KillAlphaSkag_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_KillAlphaSkag_ObjVar) == 0x000590, "Member 'UMission_FineDining_C::Obj_KillAlphaSkag_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, ObjSet_KillMincemeat_ObjSetVar) == 0x000598, "Member 'UMission_FineDining_C::ObjSet_KillMincemeat_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_KillMincemeat_ObjVar) == 0x0005A0, "Member 'UMission_FineDining_C::Obj_KillMincemeat_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_KillBadassSkags_ObjVar) == 0x0005A8, "Member 'UMission_FineDining_C::Obj_KillBadassSkags_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_KillBadassSkags_Invis_ObjVar) == 0x0005B0, "Member 'UMission_FineDining_C::Obj_KillBadassSkags_Invis_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_MincemeatObjTracker_Invis_ObjVar) == 0x0005B8, "Member 'UMission_FineDining_C::Obj_MincemeatObjTracker_Invis_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, ObjSet_IngedientDropOff_ObjSetVar) == 0x0005C0, "Member 'UMission_FineDining_C::ObjSet_IngedientDropOff_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_IngedientDropOff_ObjVar) == 0x0005C8, "Member 'UMission_FineDining_C::Obj_IngedientDropOff_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_GoToBanditCamp_Invis_ObjVar) == 0x0005D0, "Member 'UMission_FineDining_C::Obj_GoToBanditCamp_Invis_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Convo_IntroToSucc) == 0x0005D8, "Member 'UMission_FineDining_C::Convo_IntroToSucc' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, ObjSet_PickupAlphaSkagMeat_ObjSetVar) == 0x0005E8, "Member 'UMission_FineDining_C::ObjSet_PickupAlphaSkagMeat_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_PickupAlphaSkagMeat_ObjVar) == 0x0005F0, "Member 'UMission_FineDining_C::Obj_PickupAlphaSkagMeat_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, ObjSet_CollectFinalMeat_ObjSetVar) == 0x0005F8, "Member 'UMission_FineDining_C::ObjSet_CollectFinalMeat_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj__CollectFinalMeat_ObjVar) == 0x000600, "Member 'UMission_FineDining_C::Obj__CollectFinalMeat_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FineDining_C, Obj_KillAlphaSkagWithSucc_Invis_ObjVar) == 0x000608, "Member 'UMission_FineDining_C::Obj_KillAlphaSkagWithSucc_Invis_ObjVar' has a wrong offset!");

}

