#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_TechSlaughterDiscovery

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.ExecuteUbergraph_Mission_TechSlaughterDiscovery
// 0x02A8 (0x02A8 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0220(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent5; // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent5;      // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount5;      // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent4; // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent4;      // 0x023E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23F[0x1];                                      // 0x023F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount4;      // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent3; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent3;      // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount3;      // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent2;      // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount2;      // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context5;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2; // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent1;      // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263[0x1];                                      // 0x0263(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount1;      // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context4;         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context3;         // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context2;         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1; // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent; // 0x028A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent;       // 0x028B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount;       // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context1;         // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery) == 0x000008, "Wrong alignment on Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery) == 0x0002A8, "Wrong size on Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, EntryPoint) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, CallFunc_FinishSpeak_Conversation) == 0x000220, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, CallFunc_FinishSpeak_SequenceID) == 0x00022C, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, CallFunc_FinishSpeak_ReturnValue) == 0x000230, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, CallFunc_Conv_IntToBool_ReturnValue) == 0x000231, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, Temp_bool_IsClosed_Variable) == 0x000232, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent5) == 0x000233, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent5' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveEvent5) == 0x000234, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveEvent5' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveCount5) == 0x000238, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveCount5' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent4) == 0x00023C, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent4' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, K2Node_SwitchEnum_CmpSuccess) == 0x00023D, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveEvent4) == 0x00023E, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveEvent4' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveCount4) == 0x000240, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveCount4' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent3) == 0x000244, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent3' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveEvent3) == 0x000245, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveEvent3' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveCount3) == 0x000248, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveCount3' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveEvent2) == 0x00024C, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveEvent2' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveCount2) == 0x000250, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveCount2' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, K2Node_SwitchEnum1_CmpSuccess) == 0x000254, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_MissionCustomEvent_Context5) == 0x000258, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_MissionCustomEvent_Context5' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, Temp_bool_Has_Been_Initd_Variable) == 0x000260, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2) == 0x000261, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveEvent1) == 0x000262, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveEvent1' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveCount1) == 0x000264, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveCount1' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_MissionCustomEvent_Context4) == 0x000268, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_MissionCustomEvent_Context4' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, K2Node_SwitchEnum2_CmpSuccess) == 0x000270, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_MissionCustomEvent_Context3) == 0x000278, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_MissionCustomEvent_Context3' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_MissionCustomEvent_Context2) == 0x000280, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_MissionCustomEvent_Context2' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1) == 0x000288, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, K2Node_SwitchEnum3_CmpSuccess) == 0x000289, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent) == 0x00028A, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveEvent) == 0x00028B, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_ObjectiveEvent_ObjectiveCount) == 0x00028C, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_ObjectiveEvent_ObjectiveCount' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_MissionCustomEvent_Context1) == 0x000290, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_MissionCustomEvent_Context1' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, K2Node_SwitchEnum4_CmpSuccess) == 0x000298, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery, MissionK2Node_MissionCustomEvent_Context) == 0x0002A0, "Member 'Mission_TechSlaughterDiscovery_C_ExecuteUbergraph_Mission_TechSlaughterDiscovery::MissionK2Node_MissionCustomEvent_Context' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Update_GoToSanctuary
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Update_GoToSanctuary final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Update_GoToSanctuary) == 0x000008, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Update_GoToSanctuary");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Update_GoToSanctuary) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_Update_GoToSanctuary");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Update_GoToSanctuary, Context) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Update_GoToSanctuary::Context' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Update_TalkToNPC
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Update_TalkToNPC final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Update_TalkToNPC) == 0x000008, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Update_TalkToNPC");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Update_TalkToNPC) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_Update_TalkToNPC");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Update_TalkToNPC, Context) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Update_TalkToNPC::Context' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Obj_TalkToNPC
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Obj_TalkToNPC final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Obj_TalkToNPC) == 0x000004, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Obj_TalkToNPC");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Obj_TalkToNPC) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_Obj_TalkToNPC");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_TalkToNPC, ObjectiveEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Obj_TalkToNPC::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_TalkToNPC, ObjectiveCount) == 0x000004, "Member 'Mission_TechSlaughterDiscovery_C_Obj_TalkToNPC::ObjectiveCount' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Set_TalkToNPC
// 0x0001 (0x0001 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Set_TalkToNPC final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Set_TalkToNPC) == 0x000001, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Set_TalkToNPC");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Set_TalkToNPC) == 0x000001, "Wrong size on Mission_TechSlaughterDiscovery_C_Set_TalkToNPC");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Set_TalkToNPC, ObjectiveSetEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Set_TalkToNPC::ObjectiveSetEvent' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Set_UseDropPod_OnPlanet
// 0x0001 (0x0001 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Set_UseDropPod_OnPlanet final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Set_UseDropPod_OnPlanet) == 0x000001, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Set_UseDropPod_OnPlanet");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Set_UseDropPod_OnPlanet) == 0x000001, "Wrong size on Mission_TechSlaughterDiscovery_C_Set_UseDropPod_OnPlanet");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Set_UseDropPod_OnPlanet, ObjectiveSetEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Set_UseDropPod_OnPlanet::ObjectiveSetEvent' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.AdvanceTo_PlanetTitleCard
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_AdvanceTo_PlanetTitleCard final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_AdvanceTo_PlanetTitleCard) == 0x000008, "Wrong alignment on Mission_TechSlaughterDiscovery_C_AdvanceTo_PlanetTitleCard");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_AdvanceTo_PlanetTitleCard) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_AdvanceTo_PlanetTitleCard");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_AdvanceTo_PlanetTitleCard, Context) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_AdvanceTo_PlanetTitleCard::Context' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.ADVANCE_Navigate_TechSlaughter
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_ADVANCE_Navigate_TechSlaughter final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_ADVANCE_Navigate_TechSlaughter) == 0x000008, "Wrong alignment on Mission_TechSlaughterDiscovery_C_ADVANCE_Navigate_TechSlaughter");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_ADVANCE_Navigate_TechSlaughter) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_ADVANCE_Navigate_TechSlaughter");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_ADVANCE_Navigate_TechSlaughter, Context) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_ADVANCE_Navigate_TechSlaughter::Context' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.UPDATE_Navigate_TechSlaughter
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_UPDATE_Navigate_TechSlaughter final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_UPDATE_Navigate_TechSlaughter) == 0x000008, "Wrong alignment on Mission_TechSlaughterDiscovery_C_UPDATE_Navigate_TechSlaughter");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_UPDATE_Navigate_TechSlaughter) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_UPDATE_Navigate_TechSlaughter");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_UPDATE_Navigate_TechSlaughter, Context) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_UPDATE_Navigate_TechSlaughter::Context' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Obj_Navigate_TechSlaughter
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Obj_Navigate_TechSlaughter final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Obj_Navigate_TechSlaughter) == 0x000004, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Obj_Navigate_TechSlaughter");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Obj_Navigate_TechSlaughter) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_Obj_Navigate_TechSlaughter");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_Navigate_TechSlaughter, ObjectiveEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Obj_Navigate_TechSlaughter::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_Navigate_TechSlaughter, ObjectiveCount) == 0x000004, "Member 'Mission_TechSlaughterDiscovery_C_Obj_Navigate_TechSlaughter::ObjectiveCount' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Set_Navigate_TechSlaughter
// 0x0001 (0x0001 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Set_Navigate_TechSlaughter final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Set_Navigate_TechSlaughter) == 0x000001, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Set_Navigate_TechSlaughter");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Set_Navigate_TechSlaughter) == 0x000001, "Wrong size on Mission_TechSlaughterDiscovery_C_Set_Navigate_TechSlaughter");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Set_Navigate_TechSlaughter, ObjectiveSetEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Set_Navigate_TechSlaughter::ObjectiveSetEvent' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Update_ReNavigate_TechSlaughter
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Update_ReNavigate_TechSlaughter final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Update_ReNavigate_TechSlaughter) == 0x000008, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Update_ReNavigate_TechSlaughter");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Update_ReNavigate_TechSlaughter) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_Update_ReNavigate_TechSlaughter");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Update_ReNavigate_TechSlaughter, Context) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Update_ReNavigate_TechSlaughter::Context' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.OBJ_ReNavigate_TechSlaughter
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_OBJ_ReNavigate_TechSlaughter final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_OBJ_ReNavigate_TechSlaughter) == 0x000004, "Wrong alignment on Mission_TechSlaughterDiscovery_C_OBJ_ReNavigate_TechSlaughter");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_OBJ_ReNavigate_TechSlaughter) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_OBJ_ReNavigate_TechSlaughter");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_OBJ_ReNavigate_TechSlaughter, ObjectiveEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_OBJ_ReNavigate_TechSlaughter::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_OBJ_ReNavigate_TechSlaughter, ObjectiveCount) == 0x000004, "Member 'Mission_TechSlaughterDiscovery_C_OBJ_ReNavigate_TechSlaughter::ObjectiveCount' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Obj_UseDropPod
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Obj_UseDropPod final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Obj_UseDropPod) == 0x000004, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Obj_UseDropPod");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Obj_UseDropPod) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_Obj_UseDropPod");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_UseDropPod, ObjectiveEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Obj_UseDropPod::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_UseDropPod, ObjectiveCount) == 0x000004, "Member 'Mission_TechSlaughterDiscovery_C_Obj_UseDropPod::ObjectiveCount' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.SET_UseDropPod_OnSanctuary
// 0x0001 (0x0001 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_SET_UseDropPod_OnSanctuary final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_SET_UseDropPod_OnSanctuary) == 0x000001, "Wrong alignment on Mission_TechSlaughterDiscovery_C_SET_UseDropPod_OnSanctuary");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_SET_UseDropPod_OnSanctuary) == 0x000001, "Wrong size on Mission_TechSlaughterDiscovery_C_SET_UseDropPod_OnSanctuary");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_SET_UseDropPod_OnSanctuary, ObjectiveSetEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_SET_UseDropPod_OnSanctuary::ObjectiveSetEvent' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Obj_PlanetTitleCard
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Obj_PlanetTitleCard final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Obj_PlanetTitleCard) == 0x000004, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Obj_PlanetTitleCard");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Obj_PlanetTitleCard) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_Obj_PlanetTitleCard");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_PlanetTitleCard, ObjectiveEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Obj_PlanetTitleCard::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_PlanetTitleCard, ObjectiveCount) == 0x000004, "Member 'Mission_TechSlaughterDiscovery_C_Obj_PlanetTitleCard::ObjectiveCount' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Set_TechSlaughterTitleCard
// 0x0001 (0x0001 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Set_TechSlaughterTitleCard final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Set_TechSlaughterTitleCard) == 0x000001, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Set_TechSlaughterTitleCard");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Set_TechSlaughterTitleCard) == 0x000001, "Wrong size on Mission_TechSlaughterDiscovery_C_Set_TechSlaughterTitleCard");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Set_TechSlaughterTitleCard, ObjectiveSetEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Set_TechSlaughterTitleCard::ObjectiveSetEvent' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Obj_GoToSanctuary
// 0x0008 (0x0008 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Obj_GoToSanctuary final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Obj_GoToSanctuary) == 0x000004, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Obj_GoToSanctuary");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Obj_GoToSanctuary) == 0x000008, "Wrong size on Mission_TechSlaughterDiscovery_C_Obj_GoToSanctuary");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_GoToSanctuary, ObjectiveEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Obj_GoToSanctuary::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Obj_GoToSanctuary, ObjectiveCount) == 0x000004, "Member 'Mission_TechSlaughterDiscovery_C_Obj_GoToSanctuary::ObjectiveCount' has a wrong offset!");

// Function Mission_TechSlaughterDiscovery.Mission_TechSlaughterDiscovery_C.Set_GoToSanctuary
// 0x0001 (0x0001 - 0x0000)
struct Mission_TechSlaughterDiscovery_C_Set_GoToSanctuary final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_TechSlaughterDiscovery_C_Set_GoToSanctuary) == 0x000001, "Wrong alignment on Mission_TechSlaughterDiscovery_C_Set_GoToSanctuary");
static_assert(sizeof(Mission_TechSlaughterDiscovery_C_Set_GoToSanctuary) == 0x000001, "Wrong size on Mission_TechSlaughterDiscovery_C_Set_GoToSanctuary");
static_assert(offsetof(Mission_TechSlaughterDiscovery_C_Set_GoToSanctuary, ObjectiveSetEvent) == 0x000000, "Member 'Mission_TechSlaughterDiscovery_C_Set_GoToSanctuary::ObjectiveSetEvent' has a wrong offset!");

}

