#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_DLC1_Side_DoItForDigby_Part1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_DLC1_Side_DoItForDigby_Part1.Mission_DLC1_Side_DoItForDigby_Part1_C
// 0x00A0 (0x05B0 - 0x0510)
class UMission_DLC1_Side_DoItForDigby_Part1_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_DLC1_Side_DoItForDigby_Part1_C; // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_WhackDigby_ObjSetVar;                          // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_WhackDigby_ObjVar;                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GetDrinkIngredients_ObjSetVar;                 // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetPaintThinner_ObjVar;                        // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetRakkEggs_ObjVar;                            // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTwistOfLime_ObjVar;                         // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PutIngredientsInBlender_ObjSetVar;             // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_AddPaintThinner_ObjVar;                        // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_AddEggs_ObjVar;                                // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_AddLime_ObjSetVar;                             // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_AddLime_ObjVar;                                // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TakeDrink_ObjSetVar;                           // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetPitcher_ObjVar;                             // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GivePitcher_ObjVar;                            // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_BlendDrink_ObjVar;                             // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_ReturnToDigby_ObjSetVar;                       // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TalkToDigbyWithIngredients_ObjVar;             // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_WaitForBlend_ObjVar;                           // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GiveDrink_ObjSetVar;                           // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_DLC1_Side_DoItForDigby_Part1(int32 EntryPoint);
	void Obj_WhackDigby(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_WhackDigby(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PlayerWhackedDigby(class UObject* Context);
	void Obj_AddEggs(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_GetPaintThinner(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_GetDrinkIngredients(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_GiveDrink(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_WaitForBlend(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_GetRakkEggs(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_GetTwistOfLime(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerAddedEggs(class UObject* Context);
	void MissionKickoff();
	void Obj_AddPaintThinner(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerGavePitcherToDigby(class UObject* Context);
	void MCE_PlayerAddedPaintThinner(class UObject* Context);
	void MCE_PlayerTalkedToDigbyWithIngredients(class UObject* Context);
	void Set_ReturnToDigby(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_TalkToDigbyWithIngredients(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerBlendedDrink(class UObject* Context);
	void Obj_BlendDrink(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_GivePitcher(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_AddLime(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_TakeDrink(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GetPitcher(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_AddLime(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_PutIngredientsInBlender(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PlayerAddedLime(class UObject* Context);
	void OnDialogSequenceFinished_10();
	void OnDialogSequenceFinished_11();
	void OnDialogSequenceFinished_12();
	void OnDialogSequenceFinished_13();
	void OnDialogSequenceFinished_14();
	void OnDialogSequenceFinished_8();
	void OnDialogSequenceFinished_9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_DLC1_Side_DoItForDigby_Part1_C">();
	}
	static class UMission_DLC1_Side_DoItForDigby_Part1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_DLC1_Side_DoItForDigby_Part1_C>();
	}
};
static_assert(alignof(UMission_DLC1_Side_DoItForDigby_Part1_C) == 0x000008, "Wrong alignment on UMission_DLC1_Side_DoItForDigby_Part1_C");
static_assert(sizeof(UMission_DLC1_Side_DoItForDigby_Part1_C) == 0x0005B0, "Wrong size on UMission_DLC1_Side_DoItForDigby_Part1_C");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, UberGraphFrame_Mission_DLC1_Side_DoItForDigby_Part1_C) == 0x000510, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::UberGraphFrame_Mission_DLC1_Side_DoItForDigby_Part1_C' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Set_WhackDigby_ObjSetVar) == 0x000518, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Set_WhackDigby_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_WhackDigby_ObjVar) == 0x000520, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_WhackDigby_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Set_GetDrinkIngredients_ObjSetVar) == 0x000528, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Set_GetDrinkIngredients_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_GetPaintThinner_ObjVar) == 0x000530, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_GetPaintThinner_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_GetRakkEggs_ObjVar) == 0x000538, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_GetRakkEggs_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_GetTwistOfLime_ObjVar) == 0x000540, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_GetTwistOfLime_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Set_PutIngredientsInBlender_ObjSetVar) == 0x000548, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Set_PutIngredientsInBlender_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_AddPaintThinner_ObjVar) == 0x000550, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_AddPaintThinner_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_AddEggs_ObjVar) == 0x000558, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_AddEggs_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Set_AddLime_ObjSetVar) == 0x000560, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Set_AddLime_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_AddLime_ObjVar) == 0x000568, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_AddLime_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Set_TakeDrink_ObjSetVar) == 0x000570, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Set_TakeDrink_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_GetPitcher_ObjVar) == 0x000578, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_GetPitcher_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_GivePitcher_ObjVar) == 0x000580, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_GivePitcher_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_BlendDrink_ObjVar) == 0x000588, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_BlendDrink_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Set_ReturnToDigby_ObjSetVar) == 0x000590, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Set_ReturnToDigby_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_TalkToDigbyWithIngredients_ObjVar) == 0x000598, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_TalkToDigbyWithIngredients_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Obj_WaitForBlend_ObjVar) == 0x0005A0, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Obj_WaitForBlend_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_DLC1_Side_DoItForDigby_Part1_C, Set_GiveDrink_ObjSetVar) == 0x0005A8, "Member 'UMission_DLC1_Side_DoItForDigby_Part1_C::Set_GiveDrink_ObjSetVar' has a wrong offset!");

}

