#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_BoneDeep

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_BoneDeep.Mission_BoneDeep_C
// 0x00E0 (0x05F0 - 0x0510)
class UMission_BoneDeep_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_BoneDeep_C;                 // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_PlaceFirstBeacon_ObjSetVar;                    // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GoToEpicenter_ObjSetVar;                       // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TakeSteamJet_ObjSetVar;                        // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TalkToGrouse_ObjVar;                           // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceBeacons_ObjVar;                           // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlaceExplosive_Boulder_ObjSetVar;              // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceExplosives_Boulder_ObjVar;                // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_BlowUpBoulder_ObjVar;                          // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GetExplosives_ObjSetVar;                       // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetExplosives_ObjVar;                          // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlaceExplosives_Shaft_ObjSetVar;               // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceExplosive_Shaft_ObjVar;                   // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_BlowHoleInShaft_ObjVar;                        // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToEpicenter_BC1_ObjVar;                      // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_PickUpBeacons_ObjSetVar;                       // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_PickUpBeacons_ObjVar;                          // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToEpicenter_BC2_ObjVar;                      // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToEpicenter_ObjVar;                          // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToEpicenter_BC3_ObjVar;                      // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TakeSteamJet_ObjVar;                           // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceFirstBeacon_ObjVar;                       // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlaceBeacons_ObjSetVar;                        // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_PlaceBeaconA_BC_ObjVar;                    // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_PlaceBeaconB_BC_ObjVar;                    // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      INV_Obj_ExitBase_ObjVar;                           // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TalkToGrouse_ObjSetVar;                        // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_BlowHoleInShaft_ObjSetVar;                     // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_BoneDeep(int32 EntryPoint);
	void Set_GoToEpicenter(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_BlowHoleInShaft(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_TalkToGrouse(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MissionKickoff();
	void MCE_ExitedBase(class UObject* Context);
	void INV_Obj_ExitBase(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_TalkToGrouse(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_INV_WentToPlaceBeaconB_BC(class UObject* Context);
	void MCE_INV_WentToPlaceBeaconA_BC(class UObject* Context);
	void Set_TakeSteamJet(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_INV_PlaceBeaconB_BC(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_INV_PlaceBeaconA_BC(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_PlaceBeacons(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PlayerPlacedFirstBeacon(class UObject* Context);
	void Obj_PlaceFirstBeacon(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_ResetPlaceExplosive_Shaft(class UObject* Context);
	void MCE_ResetPlaceExplosive_Boulder(class UObject* Context);
	void MCE_PlayerTookSteamJetOutOfCave(class UObject* Context);
	void Obj_TakeSteamJet(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerArrivedAtEpicenter_BC_3(class UObject* Context);
	void Obj_GoToEpicenter_BC3(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_PickUpBeacons(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_PickUpBeacons(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_PlaceFirstBeacon(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GoToEpicenter(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerArrivedAtEpicenter_BC_2(class UObject* Context);
	void Obj_GoToEpicenter_BC2(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerArrivedAtEpicenter_BC_1(class UObject* Context);
	void Obj_GoToEpicenter_BC1(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerBlewHoleInShaft(class UObject* Context);
	void Obj_BlowHoleInShaft(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerPlacedOneBeacon(class UObject* Context);
	void Obj_PlaceExplosive_Shaft(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerPlacedExplosives_Shaft(class UObject* Context);
	void Set_PlaceExplosives_Shaft(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PlayerTalkedToEndRobot(class UObject* Context);
	void Obj_GetExplosives(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_GetExplosives(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PlayerBlewUpBoulder(class UObject* Context);
	void Obj_BlowUpBoulder(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerPlacedAnExplosive_Boulder(class UObject* Context);
	void Set_PlaceExplosive_Boulder(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_PlaceExplosives_Boulder(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerArrivedAtEpicenter(class UObject* Context);
	void Obj_PlaceBeacons(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OnDialogSequenceFinished_16();
	void OnDialogSequenceFinished_17();
	void OnDialogSequenceFinished_18();
	void OnDialogSequenceFinished_19();
	void OnDialogSequenceFinished_20();
	void OnDialogSequenceFinished_21();
	void OnDialogSequenceFinished_22();
	void OnDialogSequenceFinished_23();
	void OnDialogSequenceFinished_24();
	void OnDialogSequenceFinished_25();
	void OnDialogSequenceFinished_26();
	void OnDialogSequenceFinished_27();
	void OnDialogSequenceFinished_28();
	void OnDialogSequenceFinished_29();
	void OnDialogSequenceFinished_30();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_BoneDeep_C">();
	}
	static class UMission_BoneDeep_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_BoneDeep_C>();
	}
};
static_assert(alignof(UMission_BoneDeep_C) == 0x000008, "Wrong alignment on UMission_BoneDeep_C");
static_assert(sizeof(UMission_BoneDeep_C) == 0x0005F0, "Wrong size on UMission_BoneDeep_C");
static_assert(offsetof(UMission_BoneDeep_C, UberGraphFrame_Mission_BoneDeep_C) == 0x000510, "Member 'UMission_BoneDeep_C::UberGraphFrame_Mission_BoneDeep_C' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Set_PlaceFirstBeacon_ObjSetVar) == 0x000518, "Member 'UMission_BoneDeep_C::Set_PlaceFirstBeacon_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Set_GoToEpicenter_ObjSetVar) == 0x000520, "Member 'UMission_BoneDeep_C::Set_GoToEpicenter_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Set_TakeSteamJet_ObjSetVar) == 0x000528, "Member 'UMission_BoneDeep_C::Set_TakeSteamJet_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_TalkToGrouse_ObjVar) == 0x000530, "Member 'UMission_BoneDeep_C::Obj_TalkToGrouse_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_PlaceBeacons_ObjVar) == 0x000538, "Member 'UMission_BoneDeep_C::Obj_PlaceBeacons_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Set_PlaceExplosive_Boulder_ObjSetVar) == 0x000540, "Member 'UMission_BoneDeep_C::Set_PlaceExplosive_Boulder_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_PlaceExplosives_Boulder_ObjVar) == 0x000548, "Member 'UMission_BoneDeep_C::Obj_PlaceExplosives_Boulder_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_BlowUpBoulder_ObjVar) == 0x000550, "Member 'UMission_BoneDeep_C::Obj_BlowUpBoulder_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Set_GetExplosives_ObjSetVar) == 0x000558, "Member 'UMission_BoneDeep_C::Set_GetExplosives_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_GetExplosives_ObjVar) == 0x000560, "Member 'UMission_BoneDeep_C::Obj_GetExplosives_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Set_PlaceExplosives_Shaft_ObjSetVar) == 0x000568, "Member 'UMission_BoneDeep_C::Set_PlaceExplosives_Shaft_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_PlaceExplosive_Shaft_ObjVar) == 0x000570, "Member 'UMission_BoneDeep_C::Obj_PlaceExplosive_Shaft_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_BlowHoleInShaft_ObjVar) == 0x000578, "Member 'UMission_BoneDeep_C::Obj_BlowHoleInShaft_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_GoToEpicenter_BC1_ObjVar) == 0x000580, "Member 'UMission_BoneDeep_C::Obj_GoToEpicenter_BC1_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, SET_PickUpBeacons_ObjSetVar) == 0x000588, "Member 'UMission_BoneDeep_C::SET_PickUpBeacons_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, OBJ_PickUpBeacons_ObjVar) == 0x000590, "Member 'UMission_BoneDeep_C::OBJ_PickUpBeacons_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_GoToEpicenter_BC2_ObjVar) == 0x000598, "Member 'UMission_BoneDeep_C::Obj_GoToEpicenter_BC2_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_GoToEpicenter_ObjVar) == 0x0005A0, "Member 'UMission_BoneDeep_C::Obj_GoToEpicenter_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_GoToEpicenter_BC3_ObjVar) == 0x0005A8, "Member 'UMission_BoneDeep_C::Obj_GoToEpicenter_BC3_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_TakeSteamJet_ObjVar) == 0x0005B0, "Member 'UMission_BoneDeep_C::Obj_TakeSteamJet_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_PlaceFirstBeacon_ObjVar) == 0x0005B8, "Member 'UMission_BoneDeep_C::Obj_PlaceFirstBeacon_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Set_PlaceBeacons_ObjSetVar) == 0x0005C0, "Member 'UMission_BoneDeep_C::Set_PlaceBeacons_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_INV_PlaceBeaconA_BC_ObjVar) == 0x0005C8, "Member 'UMission_BoneDeep_C::Obj_INV_PlaceBeaconA_BC_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Obj_INV_PlaceBeaconB_BC_ObjVar) == 0x0005D0, "Member 'UMission_BoneDeep_C::Obj_INV_PlaceBeaconB_BC_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, INV_Obj_ExitBase_ObjVar) == 0x0005D8, "Member 'UMission_BoneDeep_C::INV_Obj_ExitBase_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Set_TalkToGrouse_ObjSetVar) == 0x0005E0, "Member 'UMission_BoneDeep_C::Set_TalkToGrouse_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BoneDeep_C, Set_BlowHoleInShaft_ObjSetVar) == 0x0005E8, "Member 'UMission_BoneDeep_C::Set_BlowHoleInShaft_ObjSetVar' has a wrong offset!");

}

