#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_BetterTimes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_BetterTimes.Mission_BetterTimes_C
// 0x0140 (0x0650 - 0x0510)
class UMission_BetterTimes_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_BetterTimes_C;              // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_LaunchRocket_ObjSetVar;                        // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_LaunchRocket_ObjVar;                           // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GetRocketParts_ObjSetVar;                      // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetRocketParts_ObjVar;                         // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GoToOldBase_1_ObjSetVar;                       // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToOldBase_ObjVar;                            // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillCreature_ObjVar;                           // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ClearOldBase_ObjVar;                           // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_AssembleRocket_1_ObjSetVar;                    // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_AssembleRocket_ObjVar;                         // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlaceEchoLogs_ObjSetVar;                       // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceEchoLogs_ObjVar;                          // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetEchoLogs_ObjVar;                            // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GetEchoLogs_1_ObjSetVar;                       // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_KillCreature_ObjSetVar;                        // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GetEchoLogs_3_ObjSetVar;                       // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_GetEchoLog_Second_ObjVar;                  // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ShootEchoLog_Second_ObjVar;                    // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_ShootEchoLog_Second_ObjSetVar;                 // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_PlaceDetonator_ObjSetVar;                      // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceDetonator_ObjVar;                         // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GetDetonator_ObjSetVar;                        // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetDetonator_ObjVar;                           // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldBaseSpawnerClearedNum;                          // 0x05D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjectiveSet*                   Set_GetEchoLog_Second_ObjSetVar;                   // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_GetEchoLog_First_ObjVar;                   // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_AssembleRocket_Piece1_ObjVar;              // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_AssembleRocket_2_ObjSetVar;                    // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_AssembleRocket_3_ObjSetVar;                    // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_AssembleRocket_Piece2_ObjVar;              // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_AssembleRocket_Piece3_ObjVar;              // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_GetEchoLog_Third_ObjVar;                   // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_ClearOldBase_ObjSetVar;                        // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_ClearOldBase_BC1_ObjVar;                   // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_ClearOldBase_BC2_ObjVar;                   // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToBeach_ObjVar;                              // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_WhereIsThirdEchoLog_ObjVar;                // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TalkToSparrow_ObjSetVar;                       // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TalkToSparrow_ObjVar;                          // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_BetterTimes(int32 EntryPoint);
	void Obj_LaunchRocket(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_LaunchRocket(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_LaunchedRocket(class UObject* Context);
	void Set_GetRocketParts(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GetRocketParts(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void CustomEvent_OnFirstEchoLog_Finished();
	void CustomEvent_OnSecondEchoLog_Finished();
	void CustomEvent_OnThirdEchoLog_Finished();
	void Set_GoToOldBase_1(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_RocketExploded1(class UObject* Context);
	void MCE_MissionComplete(class UObject* Context);
	void MCE_TalkedToSparrow(class UObject* Context);
	void Obj_GoToOldBase(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_TalkToSparrow(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_TalkToSparrow(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_INV_WhereIsThirdEchoLog(class UObject* Context);
	void Obj_INV_WhereIsThirdEchoLog(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_WentToBeach(class UObject* Context);
	void MCE_WentToOldBase(class UObject* Context);
	void Obj_KillCreature(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_GoToBeach(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_ClearOldBase(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_AssembleRocket_1(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MissionKickoff();
	void MCE_ClearedOldBase_BC2(class UObject* Context);
	void MCE_ClearedOldBase_BC1(class UObject* Context);
	void Obj_INV_ClearOldBase_BC2(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_INV_ClearOldBase_BC1(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_AssembleRocket(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_ClearOldBase(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_INV_GetEchoLog_Third(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_AssembledRocketPart_3(class UObject* Context);
	void MCE_AssembledRocketPart_2(class UObject* Context);
	void MCE_AssembledRocketPart_1(class UObject* Context);
	void _Obj_AssembleRocket_Objective__PROXY_4();
	void Obj_INV_AssembleRocket_Piece3(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_AssembleRocket_Objective__PROXY_3();
	void Obj_INV_AssembleRocket_Piece2(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_INV_AssembleRocket_Piece1(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_AssembleRocket_3(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_AssembleRocket_2(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_GotEchoLog_First(class UObject* Context);
	void Obj_INV_GetEchoLog_First(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_GetEchoLogs_Objective__PROXY_2();
	void Set_GetEchoLog_Second(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_ClearedOldBase(class UObject* Context);
	void Obj_GetDetonator(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_GetDetonator(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_PlaceEchoLogs(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_GetEchoLogs(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlacedDetonator(class UObject* Context);
	void Obj_PlaceDetonator(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_PlaceDetonator(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_ShootedEchoLog_Second(class UObject* Context);
	void Set_ShootEchoLog_Second(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void _Obj_GetEchoLogs_Objective__PROXY_1();
	void _Obj_GetEchoLogs_Objective__PROXY_0();
	void _Obj_GetEchoLogs_Objective__PROXY();
	void Obj_ShootEchoLog_Second(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_OnCreatureKilled(class UObject* Context);
	void MCE_GotEchoLog_Second(class UObject* Context);
	void Obj_INV_GetEchoLog_Second(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_AssembledAnyRocketPart(class UObject* Context);
	void MCE_GotEchoLog(class UObject* Context);
	void Set_PlaceEchoLogs(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PlacedEcho(class UObject* Context);
	void MCE_OnSpawnCreature(class UObject* Context);
	void Set_GetEchoLogs_3(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_KillCreature(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_GetEchoLogs_1(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OnDialogSequenceFinished_10();
	void OnDialogSequenceFinished_11();
	void OnDialogSequenceFinished_12();
	void OnDialogSequenceFinished_13();
	void OnDialogSequenceFinished_14();
	void OnDialogSequenceFinished_15();
	void OnDialogSequenceFinished_16();
	void OnDialogSequenceFinished_17();
	void OnDialogSequenceFinished_18();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_BetterTimes_C">();
	}
	static class UMission_BetterTimes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_BetterTimes_C>();
	}
};
static_assert(alignof(UMission_BetterTimes_C) == 0x000008, "Wrong alignment on UMission_BetterTimes_C");
static_assert(sizeof(UMission_BetterTimes_C) == 0x000650, "Wrong size on UMission_BetterTimes_C");
static_assert(offsetof(UMission_BetterTimes_C, UberGraphFrame_Mission_BetterTimes_C) == 0x000510, "Member 'UMission_BetterTimes_C::UberGraphFrame_Mission_BetterTimes_C' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_LaunchRocket_ObjSetVar) == 0x000518, "Member 'UMission_BetterTimes_C::Set_LaunchRocket_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_LaunchRocket_ObjVar) == 0x000520, "Member 'UMission_BetterTimes_C::Obj_LaunchRocket_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_GetRocketParts_ObjSetVar) == 0x000528, "Member 'UMission_BetterTimes_C::Set_GetRocketParts_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_GetRocketParts_ObjVar) == 0x000530, "Member 'UMission_BetterTimes_C::Obj_GetRocketParts_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_GoToOldBase_1_ObjSetVar) == 0x000538, "Member 'UMission_BetterTimes_C::Set_GoToOldBase_1_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_GoToOldBase_ObjVar) == 0x000540, "Member 'UMission_BetterTimes_C::Obj_GoToOldBase_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_KillCreature_ObjVar) == 0x000548, "Member 'UMission_BetterTimes_C::Obj_KillCreature_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_ClearOldBase_ObjVar) == 0x000550, "Member 'UMission_BetterTimes_C::Obj_ClearOldBase_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_AssembleRocket_1_ObjSetVar) == 0x000558, "Member 'UMission_BetterTimes_C::Set_AssembleRocket_1_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_AssembleRocket_ObjVar) == 0x000560, "Member 'UMission_BetterTimes_C::Obj_AssembleRocket_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_PlaceEchoLogs_ObjSetVar) == 0x000568, "Member 'UMission_BetterTimes_C::Set_PlaceEchoLogs_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_PlaceEchoLogs_ObjVar) == 0x000570, "Member 'UMission_BetterTimes_C::Obj_PlaceEchoLogs_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_GetEchoLogs_ObjVar) == 0x000578, "Member 'UMission_BetterTimes_C::Obj_GetEchoLogs_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_GetEchoLogs_1_ObjSetVar) == 0x000580, "Member 'UMission_BetterTimes_C::Set_GetEchoLogs_1_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_KillCreature_ObjSetVar) == 0x000588, "Member 'UMission_BetterTimes_C::Set_KillCreature_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_GetEchoLogs_3_ObjSetVar) == 0x000590, "Member 'UMission_BetterTimes_C::Set_GetEchoLogs_3_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_INV_GetEchoLog_Second_ObjVar) == 0x000598, "Member 'UMission_BetterTimes_C::Obj_INV_GetEchoLog_Second_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_ShootEchoLog_Second_ObjVar) == 0x0005A0, "Member 'UMission_BetterTimes_C::Obj_ShootEchoLog_Second_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_ShootEchoLog_Second_ObjSetVar) == 0x0005A8, "Member 'UMission_BetterTimes_C::Set_ShootEchoLog_Second_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, SET_PlaceDetonator_ObjSetVar) == 0x0005B0, "Member 'UMission_BetterTimes_C::SET_PlaceDetonator_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_PlaceDetonator_ObjVar) == 0x0005B8, "Member 'UMission_BetterTimes_C::Obj_PlaceDetonator_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_GetDetonator_ObjSetVar) == 0x0005C0, "Member 'UMission_BetterTimes_C::Set_GetDetonator_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_GetDetonator_ObjVar) == 0x0005C8, "Member 'UMission_BetterTimes_C::Obj_GetDetonator_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, OldBaseSpawnerClearedNum) == 0x0005D0, "Member 'UMission_BetterTimes_C::OldBaseSpawnerClearedNum' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_GetEchoLog_Second_ObjSetVar) == 0x0005D8, "Member 'UMission_BetterTimes_C::Set_GetEchoLog_Second_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_INV_GetEchoLog_First_ObjVar) == 0x0005E0, "Member 'UMission_BetterTimes_C::Obj_INV_GetEchoLog_First_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_INV_AssembleRocket_Piece1_ObjVar) == 0x0005E8, "Member 'UMission_BetterTimes_C::Obj_INV_AssembleRocket_Piece1_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_AssembleRocket_2_ObjSetVar) == 0x0005F0, "Member 'UMission_BetterTimes_C::Set_AssembleRocket_2_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_AssembleRocket_3_ObjSetVar) == 0x0005F8, "Member 'UMission_BetterTimes_C::Set_AssembleRocket_3_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_INV_AssembleRocket_Piece2_ObjVar) == 0x000600, "Member 'UMission_BetterTimes_C::Obj_INV_AssembleRocket_Piece2_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_INV_AssembleRocket_Piece3_ObjVar) == 0x000608, "Member 'UMission_BetterTimes_C::Obj_INV_AssembleRocket_Piece3_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_INV_GetEchoLog_Third_ObjVar) == 0x000610, "Member 'UMission_BetterTimes_C::Obj_INV_GetEchoLog_Third_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_ClearOldBase_ObjSetVar) == 0x000618, "Member 'UMission_BetterTimes_C::Set_ClearOldBase_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_INV_ClearOldBase_BC1_ObjVar) == 0x000620, "Member 'UMission_BetterTimes_C::Obj_INV_ClearOldBase_BC1_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_INV_ClearOldBase_BC2_ObjVar) == 0x000628, "Member 'UMission_BetterTimes_C::Obj_INV_ClearOldBase_BC2_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_GoToBeach_ObjVar) == 0x000630, "Member 'UMission_BetterTimes_C::Obj_GoToBeach_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_INV_WhereIsThirdEchoLog_ObjVar) == 0x000638, "Member 'UMission_BetterTimes_C::Obj_INV_WhereIsThirdEchoLog_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Set_TalkToSparrow_ObjSetVar) == 0x000640, "Member 'UMission_BetterTimes_C::Set_TalkToSparrow_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BetterTimes_C, Obj_TalkToSparrow_ObjVar) == 0x000648, "Member 'UMission_BetterTimes_C::Obj_TalkToSparrow_ObjVar' has a wrong offset!");

}

