#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_Canonization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_Canonization.Mission_Canonization_C
// 0x00E0 (0x05F0 - 0x0510)
class UMission_Canonization_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_Canonization_C;             // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_GetTrap_Empty_ObjSetVar;                       // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTrap_Empty_ObjVar;                          // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GoToTemple_ObjSetVar;                          // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToTemple_ObjVar;                             // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlaceTrap_ObjSetVar;                           // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceTrap_ObjVar;                              // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_FillTrap_ObjSetVar;                            // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GetWeaponParts_ObjSetVar;                      // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_ReturnToResearchCenter_ObjSetVar;              // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ReturnToResearchCenter_ObjVar;                 // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlaceWeaponParts_ObjSetVar;                    // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceWeaponParts_ObjVar;                       // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceEnergySinkInWeapon_ObjVar;                // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FillTrap_ObjVar;                               // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_DestroyCyclone_ObjVar;                         // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlaceEnergySinkInWeapon_ObjSetVar;             // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GetTrap_Full_ObjSetVar;                        // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetTrap_Full_ObjVar;                           // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_LootCyclone_ObjVar;                            // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      INV_CannonWarmupComplete_ObjVar;                   // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_DestroyOutrunner_ObjVar;                       // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_LootOutrunner_ObjVar;                          // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WeaponPartsLooted;                                 // 0x05C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjectiveSet*                   Set_GetWeapon_ObjSetVar;                           // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetWeapon_ObjVar;                              // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_BackUp_ObjVar;                                 // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_BackUp_ObjSetVar;                              // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_Canonization(int32 EntryPoint);
	void MCE_FiledEnergySink(class UObject* Context);
	void Set_GetTrap_Empty(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_GoToTemple(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_PlaceTrap(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_GrouseBackedUp(class UObject* Context);
	void Obj_FillTrap(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_DestroyCyclone(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_FillTrap(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_BackUp(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_GetWeaponParts(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_BackUp(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_ReturnToResearchCenter(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_PlaceWeaponParts(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_PlaceEnergySinkInWeapon(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PlacedEnergySinkInWeapon(class UObject* Context);
	void MCE_PlacedWeaponPart(class UObject* Context);
	void Obj_GoToTemple(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_ClosedTrap(class UObject* Context);
	void Obj_GetWeapon(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_GetWeapon(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_DestroyedOutrunner(class UObject* Context);
	void MCE_DestroyedCyclone(class UObject* Context);
	void MCE_GetWeaponParts_OnCompleted(class UObject* Context);
	void MCE_GetWeaponParts_CompleteLoad(class UObject* Context);
	void Obj_LootOutrunner(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_DestroyOutrunner(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_INV_WeaponWarmupComplete(class UObject* Context);
	void INV_CannonWarmupComplete(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_GetTrap_Empty(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_PlaceTrap(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_ReturnToResearchCenter(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_WentToTemple(class UObject* Context);
	void Obj_PlaceWeaponParts(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_PlaceEnergySinkInWeapon(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlacedEnergySink(class UObject* Context);
	void Obj_LootCyclone(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_GetTrap_Full(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GetTrap_Full(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_ReturnedToResearchCenter(class UObject* Context);
	void OnDialogSequenceFinished_9();
	void OnDialogSequenceFinished_10();
	void OnDialogSequenceFinished_11();
	void OnDialogSequenceFinished_12();
	void OnDialogSequenceFinished_13();
	void OnDialogSequenceFinished_14();
	void OnDialogSequenceFinished_15();
	void OnDialogSequenceFinished_16();
	void IsAllWeaponPartsLooted_(bool* Return_bool);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_Canonization_C">();
	}
	static class UMission_Canonization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_Canonization_C>();
	}
};
static_assert(alignof(UMission_Canonization_C) == 0x000008, "Wrong alignment on UMission_Canonization_C");
static_assert(sizeof(UMission_Canonization_C) == 0x0005F0, "Wrong size on UMission_Canonization_C");
static_assert(offsetof(UMission_Canonization_C, UberGraphFrame_Mission_Canonization_C) == 0x000510, "Member 'UMission_Canonization_C::UberGraphFrame_Mission_Canonization_C' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_GetTrap_Empty_ObjSetVar) == 0x000518, "Member 'UMission_Canonization_C::Set_GetTrap_Empty_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_GetTrap_Empty_ObjVar) == 0x000520, "Member 'UMission_Canonization_C::Obj_GetTrap_Empty_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_GoToTemple_ObjSetVar) == 0x000528, "Member 'UMission_Canonization_C::Set_GoToTemple_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_GoToTemple_ObjVar) == 0x000530, "Member 'UMission_Canonization_C::Obj_GoToTemple_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_PlaceTrap_ObjSetVar) == 0x000538, "Member 'UMission_Canonization_C::Set_PlaceTrap_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_PlaceTrap_ObjVar) == 0x000540, "Member 'UMission_Canonization_C::Obj_PlaceTrap_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_FillTrap_ObjSetVar) == 0x000548, "Member 'UMission_Canonization_C::Set_FillTrap_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_GetWeaponParts_ObjSetVar) == 0x000550, "Member 'UMission_Canonization_C::Set_GetWeaponParts_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_ReturnToResearchCenter_ObjSetVar) == 0x000558, "Member 'UMission_Canonization_C::Set_ReturnToResearchCenter_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_ReturnToResearchCenter_ObjVar) == 0x000560, "Member 'UMission_Canonization_C::Obj_ReturnToResearchCenter_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_PlaceWeaponParts_ObjSetVar) == 0x000568, "Member 'UMission_Canonization_C::Set_PlaceWeaponParts_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_PlaceWeaponParts_ObjVar) == 0x000570, "Member 'UMission_Canonization_C::Obj_PlaceWeaponParts_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_PlaceEnergySinkInWeapon_ObjVar) == 0x000578, "Member 'UMission_Canonization_C::Obj_PlaceEnergySinkInWeapon_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_FillTrap_ObjVar) == 0x000580, "Member 'UMission_Canonization_C::Obj_FillTrap_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_DestroyCyclone_ObjVar) == 0x000588, "Member 'UMission_Canonization_C::Obj_DestroyCyclone_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_PlaceEnergySinkInWeapon_ObjSetVar) == 0x000590, "Member 'UMission_Canonization_C::Set_PlaceEnergySinkInWeapon_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_GetTrap_Full_ObjSetVar) == 0x000598, "Member 'UMission_Canonization_C::Set_GetTrap_Full_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_GetTrap_Full_ObjVar) == 0x0005A0, "Member 'UMission_Canonization_C::Obj_GetTrap_Full_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_LootCyclone_ObjVar) == 0x0005A8, "Member 'UMission_Canonization_C::Obj_LootCyclone_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, INV_CannonWarmupComplete_ObjVar) == 0x0005B0, "Member 'UMission_Canonization_C::INV_CannonWarmupComplete_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_DestroyOutrunner_ObjVar) == 0x0005B8, "Member 'UMission_Canonization_C::Obj_DestroyOutrunner_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_LootOutrunner_ObjVar) == 0x0005C0, "Member 'UMission_Canonization_C::Obj_LootOutrunner_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, WeaponPartsLooted) == 0x0005C8, "Member 'UMission_Canonization_C::WeaponPartsLooted' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_GetWeapon_ObjSetVar) == 0x0005D0, "Member 'UMission_Canonization_C::Set_GetWeapon_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_GetWeapon_ObjVar) == 0x0005D8, "Member 'UMission_Canonization_C::Obj_GetWeapon_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Obj_BackUp_ObjVar) == 0x0005E0, "Member 'UMission_Canonization_C::Obj_BackUp_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Canonization_C, Set_BackUp_ObjSetVar) == 0x0005E8, "Member 'UMission_Canonization_C::Set_BackUp_ObjSetVar' has a wrong offset!");

}

