#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_DynastyDash_Desert_Repeatable

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function Mission_DynastyDash_Desert_Repeatable.Mission_DynastyDash_Desert_Repeatable_C.ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable
// 0x16B8 (0x16B8 - 0x0000)
struct Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0220(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0238(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0450(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0468(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x0680(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_692[0x6];                                      // 0x0692(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0698(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x08B0(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x0AC8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x0AD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x0AD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD9[0x3];                                      // 0x0AD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x0ADC(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x0AEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x0AED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0AEE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AEF[0x1];                                      // 0x0AEF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AF0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0D08(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x0F20(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x0F2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x0F30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0F31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0F32(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x0F33(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0F34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F35[0x3];                                      // 0x0F35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x0F38(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x1150(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x115C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x1160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x1161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1162[0x2];                                     // 0x1162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation7;                // 0x1164(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID7;                  // 0x1170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue7;                 // 0x1174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x1175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1176[0x2];                                     // 0x1176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x1178(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue9;            // 0x1390(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation8;                // 0x15A8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID8;                  // 0x15B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue8;                 // 0x15B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15B9[0x3];                                     // 0x15B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation9;                // 0x15BC(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID9;                  // 0x15C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue9;                 // 0x15CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x15CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x15CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15CF[0x1];                                     // 0x15CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x15D0(0x0010)(ZeroConstructor, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent6;      // 0x15E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E1[0x3];                                     // 0x15E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount6;      // 0x15E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x15E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2; // 0x15E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1; // 0x15EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent5;      // 0x15EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount5;      // 0x15EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context4;         // 0x15F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x15F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent; // 0x15F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent4;      // 0x15FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15FB[0x1];                                     // 0x15FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount4;      // 0x15FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent3;      // 0x1600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1601[0x3];                                     // 0x1601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount3;      // 0x1604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x1608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x1609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent2;      // 0x160A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_160B[0x1];                                     // 0x160B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount2;      // 0x160C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x1610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1611[0x7];                                     // 0x1611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context3;         // 0x1618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent1;      // 0x1620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1621[0x3];                                     // 0x1621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount1;      // 0x1624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x1628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1629[0x7];                                     // 0x1629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context2;         // 0x1630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context1;         // 0x1638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMissionRemainingSeconds_ReturnValue;   // 0x1640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue;           // 0x1644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent;       // 0x1645(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1646[0x2];                                     // 0x1646(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount;       // 0x1648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164C[0x4];                                     // 0x164C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context;          // 0x1650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x1658(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x1668(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x1678(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x1688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x168C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_168D[0x3];                                     // 0x168D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x1690(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x16A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue1;          // 0x16B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable) == 0x000008, "Wrong alignment on Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable");
static_assert(sizeof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable) == 0x0016B8, "Wrong size on Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, EntryPoint) == 0x000000, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation) == 0x000220, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID) == 0x00022C, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue) == 0x000230, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue) == 0x000231, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue1) == 0x000238, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation1) == 0x000450, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID1) == 0x00045C, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue1) == 0x000460, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000461, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue2) == 0x000468, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation2) == 0x000680, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID2) == 0x00068C, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue2) == 0x000690, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue2) == 0x000691, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue3) == 0x000698, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue4) == 0x0008B0, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation3) == 0x000AC8, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation3' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID3) == 0x000AD4, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID3' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue3) == 0x000AD8, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation4) == 0x000ADC, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation4' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID4) == 0x000AE8, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID4' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue4) == 0x000AEC, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue3) == 0x000AED, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue4) == 0x000AEE, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue5) == 0x000AF0, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue6) == 0x000D08, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation5) == 0x000F20, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation5' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID5) == 0x000F2C, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID5' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue5) == 0x000F30, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue5) == 0x000F31, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000F32, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_GreaterEqual_IntInt_ReturnValue1) == 0x000F33, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_GreaterEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x000F34, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue7) == 0x000F38, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation6) == 0x001150, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation6' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID6) == 0x00115C, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID6' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue6) == 0x001160, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue6) == 0x001161, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation7) == 0x001164, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation7' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID7) == 0x001170, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID7' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue7) == 0x001174, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue7) == 0x001175, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue8) == 0x001178, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_NewDialogContext_ReturnValue9) == 0x001390, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_NewDialogContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation8) == 0x0015A8, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation8' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID8) == 0x0015B4, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID8' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue8) == 0x0015B8, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_Conversation9) == 0x0015BC, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_Conversation9' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_SequenceID9) == 0x0015C8, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_SequenceID9' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_FinishSpeak_ReturnValue9) == 0x0015CC, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_FinishSpeak_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue8) == 0x0015CD, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_Conv_IntToBool_ReturnValue9) == 0x0015CE, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_Conv_IntToBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_CreateDelegate_OutputDelegate) == 0x0015D0, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveEvent6) == 0x0015E0, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveEvent6' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveCount6) == 0x0015E4, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveCount6' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_SwitchEnum_CmpSuccess) == 0x0015E8, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2) == 0x0015E9, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1) == 0x0015EA, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveEvent5) == 0x0015EB, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveEvent5' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveCount5) == 0x0015EC, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveCount5' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_MissionCustomEvent_Context4) == 0x0015F0, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_MissionCustomEvent_Context4' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_SwitchEnum1_CmpSuccess) == 0x0015F8, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent) == 0x0015F9, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveEvent4) == 0x0015FA, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveEvent4' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveCount4) == 0x0015FC, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveCount4' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveEvent3) == 0x001600, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveEvent3' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveCount3) == 0x001604, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveCount3' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_SwitchEnum2_CmpSuccess) == 0x001608, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_SwitchEnum3_CmpSuccess) == 0x001609, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveEvent2) == 0x00160A, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveEvent2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveCount2) == 0x00160C, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveCount2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_SwitchEnum4_CmpSuccess) == 0x001610, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_SwitchEnum4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_MissionCustomEvent_Context3) == 0x001618, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_MissionCustomEvent_Context3' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveEvent1) == 0x001620, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveEvent1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveCount1) == 0x001624, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveCount1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_SwitchEnum5_CmpSuccess) == 0x001628, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_SwitchEnum5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_MissionCustomEvent_Context2) == 0x001630, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_MissionCustomEvent_Context2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_MissionCustomEvent_Context1) == 0x001638, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_MissionCustomEvent_Context1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_GetMissionRemainingSeconds_ReturnValue) == 0x001640, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_GetMissionRemainingSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_MissionRemoteEvent_ReturnValue) == 0x001644, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_MissionRemoteEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveEvent) == 0x001645, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_ObjectiveEvent_ObjectiveCount) == 0x001648, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_ObjectiveEvent_ObjectiveCount' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, MissionK2Node_MissionCustomEvent_Context) == 0x001650, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::MissionK2Node_MissionCustomEvent_Context' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_CreateDelegate_OutputDelegate1) == 0x001658, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_CreateDelegate_OutputDelegate2) == 0x001668, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_CreateDelegate_OutputDelegate3) == 0x001678, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_RandomInteger_ReturnValue) == 0x001688, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00168C, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_CreateDelegate_OutputDelegate4) == 0x001690, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, K2Node_CreateDelegate_OutputDelegate5) == 0x0016A0, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable, CallFunc_MissionRemoteEvent_ReturnValue1) == 0x0016B0, "Member 'Mission_DynastyDash_Desert_Repeatable_C_ExecuteUbergraph_Mission_DynastyDash_Desert_Repeatable::CallFunc_MissionRemoteEvent_ReturnValue1' has a wrong offset!");

// Function Mission_DynastyDash_Desert_Repeatable.Mission_DynastyDash_Desert_Repeatable_C.MCE_ShotSign
// 0x0008 (0x0008 - 0x0000)
struct Mission_DynastyDash_Desert_Repeatable_C_MCE_ShotSign final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_DynastyDash_Desert_Repeatable_C_MCE_ShotSign) == 0x000008, "Wrong alignment on Mission_DynastyDash_Desert_Repeatable_C_MCE_ShotSign");
static_assert(sizeof(Mission_DynastyDash_Desert_Repeatable_C_MCE_ShotSign) == 0x000008, "Wrong size on Mission_DynastyDash_Desert_Repeatable_C_MCE_ShotSign");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_MCE_ShotSign, Context) == 0x000000, "Member 'Mission_DynastyDash_Desert_Repeatable_C_MCE_ShotSign::Context' has a wrong offset!");

// Function Mission_DynastyDash_Desert_Repeatable.Mission_DynastyDash_Desert_Repeatable_C.OBJ_SignTest
// 0x0008 (0x0008 - 0x0000)
struct Mission_DynastyDash_Desert_Repeatable_C_OBJ_SignTest final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_SignTest) == 0x000004, "Wrong alignment on Mission_DynastyDash_Desert_Repeatable_C_OBJ_SignTest");
static_assert(sizeof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_SignTest) == 0x000008, "Wrong size on Mission_DynastyDash_Desert_Repeatable_C_OBJ_SignTest");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_SignTest, ObjectiveEvent) == 0x000000, "Member 'Mission_DynastyDash_Desert_Repeatable_C_OBJ_SignTest::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_SignTest, ObjectiveCount) == 0x000004, "Member 'Mission_DynastyDash_Desert_Repeatable_C_OBJ_SignTest::ObjectiveCount' has a wrong offset!");

// Function Mission_DynastyDash_Desert_Repeatable.Mission_DynastyDash_Desert_Repeatable_C.MCE_DetermineResults
// 0x0008 (0x0008 - 0x0000)
struct Mission_DynastyDash_Desert_Repeatable_C_MCE_DetermineResults final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_DynastyDash_Desert_Repeatable_C_MCE_DetermineResults) == 0x000008, "Wrong alignment on Mission_DynastyDash_Desert_Repeatable_C_MCE_DetermineResults");
static_assert(sizeof(Mission_DynastyDash_Desert_Repeatable_C_MCE_DetermineResults) == 0x000008, "Wrong size on Mission_DynastyDash_Desert_Repeatable_C_MCE_DetermineResults");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_MCE_DetermineResults, Context) == 0x000000, "Member 'Mission_DynastyDash_Desert_Repeatable_C_MCE_DetermineResults::Context' has a wrong offset!");

// Function Mission_DynastyDash_Desert_Repeatable.Mission_DynastyDash_Desert_Repeatable_C.MCE_ReturnToStart
// 0x0008 (0x0008 - 0x0000)
struct Mission_DynastyDash_Desert_Repeatable_C_MCE_ReturnToStart final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_DynastyDash_Desert_Repeatable_C_MCE_ReturnToStart) == 0x000008, "Wrong alignment on Mission_DynastyDash_Desert_Repeatable_C_MCE_ReturnToStart");
static_assert(sizeof(Mission_DynastyDash_Desert_Repeatable_C_MCE_ReturnToStart) == 0x000008, "Wrong size on Mission_DynastyDash_Desert_Repeatable_C_MCE_ReturnToStart");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_MCE_ReturnToStart, Context) == 0x000000, "Member 'Mission_DynastyDash_Desert_Repeatable_C_MCE_ReturnToStart::Context' has a wrong offset!");

// Function Mission_DynastyDash_Desert_Repeatable.Mission_DynastyDash_Desert_Repeatable_C.OBJ_ReturnToStart
// 0x0008 (0x0008 - 0x0000)
struct Mission_DynastyDash_Desert_Repeatable_C_OBJ_ReturnToStart final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_ReturnToStart) == 0x000004, "Wrong alignment on Mission_DynastyDash_Desert_Repeatable_C_OBJ_ReturnToStart");
static_assert(sizeof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_ReturnToStart) == 0x000008, "Wrong size on Mission_DynastyDash_Desert_Repeatable_C_OBJ_ReturnToStart");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_ReturnToStart, ObjectiveEvent) == 0x000000, "Member 'Mission_DynastyDash_Desert_Repeatable_C_OBJ_ReturnToStart::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_ReturnToStart, ObjectiveCount) == 0x000004, "Member 'Mission_DynastyDash_Desert_Repeatable_C_OBJ_ReturnToStart::ObjectiveCount' has a wrong offset!");

// Function Mission_DynastyDash_Desert_Repeatable.Mission_DynastyDash_Desert_Repeatable_C.MCE_AcquireBurgers
// 0x0008 (0x0008 - 0x0000)
struct Mission_DynastyDash_Desert_Repeatable_C_MCE_AcquireBurgers final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_DynastyDash_Desert_Repeatable_C_MCE_AcquireBurgers) == 0x000008, "Wrong alignment on Mission_DynastyDash_Desert_Repeatable_C_MCE_AcquireBurgers");
static_assert(sizeof(Mission_DynastyDash_Desert_Repeatable_C_MCE_AcquireBurgers) == 0x000008, "Wrong size on Mission_DynastyDash_Desert_Repeatable_C_MCE_AcquireBurgers");
static_assert(offsetof(Mission_DynastyDash_Desert_Repeatable_C_MCE_AcquireBurgers, Context) == 0x000000, "Member 'Mission_DynastyDash_Desert_Repeatable_C_MCE_AcquireBurgers::Context' has a wrong offset!");

// Function Mission_DynastyDash_Desert_Repeatable.Mission_DynastyDash_Desert_Repeatable_C.OBJ_CompleteDeliverySlow
// 0x0008 (0x0008 - 0x0000)
struct Mission_DynastyDash_Desert_Repeatable_C_OBJ_CompleteDeliverySlow final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_CompleteDeliverySlow) == 0x000004, "Wrong alignment on Mission_DynastyDash_Desert_Repeatable_C_OBJ_CompleteDeliverySlow");
static_assert(sizeof(Mission_DynastyDash_Desert_Repeatable_C_OBJ_CompleteDeliverySlow) == 0x000008, "Wrong size on Mission_DynastyDash_Desert_Repeatable_C_OBJ_CompleteDeliverySlow");
