#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_Ep23_TyreenFinalBoss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_Ep23_TyreenFinalBoss.Mission_Ep23_TyreenFinalBoss_C
// 0x0120 (0x0630 - 0x0510)
class UMission_Ep23_TyreenFinalBoss_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_Ep23_TyreenFinalBoss_C;     // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_KillTyreen_ObjSetVar;                          // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillTyreen_ObjVar;                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_EnterPortalToPandora_ObjSetVar;                // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_EnterPortalToPandora_ObjVar;                   // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TalkToLilithGameOver_ObjSetVar;                // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TalkToLilithGameOver_ObjVar;                   // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_EndGameCinematic_ObjSetVar;                    // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_EndGameCinematic_ObjVar;                       // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TyreenTitleCard_ObjSetVar;                     // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TyreenTitleCard_ObjVar;                        // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_FindTyreen_ObjSetVar;                          // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FindTyreen_ObjVar;                             // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_LootVault_ObjSetVar;                           // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_LootVault_ObjVar;                              // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_Breadcrumb01_ObjVar;                           // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_Breadcrumb02_ObjVar;                           // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_Breadcrumb03_ObjVar;                           // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TalkToTannisGameOver_ObjSetVar;                // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TalkToTannisGameOver_ObjVar;                   // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GetVaultKey_ObjVar;                            // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_ReturnToSanctuary_ObjSetVar;                   // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ReturnToSanctuary_ObjVar;                      // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_OpenEridianChest_ObjVar;                       // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_OpenEridianChest_ObjSetVar;                    // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TalkToTannisAgain_ObjSetVar;                   // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TalkToTannisAgain_ObjVar;                      // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlaceArtifact_ObjSetVar;                       // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PlaceArtifact_ObjVar;                          // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_ShowCredits_ObjSetVar;                         // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ShowCredits_ObjVar;                            // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_LeaveVault_ObjVar;                             // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_EnterVault_ObjVar;                             // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_TyreenDeadCine_ObjSetVar;                      // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TyreenDeadCine_ObjVar;                         // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToLilithsRoom_ObjVar;                        // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_Ep23_TyreenFinalBoss(int32 EntryPoint);
	void Update_Portal_Entered(class UObject* Context);
	void Obj_KillTyreen(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_GoToLilithsRoom(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_GoToLilithsRoom(class UObject* Context);
	void Set_KillTyreen(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_TalkToLilithGameOver(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_TyreenDeadCine(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_TyreenDeadCine(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_TalkToLilithGameOver(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void PlayersOutsideVault(class UObject* Context);
	void PlayersInsideVault(class UObject* Context);
	void Obj_EnterVault(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_LeaveVault(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_EndGameCinematic(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void AdvanceTo_LootVault(class UObject* Context);
	void Obj_EndGameCinematic(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void AdvanceTo_EndGameCinematic(class UObject* Context);
	void Update_ShowCredits(class UObject* Context);
	void Obj_ShowCredits(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_ShowCredits(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void _Obj_TalkToTannisGameOver_Objective__PROXY();
	void Update_Play_Cinematic(class UObject* Context);
	void Update_UseMayhemDevice(class UObject* Context);
	void Obj_PlaceArtifact(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_PlaceArtifact(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_TalkToTannisAgain(class UObject* Context);
	void Obj_TalkToTannisAgain(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_TalkToTannisAgain(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void AdvanceTo_OpenEridianChest(class UObject* Context);
	void Set_TyreenTitleCard(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_OpenEridianChest(class UObject* Context);
	void Set_OpenEridianChest(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_OpenEridianChest(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_TyreenTitleCard(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_ReturnToSanctuary(class UObject* Context);
	void OBJ_ReturnToSanctuary(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_ReturnToSanctuary(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GetVaultKey(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_Talked_To_Lilith_Game_Over(class UObject* Context);
	void MissionKickoff();
	void Update_Talked_To_Tannis_Game_Over(class UObject* Context);
	void Set_TalkToTannisGameOver(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_TalkToTannisGameOver(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_Breadcrumb03(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_Breadcrumb03(class UObject* Context);
	void Obj_Breadcrumb02(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_Breadcrumb02(class UObject* Context);
	void Obj_Breadcrumb01(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_Breadcrumb01(class UObject* Context);
	void Update_Loot_Vault(class UObject* Context);
	void Set_EnterPortalToPandora(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_LootVault(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_LootVault(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_EnterPortalToPandora(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_Final_Boss_Map_Entered(class UObject* Context);
	void Obj_FindTyreen(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_FindTyreen(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OnDialogSequenceFinished_10();
	void OnDialogSequenceFinished_11();
	void OnDialogSequenceFinished_12();
	void OnDialogSequenceFinished_7();
	void OnDialogSequenceFinished_8();
	void OnDialogSequenceFinished_9();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_Ep23_TyreenFinalBoss_C">();
	}
	static class UMission_Ep23_TyreenFinalBoss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_Ep23_TyreenFinalBoss_C>();
	}
};
static_assert(alignof(UMission_Ep23_TyreenFinalBoss_C) == 0x000008, "Wrong alignment on UMission_Ep23_TyreenFinalBoss_C");
static_assert(sizeof(UMission_Ep23_TyreenFinalBoss_C) == 0x000630, "Wrong size on UMission_Ep23_TyreenFinalBoss_C");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, UberGraphFrame_Mission_Ep23_TyreenFinalBoss_C) == 0x000510, "Member 'UMission_Ep23_TyreenFinalBoss_C::UberGraphFrame_Mission_Ep23_TyreenFinalBoss_C' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_KillTyreen_ObjSetVar) == 0x000518, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_KillTyreen_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_KillTyreen_ObjVar) == 0x000520, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_KillTyreen_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_EnterPortalToPandora_ObjSetVar) == 0x000528, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_EnterPortalToPandora_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_EnterPortalToPandora_ObjVar) == 0x000530, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_EnterPortalToPandora_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_TalkToLilithGameOver_ObjSetVar) == 0x000538, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_TalkToLilithGameOver_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_TalkToLilithGameOver_ObjVar) == 0x000540, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_TalkToLilithGameOver_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_EndGameCinematic_ObjSetVar) == 0x000548, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_EndGameCinematic_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_EndGameCinematic_ObjVar) == 0x000550, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_EndGameCinematic_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_TyreenTitleCard_ObjSetVar) == 0x000558, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_TyreenTitleCard_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_TyreenTitleCard_ObjVar) == 0x000560, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_TyreenTitleCard_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_FindTyreen_ObjSetVar) == 0x000568, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_FindTyreen_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_FindTyreen_ObjVar) == 0x000570, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_FindTyreen_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_LootVault_ObjSetVar) == 0x000578, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_LootVault_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_LootVault_ObjVar) == 0x000580, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_LootVault_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_Breadcrumb01_ObjVar) == 0x000588, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_Breadcrumb01_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_Breadcrumb02_ObjVar) == 0x000590, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_Breadcrumb02_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_Breadcrumb03_ObjVar) == 0x000598, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_Breadcrumb03_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_TalkToTannisGameOver_ObjSetVar) == 0x0005A0, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_TalkToTannisGameOver_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_TalkToTannisGameOver_ObjVar) == 0x0005A8, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_TalkToTannisGameOver_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_GetVaultKey_ObjVar) == 0x0005B0, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_GetVaultKey_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_ReturnToSanctuary_ObjSetVar) == 0x0005B8, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_ReturnToSanctuary_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, OBJ_ReturnToSanctuary_ObjVar) == 0x0005C0, "Member 'UMission_Ep23_TyreenFinalBoss_C::OBJ_ReturnToSanctuary_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_OpenEridianChest_ObjVar) == 0x0005C8, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_OpenEridianChest_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_OpenEridianChest_ObjSetVar) == 0x0005D0, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_OpenEridianChest_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_TalkToTannisAgain_ObjSetVar) == 0x0005D8, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_TalkToTannisAgain_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_TalkToTannisAgain_ObjVar) == 0x0005E0, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_TalkToTannisAgain_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_PlaceArtifact_ObjSetVar) == 0x0005E8, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_PlaceArtifact_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_PlaceArtifact_ObjVar) == 0x0005F0, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_PlaceArtifact_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_ShowCredits_ObjSetVar) == 0x0005F8, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_ShowCredits_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_ShowCredits_ObjVar) == 0x000600, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_ShowCredits_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_LeaveVault_ObjVar) == 0x000608, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_LeaveVault_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_EnterVault_ObjVar) == 0x000610, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_EnterVault_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Set_TyreenDeadCine_ObjSetVar) == 0x000618, "Member 'UMission_Ep23_TyreenFinalBoss_C::Set_TyreenDeadCine_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_TyreenDeadCine_ObjVar) == 0x000620, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_TyreenDeadCine_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ep23_TyreenFinalBoss_C, Obj_GoToLilithsRoom_ObjVar) == 0x000628, "Member 'UMission_Ep23_TyreenFinalBoss_C::Obj_GoToLilithsRoom_ObjVar' has a wrong offset!");

}

