#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_GearUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_GearUp.Mission_GearUp_C
// 0x0068 (0x0578 - 0x0510)
class UMission_GearUp_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_GearUp_C;                   // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_RunStart_ObjSetVar;                            // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_RunStart_ObjVar;                               // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_KillBoss_ObjSetVar;                            // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillBoss_ObjVar;                               // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_CircleMoveStop_ObjSetVar;                      // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_StartCountdown_INV_ObjVar;                     // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_OpenAllWindows_ObjVar;                         // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_CircleMoveStop_AndBoss_ObjSetVar;              // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_CircleMove_2_ObjVar;                           // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_CircleStop_2_ObjVar;                           // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillBoss_BC_ObjVar;                            // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_BossFightStart_ObjVar;                         // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_GearUp(int32 EntryPoint);
	void _Obj_CircleStop_2_Objective__PROXY_3();
	void _Obj_CircleMove_2_Objective__PROXY_2();
	void Obj_RunStart(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_AdvanceToKillBossSet(class UObject* Context);
	void MCE_ActivateMission_Remote(class UObject* Context);
	void MCE_Update_RunStart(class UObject* Context);
	void Set_KillBoss(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_KillBoss(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_Update_KillBoss(class UObject* Context);
	void _Obj_KillBoss_Objective__PROXY_1();
	void MCE_Audio_RevenantSpawn(class UObject* Context);
	void _Obj_BossFightStart_Objective__PROXY_0();
	void MCE_Update_BossFightStart(class UObject* Context);
	void Obj_BossFightStart(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_BossFightStart_Objective__PROXY();
	void Set_CircleMoveStop(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_Update_KillBoss_BC(class UObject* Context);
	void Obj_KillBoss_BC(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void AdvanceToKillBossSet();
	void MCE_CompleteMission(class UObject* Context);
	void MCE_Update_CircleStop_2(class UObject* Context);
	void MCE_Update_CircleMove_2(class UObject* Context);
	void Obj_CircleStop_2(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_CircleMove_2(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_CircleMoveStop_AndBoss(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PrizeDoorOpen(class UObject* Context);
	void MCE_InterruptWelcomeBack(class UObject* Context);
	void MCE_RespawnStationUsed(class UObject* Context);
	void MCE_FailGearUpRun(class UObject* Context);
	void MCE_VO_RevenantAmbush(class UObject* Context);
	void MCE_VO_LootTrap(class UObject* Context);
	void MCE_AdvanceToMixedSet(class UObject* Context);
	void MCE_VO_OutsideCircle(class UObject* Context);
	void MCE_InterruptBanter(class UObject* Context);
	void MCE_VO_Airdrop(class UObject* Context);
	void MCE_VO_SponsorBanter(class UObject* Context);
	void Obj_StartCountdown_INV(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_VO_EarlyBanter(class UObject* Context);
	void MCE_Update_StartCountdown_INV(class UObject* Context);
	void MCE_VO_FinalCircleStop(class UObject* Context);
	void MCE_VO_APlayerDied(class UObject* Context);
	void MCE_VO_KilledBoss(class UObject* Context);
	void MCE_RespawnPlayers(class UObject* Context);
	void Set_RunStart(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_ResetMission(class UObject* Context);
	void MCE_VO_CircleStopping(class UObject* Context);
	void MCE_VO_CircleMoving(class UObject* Context);
	void MCE_VO_RunStart(class UObject* Context);
	void MCE_VO_EnterMap(class UObject* Context);
	void MCE_Update_OpenAllWindows(class UObject* Context);
	void Obj_OpenAllWindows(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_GearUp_C">();
	}
	static class UMission_GearUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_GearUp_C>();
	}
};
static_assert(alignof(UMission_GearUp_C) == 0x000008, "Wrong alignment on UMission_GearUp_C");
static_assert(sizeof(UMission_GearUp_C) == 0x000578, "Wrong size on UMission_GearUp_C");
static_assert(offsetof(UMission_GearUp_C, UberGraphFrame_Mission_GearUp_C) == 0x000510, "Member 'UMission_GearUp_C::UberGraphFrame_Mission_GearUp_C' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Set_RunStart_ObjSetVar) == 0x000518, "Member 'UMission_GearUp_C::Set_RunStart_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Obj_RunStart_ObjVar) == 0x000520, "Member 'UMission_GearUp_C::Obj_RunStart_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Set_KillBoss_ObjSetVar) == 0x000528, "Member 'UMission_GearUp_C::Set_KillBoss_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Obj_KillBoss_ObjVar) == 0x000530, "Member 'UMission_GearUp_C::Obj_KillBoss_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Set_CircleMoveStop_ObjSetVar) == 0x000538, "Member 'UMission_GearUp_C::Set_CircleMoveStop_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Obj_StartCountdown_INV_ObjVar) == 0x000540, "Member 'UMission_GearUp_C::Obj_StartCountdown_INV_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Obj_OpenAllWindows_ObjVar) == 0x000548, "Member 'UMission_GearUp_C::Obj_OpenAllWindows_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Set_CircleMoveStop_AndBoss_ObjSetVar) == 0x000550, "Member 'UMission_GearUp_C::Set_CircleMoveStop_AndBoss_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Obj_CircleMove_2_ObjVar) == 0x000558, "Member 'UMission_GearUp_C::Obj_CircleMove_2_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Obj_CircleStop_2_ObjVar) == 0x000560, "Member 'UMission_GearUp_C::Obj_CircleStop_2_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Obj_KillBoss_BC_ObjVar) == 0x000568, "Member 'UMission_GearUp_C::Obj_KillBoss_BC_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_GearUp_C, Obj_BossFightStart_ObjVar) == 0x000570, "Member 'UMission_GearUp_C::Obj_BossFightStart_ObjVar' has a wrong offset!");

}

