#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_Maurice

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function Mission_Maurice.Mission_Maurice_C.ExecuteUbergraph_Mission_Maurice
// 0x1AC0 (0x1AC0 - 0x0000)
struct Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0220(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0238(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0450(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0468(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x0684(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x0695(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_696[0x2];                                      // 0x0696(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0698(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x08B0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x08C8(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x0AE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE1[0x3];                                      // 0x0AE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x0AE4(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x0AF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x0AF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0AF5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF6[0x2];                                      // 0x0AF6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AF8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0D10(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x0F28(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x0F34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x0F38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F39[0x3];                                      // 0x0F39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x0F3C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x0F48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x0F4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0F4D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x0F4E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4F[0x1];                                      // 0x0F4F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x0F50(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation7;                // 0x1168(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID7;                  // 0x1174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue7;                 // 0x1178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x1179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_117A[0x6];                                     // 0x117A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x1180(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation8;                // 0x1398(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID8;                  // 0x13A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue8;                 // 0x13A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x13A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13AA[0x6];                                     // 0x13AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue9;            // 0x13B0(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation9;                // 0x15C8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID9;                  // 0x15D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue9;                 // 0x15D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x15D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15DA[0x6];                                     // 0x15DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x15E0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x15F0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x1600(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context26;        // 0x1610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent25;     // 0x1618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1619[0x3];                                     // 0x1619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount25;     // 0x161C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context25;        // 0x1620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent10; // 0x1628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent24;     // 0x1629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162A[0x2];                                     // 0x162A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount24;     // 0x162C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context24;        // 0x1630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x1638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent9; // 0x1639(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent23;     // 0x163A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163B[0x1];                                     // 0x163B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount23;     // 0x163C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context23;        // 0x1640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x1648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent22;     // 0x1649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164A[0x2];                                     // 0x164A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount22;     // 0x164C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent8; // 0x1650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent7; // 0x1651(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent6; // 0x1652(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent21;     // 0x1653(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount21;     // 0x1654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context22;        // 0x1658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x1660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent5; // 0x1661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent20;     // 0x1662(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1663[0x1];                                     // 0x1663(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount20;     // 0x1664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context21;        // 0x1668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x1670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1671[0x7];                                     // 0x1671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context20;        // 0x1678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent19;     // 0x1680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1681[0x3];                                     // 0x1681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount19;     // 0x1684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x1688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1689[0x7];                                     // 0x1689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context19;        // 0x1690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent18;     // 0x1698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1699[0x3];                                     // 0x1699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount18;     // 0x169C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context18;        // 0x16A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x16A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent17;     // 0x16A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16AA[0x2];                                     // 0x16AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount17;     // 0x16AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue;           // 0x16B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x16B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue; // 0x16B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent16;     // 0x16B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount16;     // 0x16B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x16B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent15;     // 0x16B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16BA[0x2];                                     // 0x16BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount15;     // 0x16BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context17;        // 0x16C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x16C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16C9[0x7];                                     // 0x16C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context16;        // 0x16D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue1;          // 0x16D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue1; // 0x16D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16DA[0x6];                                     // 0x16DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x16E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x16F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent14;     // 0x16F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16F2[0x2];                                     // 0x16F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount14;     // 0x16F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context15;        // 0x16F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent13;     // 0x1700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1701[0x3];                                     // 0x1701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount13;     // 0x1704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x1708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1709[0x7];                                     // 0x1709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context14;        // 0x1710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue2; // 0x1718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x1719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent12;     // 0x171A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171B[0x1];                                     // 0x171B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount12;     // 0x171C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context13;        // 0x1720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent11;     // 0x1728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1729[0x3];                                     // 0x1729(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount11;     // 0x172C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x1730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveStatus                       CallFunc_GetMissionObjectiveStatusRef_ReturnValue3; // 0x1731(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1732[0x6];                                     // 0x1732(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x1738(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum13_CmpSuccess;                    // 0x1748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1749[0x7];                                     // 0x1749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context12;        // 0x1750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent10;     // 0x1758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1759[0x3];                                     // 0x1759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount10;     // 0x175C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum14_CmpSuccess;                    // 0x1760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent9;      // 0x1761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1762[0x2];                                     // 0x1762(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount9;      // 0x1764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent8;      // 0x1768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1769[0x3];                                     // 0x1769(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount8;      // 0x176C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum15_CmpSuccess;                    // 0x1770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum16_CmpSuccess;                    // 0x1771(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent7;      // 0x1772(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1773[0x1];                                     // 0x1773(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount7;      // 0x1774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x1778(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum17_CmpSuccess;                    // 0x1788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1789[0x7];                                     // 0x1789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context11;        // 0x1790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue2;          // 0x1798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent6;      // 0x1799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179A[0x2];                                     // 0x179A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount6;      // 0x179C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context10;        // 0x17A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum18_CmpSuccess;                    // 0x17A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue3;          // 0x17A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent5;      // 0x17AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17AB[0x1];                                     // 0x17AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount5;      // 0x17AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context9;         // 0x17B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum19_CmpSuccess;                    // 0x17B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17B9[0x7];                                     // 0x17B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context8;         // 0x17C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context7;         // 0x17C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context6;         // 0x17D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent4;      // 0x17D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D9[0x3];                                     // 0x17D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount4;      // 0x17DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x17E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum20_CmpSuccess;                    // 0x17F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17F1[0x7];                                     // 0x17F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context5;         // 0x17F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context4;         // 0x1800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent3;      // 0x1808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1809[0x3];                                     // 0x1809(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount3;      // 0x180C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x1810(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum21_CmpSuccess;                    // 0x1820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent2;      // 0x1821(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1822[0x2];                                     // 0x1822(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount2;      // 0x1824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent1;      // 0x1828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1829[0x3];                                     // 0x1829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount1;      // 0x182C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum22_CmpSuccess;                    // 0x1830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum23_CmpSuccess;                    // 0x1831(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1832[0x6];                                     // 0x1832(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context3;         // 0x1838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context2;         // 0x1840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context1;         // 0x1848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent4; // 0x1850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent3; // 0x1851(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent;       // 0x1852(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1853[0x1];                                     // 0x1853(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount;       // 0x1854(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2; // 0x1858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum24_CmpSuccess;                    // 0x1859(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1; // 0x185A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent; // 0x185B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum25_CmpSuccess;                    // 0x185C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum26_CmpSuccess;                    // 0x185D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185E[0x2];                                     // 0x185E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context;          // 0x1860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x1868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x1870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x1878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue10;           // 0x1880(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation10;               // 0x1A98(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID10;                 // 0x1AA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue10;                // 0x1AA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue10;             // 0x1AA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AAA[0x6];                                     // 0x1AAA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x1AB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStatValue_ReturnValue;                 // 0x1AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x1ABC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice) == 0x000008, "Wrong alignment on Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice");
static_assert(sizeof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice) == 0x001AC0, "Wrong size on Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, EntryPoint) == 0x000000, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation) == 0x000220, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID) == 0x00022C, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue) == 0x000230, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue) == 0x000231, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue1) == 0x000238, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation1) == 0x000450, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation1' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID1) == 0x00045C, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID1' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue1) == 0x000460, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue2) == 0x000468, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000680, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation2) == 0x000684, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation2' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID2) == 0x000690, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID2' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue2) == 0x000694, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue2) == 0x000695, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue3) == 0x000698, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation3) == 0x0008B0, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation3' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID3) == 0x0008BC, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID3' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue3) == 0x0008C0, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue4) == 0x0008C8, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue3) == 0x000AE0, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation4) == 0x000AE4, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation4' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID4) == 0x000AF0, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID4' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue4) == 0x000AF4, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue4) == 0x000AF5, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue5) == 0x000AF8, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue6) == 0x000D10, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation5) == 0x000F28, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation5' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID5) == 0x000F34, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID5' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue5) == 0x000F38, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation6) == 0x000F3C, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation6' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID6) == 0x000F48, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID6' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue6) == 0x000F4C, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue5) == 0x000F4D, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue6) == 0x000F4E, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue7) == 0x000F50, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation7) == 0x001168, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation7' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID7) == 0x001174, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID7' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue7) == 0x001178, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue7) == 0x001179, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue8) == 0x001180, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation8) == 0x001398, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation8' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID8) == 0x0013A4, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID8' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue8) == 0x0013A8, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue8) == 0x0013A9, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_NewDialogContext_ReturnValue9) == 0x0013B0, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_NewDialogContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_Conversation9) == 0x0015C8, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_Conversation9' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_SequenceID9) == 0x0015D4, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_SequenceID9' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_FinishSpeak_ReturnValue9) == 0x0015D8, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_FinishSpeak_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, CallFunc_Conv_IntToBool_ReturnValue9) == 0x0015D9, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::CallFunc_Conv_IntToBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, K2Node_CreateDelegate_OutputDelegate) == 0x0015E0, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, K2Node_CreateDelegate_OutputDelegate1) == 0x0015F0, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, K2Node_CreateDelegate_OutputDelegate2) == 0x001600, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_MissionCustomEvent_Context26) == 0x001610, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_MissionCustomEvent_Context26' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveEvent_ObjectiveEvent25) == 0x001618, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveEvent_ObjectiveEvent25' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveEvent_ObjectiveCount25) == 0x00161C, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveEvent_ObjectiveCount25' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_MissionCustomEvent_Context25) == 0x001620, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_MissionCustomEvent_Context25' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent10) == 0x001628, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent10' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveEvent_ObjectiveEvent24) == 0x001629, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveEvent_ObjectiveEvent24' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveEvent_ObjectiveCount24) == 0x00162C, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveEvent_ObjectiveCount24' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_MissionCustomEvent_Context24) == 0x001630, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_MissionCustomEvent_Context24' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, K2Node_SwitchEnum_CmpSuccess) == 0x001638, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent9) == 0x001639, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent9' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveEvent_ObjectiveEvent23) == 0x00163A, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveEvent_ObjectiveEvent23' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveEvent_ObjectiveCount23) == 0x00163C, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveEvent_ObjectiveCount23' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_MissionCustomEvent_Context23) == 0x001640, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_MissionCustomEvent_Context23' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, K2Node_SwitchEnum1_CmpSuccess) == 0x001648, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveEvent_ObjectiveEvent22) == 0x001649, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveEvent_ObjectiveEvent22' has a wrong offset!");
static_assert(offsetof(Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice, MissionK2Node_ObjectiveEvent_ObjectiveCount22) == 0x00164C, "Member 'Mission_Maurice_C_ExecuteUbergraph_Mission_Maurice::MissionK2Node_ObjectiveEvent_ObjectiveCount22' has a wrong offset!");
