#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_Just_Desserts

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_Just_Desserts.Mission_Just_Desserts_C
// 0x0120 (0x0630 - 0x0510)
class UMission_Just_Desserts_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_Just_Desserts_C;            // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   SET_Get_EggsGunpowder_ObjSetVar;                   // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GetEggs_ObjVar;                                // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GetGunPowder_ObjVar;                           // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GiveBeatriceIngredients_ObjSetVar;             // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GiveBeatriceIngredients_ObjVar;                // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_Get_Candles_ObjSetVar;                         // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GetCandles_ObjVar;                             // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_Get_Cake_ObjSetVar;                            // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GetCake_ObjVar;                                // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ReturnToBeatrice_ObjSetVar;                    // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_ReturnToBeatrice_ObjVar;                       // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GoToCave_ObjSetVar;                            // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_GoToCave_ObjVar;                               // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ReturnToBeatriceWithCandles_ObjVar;            // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ReturnWithCandles_ObjSetVar;                   // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_AssembleCake_ObjSetVar;                        // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_AssembleCake_ObjVar;                           // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_PlaceCandles_ObjSetVar;                        // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_PlaceCandles_ObjVar;                           // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_RingDoorbell_ObjSetVar;                        // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_RingDoorbell_ObjVar;                           // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_LightCandles_ObjSetVar;                        // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_LightCandles_ObjVar;                           // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_KickCart_ObjSetVar;                            // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_KickCart_ObjVar;                               // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_WaitForPayment_ObjSetVar;                      // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_WaitForPayment_ObjVar;                         // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      INV_OBJ_WaitForExplosion_ObjVar;                   // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      INV_PlaceCakeBottom_ObjVar;                        // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      INV_PlaceCakeMiddle_ObjVar;                        // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      INV_PlaceCakeTop_ObjVar;                           // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      INV_DestroyEggMembranes_ObjVar;                    // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      INVS_CollectionCounter_ObjVar;                     // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_BeatriceInKitchen_ObjVar;                      // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ThingsCollected;                                   // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ActiveLoadMinusWaitForIt;                          // 0x062C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Mission_Just_Desserts(int32 EntryPoint);
	void Update_BeatriceInKitchen(class UObject* Context);
	void _Obj_BeatriceInKitchen_Objective__PROXY();
	void Obj_BeatriceInKitchen(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void INVS_CollectionCounter(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MissionKickoff();
	void PlayerIsNearEggs(class UObject* Context);
	void UPDATE_DestroyEggMembrane(class UObject* Context);
	void INV_DestroyEggMembranes(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void PlayerCakeAssemblyUpdate(class UObject* Context);
	void PlayerPlacedTop(class UObject* Context);
	void PlayerPlacedMiddle(class UObject* Context);
	void INV_PlaceCakeTop(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void INV_PlaceCakeMiddle(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void INV_PlaceCakeBottom(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void PlayerIsNearPachinko(class UObject* Context);
	void SET_Get_EggsGunpowder(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_GetEggs(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_GetGunPowder(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_GiveBeatriceIngredients(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_GiveBeatriceIngredients(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_Get_Candles(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_GetCandles(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_Get_Cake(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_GetCake(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_ReturnToBeatrice(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_ReturnToBeatrice(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void PlayerGaveBeatriceIngredients(class UObject* Context);
	void PlayerGotCandles(class UObject* Context);
	void PlayerReturnedToBeatrice(class UObject* Context);
	void SET_GoToCave(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_GoToCave(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void PlayerIsAtCave(class UObject* Context);
	void Obj_ReturnToBeatriceWithCandles(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void CakeExploded(class UObject* Context);
	void INV_OBJ_WaitForExplosion(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void PlayerWaitedForPayment(class UObject* Context);
	void OBJ_WaitForPayment(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_WaitForPayment(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void PlayerStartedCart(class UObject* Context);
	void OBJ_KickCart(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_KickCart(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void PlayerLitCandles(class UObject* Context);
	void OBJ_LightCandles(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_LightCandles(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void PlayerRangDoorbell(class UObject* Context);
	void OBJ_RingDoorbell(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_RingDoorbell(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void PlayerPlacedCandles(class UObject* Context);
	void OBJ_PlaceCandles(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_PlaceCandles(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void PlayerPlacedBottom(class UObject* Context);
	void OBJ_AssembleCake(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_AssembleCake(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_ReturnWithCandles(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OnDialogSequenceFinished_20();
	void OnDialogSequenceFinished_21();
	void OnDialogSequenceFinished_22();
	void OnDialogSequenceFinished_23();
	void OnDialogSequenceFinished_24();
	void OnDialogSequenceFinished_25();
	void OnDialogSequenceFinished_26();
	void OnDialogSequenceFinished_27();
	void OnDialogSequenceFinished_28();
	void OnDialogSequenceFinished_29();
	void OnDialogSequenceFinished_30();
	void OnDialogSequenceFinished_31();
	void OnDialogSequenceFinished_32();
	void OnDialogSequenceFinished_33();
	void OnDialogSequenceFinished_34();
	void OnDialogSequenceFinished_35();
	void OnDialogSequenceFinished_36();
	void OnDialogSequenceFinished_37();
	void OnDialogSequenceFinished_38();
	void PlayerGotBackWithCandles(class UObject* Context);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_Just_Desserts_C">();
	}
	static class UMission_Just_Desserts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_Just_Desserts_C>();
	}
};
static_assert(alignof(UMission_Just_Desserts_C) == 0x000008, "Wrong alignment on UMission_Just_Desserts_C");
static_assert(sizeof(UMission_Just_Desserts_C) == 0x000630, "Wrong size on UMission_Just_Desserts_C");
static_assert(offsetof(UMission_Just_Desserts_C, UberGraphFrame_Mission_Just_Desserts_C) == 0x000510, "Member 'UMission_Just_Desserts_C::UberGraphFrame_Mission_Just_Desserts_C' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_Get_EggsGunpowder_ObjSetVar) == 0x000518, "Member 'UMission_Just_Desserts_C::SET_Get_EggsGunpowder_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_GetEggs_ObjVar) == 0x000520, "Member 'UMission_Just_Desserts_C::OBJ_GetEggs_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_GetGunPowder_ObjVar) == 0x000528, "Member 'UMission_Just_Desserts_C::OBJ_GetGunPowder_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_GiveBeatriceIngredients_ObjSetVar) == 0x000530, "Member 'UMission_Just_Desserts_C::SET_GiveBeatriceIngredients_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_GiveBeatriceIngredients_ObjVar) == 0x000538, "Member 'UMission_Just_Desserts_C::OBJ_GiveBeatriceIngredients_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_Get_Candles_ObjSetVar) == 0x000540, "Member 'UMission_Just_Desserts_C::SET_Get_Candles_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_GetCandles_ObjVar) == 0x000548, "Member 'UMission_Just_Desserts_C::OBJ_GetCandles_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_Get_Cake_ObjSetVar) == 0x000550, "Member 'UMission_Just_Desserts_C::SET_Get_Cake_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_GetCake_ObjVar) == 0x000558, "Member 'UMission_Just_Desserts_C::OBJ_GetCake_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_ReturnToBeatrice_ObjSetVar) == 0x000560, "Member 'UMission_Just_Desserts_C::SET_ReturnToBeatrice_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_ReturnToBeatrice_ObjVar) == 0x000568, "Member 'UMission_Just_Desserts_C::OBJ_ReturnToBeatrice_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_GoToCave_ObjSetVar) == 0x000570, "Member 'UMission_Just_Desserts_C::SET_GoToCave_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_GoToCave_ObjVar) == 0x000578, "Member 'UMission_Just_Desserts_C::OBJ_GoToCave_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, Obj_ReturnToBeatriceWithCandles_ObjVar) == 0x000580, "Member 'UMission_Just_Desserts_C::Obj_ReturnToBeatriceWithCandles_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_ReturnWithCandles_ObjSetVar) == 0x000588, "Member 'UMission_Just_Desserts_C::SET_ReturnWithCandles_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_AssembleCake_ObjSetVar) == 0x000590, "Member 'UMission_Just_Desserts_C::SET_AssembleCake_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_AssembleCake_ObjVar) == 0x000598, "Member 'UMission_Just_Desserts_C::OBJ_AssembleCake_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_PlaceCandles_ObjSetVar) == 0x0005A0, "Member 'UMission_Just_Desserts_C::SET_PlaceCandles_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_PlaceCandles_ObjVar) == 0x0005A8, "Member 'UMission_Just_Desserts_C::OBJ_PlaceCandles_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_RingDoorbell_ObjSetVar) == 0x0005B0, "Member 'UMission_Just_Desserts_C::SET_RingDoorbell_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_RingDoorbell_ObjVar) == 0x0005B8, "Member 'UMission_Just_Desserts_C::OBJ_RingDoorbell_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_LightCandles_ObjSetVar) == 0x0005C0, "Member 'UMission_Just_Desserts_C::SET_LightCandles_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_LightCandles_ObjVar) == 0x0005C8, "Member 'UMission_Just_Desserts_C::OBJ_LightCandles_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_KickCart_ObjSetVar) == 0x0005D0, "Member 'UMission_Just_Desserts_C::SET_KickCart_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_KickCart_ObjVar) == 0x0005D8, "Member 'UMission_Just_Desserts_C::OBJ_KickCart_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, SET_WaitForPayment_ObjSetVar) == 0x0005E0, "Member 'UMission_Just_Desserts_C::SET_WaitForPayment_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, OBJ_WaitForPayment_ObjVar) == 0x0005E8, "Member 'UMission_Just_Desserts_C::OBJ_WaitForPayment_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, INV_OBJ_WaitForExplosion_ObjVar) == 0x0005F0, "Member 'UMission_Just_Desserts_C::INV_OBJ_WaitForExplosion_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, INV_PlaceCakeBottom_ObjVar) == 0x0005F8, "Member 'UMission_Just_Desserts_C::INV_PlaceCakeBottom_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, INV_PlaceCakeMiddle_ObjVar) == 0x000600, "Member 'UMission_Just_Desserts_C::INV_PlaceCakeMiddle_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, INV_PlaceCakeTop_ObjVar) == 0x000608, "Member 'UMission_Just_Desserts_C::INV_PlaceCakeTop_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, INV_DestroyEggMembranes_ObjVar) == 0x000610, "Member 'UMission_Just_Desserts_C::INV_DestroyEggMembranes_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, INVS_CollectionCounter_ObjVar) == 0x000618, "Member 'UMission_Just_Desserts_C::INVS_CollectionCounter_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, Obj_BeatriceInKitchen_ObjVar) == 0x000620, "Member 'UMission_Just_Desserts_C::Obj_BeatriceInKitchen_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, ThingsCollected) == 0x000628, "Member 'UMission_Just_Desserts_C::ThingsCollected' has a wrong offset!");
static_assert(offsetof(UMission_Just_Desserts_C, ActiveLoadMinusWaitForIt) == 0x00062C, "Member 'UMission_Just_Desserts_C::ActiveLoadMinusWaitForIt' has a wrong offset!");

}

