#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_DriveAwayThePain

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function Mission_DriveAwayThePain.Mission_DriveAwayThePain_C.ExecuteUbergraph_Mission_DriveAwayThePain
// 0x2B60 (0x2B60 - 0x0000)
struct Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0220(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0238(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0454(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466[0x2];                                      // 0x0466(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0468(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0680(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x0898(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x08A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A9[0x3];                                      // 0x08A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x08AC(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x08BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x08BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x08BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8BF[0x1];                                      // 0x08BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x08C0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AD8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x0CF0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x0CFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x0D00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D01[0x3];                                      // 0x0D01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x0D04(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x0D10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x0D14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0D15(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0D16(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D17[0x1];                                      // 0x0D17(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0D18(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x0F30(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x0F3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x0F40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x0F41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F42[0x6];                                      // 0x0F42(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x0F48(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation7;                // 0x1160(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID7;                  // 0x116C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue7;                 // 0x1170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x1171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1172[0x6];                                     // 0x1172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x1178(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation8;                // 0x1390(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID8;                  // 0x139C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue8;                 // 0x13A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A1[0x7];                                     // 0x13A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue9;            // 0x13A8(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x15C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15C1[0x3];                                     // 0x15C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation9;                // 0x15C4(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID9;                  // 0x15D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue9;                 // 0x15D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x15D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D6[0x2];                                     // 0x15D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue10;           // 0x15D8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation10;               // 0x17F0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID10;                 // 0x17FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue10;                // 0x1800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1801[0x7];                                     // 0x1801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue11;           // 0x1808(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue10;             // 0x1A20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A21[0x3];                                     // 0x1A21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation11;               // 0x1A24(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID11;                 // 0x1A30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue11;                // 0x1A34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue11;             // 0x1A35(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A36[0x2];                                     // 0x1A36(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue12;           // 0x1A38(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation12;               // 0x1C50(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID12;                 // 0x1C5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue12;                // 0x1C60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue12;             // 0x1C61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C62[0x6];                                     // 0x1C62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue13;           // 0x1C68(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue14;           // 0x1E80(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation13;               // 0x2098(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID13;                 // 0x20A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue13;                // 0x20A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A9[0x3];                                     // 0x20A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation14;               // 0x20AC(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID14;                 // 0x20B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue14;                // 0x20BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue13;             // 0x20BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue14;             // 0x20BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20BF[0x1];                                     // 0x20BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue15;           // 0x20C0(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation15;               // 0x22D8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID15;                 // 0x22E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue15;                // 0x22E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue15;             // 0x22E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22EA[0x6];                                     // 0x22EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue16;           // 0x22F0(0x0218)()
	class UObject*                                MissionK2Node_MissionCustomEvent_Context21;        // 0x2508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation16;               // 0x2510(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID16;                 // 0x251C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue16;                // 0x2520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue16;             // 0x2521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent5; // 0x2522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent14;     // 0x2523(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount14;     // 0x2524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context20;        // 0x2528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x2530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2531[0x7];                                     // 0x2531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context19;        // 0x2538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context18;        // 0x2540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent13;     // 0x2548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2549[0x3];                                     // 0x2549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount13;     // 0x254C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context17;        // 0x2550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent12;     // 0x2558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2559[0x3];                                     // 0x2559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount12;     // 0x255C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context16;        // 0x2560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue;           // 0x2568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2569[0x7];                                     // 0x2569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context15;        // 0x2570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue1;          // 0x2578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2579[0x7];                                     // 0x2579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context14;        // 0x2580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context13;        // 0x2588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue2;          // 0x2590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2591[0x7];                                     // 0x2591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context12;        // 0x2598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue3;          // 0x25A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A1[0x7];                                     // 0x25A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context11;        // 0x25A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context10;        // 0x25B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue4;          // 0x25B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x25B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25BA[0x2];                                     // 0x25BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x25BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x25C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25C1[0x3];                                     // 0x25C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x25C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent11;     // 0x25C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C9[0x3];                                     // 0x25C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount11;     // 0x25CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x25D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue17;           // 0x25E0(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation17;               // 0x27F8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID17;                 // 0x2804(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue17;                // 0x2808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent10;     // 0x2809(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_280A[0x2];                                     // 0x280A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount10;     // 0x280C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue17;             // 0x2810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x2811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue5;          // 0x2812(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue6;          // 0x2813(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2814[0x4];                                     // 0x2814(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x2818(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x2828(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context9;         // 0x2838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent9;      // 0x2840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2841[0x3];                                     // 0x2841(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount9;      // 0x2844(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context8;         // 0x2848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x2850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent8;      // 0x2851(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2852[0x2];                                     // 0x2852(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount8;      // 0x2854(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context7;         // 0x2858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x2860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent7;      // 0x2861(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2862[0x2];                                     // 0x2862(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount7;      // 0x2864(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context6;         // 0x2868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x2870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent6;      // 0x2871(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2872[0x2];                                     // 0x2872(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount6;      // 0x2874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x2878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2879[0x7];                                     // 0x2879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context5;         // 0x2880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context4;         // 0x2888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context3;         // 0x2890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context2;         // 0x2898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent5;      // 0x28A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A1[0x3];                                     // 0x28A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount5;      // 0x28A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x28A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent4; // 0x28A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent4;      // 0x28AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28AB[0x1];                                     // 0x28AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount4;      // 0x28AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent3; // 0x28B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x28B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28B2[0x6];                                     // 0x28B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context1;         // 0x28B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent3;      // 0x28C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C1[0x3];                                     // 0x28C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount3;      // 0x28C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x28C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2; // 0x28C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent2;      // 0x28CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28CB[0x1];                                     // 0x28CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount2;      // 0x28CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1; // 0x28D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x28D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent; // 0x28D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D3[0x5];                                     // 0x28D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x28D8(0x0010)(ZeroConstructor, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent1;      // 0x28E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E9[0x3];                                     // 0x28E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount1;      // 0x28EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x28F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x28F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28F2[0x6];                                     // 0x28F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context;          // 0x28F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue18;           // 0x2900(0x0218)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x2B18(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation18;               // 0x2B28(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID18;                 // 0x2B34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue18;                // 0x2B38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue18;             // 0x2B39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B3A[0x6];                                     // 0x2B3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x2B40(0x0010)(ZeroConstructor, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent;       // 0x2B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B51[0x3];                                     // 0x2B51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount;       // 0x2B54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x2B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain) == 0x000008, "Wrong alignment on Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain");
static_assert(sizeof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain) == 0x002B60, "Wrong size on Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, EntryPoint) == 0x000000, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation) == 0x000220, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID) == 0x00022C, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue) == 0x000230, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue1) == 0x000238, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue) == 0x000450, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation1) == 0x000454, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation1' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID1) == 0x000460, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID1' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue1) == 0x000464, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000465, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue2) == 0x000468, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue3) == 0x000680, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation2) == 0x000898, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation2' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID2) == 0x0008A4, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID2' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue2) == 0x0008A8, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation3) == 0x0008AC, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation3' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID3) == 0x0008B8, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID3' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue3) == 0x0008BC, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue2) == 0x0008BD, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue3) == 0x0008BE, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue4) == 0x0008C0, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue5) == 0x000AD8, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation4) == 0x000CF0, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation4' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID4) == 0x000CFC, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID4' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue4) == 0x000D00, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation5) == 0x000D04, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation5' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID5) == 0x000D10, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID5' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue5) == 0x000D14, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue4) == 0x000D15, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue5) == 0x000D16, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue6) == 0x000D18, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation6) == 0x000F30, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation6' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID6) == 0x000F3C, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID6' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue6) == 0x000F40, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue6) == 0x000F41, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue7) == 0x000F48, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation7) == 0x001160, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation7' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID7) == 0x00116C, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID7' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue7) == 0x001170, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue7) == 0x001171, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue8) == 0x001178, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation8) == 0x001390, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation8' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID8) == 0x00139C, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID8' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue8) == 0x0013A0, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue9) == 0x0013A8, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue8) == 0x0015C0, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation9) == 0x0015C4, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation9' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID9) == 0x0015D0, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID9' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue9) == 0x0015D4, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue9) == 0x0015D5, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue10) == 0x0015D8, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue10' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation10) == 0x0017F0, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation10' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID10) == 0x0017FC, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID10' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue10) == 0x001800, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue10' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue11) == 0x001808, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue11' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue10) == 0x001A20, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue10' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation11) == 0x001A24, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation11' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID11) == 0x001A30, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID11' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue11) == 0x001A34, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue11' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue11) == 0x001A35, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue11' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue12) == 0x001A38, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue12' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation12) == 0x001C50, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation12' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID12) == 0x001C5C, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID12' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue12) == 0x001C60, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue12' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_Conv_IntToBool_ReturnValue12) == 0x001C61, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_Conv_IntToBool_ReturnValue12' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue13) == 0x001C68, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue13' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_NewDialogContext_ReturnValue14) == 0x001E80, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_NewDialogContext_ReturnValue14' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation13) == 0x002098, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation13' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID13) == 0x0020A4, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID13' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_ReturnValue13) == 0x0020A8, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_ReturnValue13' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_Conversation14) == 0x0020AC, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_Conversation14' has a wrong offset!");
static_assert(offsetof(Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain, CallFunc_FinishSpeak_SequenceID14) == 0x0020B8, "Member 'Mission_DriveAwayThePain_C_ExecuteUbergraph_Mission_DriveAwayThePain::CallFunc_FinishSpeak_SequenceID14' has a wrong offset!");
