#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_BloodAndBeans

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "BP_OakMission_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_BloodAndBeans.Mission_BloodAndBeans_C
// 0x0148 (0x0658 - 0x0510)
class UMission_BloodAndBeans_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_BloodAndBeans_C;            // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_SearchForClues_ObjSetVar;                      // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_SearchForClues_ObjVar;                         // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_InspectCan_ObjSetVar;                          // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_InspectCan_ObjVar;                             // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_FollowTrail_ObjSetVar;                         // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FollowTrail_ObjVar;                            // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_FindBeans_ObjSetVar;                           // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FindBeans_ObjVar;                              // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_KillFirstAssBlaster_ObjSetVar;                 // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillFirstAssBlaster_ObjVar;                    // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_DefeatAmbush_ObjSetVar;                        // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_DefeatAmbush_ObjVar;                           // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_ReturnToCowboys_ObjSetVar;                     // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ReturnToCowboys_ObjVar;                        // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_ResolveDispute_ObjSetVar;                      // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillCowboyA_ObjVar;                            // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillCowboyB_ObjVar;                            // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_DestroyBeans_ObjVar;                           // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_KillCowboyA_ObjSetVar;                         // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_KillCowboyB_ObjSetVar;                         // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GiveBeansToCowboyA_ObjVar;                     // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GiveBeansToCowboyB_ObjVar;                     // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_EnterClearing_ObjVar;                          // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_MissionComplete_ObjSetVar;                     // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_CowboyAComplete_ObjVar;                        // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_KillBothCowboys_ObjSetVar;                     // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillBothCowboys_ObjVar;                        // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GaveBeanstoCowboyA_ObjSetVar;                  // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GaveBeansToCowboyB_ObjSetVar;                  // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_DestroyedBeans_ObjSetVar;                      // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    CurrentConversation;                               // 0x0608(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614[0x4];                                      // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjectiveSet*                   Set_GaveBeansToCowboyA2_ObjSetVar;                 // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_GaveBeansToCowboyB2_ObjSetVar;                 // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_DestroyedBeans2_ObjSetVar;                     // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TalkToCowboys_ObjVar;                          // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Invs_GiveBeansToCowboyA_ObjVar;                    // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Invs_GiveBeansToCowboyB_ObjVar;                    // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Invs_TrailWaypoints_ObjVar;                        // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Invs_Clues_ObjVar;                                 // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_BloodAndBeans(int32 EntryPoint);
	void Set_SearchForClues(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Advance_SearchForClues(class UObject* Context);
	void _Invs_Clues_Objective__PROXY_11();
	void Invs_Clues(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_BeckonConversation(class UObject* Context);
	void Set_InspectCan(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_ResolveDisputeConversation(class UObject* Context);
	void Obj_InspectCan(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Advance_InspectCan(class UObject* Context);
	void Obj_SearchForClues(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_ReturnConversation(class UObject* Context);
	void SET_FollowTrail(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_TrailWaypoints(class UObject* Context);
	void Invs_TrailWaypoints(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Invs_GiveBeansToCowboyB(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Invs_GiveBeansToCowboyA(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_GiveBeansToCowboyA_Objective__PROXY_10();
	void _Obj_GiveBeansToCowboyB_Objective__PROXY_9();
	void _Obj_GiveBeansToCowboyA_Objective__PROXY_8();
	void Update_TalkToCowboys(class UObject* Context);
	void Obj_TalkToCowboys(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_FollowTrail(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Advance_FollowTrail(class UObject* Context);
	void Set_FindBeans(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void _Obj_DestroyBeans_Objective__PROXY_7();
	void _Obj_GiveBeansToCowboyB_Objective__PROXY_6();
	void _Obj_GiveBeansToCowboyA_Objective__PROXY_5();
	void _Obj_GiveBeansToCowboyB_Objective__PROXY_4();
	void Set_DestroyedBeans2(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void _Obj_GiveBeansToCowboyB_Objective__PROXY_3();
	void Set_GaveBeansToCowboyB2(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void _Obj_GiveBeansToCowboyB_Objective__PROXY_2();
	void Set_GaveBeansToCowboyA2(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void _Obj_DestroyBeans_Objective__PROXY_1();
	void _Obj_GiveBeansToCowboyA_Objective__PROXY_0();
	void Set_DestroyedBeans(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_FindBeans(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Advance_FindBeans(class UObject* Context);
	void Set_KillFirstAssBlaster(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_KillFirstAssBlaster(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_GaveBeansToCowboyB(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Advance_KillFirstAssBlaster(class UObject* Context);
	void SET_DefeatAmbush(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_DefeatAmbush(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Advance_DefeatAmbush(class UObject* Context);
	void _Obj_GiveBeansToCowboyA_Objective__PROXY();
	void Set_GaveBeanstoCowboyA(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_ReturnToCowboys(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_ReturnToCowboys(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_ReturnToCowboys(class UObject* Context);
	void Set_ResolveDispute(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void JumpTo_MissionComplete(class UObject* Context);
	void Set_KillBothCowboys(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_KillCowboyA(class UObject* Context);
	void Obj_KillCowboyA(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_KillCowboyB(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_DestroyBeans(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_KillBothCowboys(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Update_KillBothCowboys(class UObject* Context);
	void Advance_CowboyAComplete(class UObject* Context);
	void Obj_CowboyAComplete(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_MissionComplete(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Update_KillCowboyB(class UObject* Context);
	void Advance_DestroyBeans(class UObject* Context);
	void Set_KillCowboyA(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_KillCowboyB(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GiveBeansToCowboyA(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MissionKickoff();
	void Advance_EnterClearing(class UObject* Context);
	void Obj_EnterClearing(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Advance_GiveBeansToCowboyB(class UObject* Context);
	void Advance_GiveBeansToCowboyA(class UObject* Context);
	void Obj_GiveBeansToCowboyB(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OnDialogSequenceFinished_18();
	void OnDialogSequenceFinished_19();
	void OnDialogSequenceFinished_20();
	void OnDialogSequenceFinished_21();
	void OnDialogSequenceFinished_22();
	void OnDialogSequenceFinished_23();
	void OnDialogSequenceFinished_24();
	void OnDialogSequenceFinished_25();
	void OnDialogSequenceFinished_26();
	void OnDialogSequenceFinished_27();
	void OnDialogSequenceFinished_28();
	void OnDialogSequenceFinished_29();
	void OnDialogSequenceFinished_30();
	void OnDialogSequenceFinished_31();
	void OnDialogSequenceFinished_32();
	void OnDialogSequenceFinished_33();
	void OnDialogSequenceFinished_34();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_BloodAndBeans_C">();
	}
	static class UMission_BloodAndBeans_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_BloodAndBeans_C>();
	}
};
static_assert(alignof(UMission_BloodAndBeans_C) == 0x000008, "Wrong alignment on UMission_BloodAndBeans_C");
static_assert(sizeof(UMission_BloodAndBeans_C) == 0x000658, "Wrong size on UMission_BloodAndBeans_C");
static_assert(offsetof(UMission_BloodAndBeans_C, UberGraphFrame_Mission_BloodAndBeans_C) == 0x000510, "Member 'UMission_BloodAndBeans_C::UberGraphFrame_Mission_BloodAndBeans_C' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_SearchForClues_ObjSetVar) == 0x000518, "Member 'UMission_BloodAndBeans_C::Set_SearchForClues_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_SearchForClues_ObjVar) == 0x000520, "Member 'UMission_BloodAndBeans_C::Obj_SearchForClues_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_InspectCan_ObjSetVar) == 0x000528, "Member 'UMission_BloodAndBeans_C::Set_InspectCan_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_InspectCan_ObjVar) == 0x000530, "Member 'UMission_BloodAndBeans_C::Obj_InspectCan_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, SET_FollowTrail_ObjSetVar) == 0x000538, "Member 'UMission_BloodAndBeans_C::SET_FollowTrail_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, OBJ_FollowTrail_ObjVar) == 0x000540, "Member 'UMission_BloodAndBeans_C::OBJ_FollowTrail_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_FindBeans_ObjSetVar) == 0x000548, "Member 'UMission_BloodAndBeans_C::Set_FindBeans_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_FindBeans_ObjVar) == 0x000550, "Member 'UMission_BloodAndBeans_C::Obj_FindBeans_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_KillFirstAssBlaster_ObjSetVar) == 0x000558, "Member 'UMission_BloodAndBeans_C::Set_KillFirstAssBlaster_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_KillFirstAssBlaster_ObjVar) == 0x000560, "Member 'UMission_BloodAndBeans_C::Obj_KillFirstAssBlaster_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, SET_DefeatAmbush_ObjSetVar) == 0x000568, "Member 'UMission_BloodAndBeans_C::SET_DefeatAmbush_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, OBJ_DefeatAmbush_ObjVar) == 0x000570, "Member 'UMission_BloodAndBeans_C::OBJ_DefeatAmbush_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_ReturnToCowboys_ObjSetVar) == 0x000578, "Member 'UMission_BloodAndBeans_C::Set_ReturnToCowboys_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_ReturnToCowboys_ObjVar) == 0x000580, "Member 'UMission_BloodAndBeans_C::Obj_ReturnToCowboys_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_ResolveDispute_ObjSetVar) == 0x000588, "Member 'UMission_BloodAndBeans_C::Set_ResolveDispute_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_KillCowboyA_ObjVar) == 0x000590, "Member 'UMission_BloodAndBeans_C::Obj_KillCowboyA_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_KillCowboyB_ObjVar) == 0x000598, "Member 'UMission_BloodAndBeans_C::Obj_KillCowboyB_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_DestroyBeans_ObjVar) == 0x0005A0, "Member 'UMission_BloodAndBeans_C::Obj_DestroyBeans_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_KillCowboyA_ObjSetVar) == 0x0005A8, "Member 'UMission_BloodAndBeans_C::Set_KillCowboyA_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_KillCowboyB_ObjSetVar) == 0x0005B0, "Member 'UMission_BloodAndBeans_C::Set_KillCowboyB_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_GiveBeansToCowboyA_ObjVar) == 0x0005B8, "Member 'UMission_BloodAndBeans_C::Obj_GiveBeansToCowboyA_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_GiveBeansToCowboyB_ObjVar) == 0x0005C0, "Member 'UMission_BloodAndBeans_C::Obj_GiveBeansToCowboyB_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_EnterClearing_ObjVar) == 0x0005C8, "Member 'UMission_BloodAndBeans_C::Obj_EnterClearing_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_MissionComplete_ObjSetVar) == 0x0005D0, "Member 'UMission_BloodAndBeans_C::Set_MissionComplete_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_CowboyAComplete_ObjVar) == 0x0005D8, "Member 'UMission_BloodAndBeans_C::Obj_CowboyAComplete_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_KillBothCowboys_ObjSetVar) == 0x0005E0, "Member 'UMission_BloodAndBeans_C::Set_KillBothCowboys_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_KillBothCowboys_ObjVar) == 0x0005E8, "Member 'UMission_BloodAndBeans_C::Obj_KillBothCowboys_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_GaveBeanstoCowboyA_ObjSetVar) == 0x0005F0, "Member 'UMission_BloodAndBeans_C::Set_GaveBeanstoCowboyA_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_GaveBeansToCowboyB_ObjSetVar) == 0x0005F8, "Member 'UMission_BloodAndBeans_C::Set_GaveBeansToCowboyB_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_DestroyedBeans_ObjSetVar) == 0x000600, "Member 'UMission_BloodAndBeans_C::Set_DestroyedBeans_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, CurrentConversation) == 0x000608, "Member 'UMission_BloodAndBeans_C::CurrentConversation' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_GaveBeansToCowboyA2_ObjSetVar) == 0x000618, "Member 'UMission_BloodAndBeans_C::Set_GaveBeansToCowboyA2_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_GaveBeansToCowboyB2_ObjSetVar) == 0x000620, "Member 'UMission_BloodAndBeans_C::Set_GaveBeansToCowboyB2_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Set_DestroyedBeans2_ObjSetVar) == 0x000628, "Member 'UMission_BloodAndBeans_C::Set_DestroyedBeans2_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Obj_TalkToCowboys_ObjVar) == 0x000630, "Member 'UMission_BloodAndBeans_C::Obj_TalkToCowboys_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Invs_GiveBeansToCowboyA_ObjVar) == 0x000638, "Member 'UMission_BloodAndBeans_C::Invs_GiveBeansToCowboyA_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Invs_GiveBeansToCowboyB_ObjVar) == 0x000640, "Member 'UMission_BloodAndBeans_C::Invs_GiveBeansToCowboyB_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Invs_TrailWaypoints_ObjVar) == 0x000648, "Member 'UMission_BloodAndBeans_C::Invs_TrailWaypoints_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_BloodAndBeans_C, Invs_Clues_ObjVar) == 0x000650, "Member 'UMission_BloodAndBeans_C::Invs_Clues_ObjVar' has a wrong offset!");

}

