#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_Takedown2_Intro

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_Takedown2_Intro.Mission_Takedown2_Intro_C
// 0x0050 (0x0560 - 0x0510)
class UMission_Takedown2_Intro_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_Takedown2_Intro_C;          // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_Navigate_TakedownTwoPlanet_ObjSetVar;          // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_Navigate_TakedownTwoPlanet_ObjVar;             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_UseDropPod_ObjSetVar;                          // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ReNavigate_Takedown2Planet_ObjVar;             // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_UseDropPod_ObjVar;                             // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_PlanetTitleCard_ObjSetVar;                     // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TITLECARD_TAKEDOWNTWOPLANET_ObjVar;            // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_MissionEnd_ObjSetVar;                          // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_MissionEnd_ObjVar;                             // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_Takedown2_Intro(int32 EntryPoint);
	void AdvanceTo_PlanetTitleCard(class UObject* Context);
	void MissionKickoff();
	void Obj_MissionEnd(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_TITLECARD_TAKEDOWNTWOPLANET(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_UseDropPod(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void UPDATE_ReNavigate_Takedown2Planet(class UObject* Context);
	void Obj_ReNavigate_Takedown2Planet(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_MissionEnd(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_PlanetTitleCard(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_UseDropPod(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void ADVANCE_Navigate_Takedown2Planet(class UObject* Context);
	void UPDATE_Navigate_Takedown2Planet(class UObject* Context);
	void Obj_Navigate_TakedownTwoPlanet(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_Navigate_TakedownTwoPlanet(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OnDialogSequenceFinished_2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_Takedown2_Intro_C">();
	}
	static class UMission_Takedown2_Intro_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_Takedown2_Intro_C>();
	}
};
static_assert(alignof(UMission_Takedown2_Intro_C) == 0x000008, "Wrong alignment on UMission_Takedown2_Intro_C");
static_assert(sizeof(UMission_Takedown2_Intro_C) == 0x000560, "Wrong size on UMission_Takedown2_Intro_C");
static_assert(offsetof(UMission_Takedown2_Intro_C, UberGraphFrame_Mission_Takedown2_Intro_C) == 0x000510, "Member 'UMission_Takedown2_Intro_C::UberGraphFrame_Mission_Takedown2_Intro_C' has a wrong offset!");
static_assert(offsetof(UMission_Takedown2_Intro_C, Set_Navigate_TakedownTwoPlanet_ObjSetVar) == 0x000518, "Member 'UMission_Takedown2_Intro_C::Set_Navigate_TakedownTwoPlanet_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Takedown2_Intro_C, Obj_Navigate_TakedownTwoPlanet_ObjVar) == 0x000520, "Member 'UMission_Takedown2_Intro_C::Obj_Navigate_TakedownTwoPlanet_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Takedown2_Intro_C, Set_UseDropPod_ObjSetVar) == 0x000528, "Member 'UMission_Takedown2_Intro_C::Set_UseDropPod_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Takedown2_Intro_C, Obj_ReNavigate_Takedown2Planet_ObjVar) == 0x000530, "Member 'UMission_Takedown2_Intro_C::Obj_ReNavigate_Takedown2Planet_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Takedown2_Intro_C, Obj_UseDropPod_ObjVar) == 0x000538, "Member 'UMission_Takedown2_Intro_C::Obj_UseDropPod_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Takedown2_Intro_C, Set_PlanetTitleCard_ObjSetVar) == 0x000540, "Member 'UMission_Takedown2_Intro_C::Set_PlanetTitleCard_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Takedown2_Intro_C, Obj_TITLECARD_TAKEDOWNTWOPLANET_ObjVar) == 0x000548, "Member 'UMission_Takedown2_Intro_C::Obj_TITLECARD_TAKEDOWNTWOPLANET_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Takedown2_Intro_C, Set_MissionEnd_ObjSetVar) == 0x000550, "Member 'UMission_Takedown2_Intro_C::Set_MissionEnd_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Takedown2_Intro_C, Obj_MissionEnd_ObjVar) == 0x000558, "Member 'UMission_Takedown2_Intro_C::Obj_MissionEnd_ObjVar' has a wrong offset!");

}

