#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_Scoopers_Bully

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "BP_OakMission_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_Scoopers_Bully.Mission_Scoopers_Bully_C
// 0x0078 (0x0588 - 0x0510)
class UMission_Scoopers_Bully_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_Scoopers_Bully_C;           // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_Bullystart_ObjSetVar;                          // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillBully_ObjVar;                              // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    Conversation;                                      // 0x0528(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      Obj_SawRakkspit_ObjVar;                            // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_OpenTrapDoor_ObjSetVar;                        // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_OpenTrapDoor_ObjVar;                           // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_FindRedChest_ObjSetVar;                        // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FindRedChest_ObjVar;                           // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PipeIsFlowing_ObjVar;                          // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_SwitchIsOn_ObjVar;                             // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_OpenTrapDoorInitial_ObjSetVar;                 // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TimedToAdvanceToDirectHelp_ObjVar;             // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ShootDumptrucksAss_ObjVar;                     // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_Scoopers_Bully(int32 EntryPoint);
	void CE_EllieSpellsItOut();
	void Advance_ShootDumpTrucksAss(class UObject* Context);
	void Obj_ShootDumptrucksAss(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Advance_TimedToAdvanceToDirectHelp(class UObject* Context);
	void Obj_TimedToAdvanceToDirectHelp(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_KillBully(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_OpenTrapDoor_Objective__PROXY();
	void Set_OpenTrapDoorInitial(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_Bullystart(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Advance_SwitchIsOn(class UObject* Context);
	void Obj_SwitchIsOn(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Advance_PipeIsFlowing(class UObject* Context);
	void Set_FindRedChest(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Advance_FindRedChest(class UObject* Context);
	void Obj_FindRedChest(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_OpenTrapDoor(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Advance_OpenTrapDoor(class UObject* Context);
	void Set_OpenTrapDoor(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_PipeIsFlowing(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MissionKickoff();
	void Obj_SawRakkspit(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_BullyKilled(class UObject* Context);
	void MCE_SawRakkspitr(class UObject* Context);
	void OnDialogSequenceFinished_5();
	void OnDialogSequenceFinished_6();
	void OnDialogSequenceFinished_7();
	void OnDialogSequenceFinished_8();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_Scoopers_Bully_C">();
	}
	static class UMission_Scoopers_Bully_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_Scoopers_Bully_C>();
	}
};
static_assert(alignof(UMission_Scoopers_Bully_C) == 0x000008, "Wrong alignment on UMission_Scoopers_Bully_C");
static_assert(sizeof(UMission_Scoopers_Bully_C) == 0x000588, "Wrong size on UMission_Scoopers_Bully_C");
static_assert(offsetof(UMission_Scoopers_Bully_C, UberGraphFrame_Mission_Scoopers_Bully_C) == 0x000510, "Member 'UMission_Scoopers_Bully_C::UberGraphFrame_Mission_Scoopers_Bully_C' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Set_Bullystart_ObjSetVar) == 0x000518, "Member 'UMission_Scoopers_Bully_C::Set_Bullystart_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Obj_KillBully_ObjVar) == 0x000520, "Member 'UMission_Scoopers_Bully_C::Obj_KillBully_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Conversation) == 0x000528, "Member 'UMission_Scoopers_Bully_C::Conversation' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Obj_SawRakkspit_ObjVar) == 0x000538, "Member 'UMission_Scoopers_Bully_C::Obj_SawRakkspit_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Set_OpenTrapDoor_ObjSetVar) == 0x000540, "Member 'UMission_Scoopers_Bully_C::Set_OpenTrapDoor_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Obj_OpenTrapDoor_ObjVar) == 0x000548, "Member 'UMission_Scoopers_Bully_C::Obj_OpenTrapDoor_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Set_FindRedChest_ObjSetVar) == 0x000550, "Member 'UMission_Scoopers_Bully_C::Set_FindRedChest_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Obj_FindRedChest_ObjVar) == 0x000558, "Member 'UMission_Scoopers_Bully_C::Obj_FindRedChest_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Obj_PipeIsFlowing_ObjVar) == 0x000560, "Member 'UMission_Scoopers_Bully_C::Obj_PipeIsFlowing_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Obj_SwitchIsOn_ObjVar) == 0x000568, "Member 'UMission_Scoopers_Bully_C::Obj_SwitchIsOn_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Set_OpenTrapDoorInitial_ObjSetVar) == 0x000570, "Member 'UMission_Scoopers_Bully_C::Set_OpenTrapDoorInitial_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Obj_TimedToAdvanceToDirectHelp_ObjVar) == 0x000578, "Member 'UMission_Scoopers_Bully_C::Obj_TimedToAdvanceToDirectHelp_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Scoopers_Bully_C, Obj_ShootDumptrucksAss_ObjVar) == 0x000580, "Member 'UMission_Scoopers_Bully_C::Obj_ShootDumptrucksAss_ObjVar' has a wrong offset!");

}

