#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_Async_Rakkman

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_Async_Rakkman.Mission_Async_Rakkman_C
// 0x0018 (0x0530 - 0x0518)
class UMission_Async_Rakkman_C final : public UOakMissionRareSpawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_KillRakkman_ObjSetVar;                         // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillRakkman_ObjVar;                            // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_Async_Rakkman(int32 EntryPoint);
	void MCE_RakkmanKilled(class UObject* Context);
	void Set_KillRakkman(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_KillRakkman(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_Async_Rakkman_C">();
	}
	static class UMission_Async_Rakkman_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_Async_Rakkman_C>();
	}
};
static_assert(alignof(UMission_Async_Rakkman_C) == 0x000008, "Wrong alignment on UMission_Async_Rakkman_C");
static_assert(sizeof(UMission_Async_Rakkman_C) == 0x000530, "Wrong size on UMission_Async_Rakkman_C");
static_assert(offsetof(UMission_Async_Rakkman_C, UberGraphFrame) == 0x000518, "Member 'UMission_Async_Rakkman_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMission_Async_Rakkman_C, Set_KillRakkman_ObjSetVar) == 0x000520, "Member 'UMission_Async_Rakkman_C::Set_KillRakkman_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Async_Rakkman_C, Obj_KillRakkman_ObjVar) == 0x000528, "Member 'UMission_Async_Rakkman_C::Obj_KillRakkman_ObjVar' has a wrong offset!");

}

