#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_FreeHugs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxMission_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "BP_OakMission_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_FreeHugs.Mission_FreeHugs_C
// 0x01E8 (0x06F8 - 0x0510)
class UMission_FreeHugs_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_FreeHugs_C;                 // 0x0510(0x0008)(Transient, DuplicateTransient)
	UMulticastDelegateProperty_                   ED_TalkedToHolder;                                 // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   ED_MoveToPrison;                                   // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   ED_DistractionCreated;                             // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   ED_ToiletButtonPressed;                            // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   ED_DoorOpened;                                     // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   ED_WeHaveDisguises;                                // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMissionObjectiveSet*                   SET_UnlockPrisonGate_ObjSetVar;                    // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_UnlockPrisonGate_ObjVar;                       // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_LootKeys_ObjSetVar;                            // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_WakeHugs_ObjSetVar;                            // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_WakeHugs_ObjVar;                               // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_OpenCells_ObjSetVar;                           // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_OpenCells_ObjVar;                              // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_InvestigateCell_ObjVar;                        // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_FollowTunnel_ObjSetVar;                        // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FollowTunnel_ObjVar;                           // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_SearchforKey_ObjVar;                           // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_TakeKey_ObjSetVar;                             // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_KeyCard_ObjVar;                                // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ClearCombatRoom_ObjVar;                        // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_KillingPit_ObjSetVar;                          // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_FightGang_ObjVar;                              // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_TalkwithHugs_ObjSetVar;                        // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_TalkwithHugs_ObjVar;                           // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_KillHugs_ObjSetVar;                            // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_KillHugs_ObjVar;                               // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_KillGangLeader_ObjVar;                         // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_TurnInToNPC_ObjSetVar;                         // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_TalkWithLeftoverNPC_ObjVar;                    // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_SideWithGangLeader_ObjVar;                     // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_KillGangLeader_ObjSetVar;                      // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_OpenDoor_ObjVar;                               // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_TalkwithVictim_ObjSetVar;                      // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ChatwithVictim_ObjVar;                         // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_TurnIntoVillain_ObjSetVar;                     // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      OBJ_VillainTurnIn_ObjVar;                          // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    NewVar_0;                                          // 0x0668(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      INVIS_Obj_FindDeadBodies_ObjVar;                   // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    VO_Ramsden_Start;                                  // 0x0680(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    VO_Ramsden_FaceToFace;                             // 0x068C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    VO_Ramsden_CheckOnHolder;                          // 0x0698(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    VO_Ramsden_FollowTunnel;                           // 0x06A4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    RamsdenConversationToOpenGate;                     // 0x06B0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      Obj_FindCell_ObjVar;                               // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      INVIS_Obj_GetToShankLand_ObjVar;                   // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FindHolder_ObjVar;                             // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    ChoiceChat;                                        // 0x06D8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionObjective*                      Obj_KillFingerBiters_ObjVar;                       // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillShanks_ObjVar;                             // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ED_TalkedToHolder__DelegateSignature();
	void ED_MoveToPrison__DelegateSignature();
	void ED_DistractionCreated__DelegateSignature();
	void ED_ToiletButtonPressed__DelegateSignature();
	void ED_DoorOpened__DelegateSignature();
	void ED_WeHaveDisguises__DelegateSignature();
	void ExecuteUbergraph_Mission_FreeHugs(int32 EntryPoint);
	void MissionKickoff();
	void MCE_FinalShanksDead(class UObject* Context);
	void Obj_KillShanks(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_FingerbitersDead(class UObject* Context);
	void Obj_KillFingerBiters(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_SearchedForKey(class UObject* Context);
	void _Obj_FindHolder_Objective__PROXY_1();
	void _Obj_FindHolder_Objective__PROXY_0();
	void _Obj_FindHolder_Objective__PROXY();
	void Obj_FindHolder(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_Update_FoundCells(class UObject* Context);
	void Obj_FindCell(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_FoundDeadBodies(class UObject* Context);
	void INVIS_Obj_FindDeadBodies(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_ShankLandFound_INVIS(class UObject* Context);
	void INVIS_Obj_GetToShankLand(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_PlayerTurnedIntoVillain(class UObject* Context);
	void OBJ_VillainTurnIn(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_TurnIntoVillain(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_VictimGivesSituation(class UObject* Context);
	void Obj_ChatwithVictim(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_TalkwithVictim(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void SET_UnlockPrisonGate(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_GuardStationSwitch(class UObject* Context);
	void Obj_OpenDoor(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_KillGangLeader(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_SidedWithGangLeader(class UObject* Context);
	void OBJ_SideWithGangLeader(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_TalkedWithAliveNPC(class UObject* Context);
	void MCE_PlayerKilledStanley(class UObject* Context);
	void MCE_PlayerKilledHugs(class UObject* Context);
	void OBJ_TalkWithLeftoverNPC(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_TurnInToNPC(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_KillGangLeader(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_KillHugs(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_KillHugs(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_SideWithVictim(class UObject* Context);
	void OBJ_TalkwithHugs(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_TalkwithHugs(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_GangDied(class UObject* Context);
	void OBJ_FightGang(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_KillingPit(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_KilledGuards(class UObject* Context);
	void Obj_ClearCombatRoom(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_KeyCard(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_TakeKey(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_SearchforKey(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void OBJ_UnlockPrisonGate(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_LootKeys(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MRE_TunnelExplored(class UObject* Context);
	void OBJ_FollowTunnel(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_FollowTunnel(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MRE_SecretHoleFound(class UObject* Context);
	void OBJ_InvestigateCell(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MRE_FoundFakeHugs(class UObject* Context);
	void MRE_CellDoorsOpened(class UObject* Context);
	void OBJ_OpenCells(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_OpenCells(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OBJ_WakeHugs(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_WakeHugs(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_UsedKey(class UObject* Context);
	void OnDialogSequenceFinished_26();
	void OnDialogSequenceFinished_27();
	void OnDialogSequenceFinished_28();
	void OnDialogSequenceFinished_29();
	void OnDialogSequenceFinished_30();
	void OnDialogSequenceFinished_31();
	void OnDialogSequenceFinished_32();
	void OnDialogSequenceFinished_33();
	void OnDialogSequenceFinished_34();
	void OnDialogSequenceFinished_35();
	void OnDialogSequenceFinished_36();
	void OnDialogSequenceFinished_37();
	void OnDialogSequenceFinished_38();
	void OnDialogSequenceFinished_39();
	void OnDialogSequenceFinished_40();
	void OnDialogSequenceFinished_41();
	void OnDialogSequenceFinished_42();
	void OnDialogSequenceFinished_43();
	void OnDialogSequenceFinished_44();
	void OnDialogSequenceFinished_45();
	void OnDialogSequenceFinished_46();
	void OnDialogSequenceFinished_47();
	void OnDialogSequenceFinished_48();
	void OnDialogSequenceFinished_49();
	void OnDialogSequenceFinished_50();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_FreeHugs_C">();
	}
	static class UMission_FreeHugs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_FreeHugs_C>();
	}
};
static_assert(alignof(UMission_FreeHugs_C) == 0x000008, "Wrong alignment on UMission_FreeHugs_C");
static_assert(sizeof(UMission_FreeHugs_C) == 0x0006F8, "Wrong size on UMission_FreeHugs_C");
static_assert(offsetof(UMission_FreeHugs_C, UberGraphFrame_Mission_FreeHugs_C) == 0x000510, "Member 'UMission_FreeHugs_C::UberGraphFrame_Mission_FreeHugs_C' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, ED_TalkedToHolder) == 0x000518, "Member 'UMission_FreeHugs_C::ED_TalkedToHolder' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, ED_MoveToPrison) == 0x000528, "Member 'UMission_FreeHugs_C::ED_MoveToPrison' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, ED_DistractionCreated) == 0x000538, "Member 'UMission_FreeHugs_C::ED_DistractionCreated' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, ED_ToiletButtonPressed) == 0x000548, "Member 'UMission_FreeHugs_C::ED_ToiletButtonPressed' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, ED_DoorOpened) == 0x000558, "Member 'UMission_FreeHugs_C::ED_DoorOpened' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, ED_WeHaveDisguises) == 0x000568, "Member 'UMission_FreeHugs_C::ED_WeHaveDisguises' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_UnlockPrisonGate_ObjSetVar) == 0x000578, "Member 'UMission_FreeHugs_C::SET_UnlockPrisonGate_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_UnlockPrisonGate_ObjVar) == 0x000580, "Member 'UMission_FreeHugs_C::OBJ_UnlockPrisonGate_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_LootKeys_ObjSetVar) == 0x000588, "Member 'UMission_FreeHugs_C::SET_LootKeys_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_WakeHugs_ObjSetVar) == 0x000590, "Member 'UMission_FreeHugs_C::SET_WakeHugs_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_WakeHugs_ObjVar) == 0x000598, "Member 'UMission_FreeHugs_C::OBJ_WakeHugs_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_OpenCells_ObjSetVar) == 0x0005A0, "Member 'UMission_FreeHugs_C::SET_OpenCells_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_OpenCells_ObjVar) == 0x0005A8, "Member 'UMission_FreeHugs_C::OBJ_OpenCells_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_InvestigateCell_ObjVar) == 0x0005B0, "Member 'UMission_FreeHugs_C::OBJ_InvestigateCell_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_FollowTunnel_ObjSetVar) == 0x0005B8, "Member 'UMission_FreeHugs_C::SET_FollowTunnel_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_FollowTunnel_ObjVar) == 0x0005C0, "Member 'UMission_FreeHugs_C::OBJ_FollowTunnel_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, Obj_SearchforKey_ObjVar) == 0x0005C8, "Member 'UMission_FreeHugs_C::Obj_SearchforKey_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_TakeKey_ObjSetVar) == 0x0005D0, "Member 'UMission_FreeHugs_C::SET_TakeKey_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_KeyCard_ObjVar) == 0x0005D8, "Member 'UMission_FreeHugs_C::OBJ_KeyCard_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, Obj_ClearCombatRoom_ObjVar) == 0x0005E0, "Member 'UMission_FreeHugs_C::Obj_ClearCombatRoom_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_KillingPit_ObjSetVar) == 0x0005E8, "Member 'UMission_FreeHugs_C::SET_KillingPit_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_FightGang_ObjVar) == 0x0005F0, "Member 'UMission_FreeHugs_C::OBJ_FightGang_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_TalkwithHugs_ObjSetVar) == 0x0005F8, "Member 'UMission_FreeHugs_C::SET_TalkwithHugs_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_TalkwithHugs_ObjVar) == 0x000600, "Member 'UMission_FreeHugs_C::OBJ_TalkwithHugs_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_KillHugs_ObjSetVar) == 0x000608, "Member 'UMission_FreeHugs_C::SET_KillHugs_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_KillHugs_ObjVar) == 0x000610, "Member 'UMission_FreeHugs_C::OBJ_KillHugs_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_KillGangLeader_ObjVar) == 0x000618, "Member 'UMission_FreeHugs_C::OBJ_KillGangLeader_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_TurnInToNPC_ObjSetVar) == 0x000620, "Member 'UMission_FreeHugs_C::SET_TurnInToNPC_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_TalkWithLeftoverNPC_ObjVar) == 0x000628, "Member 'UMission_FreeHugs_C::OBJ_TalkWithLeftoverNPC_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_SideWithGangLeader_ObjVar) == 0x000630, "Member 'UMission_FreeHugs_C::OBJ_SideWithGangLeader_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_KillGangLeader_ObjSetVar) == 0x000638, "Member 'UMission_FreeHugs_C::SET_KillGangLeader_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, Obj_OpenDoor_ObjVar) == 0x000640, "Member 'UMission_FreeHugs_C::Obj_OpenDoor_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_TalkwithVictim_ObjSetVar) == 0x000648, "Member 'UMission_FreeHugs_C::SET_TalkwithVictim_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, Obj_ChatwithVictim_ObjVar) == 0x000650, "Member 'UMission_FreeHugs_C::Obj_ChatwithVictim_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, SET_TurnIntoVillain_ObjSetVar) == 0x000658, "Member 'UMission_FreeHugs_C::SET_TurnIntoVillain_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, OBJ_VillainTurnIn_ObjVar) == 0x000660, "Member 'UMission_FreeHugs_C::OBJ_VillainTurnIn_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, NewVar_0) == 0x000668, "Member 'UMission_FreeHugs_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, INVIS_Obj_FindDeadBodies_ObjVar) == 0x000678, "Member 'UMission_FreeHugs_C::INVIS_Obj_FindDeadBodies_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, VO_Ramsden_Start) == 0x000680, "Member 'UMission_FreeHugs_C::VO_Ramsden_Start' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, VO_Ramsden_FaceToFace) == 0x00068C, "Member 'UMission_FreeHugs_C::VO_Ramsden_FaceToFace' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, VO_Ramsden_CheckOnHolder) == 0x000698, "Member 'UMission_FreeHugs_C::VO_Ramsden_CheckOnHolder' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, VO_Ramsden_FollowTunnel) == 0x0006A4, "Member 'UMission_FreeHugs_C::VO_Ramsden_FollowTunnel' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, RamsdenConversationToOpenGate) == 0x0006B0, "Member 'UMission_FreeHugs_C::RamsdenConversationToOpenGate' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, Obj_FindCell_ObjVar) == 0x0006C0, "Member 'UMission_FreeHugs_C::Obj_FindCell_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, INVIS_Obj_GetToShankLand_ObjVar) == 0x0006C8, "Member 'UMission_FreeHugs_C::INVIS_Obj_GetToShankLand_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, Obj_FindHolder_ObjVar) == 0x0006D0, "Member 'UMission_FreeHugs_C::Obj_FindHolder_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, ChoiceChat) == 0x0006D8, "Member 'UMission_FreeHugs_C::ChoiceChat' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, Obj_KillFingerBiters_ObjVar) == 0x0006E8, "Member 'UMission_FreeHugs_C::Obj_KillFingerBiters_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_FreeHugs_C, Obj_KillShanks_ObjVar) == 0x0006F0, "Member 'UMission_FreeHugs_C::Obj_KillShanks_ObjVar' has a wrong offset!");

}

