#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_ProvingGrounds_Mission01

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function Mission_ProvingGrounds_Mission01.Mission_ProvingGrounds_Mission01_C.ExecuteUbergraph_Mission_ProvingGrounds_Mission01
// 0x2CA0 (0x2CA0 - 0x0000)
struct Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0018(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0230(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0248(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0460(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0478(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x0690(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A2[0x6];                                      // 0x06A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x06A8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x08C0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x08D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D2[0x6];                                      // 0x08D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x08D8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x0AF0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x0AFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x0B00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x0B01(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B02[0x6];                                      // 0x0B02(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0B08(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x0D20(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x0D2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x0D30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x0D31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D32[0x6];                                      // 0x0D32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0D38(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x0F50(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x0F5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x0F60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x0F61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F62[0x6];                                      // 0x0F62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x0F68(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation7;                // 0x1180(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID7;                  // 0x118C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue7;                 // 0x1190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x1191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1192[0x2];                                     // 0x1192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x1194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x1198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1199[0x3];                                     // 0x1199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue1;              // 0x119C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue1;           // 0x11A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A1[0x3];                                     // 0x11A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue2;              // 0x11A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue2;           // 0x11A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A9[0x3];                                     // 0x11A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue3;              // 0x11AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue3;           // 0x11B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B1[0x3];                                     // 0x11B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataTableValue_OutValue4;              // 0x11B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue4;           // 0x11B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B9[0x3];                                     // 0x11B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDataTableValue_OutValue5;              // 0x11BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue5;           // 0x11C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11C1[0x7];                                     // 0x11C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x11C8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation8;                // 0x13E0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID8;                  // 0x13EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue8;                 // 0x13F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x13F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13F2[0x6];                                     // 0x13F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue9;            // 0x13F8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation9;                // 0x1610(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID9;                  // 0x161C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue9;                 // 0x1620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x1621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1622[0x6];                                     // 0x1622(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue10;           // 0x1628(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation10;               // 0x1840(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID10;                 // 0x184C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue10;                // 0x1850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue10;             // 0x1851(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1852[0x6];                                     // 0x1852(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue11;           // 0x1858(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation11;               // 0x1A70(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID11;                 // 0x1A7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue11;                // 0x1A80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue11;             // 0x1A81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A82[0x6];                                     // 0x1A82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue12;           // 0x1A88(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation12;               // 0x1CA0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID12;                 // 0x1CAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue12;                // 0x1CB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CB1[0x7];                                     // 0x1CB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue13;           // 0x1CB8(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue12;             // 0x1ED0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED1[0x3];                                     // 0x1ED1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation13;               // 0x1ED4(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID13;                 // 0x1EE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue13;                // 0x1EE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue13;             // 0x1EE5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EE6[0x2];                                     // 0x1EE6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue14;           // 0x1EE8(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation14;               // 0x2100(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID14;                 // 0x210C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue14;                // 0x2110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2111[0x7];                                     // 0x2111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue15;           // 0x2118(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue14;             // 0x2330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2331[0x3];                                     // 0x2331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation15;               // 0x2334(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID15;                 // 0x2340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue15;                // 0x2344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue15;             // 0x2345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent20;     // 0x2346(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2347[0x1];                                     // 0x2347(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount20;     // 0x2348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x234C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_234D[0x3];                                     // 0x234D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context20;        // 0x2350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent19;     // 0x2358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2359[0x3];                                     // 0x2359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount19;     // 0x235C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context19;        // 0x2360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x2368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent7; // 0x2369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_236A[0x6];                                     // 0x236A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context18;        // 0x2370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent18;     // 0x2378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2379[0x3];                                     // 0x2379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount18;     // 0x237C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x2380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2381[0x7];                                     // 0x2381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context17;        // 0x2388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue;           // 0x2390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue1;          // 0x2391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue2;          // 0x2392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue3;          // 0x2393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue4;          // 0x2394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue5;          // 0x2395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue6;          // 0x2396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2397[0x1];                                     // 0x2397(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context16;        // 0x2398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context15;        // 0x23A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent6; // 0x23A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent5; // 0x23A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent4; // 0x23AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent3; // 0x23AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent17;     // 0x23AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23AD[0x3];                                     // 0x23AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount17;     // 0x23B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x23B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B5[0x3];                                     // 0x23B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context14;        // 0x23B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context13;        // 0x23C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent16;     // 0x23C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C9[0x3];                                     // 0x23C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount16;     // 0x23CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context12;        // 0x23D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x23D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D9[0x7];                                     // 0x23D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context11;        // 0x23E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent15;     // 0x23E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23E9[0x3];                                     // 0x23E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount15;     // 0x23EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x23F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23F1[0x7];                                     // 0x23F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context10;        // 0x23F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context9;         // 0x2400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent14;     // 0x2408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2409[0x3];                                     // 0x2409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount14;     // 0x240C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent13;     // 0x2410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2411[0x3];                                     // 0x2411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount13;     // 0x2414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x2418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent12;     // 0x2419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241A[0x2];                                     // 0x241A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount12;     // 0x241C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent11;     // 0x2420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2421[0x3];                                     // 0x2421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount11;     // 0x2424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context8;         // 0x2428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context7;         // 0x2430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context6;         // 0x2438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent10;     // 0x2440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2441[0x3];                                     // 0x2441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount10;     // 0x2444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue16;           // 0x2448(0x0218)()
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x2660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2661[0x3];                                     // 0x2661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation16;               // 0x2664(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID16;                 // 0x2670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue16;                // 0x2674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2; // 0x2675(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue16;             // 0x2676(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1; // 0x2677(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue7;          // 0x2678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent; // 0x2679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent9;      // 0x267A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_267B[0x1];                                     // 0x267B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount9;      // 0x267C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x2680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2681[0x7];                                     // 0x2681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue17;           // 0x2688(0x0218)()
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent8;      // 0x28A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A1[0x3];                                     // 0x28A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount8;      // 0x28A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation17;               // 0x28A8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID17;                 // 0x28B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue17;                // 0x28B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x28B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue17;             // 0x28BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent7;      // 0x28BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount7;      // 0x28BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum10_CmpSuccess;                    // 0x28C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent6;      // 0x28C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C2[0x2];                                     // 0x28C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount6;      // 0x28C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent5;      // 0x28C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C9[0x3];                                     // 0x28C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount5;      // 0x28CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum11_CmpSuccess;                    // 0x28D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum12_CmpSuccess;                    // 0x28D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D2[0x6];                                     // 0x28D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context5;         // 0x28D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent4;      // 0x28E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E1[0x3];                                     // 0x28E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount4;      // 0x28E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context4;         // 0x28E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent3;      // 0x28F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28F1[0x3];                                     // 0x28F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount3;      // 0x28F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x28F8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetMissionRemainingSeconds_ReturnValue;   // 0x2908(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x290C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x290D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x290E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x290F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent2;      // 0x2910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2911[0x3];                                     // 0x2911(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount2;      // 0x2914(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context3;         // 0x2918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent1;      // 0x2920(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2921[0x3];                                     // 0x2921(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount1;      // 0x2924(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context2;         // 0x2928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue18;           // 0x2930(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation18;               // 0x2B48(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID18;                 // 0x2B54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue18;                // 0x2B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B59[0x7];                                     // 0x2B59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x2B60(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue18;             // 0x2B70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue8;          // 0x2B71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x2B72(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B73[0x1];                                     // 0x2B73(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x2B74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x2B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B79[0x3];                                     // 0x2B79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x2B7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x2B80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x2B88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue9;          // 0x2B90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B91[0x7];                                     // 0x2B91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x2B98(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x2BA8(0x0010)(ZeroConstructor, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent;       // 0x2BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BB9[0x3];                                     // 0x2BB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount;       // 0x2BBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context1;         // 0x2BC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum13_CmpSuccess;                    // 0x2BC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MissionRemoteEvent_ReturnValue10;         // 0x2BC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BCA[0x6];                                     // 0x2BCA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x2BD0(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x2BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStatValue_ReturnValue;                 // 0x2BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x2BEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BED[0x3];                                     // 0x2BED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x2BF0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x2C00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C01[0x7];                                     // 0x2C01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x2C08(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x2C18(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetNumberOfCompletedMissionChallenges_ReturnValue; // 0x2C28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x2C2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C2D[0x3];                                     // 0x2C2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x2C30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x2C38(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetStatValue_ReturnValue1;                // 0x2C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x2C4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x2C4D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C4E[0x2];                                     // 0x2C4E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MissionK2Node_MissionCustomEvent_Context;          // 0x2C50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x2C58(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x2C68(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x2C78(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x2C88(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetNumberOfCompletedMissionChallenges_ReturnValue1; // 0x2C98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x2C9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01) == 0x000008, "Wrong alignment on Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01");
static_assert(sizeof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01) == 0x002CA0, "Wrong size on Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, EntryPoint) == 0x000000, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_NewDialogContext_ReturnValue) == 0x000018, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_Conversation) == 0x000230, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_SequenceID) == 0x00023C, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_ReturnValue) == 0x000240, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_Conv_IntToBool_ReturnValue) == 0x000241, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_NewDialogContext_ReturnValue1) == 0x000248, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_Conversation1) == 0x000460, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_Conversation1' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_SequenceID1) == 0x00046C, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_SequenceID1' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_ReturnValue1) == 0x000470, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000471, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_NewDialogContext_ReturnValue2) == 0x000478, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_Conversation2) == 0x000690, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_Conversation2' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_SequenceID2) == 0x00069C, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_SequenceID2' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_ReturnValue2) == 0x0006A0, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_Conv_IntToBool_ReturnValue2) == 0x0006A1, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_NewDialogContext_ReturnValue3) == 0x0006A8, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_Conversation3) == 0x0008C0, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_Conversation3' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_SequenceID3) == 0x0008CC, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_SequenceID3' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_ReturnValue3) == 0x0008D0, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_Conv_IntToBool_ReturnValue3) == 0x0008D1, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_NewDialogContext_ReturnValue4) == 0x0008D8, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_NewDialogContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_Conversation4) == 0x000AF0, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_Conversation4' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_SequenceID4) == 0x000AFC, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_SequenceID4' has a wrong offset!");
static_assert(offsetof(Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01, CallFunc_FinishSpeak_ReturnValue4) == 0x000B00, "Member 'Mission_ProvingGrounds_Mission01_C_ExecuteUbergraph_Mission_ProvingGrounds_Mission01::CallFunc_FinishSpeak_ReturnValue4' has a wrong offset!");
