#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mission_Ixora_VarkidBoss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mission_Ixora_VarkidBoss.Mission_Ixora_VarkidBoss_C
// 0x0078 (0x0588 - 0x0510)
class UMission_Ixora_VarkidBoss_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mission_Ixora_VarkidBoss_C;         // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   Set_GoToMap_ObjSetVar;                             // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToMap_ObjVar;                                // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_FindBoss_ObjSetVar;                            // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FindBoss_ObjVar;                               // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_KillBoss_ObjSetVar;                            // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillBoss_ObjVar;                               // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_OpenEridiumDoor_ObjSetVar;                     // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_OpenEridiumDoor_ObjVar;                        // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FindEridiumDoor_ObjVar;                        // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   Set_EnterBossArena_ObjSetVar;                      // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_BC1_ObjVar;                                    // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_BC2_ObjVar;                                    // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_StartingEridium_ObjVar;                        // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_DoorUnlock_INV_ObjVar;                         // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Mission_Ixora_VarkidBoss(int32 EntryPoint);
	void MCE_Update_DoorUnlock(class UObject* Context);
	void Obj_DoorUnlock_INV(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_Update_StartingEridium(class UObject* Context);
	void Obj_StartingEridium(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_Update_BC2(class UObject* Context);
	void MCE_Update_BC1(class UObject* Context);
	void Obj_BC2(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_BC1(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_FindBoss_Objective__PROXY_0();
	void Set_EnterBossArena(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MissionKickoff();
	void Set_GoToMap(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Set_KillBoss(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GoToMap(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_Update_GoToMap(class UObject* Context);
	void MCE_Update_FindEridiumDoor(class UObject* Context);
	void MCE_Update_OpenEridiumDoor(class UObject* Context);
	void Obj_KillBoss(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_Update_KillBoss(class UObject* Context);
	void Obj_FindEridiumDoor(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_FindBoss_Objective__PROXY();
	void Obj_OpenEridiumDoor(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_OpenEridiumDoor(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_Update_FindBoss(class UObject* Context);
	void Obj_FindBoss(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Set_FindBoss(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void OnDialogSequenceFinished_3();
	void OnDialogSequenceFinished_4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mission_Ixora_VarkidBoss_C">();
	}
	static class UMission_Ixora_VarkidBoss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission_Ixora_VarkidBoss_C>();
	}
};
static_assert(alignof(UMission_Ixora_VarkidBoss_C) == 0x000008, "Wrong alignment on UMission_Ixora_VarkidBoss_C");
static_assert(sizeof(UMission_Ixora_VarkidBoss_C) == 0x000588, "Wrong size on UMission_Ixora_VarkidBoss_C");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, UberGraphFrame_Mission_Ixora_VarkidBoss_C) == 0x000510, "Member 'UMission_Ixora_VarkidBoss_C::UberGraphFrame_Mission_Ixora_VarkidBoss_C' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Set_GoToMap_ObjSetVar) == 0x000518, "Member 'UMission_Ixora_VarkidBoss_C::Set_GoToMap_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Obj_GoToMap_ObjVar) == 0x000520, "Member 'UMission_Ixora_VarkidBoss_C::Obj_GoToMap_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Set_FindBoss_ObjSetVar) == 0x000528, "Member 'UMission_Ixora_VarkidBoss_C::Set_FindBoss_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Obj_FindBoss_ObjVar) == 0x000530, "Member 'UMission_Ixora_VarkidBoss_C::Obj_FindBoss_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Set_KillBoss_ObjSetVar) == 0x000538, "Member 'UMission_Ixora_VarkidBoss_C::Set_KillBoss_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Obj_KillBoss_ObjVar) == 0x000540, "Member 'UMission_Ixora_VarkidBoss_C::Obj_KillBoss_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Set_OpenEridiumDoor_ObjSetVar) == 0x000548, "Member 'UMission_Ixora_VarkidBoss_C::Set_OpenEridiumDoor_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Obj_OpenEridiumDoor_ObjVar) == 0x000550, "Member 'UMission_Ixora_VarkidBoss_C::Obj_OpenEridiumDoor_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Obj_FindEridiumDoor_ObjVar) == 0x000558, "Member 'UMission_Ixora_VarkidBoss_C::Obj_FindEridiumDoor_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Set_EnterBossArena_ObjSetVar) == 0x000560, "Member 'UMission_Ixora_VarkidBoss_C::Set_EnterBossArena_ObjSetVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Obj_BC1_ObjVar) == 0x000568, "Member 'UMission_Ixora_VarkidBoss_C::Obj_BC1_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Obj_BC2_ObjVar) == 0x000570, "Member 'UMission_Ixora_VarkidBoss_C::Obj_BC2_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Obj_StartingEridium_ObjVar) == 0x000578, "Member 'UMission_Ixora_VarkidBoss_C::Obj_StartingEridium_ObjVar' has a wrong offset!");
static_assert(offsetof(UMission_Ixora_VarkidBoss_C, Obj_DoorUnlock_INV_ObjVar) == 0x000580, "Member 'UMission_Ixora_VarkidBoss_C::Obj_DoorUnlock_INV_ObjVar' has a wrong offset!");

}

