#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NavigationSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NavigationSystem_structs.hpp"


namespace SDK
{

// Class NavigationSystem.GbxNavLayerBase
// 0x0000 (0x0030 - 0x0030)
class UGbxNavLayerBase : public UDataAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GbxNavLayerBase">();
	}
	static class UGbxNavLayerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNavLayerBase>();
	}
};
static_assert(alignof(UGbxNavLayerBase) == 0x000008, "Wrong alignment on UGbxNavLayerBase");
static_assert(sizeof(UGbxNavLayerBase) == 0x000030, "Wrong size on UGbxNavLayerBase");

// Class NavigationSystem.HavokTraversalType
// 0x0030 (0x0058 - 0x0028)
class UHavokTraversalType : public UObject
{
public:
	float                                         MaxPlanarAngle;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRelativeSlopeAngle;                             // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseCost;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGbxNavLayerBase*>               AssociatedLayers;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UGbxUserEdgeBase*                       GbxUserEdge;                                       // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHavokUserEdge>             UserEdge;                                          // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokTraversalType">();
	}
	static class UHavokTraversalType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokTraversalType>();
	}
};
static_assert(alignof(UHavokTraversalType) == 0x000008, "Wrong alignment on UHavokTraversalType");
static_assert(sizeof(UHavokTraversalType) == 0x000058, "Wrong size on UHavokTraversalType");
static_assert(offsetof(UHavokTraversalType, MaxPlanarAngle) == 0x000028, "Member 'UHavokTraversalType::MaxPlanarAngle' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType, MaxRelativeSlopeAngle) == 0x00002C, "Member 'UHavokTraversalType::MaxRelativeSlopeAngle' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType, BaseCost) == 0x000030, "Member 'UHavokTraversalType::BaseCost' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType, AssociatedLayers) == 0x000038, "Member 'UHavokTraversalType::AssociatedLayers' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType, GbxUserEdge) == 0x000048, "Member 'UHavokTraversalType::GbxUserEdge' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType, UserEdge) == 0x000050, "Member 'UHavokTraversalType::UserEdge' has a wrong offset!");

// Class NavigationSystem.HavokTraversalType_Vault
// 0x0030 (0x0088 - 0x0058)
class UHavokTraversalType_Vault final : public UHavokTraversalType
{
public:
	float                                         MinWallWidth;                                      // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWallWidth;                                      // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinWallHeight;                                     // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWallHeight;                                     // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxUpHeight;                                       // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDownHeight;                                     // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalApex;                                      // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandPlantAngle;                                    // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandPlantLeftExtent;                               // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandPlantRightExtent;                              // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HandPlantMaxProfileAngle;                          // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokTraversalType_Vault">();
	}
	static class UHavokTraversalType_Vault* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokTraversalType_Vault>();
	}
};
static_assert(alignof(UHavokTraversalType_Vault) == 0x000008, "Wrong alignment on UHavokTraversalType_Vault");
static_assert(sizeof(UHavokTraversalType_Vault) == 0x000088, "Wrong size on UHavokTraversalType_Vault");
static_assert(offsetof(UHavokTraversalType_Vault, MinWallWidth) == 0x000058, "Member 'UHavokTraversalType_Vault::MinWallWidth' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, MaxWallWidth) == 0x00005C, "Member 'UHavokTraversalType_Vault::MaxWallWidth' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, MinWallHeight) == 0x000060, "Member 'UHavokTraversalType_Vault::MinWallHeight' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, MaxWallHeight) == 0x000064, "Member 'UHavokTraversalType_Vault::MaxWallHeight' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, MaxUpHeight) == 0x000068, "Member 'UHavokTraversalType_Vault::MaxUpHeight' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, MaxDownHeight) == 0x00006C, "Member 'UHavokTraversalType_Vault::MaxDownHeight' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, VerticalApex) == 0x000070, "Member 'UHavokTraversalType_Vault::VerticalApex' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, HandPlantAngle) == 0x000074, "Member 'UHavokTraversalType_Vault::HandPlantAngle' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, HandPlantLeftExtent) == 0x000078, "Member 'UHavokTraversalType_Vault::HandPlantLeftExtent' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, HandPlantRightExtent) == 0x00007C, "Member 'UHavokTraversalType_Vault::HandPlantRightExtent' has a wrong offset!");
static_assert(offsetof(UHavokTraversalType_Vault, HandPlantMaxProfileAngle) == 0x000080, "Member 'UHavokTraversalType_Vault::HandPlantMaxProfileAngle' has a wrong offset!");

// Class NavigationSystem.NavigationSystemV1
// 0x0400 (0x0428 - 0x0028)
class UNavigationSystemV1 : public UNavigationSystemBase
{
public:
	class ANavigationData*                        MainNavData;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANavigationData*                        AbstractNavData;                                   // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCrowdManagerBase>          CrowdManagerClass;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bAutoCreateNavigationData : 1;                     // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bSpawnNavDataInNavBoundsLevel : 1;                 // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAllowClientSideNavigation : 1;                    // 0x0040(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldDiscardSubLevelNavData : 1;                 // 0x0040(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bTickWhilePaused : 1;                              // 0x0040(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bSupportRebuilding : 1;                            // 0x0040(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bInitialBuildingLocked : 1;                        // 0x0040(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_40_7 : 1;                                   // 0x0040(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         bSkipAgentHeightCheckWhenPickingNavData : 1;       // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	ENavDataGatheringModeConfig                   DataGatheringMode;                                 // 0x0044(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActiveTilesUpdateInterval;                         // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FNavDataConfig>                 SupportedAgents;                                   // 0x0050(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	float                                         DirtyAreasUpdateFreq;                              // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ANavigationData*>                NavDataSet;                                        // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ANavigationData*>                NavDataRegistrationQueue;                          // 0x0078(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x60];                                      // 0x0088(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnNavDataRegisteredEvent;                          // 0x00E8(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnNavigationGenerationFinishedDelegate;            // 0x00F8(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0xCC];                                     // 0x0108(0x00CC)(Fixing Size After Last Property [ Dumper-7 ])
	EFNavigationSystemRunMode                     OperationMode;                                     // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D5[0x23B];                                    // 0x01D5(0x023B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         NavigationDataClassName;                           // 0x0410(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UNavigationSystemV1* GetNavigationSystem(class UObject* WorldContextObject);
	static struct FVector GetRandomPointInNavigableRadius(class UObject* WorldContextObject, const struct FVector& Origin, float Radius, class ANavigationData* NavData, TSubclassOf<class UNavigationQueryFilter> FilterClass);
	static struct FVector GetRandomReachablePointInRadius(class UObject* WorldContextObject, const struct FVector& Origin, float Radius, class ANavigationData* NavData, TSubclassOf<class UNavigationQueryFilter> FilterClass);
	static bool K2_GetRandomPointInNavigableRadius(class UObject* WorldContextObject, const struct FVector& Origin, struct FVector* RandomLocation, float Radius, class ANavigationData* NavData, TSubclassOf<class UNavigationQueryFilter> FilterClass);
	static bool K2_GetRandomReachablePointInRadius(class UObject* WorldContextObject, const struct FVector& Origin, struct FVector* RandomLocation, float Radius, class ANavigationData* NavData, TSubclassOf<class UNavigationQueryFilter> FilterClass);
	static bool K2_ProjectPointToNavigation(class UObject* WorldContextObject, const struct FVector& Point, struct FVector* ProjectedLocation, class ANavigationData* NavData, TSubclassOf<class UNavigationQueryFilter> FilterClass, const struct FVector& QueryExtent);
	static struct FVector ProjectPointToNavigation(class UObject* WorldContextObject, const struct FVector& Point, class ANavigationData* NavData, TSubclassOf<class UNavigationQueryFilter> FilterClass, const struct FVector& QueryExtent);
	static void SimpleMoveToActor(class AController* Controller, const class AActor* Goal);
	static void SimpleMoveToLocation(class AController* Controller, const struct FVector& Goal);

	void OnNavigationBoundsUpdated(class ANavMeshBoundsVolume* NavVolume);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavigationSystemV1">();
	}
	static class UNavigationSystemV1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavigationSystemV1>();
	}
};
static_assert(alignof(UNavigationSystemV1) == 0x000008, "Wrong alignment on UNavigationSystemV1");
static_assert(sizeof(UNavigationSystemV1) == 0x000428, "Wrong size on UNavigationSystemV1");
static_assert(offsetof(UNavigationSystemV1, MainNavData) == 0x000028, "Member 'UNavigationSystemV1::MainNavData' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, AbstractNavData) == 0x000030, "Member 'UNavigationSystemV1::AbstractNavData' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, CrowdManagerClass) == 0x000038, "Member 'UNavigationSystemV1::CrowdManagerClass' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, DataGatheringMode) == 0x000044, "Member 'UNavigationSystemV1::DataGatheringMode' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, ActiveTilesUpdateInterval) == 0x00004C, "Member 'UNavigationSystemV1::ActiveTilesUpdateInterval' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, SupportedAgents) == 0x000050, "Member 'UNavigationSystemV1::SupportedAgents' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, DirtyAreasUpdateFreq) == 0x000060, "Member 'UNavigationSystemV1::DirtyAreasUpdateFreq' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, NavDataSet) == 0x000068, "Member 'UNavigationSystemV1::NavDataSet' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, NavDataRegistrationQueue) == 0x000078, "Member 'UNavigationSystemV1::NavDataRegistrationQueue' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, OnNavDataRegisteredEvent) == 0x0000E8, "Member 'UNavigationSystemV1::OnNavDataRegisteredEvent' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, OnNavigationGenerationFinishedDelegate) == 0x0000F8, "Member 'UNavigationSystemV1::OnNavigationGenerationFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, OperationMode) == 0x0001D4, "Member 'UNavigationSystemV1::OperationMode' has a wrong offset!");
static_assert(offsetof(UNavigationSystemV1, NavigationDataClassName) == 0x000410, "Member 'UNavigationSystemV1::NavigationDataClassName' has a wrong offset!");

// Class NavigationSystem.NavArea
// 0x0040 (0x0070 - 0x0030)
class UNavArea : public UNavAreaBase
{
public:
	float                                         DefaultCost;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FixedAreaEnteringCost;                             // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 DrawColor;                                         // 0x0038(0x0004)(Edit, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNavAgentSelector                      SupportedAgents;                                   // 0x003C(0x0004)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bSupportsAgent0 : 1;                               // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent1 : 1;                               // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent2 : 1;                               // 0x0040(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent3 : 1;                               // 0x0040(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent4 : 1;                               // 0x0040(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent5 : 1;                               // 0x0040(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent6 : 1;                               // 0x0040(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent7 : 1;                               // 0x0040(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent8 : 1;                               // 0x0041(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent9 : 1;                               // 0x0041(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent10 : 1;                              // 0x0041(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent11 : 1;                              // 0x0041(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent12 : 1;                              // 0x0041(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent13 : 1;                              // 0x0041(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent14 : 1;                              // 0x0041(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsAgent15 : 1;                              // 0x0041(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                GbxNavArea;                                        // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHavokNavMaterial                             HavokNavMaterial;                                  // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGbxNavLayerBase*>               IgnoreLayers;                                      // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UNavArea>                   EffectiveArea;                                     // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavArea">();
	}
	static class UNavArea* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavArea>();
	}
};
static_assert(alignof(UNavArea) == 0x000008, "Wrong alignment on UNavArea");
static_assert(sizeof(UNavArea) == 0x000070, "Wrong size on UNavArea");
static_assert(offsetof(UNavArea, DefaultCost) == 0x000030, "Member 'UNavArea::DefaultCost' has a wrong offset!");
static_assert(offsetof(UNavArea, FixedAreaEnteringCost) == 0x000034, "Member 'UNavArea::FixedAreaEnteringCost' has a wrong offset!");
static_assert(offsetof(UNavArea, DrawColor) == 0x000038, "Member 'UNavArea::DrawColor' has a wrong offset!");
static_assert(offsetof(UNavArea, SupportedAgents) == 0x00003C, "Member 'UNavArea::SupportedAgents' has a wrong offset!");
static_assert(offsetof(UNavArea, GbxNavArea) == 0x000048, "Member 'UNavArea::GbxNavArea' has a wrong offset!");
static_assert(offsetof(UNavArea, HavokNavMaterial) == 0x000050, "Member 'UNavArea::HavokNavMaterial' has a wrong offset!");
static_assert(offsetof(UNavArea, IgnoreLayers) == 0x000058, "Member 'UNavArea::IgnoreLayers' has a wrong offset!");
static_assert(offsetof(UNavArea, EffectiveArea) == 0x000068, "Member 'UNavArea::EffectiveArea' has a wrong offset!");

// Class NavigationSystem.NavAreaMeta
// 0x0000 (0x0070 - 0x0070)
class UNavAreaMeta : public UNavArea
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavAreaMeta">();
	}
	static class UNavAreaMeta* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavAreaMeta>();
	}
};
static_assert(alignof(UNavAreaMeta) == 0x000008, "Wrong alignment on UNavAreaMeta");
static_assert(sizeof(UNavAreaMeta) == 0x000070, "Wrong size on UNavAreaMeta");

// Class NavigationSystem.NavAreaMeta_SwitchByAgent
// 0x0080 (0x00F0 - 0x0070)
class UNavAreaMeta_SwitchByAgent final : public UNavAreaMeta
{
public:
	TSubclassOf<class UNavArea>                   Agent0Area;                                        // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent1Area;                                        // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent2Area;                                        // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent3Area;                                        // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent4Area;                                        // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent5Area;                                        // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent6Area;                                        // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent7Area;                                        // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent8Area;                                        // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent9Area;                                        // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent10Area;                                       // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent11Area;                                       // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent12Area;                                       // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent13Area;                                       // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent14Area;                                       // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                   Agent15Area;                                       // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavAreaMeta_SwitchByAgent">();
	}
	static class UNavAreaMeta_SwitchByAgent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavAreaMeta_SwitchByAgent>();
	}
};
static_assert(alignof(UNavAreaMeta_SwitchByAgent) == 0x000008, "Wrong alignment on UNavAreaMeta_SwitchByAgent");
static_assert(sizeof(UNavAreaMeta_SwitchByAgent) == 0x0000F0, "Wrong size on UNavAreaMeta_SwitchByAgent");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent0Area) == 0x000070, "Member 'UNavAreaMeta_SwitchByAgent::Agent0Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent1Area) == 0x000078, "Member 'UNavAreaMeta_SwitchByAgent::Agent1Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent2Area) == 0x000080, "Member 'UNavAreaMeta_SwitchByAgent::Agent2Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent3Area) == 0x000088, "Member 'UNavAreaMeta_SwitchByAgent::Agent3Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent4Area) == 0x000090, "Member 'UNavAreaMeta_SwitchByAgent::Agent4Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent5Area) == 0x000098, "Member 'UNavAreaMeta_SwitchByAgent::Agent5Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent6Area) == 0x0000A0, "Member 'UNavAreaMeta_SwitchByAgent::Agent6Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent7Area) == 0x0000A8, "Member 'UNavAreaMeta_SwitchByAgent::Agent7Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent8Area) == 0x0000B0, "Member 'UNavAreaMeta_SwitchByAgent::Agent8Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent9Area) == 0x0000B8, "Member 'UNavAreaMeta_SwitchByAgent::Agent9Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent10Area) == 0x0000C0, "Member 'UNavAreaMeta_SwitchByAgent::Agent10Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent11Area) == 0x0000C8, "Member 'UNavAreaMeta_SwitchByAgent::Agent11Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent12Area) == 0x0000D0, "Member 'UNavAreaMeta_SwitchByAgent::Agent12Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent13Area) == 0x0000D8, "Member 'UNavAreaMeta_SwitchByAgent::Agent13Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent14Area) == 0x0000E0, "Member 'UNavAreaMeta_SwitchByAgent::Agent14Area' has a wrong offset!");
static_assert(offsetof(UNavAreaMeta_SwitchByAgent, Agent15Area) == 0x0000E8, "Member 'UNavAreaMeta_SwitchByAgent::Agent15Area' has a wrong offset!");

// Class NavigationSystem.NavigationData
// 0x01C0 (0x0618 - 0x0458)
class ANavigationData : public AActor
{
public:
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    RenderingComp;                                     // 0x0460(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNavDataConfig                         NavDataConfig;                                     // 0x0468(0x0068)(Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bEnableDrawing : 1;                                // 0x04D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bForceRebuildOnLoad : 1;                           // 0x04D0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCanBeMainNavData : 1;                             // 0x04D0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, EditConst, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCanSpawnOnRebuild : 1;                            // 0x04D0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, Config, EditConst, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRebuildAtRuntime : 1;                             // 0x04D0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Config, Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ERuntimeGenerationType                        RuntimeGeneration;                                 // 0x04D4(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObservedPathsTickInterval;                         // 0x04D8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        DataVersion;                                       // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E0[0xD0];                                     // 0x04E0(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSupportedAreaData>             SupportedAreas;                                    // 0x05B0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C0[0x58];                                     // 0x05C0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavigationData">();
	}
	static class ANavigationData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavigationData>();
	}
};
static_assert(alignof(ANavigationData) == 0x000008, "Wrong alignment on ANavigationData");
static_assert(sizeof(ANavigationData) == 0x000618, "Wrong size on ANavigationData");
static_assert(offsetof(ANavigationData, RenderingComp) == 0x000460, "Member 'ANavigationData::RenderingComp' has a wrong offset!");
static_assert(offsetof(ANavigationData, NavDataConfig) == 0x000468, "Member 'ANavigationData::NavDataConfig' has a wrong offset!");
static_assert(offsetof(ANavigationData, RuntimeGeneration) == 0x0004D4, "Member 'ANavigationData::RuntimeGeneration' has a wrong offset!");
static_assert(offsetof(ANavigationData, ObservedPathsTickInterval) == 0x0004D8, "Member 'ANavigationData::ObservedPathsTickInterval' has a wrong offset!");
static_assert(offsetof(ANavigationData, DataVersion) == 0x0004DC, "Member 'ANavigationData::DataVersion' has a wrong offset!");
static_assert(offsetof(ANavigationData, SupportedAreas) == 0x0005B0, "Member 'ANavigationData::SupportedAreas' has a wrong offset!");

// Class NavigationSystem.AbstractNavData
// 0x0000 (0x0618 - 0x0618)
class AAbstractNavData final : public ANavigationData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbstractNavData">();
	}
	static class AAbstractNavData* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbstractNavData>();
	}
};
static_assert(alignof(AAbstractNavData) == 0x000008, "Wrong alignment on AAbstractNavData");
static_assert(sizeof(AAbstractNavData) == 0x000618, "Wrong size on AAbstractNavData");

// Class NavigationSystem.CrowdManagerBase
// 0x0000 (0x0028 - 0x0028)
class UCrowdManagerBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CrowdManagerBase">();
	}
	static class UCrowdManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrowdManagerBase>();
	}
};
static_assert(alignof(UCrowdManagerBase) == 0x000008, "Wrong alignment on UCrowdManagerBase");
static_assert(sizeof(UCrowdManagerBase) == 0x000028, "Wrong size on UCrowdManagerBase");

// Class NavigationSystem.HavokNavData
// 0x0000 (0x0028 - 0x0028)
class UHavokNavData : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokNavData">();
	}
	static class UHavokNavData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokNavData>();
	}
};
static_assert(alignof(UHavokNavData) == 0x000008, "Wrong alignment on UHavokNavData");
static_assert(sizeof(UHavokNavData) == 0x000028, "Wrong size on UHavokNavData");

// Class NavigationSystem.NavigationQueryFilter
// 0x0020 (0x0048 - 0x0028)
class UNavigationQueryFilter : public UObject
{
public:
	TArray<struct FNavigationFilterArea>          Areas;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNavigationFilterFlags                 IncludeFlags;                                      // 0x0038(0x0004)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FNavigationFilterFlags                 ExcludeFlags;                                      // 0x003C(0x0004)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavigationQueryFilter">();
	}
	static class UNavigationQueryFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavigationQueryFilter>();
	}
};
static_assert(alignof(UNavigationQueryFilter) == 0x000008, "Wrong alignment on UNavigationQueryFilter");
static_assert(sizeof(UNavigationQueryFilter) == 0x000048, "Wrong size on UNavigationQueryFilter");
static_assert(offsetof(UNavigationQueryFilter, Areas) == 0x000028, "Member 'UNavigationQueryFilter::Areas' has a wrong offset!");
static_assert(offsetof(UNavigationQueryFilter, IncludeFlags) == 0x000038, "Member 'UNavigationQueryFilter::IncludeFlags' has a wrong offset!");
static_assert(offsetof(UNavigationQueryFilter, ExcludeFlags) == 0x00003C, "Member 'UNavigationQueryFilter::ExcludeFlags' has a wrong offset!");

// Class NavigationSystem.HavokNavigationQueryFilter
// 0x0000 (0x0048 - 0x0048)
class UHavokNavigationQueryFilter final : public UNavigationQueryFilter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokNavigationQueryFilter">();
	}
	static class UHavokNavigationQueryFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokNavigationQueryFilter>();
	}
};
static_assert(alignof(UHavokNavigationQueryFilter) == 0x000008, "Wrong alignment on UHavokNavigationQueryFilter");
static_assert(sizeof(UHavokNavigationQueryFilter) == 0x000048, "Wrong size on UHavokNavigationQueryFilter");

// Class NavigationSystem.HavokNavLayer
// 0x0010 (0x0038 - 0x0028)
class UHavokNavLayer : public UHavokNavLayerBase
{
public:
	class UGbxNavLayerBase*                       GbxNavLayer;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 DrawColor;                                         // 0x0030(0x0004)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokNavLayer">();
	}
	static class UHavokNavLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokNavLayer>();
	}
};
static_assert(alignof(UHavokNavLayer) == 0x000008, "Wrong alignment on UHavokNavLayer");
static_assert(sizeof(UHavokNavLayer) == 0x000038, "Wrong size on UHavokNavLayer");
static_assert(offsetof(UHavokNavLayer, GbxNavLayer) == 0x000028, "Member 'UHavokNavLayer::GbxNavLayer' has a wrong offset!");
static_assert(offsetof(UHavokNavLayer, DrawColor) == 0x000030, "Member 'UHavokNavLayer::DrawColor' has a wrong offset!");

// Class NavigationSystem.HavokNavLayerRegistry
// 0x00E0 (0x0108 - 0x0028)
class UHavokNavLayerRegistry final : public UObject
{
public:
	uint8                                         Pad_28[0xE0];                                      // 0x0028(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokNavLayerRegistry">();
	}
	static class UHavokNavLayerRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokNavLayerRegistry>();
	}
};
static_assert(alignof(UHavokNavLayerRegistry) == 0x000008, "Wrong alignment on UHavokNavLayerRegistry");
static_assert(sizeof(UHavokNavLayerRegistry) == 0x000108, "Wrong size on UHavokNavLayerRegistry");

// Class NavigationSystem.HavokNavMesh
// 0x0028 (0x0050 - 0x0028)
class UHavokNavMesh final : public UHavokNavData
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokNavMesh">();
	}
	static class UHavokNavMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokNavMesh>();
	}
};
static_assert(alignof(UHavokNavMesh) == 0x000008, "Wrong alignment on UHavokNavMesh");
static_assert(sizeof(UHavokNavMesh) == 0x000050, "Wrong size on UHavokNavMesh");

// Class NavigationSystem.NavTraversalData
// 0x0020 (0x0050 - 0x0030)
class UNavTraversalData final : public UDataAsset
{
public:
	struct FHavokTraversalAnalysisSettings        Settings;                                          // 0x0030(0x0020)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavTraversalData">();
	}
	static class UNavTraversalData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavTraversalData>();
	}
};
static_assert(alignof(UNavTraversalData) == 0x000008, "Wrong alignment on UNavTraversalData");
static_assert(sizeof(UNavTraversalData) == 0x000050, "Wrong size on UNavTraversalData");
static_assert(offsetof(UNavTraversalData, Settings) == 0x000030, "Member 'UNavTraversalData::Settings' has a wrong offset!");

// Class NavigationSystem.HavokNavMeshGenerationSettings
// 0x0160 (0x0188 - 0x0028)
class UHavokNavMeshGenerationSettings final : public UObject
{
public:
	float                                         QuantizationGridSize;                              // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWalkableSlope;                                  // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DegenerateAreaThreshold;                           // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DegeneratedWidthThreshold;                         // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConvexThreshold;                                   // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumEdgesPerFace;                                // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHavokNavMeshEdgeMatchingSettings      EdgeMatchingSettings;                              // 0x0040(0x0028)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FHavokNavMeshEdgeMatchingSettings      StreamEdgeMatchingSettings;                        // 0x0068(0x0028)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	EHavokNavMeshEdgeMatchingMetric               EdgeMatchingMetric;                                // 0x0090(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EdgeConnectionIterations;                          // 0x0094(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHavokNavMeshRegionPruningSettings     RegionPruningSettings;                             // 0x0098(0x0014)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bFixupOverlappingTriangles : 1;                    // 0x00AC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHavokNavMeshOverlappingTrianglesSettings OverlappingTrianglesSettings;                      // 0x00B0(0x000C)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         bWeldInputVertices : 1;                            // 0x00BC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WeldThreshold;                                     // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableSimplification : 1;                         // 0x00C4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHavokNavMeshSimplificationSettings    SimplificationSettings;                            // 0x00C8(0x007C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHavokTraversalAnalysisSettings        TraversalAnalysisSettings;                         // 0x0148(0x0020)(Edit, Config, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        TraversalSettingsName;                             // 0x0168(0x0018)(Edit, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSaveInputSnapshot : 1;                            // 0x0180(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokNavMeshGenerationSettings">();
	}
	static class UHavokNavMeshGenerationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokNavMeshGenerationSettings>();
	}
};
static_assert(alignof(UHavokNavMeshGenerationSettings) == 0x000008, "Wrong alignment on UHavokNavMeshGenerationSettings");
static_assert(sizeof(UHavokNavMeshGenerationSettings) == 0x000188, "Wrong size on UHavokNavMeshGenerationSettings");
static_assert(offsetof(UHavokNavMeshGenerationSettings, QuantizationGridSize) == 0x000028, "Member 'UHavokNavMeshGenerationSettings::QuantizationGridSize' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, MaxWalkableSlope) == 0x00002C, "Member 'UHavokNavMeshGenerationSettings::MaxWalkableSlope' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, DegenerateAreaThreshold) == 0x000030, "Member 'UHavokNavMeshGenerationSettings::DegenerateAreaThreshold' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, DegeneratedWidthThreshold) == 0x000034, "Member 'UHavokNavMeshGenerationSettings::DegeneratedWidthThreshold' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, ConvexThreshold) == 0x000038, "Member 'UHavokNavMeshGenerationSettings::ConvexThreshold' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, MaxNumEdgesPerFace) == 0x00003C, "Member 'UHavokNavMeshGenerationSettings::MaxNumEdgesPerFace' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, EdgeMatchingSettings) == 0x000040, "Member 'UHavokNavMeshGenerationSettings::EdgeMatchingSettings' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, StreamEdgeMatchingSettings) == 0x000068, "Member 'UHavokNavMeshGenerationSettings::StreamEdgeMatchingSettings' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, EdgeMatchingMetric) == 0x000090, "Member 'UHavokNavMeshGenerationSettings::EdgeMatchingMetric' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, EdgeConnectionIterations) == 0x000094, "Member 'UHavokNavMeshGenerationSettings::EdgeConnectionIterations' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, RegionPruningSettings) == 0x000098, "Member 'UHavokNavMeshGenerationSettings::RegionPruningSettings' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, OverlappingTrianglesSettings) == 0x0000B0, "Member 'UHavokNavMeshGenerationSettings::OverlappingTrianglesSettings' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, WeldThreshold) == 0x0000C0, "Member 'UHavokNavMeshGenerationSettings::WeldThreshold' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, SimplificationSettings) == 0x0000C8, "Member 'UHavokNavMeshGenerationSettings::SimplificationSettings' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, TraversalAnalysisSettings) == 0x000148, "Member 'UHavokNavMeshGenerationSettings::TraversalAnalysisSettings' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshGenerationSettings, TraversalSettingsName) == 0x000168, "Member 'UHavokNavMeshGenerationSettings::TraversalSettingsName' has a wrong offset!");

// Class NavigationSystem.HavokNavMeshLayer
// 0x0010 (0x0048 - 0x0038)
class UHavokNavMeshLayer : public UHavokNavLayer
{
public:
	float                                         CharacterRadius;                                   // 0x0038(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CharacterHalfHeight;                               // 0x003C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UserEdgeEntryDistance;                             // 0x0040(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bErodeWidth;                                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokNavMeshLayer">();
	}
	static class UHavokNavMeshLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokNavMeshLayer>();
	}
};
static_assert(alignof(UHavokNavMeshLayer) == 0x000008, "Wrong alignment on UHavokNavMeshLayer");
static_assert(sizeof(UHavokNavMeshLayer) == 0x000048, "Wrong size on UHavokNavMeshLayer");
static_assert(offsetof(UHavokNavMeshLayer, CharacterRadius) == 0x000038, "Member 'UHavokNavMeshLayer::CharacterRadius' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshLayer, CharacterHalfHeight) == 0x00003C, "Member 'UHavokNavMeshLayer::CharacterHalfHeight' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshLayer, UserEdgeEntryDistance) == 0x000040, "Member 'UHavokNavMeshLayer::UserEdgeEntryDistance' has a wrong offset!");
static_assert(offsetof(UHavokNavMeshLayer, bErodeWidth) == 0x000044, "Member 'UHavokNavMeshLayer::bErodeWidth' has a wrong offset!");

// Class NavigationSystem.HavokNavMeshLayer_Default
// 0x0000 (0x0048 - 0x0048)
class UHavokNavMeshLayer_Default final : public UHavokNavMeshLayer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokNavMeshLayer_Default">();
	}
	static class UHavokNavMeshLayer_Default* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokNavMeshLayer_Default>();
	}
};
static_assert(alignof(UHavokNavMeshLayer_Default) == 0x000008, "Wrong alignment on UHavokNavMeshLayer_Default");
static_assert(sizeof(UHavokNavMeshLayer_Default) == 0x000048, "Wrong size on UHavokNavMeshLayer_Default");

// Class NavigationSystem.HavokNavVolume
// 0x0018 (0x0040 - 0x0028)
class UHavokNavVolume final : public UHavokNavData
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HavokNavVolume">();
	}
	static class UHavokNavVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHavokNavVolume>();
	}
};
static_assert(alignof(UHavokNavVolume) == 0x000008, "Wrong alignment on UHavokNavVolume");
static_assert(sizeof(UHavokNavVolume) == 0x000040, "Wrong size on UHavokNavVolume");

// Class NavigationSystem.HavokNavVolumeGenerationSettings
// 0x0040 (0x0068 - 0x0028)
class UHavokNavVolumeGenerationSettings final : public UObject
{
public:
	struct FHavokNavVolumeChunkSettings           ChunkSettings;                                     // 0x0028(0x0008)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FHavokNavVolumeBorderSettings          BorderSettings;                                    // 0x0030(0x0008)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FHavokNavVolumeMergingSettings         MergingSettings;                                   // 0x0038(0x0020)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FHavokNavVolumePruningSettings         PruningSettings;                                   // 0x0058(0x0008)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSaveInputSnapshot;                                // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
