#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakAbility_Beastmaster_ClassMod_Alisma

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function OakAbility_Beastmaster_ClassMod_Alisma.OakAbility_Beastmaster_ClassMod_Alisma_C.ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma
// 0x01F8 (0x01F8 - 0x0000)
struct OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageInstigator;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   K2Node_CustomEvent_Details;                        // 0x0050(0x0060)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakDamageCauserComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec;             // 0x00D0(0x0018)(NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x00F0(0x0028)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_Player*                   K2Node_DynamicCast_AsOak_Character_Player;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_Event_Spec;                                 // 0x0130(0x0018)(ConstParm, NoDestructor)
	struct FOakAbilityTimerResult                 K2Node_Event_Result;                               // 0x0148(0x000C)(ConstParm, NoDestructor)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrenade*                               CallFunc_SpawnAmmoOptionalGrenadeFromSource_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0160(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma) == 0x000008, "Wrong alignment on OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma");
static_assert(sizeof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma) == 0x0001F8, "Wrong size on OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, EntryPoint) == 0x000000, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::EntryPoint' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_GetAbilityOwner_ReturnValue) == 0x000020, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_CustomEvent_DamageInstigator) == 0x000028, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_CustomEvent_DamageInstigator' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_CustomEvent_Damage) == 0x000030, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_CustomEvent_DamageType) == 0x000038, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_CustomEvent_DamageSource) == 0x000040, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_CustomEvent_DamagedActor) == 0x000048, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_CustomEvent_Details) == 0x000050, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_GetOwner_ReturnValue) == 0x0000B0, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_GetComponentByClass_ReturnValue) == 0x0000B8, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_GetObjectClass_ReturnValue) == 0x0000C0, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000C8, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x0000CC, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_MakeStruct_OakAbilityTimerSpec) == 0x0000D0, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_MakeStruct_OakAbilityTimerSpec' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_GetAbilityOwner_ReturnValue1) == 0x0000E8, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x0000F0, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_GetOwner_ReturnValue1) == 0x000118, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_DynamicCast_AsOak_Character_Player) == 0x000120, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_DynamicCast_AsOak_Character_Player' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_Event_Spec) == 0x000130, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_Event_Spec' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, K2Node_Event_Result) == 0x000148, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_SpawnAmmoOptionalGrenadeFromSource_ReturnValue) == 0x000158, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_SpawnAmmoOptionalGrenadeFromSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000160, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001F0, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_Alisma::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function OakAbility_Beastmaster_ClassMod_Alisma.OakAbility_Beastmaster_ClassMod_Alisma_C.OnAbilityTimerEnded
// 0x0028 (0x0028 - 0x0000)
struct OakAbility_Beastmaster_ClassMod_Alisma_C_OnAbilityTimerEnded final
{
public:
	struct FOakAbilityTimerSpec                   Spec;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FOakAbilityTimerResult                 Result;                                            // 0x0018(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(OakAbility_Beastmaster_ClassMod_Alisma_C_OnAbilityTimerEnded) == 0x000008, "Wrong alignment on OakAbility_Beastmaster_ClassMod_Alisma_C_OnAbilityTimerEnded");
static_assert(sizeof(OakAbility_Beastmaster_ClassMod_Alisma_C_OnAbilityTimerEnded) == 0x000028, "Wrong size on OakAbility_Beastmaster_ClassMod_Alisma_C_OnAbilityTimerEnded");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_OnAbilityTimerEnded, Spec) == 0x000000, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_OnAbilityTimerEnded::Spec' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_OnAbilityTimerEnded, Result) == 0x000018, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_OnAbilityTimerEnded::Result' has a wrong offset!");

// Function OakAbility_Beastmaster_ClassMod_Alisma.OakAbility_Beastmaster_ClassMod_Alisma_C.BeastmasterClassModAlisma_OnCausedAnyDamage
// 0x0088 (0x0088 - 0x0000)
struct OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor_0;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0028(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage) == 0x000008, "Wrong alignment on OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage");
static_assert(sizeof(OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage) == 0x000088, "Wrong size on OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage, DamageInstigator) == 0x000000, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage::DamageInstigator' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage, Damage) == 0x000008, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage, DamageType) == 0x000010, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage, DamageSource) == 0x000018, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage::DamageSource' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage, DamagedActor_0) == 0x000020, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage::DamagedActor_0' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage, Details) == 0x000028, "Member 'OakAbility_Beastmaster_ClassMod_Alisma_C_BeastmasterClassModAlisma_OnCausedAnyDamage::Details' has a wrong offset!");

}

