#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakAbility_Beastmaster_ClassMod_DLC1

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function OakAbility_Beastmaster_ClassMod_DLC1.OakAbility_Beastmaster_ClassMod_DLC1_C.ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1
// 0x0168 (0x0168 - 0x0000)
struct OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec;          // 0x0008(0x0010)(NoDestructor)
	TDelegate<void(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageInstigator;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   K2Node_CustomEvent_Details;                        // 0x0060(0x0060)(ContainsInstancedReference)
	class UOakDamageCauserComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x00C8(0x0028)(NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0118(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0150(0x0018)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1) == 0x000008, "Wrong alignment on OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1");
static_assert(sizeof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1) == 0x000168, "Wrong size on OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, EntryPoint) == 0x000000, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::EntryPoint' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_MakeStruct_StatusEffectRemoveSpec) == 0x000008, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_MakeStruct_StatusEffectRemoveSpec' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, CallFunc_GetAbilityOwner_ReturnValue) == 0x000028, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_CustomEvent_DamageInstigator) == 0x000038, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_CustomEvent_DamageInstigator' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_CustomEvent_Damage) == 0x000040, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_CustomEvent_DamageType) == 0x000048, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_CustomEvent_DamageSource) == 0x000050, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_CustomEvent_DamagedActor) == 0x000058, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_CustomEvent_Details) == 0x000060, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C0, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x0000C8, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, CallFunc_GetObjectClass_ReturnValue) == 0x0000F0, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, CallFunc_GetAbilityOwner_ReturnValue1) == 0x0000F8, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, CallFunc_ClassIsChildOf_ReturnValue) == 0x000100, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, CallFunc_GetOwner_ReturnValue1) == 0x000108, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, CallFunc_RemoveStatusEffect_ReturnValue) == 0x000110, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::CallFunc_RemoveStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, K2Node_MakeStruct_StatusEffectSpec) == 0x000118, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1, CallFunc_AddStatusEffect_ReturnValue) == 0x000150, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_ExecuteUbergraph_OakAbility_Beastmaster_ClassMod_DLC1::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");

// Function OakAbility_Beastmaster_ClassMod_DLC1.OakAbility_Beastmaster_ClassMod_DLC1_C.Beastmaster DLC1 Class Mod On Caused Any Damage
// 0x0088 (0x0088 - 0x0000)
struct OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0028(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage) == 0x000008, "Wrong alignment on OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage");
static_assert(sizeof(OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage) == 0x000088, "Wrong size on OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage, DamageInstigator) == 0x000000, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage::DamageInstigator' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage, Damage) == 0x000008, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage::Damage' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage, DamageType) == 0x000010, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage::DamageType' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage, DamageSource) == 0x000018, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage::DamageSource' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage, DamagedActor) == 0x000020, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage::DamagedActor' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage, Details) == 0x000028, "Member 'OakAbility_Beastmaster_ClassMod_DLC1_C_Beastmaster_DLC1_Class_Mod_On_Caused_Any_Damage::Details' has a wrong offset!");

}

