#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakAbility_Operative_ClassMod_Unique_01

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function OakAbility_Operative_ClassMod_Unique_01.OakAbility_Operative_ClassMod_Unique_01_C.ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01
// 0x0080 (0x0080 - 0x0000)
struct OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0040(0x0028)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakDamageComponent*                    CallFunc_GetComponentByClass_ReturnValue1;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxShield_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01) == 0x000008, "Wrong alignment on OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01");
static_assert(sizeof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01) == 0x000080, "Wrong size on OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, EntryPoint) == 0x000000, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, CallFunc_GetAbilityOwner_ReturnValue) == 0x000018, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, K2Node_CustomEvent_ActionAbility) == 0x000028, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::K2Node_CustomEvent_ActionAbility' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, CallFunc_GetAbilityOwner_ReturnValue1) == 0x000038, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000040, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, CallFunc_GetOwner_ReturnValue1) == 0x000068, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, CallFunc_GetComponentByClass_ReturnValue1) == 0x000070, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, CallFunc_GetMaxShield_ReturnValue) == 0x000078, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::CallFunc_GetMaxShield_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_ExecuteUbergraph_OakAbility_Operative_ClassMod_Unique_01::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function OakAbility_Operative_ClassMod_Unique_01.OakAbility_Operative_ClassMod_Unique_01_C.OnActionSkillActivated
// 0x0008 (0x0008 - 0x0000)
struct OakAbility_Operative_ClassMod_Unique_01_C_OnActionSkillActivated final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OakAbility_Operative_ClassMod_Unique_01_C_OnActionSkillActivated) == 0x000008, "Wrong alignment on OakAbility_Operative_ClassMod_Unique_01_C_OnActionSkillActivated");
static_assert(sizeof(OakAbility_Operative_ClassMod_Unique_01_C_OnActionSkillActivated) == 0x000008, "Wrong size on OakAbility_Operative_ClassMod_Unique_01_C_OnActionSkillActivated");
static_assert(offsetof(OakAbility_Operative_ClassMod_Unique_01_C_OnActionSkillActivated, ActionAbility) == 0x000000, "Member 'OakAbility_Operative_ClassMod_Unique_01_C_OnActionSkillActivated::ActionAbility' has a wrong offset!");

}

