#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakAbility_Beastmaster_Unique01

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function OakAbility_Beastmaster_Unique01.OakAbility_Beastmaster_Unique01_C.ExecuteUbergraph_OakAbility_Beastmaster_Unique01
// 0x01F0 (0x01F0 - 0x0000)
struct OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0008(0x0038)(NoDestructor)
	TDelegate<void(class AOakCharacter* Pet)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageComponent*                 K2Node_CustomEvent_Damaged;                        // 0x0060(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x0068(0x0068)(ConstParm)
	class UOakDamageCauserComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue2;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IIBPChar_Beastmaster_C> K2Node_DynamicCast_AsIBPChar_Beastmaster;          // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          CallFunc_GetCurrentPet_Res;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue1;         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPEventHub_Beastmaster_C*              K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0148(0x0028)(NoDestructor)
	bool                                          CallFunc_IsInDownState_ReturnValue;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue3;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue3;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x0188(0x0028)(NoDestructor)
	TScriptInterface<class IIBPChar_Beastmaster_C> K2Node_DynamicCast_AsIBPChar_Beastmaster1;         // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CallFunc_GetCurrentPet_Res1;                       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_CustomEvent_Pet;                            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x01D8(0x0018)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01) == 0x000008, "Wrong alignment on OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01");
static_assert(sizeof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01) == 0x0001F0, "Wrong size on OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, EntryPoint) == 0x000000, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::EntryPoint' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_MakeStruct_StatusEffectSpec) == 0x000008, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetAbilityOwner_ReturnValue) == 0x000050, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_CustomEvent_Damaged) == 0x000060, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_CustomEvent_Details) == 0x000068, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D0, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_CreateDelegate_OutputDelegate1) == 0x0000D8, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetAbilityOwner_ReturnValue1) == 0x0000E8, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetOwner_ReturnValue1) == 0x0000F0, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetAbilityOwner_ReturnValue2) == 0x0000F8, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetAbilityOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_DynamicCast_AsIBPChar_Beastmaster) == 0x000100, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_DynamicCast_AsIBPChar_Beastmaster' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetOwner_ReturnValue2) == 0x000118, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetCurrentPet_Res) == 0x000120, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetCurrentPet_Res' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetComponentByClass_ReturnValue1) == 0x000128, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster) == 0x000138, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_DynamicCast_bSuccess1) == 0x000140, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000148, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_IsInDownState_ReturnValue) == 0x000170, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_IsInDownState_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetAbilityOwner_ReturnValue3) == 0x000178, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetAbilityOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetOwner_ReturnValue3) == 0x000180, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x000188, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_DynamicCast_AsIBPChar_Beastmaster1) == 0x0001B0, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_DynamicCast_AsIBPChar_Beastmaster1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_DynamicCast_bSuccess2) == 0x0001C0, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_GetCurrentPet_Res1) == 0x0001C8, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_GetCurrentPet_Res1' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, K2Node_CustomEvent_Pet) == 0x0001D0, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::K2Node_CustomEvent_Pet' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01, CallFunc_AddStatusEffect_ReturnValue) == 0x0001D8, "Member 'OakAbility_Beastmaster_Unique01_C_ExecuteUbergraph_OakAbility_Beastmaster_Unique01::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");

// Function OakAbility_Beastmaster_Unique01.OakAbility_Beastmaster_Unique01_C.AddPetDamageModifier
// 0x0008 (0x0008 - 0x0000)
struct OakAbility_Beastmaster_Unique01_C_AddPetDamageModifier final
{
public:
	class AOakCharacter*                          Pet;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OakAbility_Beastmaster_Unique01_C_AddPetDamageModifier) == 0x000008, "Wrong alignment on OakAbility_Beastmaster_Unique01_C_AddPetDamageModifier");
static_assert(sizeof(OakAbility_Beastmaster_Unique01_C_AddPetDamageModifier) == 0x000008, "Wrong size on OakAbility_Beastmaster_Unique01_C_AddPetDamageModifier");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_AddPetDamageModifier, Pet) == 0x000000, "Member 'OakAbility_Beastmaster_Unique01_C_AddPetDamageModifier::Pet' has a wrong offset!");

// Function OakAbility_Beastmaster_Unique01.OakAbility_Beastmaster_Unique01_C.CausedDeath_UniqueClassMod01
// 0x0070 (0x0070 - 0x0000)
struct OakAbility_Beastmaster_Unique01_C_CausedDeath_UniqueClassMod01 final
{
public:
	const class UDamageComponent*                 Damaged;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(OakAbility_Beastmaster_Unique01_C_CausedDeath_UniqueClassMod01) == 0x000008, "Wrong alignment on OakAbility_Beastmaster_Unique01_C_CausedDeath_UniqueClassMod01");
static_assert(sizeof(OakAbility_Beastmaster_Unique01_C_CausedDeath_UniqueClassMod01) == 0x000070, "Wrong size on OakAbility_Beastmaster_Unique01_C_CausedDeath_UniqueClassMod01");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_CausedDeath_UniqueClassMod01, Damaged) == 0x000000, "Member 'OakAbility_Beastmaster_Unique01_C_CausedDeath_UniqueClassMod01::Damaged' has a wrong offset!");
static_assert(offsetof(OakAbility_Beastmaster_Unique01_C_CausedDeath_UniqueClassMod01, Details) == 0x000008, "Member 'OakAbility_Beastmaster_Unique01_C_CausedDeath_UniqueClassMod01::Details' has a wrong offset!");

}

