#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakAbility_Siren_ClassMod_Raid1

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function OakAbility_Siren_ClassMod_Raid1.OakAbility_Siren_ClassMod_Raid1_C.ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1
// 0x00C0 (0x00C0 - 0x0000)
struct OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbility_PhaseTrance*          K2Node_DynamicCast_AsOak_Action_Ability_Phase_Trance; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0060(0x0028)(NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue2;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectInstanceReference         CallFunc_TriggerElementalEffect_ReturnValue;       // 0x00A8(0x0018)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1) == 0x000008, "Wrong alignment on OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1");
static_assert(sizeof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1) == 0x0000C0, "Wrong size on OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, EntryPoint) == 0x000000, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::EntryPoint' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000018, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetAbilityOwner_ReturnValue1) == 0x000030, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetAbilityOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetOwner_ReturnValue1) == 0x000038, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, K2Node_CustomEvent_ActionAbility) == 0x000040, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::K2Node_CustomEvent_ActionAbility' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, K2Node_DynamicCast_AsOak_Action_Ability_Phase_Trance) == 0x000050, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::K2Node_DynamicCast_AsOak_Action_Ability_Phase_Trance' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000060, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetAbilityOwner_ReturnValue2) == 0x000088, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetAbilityOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetOwner_ReturnValue2) == 0x000090, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetAssociatedPlayerController_ReturnValue) == 0x000098, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetAssociatedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x0000A0, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A4, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1, CallFunc_TriggerElementalEffect_ReturnValue) == 0x0000A8, "Member 'OakAbility_Siren_ClassMod_Raid1_C_ExecuteUbergraph_OakAbility_Siren_ClassMod_Raid1::CallFunc_TriggerElementalEffect_ReturnValue' has a wrong offset!");

// Function OakAbility_Siren_ClassMod_Raid1.OakAbility_Siren_ClassMod_Raid1_C.SirenCMRaid1_OnActionSkillActivated
// 0x0008 (0x0008 - 0x0000)
struct OakAbility_Siren_ClassMod_Raid1_C_SirenCMRaid1_OnActionSkillActivated final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OakAbility_Siren_ClassMod_Raid1_C_SirenCMRaid1_OnActionSkillActivated) == 0x000008, "Wrong alignment on OakAbility_Siren_ClassMod_Raid1_C_SirenCMRaid1_OnActionSkillActivated");
static_assert(sizeof(OakAbility_Siren_ClassMod_Raid1_C_SirenCMRaid1_OnActionSkillActivated) == 0x000008, "Wrong size on OakAbility_Siren_ClassMod_Raid1_C_SirenCMRaid1_OnActionSkillActivated");
static_assert(offsetof(OakAbility_Siren_ClassMod_Raid1_C_SirenCMRaid1_OnActionSkillActivated, ActionAbility) == 0x000000, "Member 'OakAbility_Siren_ClassMod_Raid1_C_SirenCMRaid1_OnActionSkillActivated::ActionAbility' has a wrong offset!");

}

