#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakAbility_Gunner_CM_Raid1

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass OakAbility_Gunner_CM_Raid1.OakAbility_Gunner_CM_Raid1_C
// 0x0040 (0x0138 - 0x00F8)
class UOakAbility_Gunner_CM_Raid1_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	class AOakCharacter_Player*                   PlayerCharacterOwner;                              // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_OakAbility_Gunner_CM_Raid1; // 0x0108(0x0028)()
	class AOakCharacter_IronBear*                 IronBear;                                          // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OakAbility_Gunner_CM_Raid1(int32 EntryPoint);
	void OnActivated();
	void CMRaid1_IronBear_OnTakeAnyDamage(class UDamageComponent* DamageReceiver, float Damage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, const struct FReceivedDamageDetails& Details);
	void CMRaid1_IronBear_OnCausedDeath(const class UDamageComponent* Damaged, const struct FCausedDeathDetails& Details);
	void CMRaid1_OnActionSkillActivated(class UOakActionAbility* ActionAbility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OakAbility_Gunner_CM_Raid1_C">();
	}
	static class UOakAbility_Gunner_CM_Raid1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOakAbility_Gunner_CM_Raid1_C>();
	}
};
static_assert(alignof(UOakAbility_Gunner_CM_Raid1_C) == 0x000008, "Wrong alignment on UOakAbility_Gunner_CM_Raid1_C");
static_assert(sizeof(UOakAbility_Gunner_CM_Raid1_C) == 0x000138, "Wrong size on UOakAbility_Gunner_CM_Raid1_C");
static_assert(offsetof(UOakAbility_Gunner_CM_Raid1_C, UberGraphFrame) == 0x0000F8, "Member 'UOakAbility_Gunner_CM_Raid1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOakAbility_Gunner_CM_Raid1_C, PlayerCharacterOwner) == 0x000100, "Member 'UOakAbility_Gunner_CM_Raid1_C::PlayerCharacterOwner' has a wrong offset!");
static_assert(offsetof(UOakAbility_Gunner_CM_Raid1_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_OakAbility_Gunner_CM_Raid1) == 0x000108, "Member 'UOakAbility_Gunner_CM_Raid1_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_OakAbility_Gunner_CM_Raid1' has a wrong offset!");
static_assert(offsetof(UOakAbility_Gunner_CM_Raid1_C, IronBear) == 0x000130, "Member 'UOakAbility_Gunner_CM_Raid1_C::IronBear' has a wrong offset!");

}

