#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakAbility_Operative_CM_Hib

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function OakAbility_Operative_CM_Hib.OakAbility_Operative_CM_Hib_C.ExecuteUbergraph_OakAbility_Operative_CM_Hib
// 0x0048 (0x0048 - 0x0000)
struct OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakDamageCauserComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ConditionalDamageModifier K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier; // 0x0020(0x0028)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib) == 0x000008, "Wrong alignment on OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib");
static_assert(sizeof(OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib) == 0x000048, "Wrong size on OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib");
static_assert(offsetof(OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib, EntryPoint) == 0x000000, "Member 'OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib::EntryPoint' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib, CallFunc_GetAbilityOwner_ReturnValue) == 0x000008, "Member 'OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib, K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier) == 0x000020, "Member 'OakAbility_Operative_CM_Hib_C_ExecuteUbergraph_OakAbility_Operative_CM_Hib::K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier' has a wrong offset!");

}

