#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakAbility_Siren_ClassMod_Unique_04

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass OakAbility_Siren_ClassMod_Unique_04.OakAbility_Siren_ClassMod_Unique_04_C
// 0x0060 (0x0158 - 0x00F8)
class UOakAbility_Siren_ClassMod_Unique_04_C final : public UOakAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(Transient, DuplicateTransient)
	struct FOakAbilityResourceController_SirenRushStack RsrcCntrlr_OakAbilityResourceController_SirenRushStack_OakAbility_Siren_Unique04; // 0x0100(0x0028)()
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_OakAbility_Siren_Unique04; // 0x0128(0x0028)()
	struct FTimerHandle                           RushTimer;                                         // 0x0150(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_OakAbility_Siren_ClassMod_Unique_04(int32 EntryPoint);
	void OnActivated();
	void SirenUnique04_ActivatedRushBonus(int32 RushStacks);
	void TickDownRushStacks();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OakAbility_Siren_ClassMod_Unique_04_C">();
	}
	static class UOakAbility_Siren_ClassMod_Unique_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOakAbility_Siren_ClassMod_Unique_04_C>();
	}
};
static_assert(alignof(UOakAbility_Siren_ClassMod_Unique_04_C) == 0x000008, "Wrong alignment on UOakAbility_Siren_ClassMod_Unique_04_C");
static_assert(sizeof(UOakAbility_Siren_ClassMod_Unique_04_C) == 0x000158, "Wrong size on UOakAbility_Siren_ClassMod_Unique_04_C");
static_assert(offsetof(UOakAbility_Siren_ClassMod_Unique_04_C, UberGraphFrame) == 0x0000F8, "Member 'UOakAbility_Siren_ClassMod_Unique_04_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOakAbility_Siren_ClassMod_Unique_04_C, RsrcCntrlr_OakAbilityResourceController_SirenRushStack_OakAbility_Siren_Unique04) == 0x000100, "Member 'UOakAbility_Siren_ClassMod_Unique_04_C::RsrcCntrlr_OakAbilityResourceController_SirenRushStack_OakAbility_Siren_Unique04' has a wrong offset!");
static_assert(offsetof(UOakAbility_Siren_ClassMod_Unique_04_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_OakAbility_Siren_Unique04) == 0x000128, "Member 'UOakAbility_Siren_ClassMod_Unique_04_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_OakAbility_Siren_Unique04' has a wrong offset!");
static_assert(offsetof(UOakAbility_Siren_ClassMod_Unique_04_C, RushTimer) == 0x000150, "Member 'UOakAbility_Siren_ClassMod_Unique_04_C::RushTimer' has a wrong offset!");

}

