#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemSteam

#include "Basic.hpp"

#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemSteam.SteamNetConnection
// 0x0000 (0x19A0 - 0x19A0)
class USteamNetConnection : public UIpConnection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamNetConnection">();
	}
	static class USteamNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamNetConnection>();
	}
};
static_assert(alignof(USteamNetConnection) == 0x000008, "Wrong alignment on USteamNetConnection");
static_assert(sizeof(USteamNetConnection) == 0x0019A0, "Wrong size on USteamNetConnection");

// Class OnlineSubsystemSteam.SteamBeaconNetConnection
// 0x0000 (0x19A0 - 0x19A0)
class USteamBeaconNetConnection final : public USteamNetConnection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamBeaconNetConnection">();
	}
	static class USteamBeaconNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamBeaconNetConnection>();
	}
};
static_assert(alignof(USteamBeaconNetConnection) == 0x000008, "Wrong alignment on USteamBeaconNetConnection");
static_assert(sizeof(USteamBeaconNetConnection) == 0x0019A0, "Wrong size on USteamBeaconNetConnection");

// Class OnlineSubsystemSteam.SteamNetDriver
// 0x0018 (0x0590 - 0x0578)
class USteamNetDriver : public UIpNetDriver
{
public:
	uint8                                         Pad_578[0x18];                                     // 0x0578(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamNetDriver">();
	}
	static class USteamNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamNetDriver>();
	}
};
static_assert(alignof(USteamNetDriver) == 0x000008, "Wrong alignment on USteamNetDriver");
static_assert(sizeof(USteamNetDriver) == 0x000590, "Wrong size on USteamNetDriver");

// Class OnlineSubsystemSteam.SteamBeaconNetDriver
// 0x0000 (0x0590 - 0x0590)
class USteamBeaconNetDriver final : public USteamNetDriver
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamBeaconNetDriver">();
	}
	static class USteamBeaconNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamBeaconNetDriver>();
	}
};
static_assert(alignof(USteamBeaconNetDriver) == 0x000008, "Wrong alignment on USteamBeaconNetDriver");
static_assert(sizeof(USteamBeaconNetDriver) == 0x000590, "Wrong size on USteamBeaconNetDriver");

}

