#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Gunner_Tenacious

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Passive_Gunner_Tenacious.Passive_Gunner_Tenacious_C
// 0x0038 (0x01E8 - 0x01B0)
class UPassive_Gunner_Tenacious_C final : public UOakPassiveAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(Transient, DuplicateTransient)
	bool                                          bShieldsRefilled;                                  // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceController_ResourcePoolDelegate RsrcCntrlr_GbxAbilityResourceController_ResourcePoolDelegate_Passive_Gunner_Tenacious; // 0x01C0(0x0028)()

public:
	void ExecuteUbergraph_Passive_Gunner_Tenacious(int32 EntryPoint);
	void OnActivated();
	void OnDeactivated();
	void OnFilled_TencaciousDefense(const struct FGameResourcePoolReference& ResourcePool);
	void SetTriggerStateByShieldAmount();
	void ShieldDepleted_TencaiousDefense(const struct FGameResourcePoolReference& ResourcePool);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Passive_Gunner_Tenacious_C">();
	}
	static class UPassive_Gunner_Tenacious_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassive_Gunner_Tenacious_C>();
	}
};
static_assert(alignof(UPassive_Gunner_Tenacious_C) == 0x000008, "Wrong alignment on UPassive_Gunner_Tenacious_C");
static_assert(sizeof(UPassive_Gunner_Tenacious_C) == 0x0001E8, "Wrong size on UPassive_Gunner_Tenacious_C");
static_assert(offsetof(UPassive_Gunner_Tenacious_C, UberGraphFrame) == 0x0001B0, "Member 'UPassive_Gunner_Tenacious_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassive_Gunner_Tenacious_C, bShieldsRefilled) == 0x0001B8, "Member 'UPassive_Gunner_Tenacious_C::bShieldsRefilled' has a wrong offset!");
static_assert(offsetof(UPassive_Gunner_Tenacious_C, RsrcCntrlr_GbxAbilityResourceController_ResourcePoolDelegate_Passive_Gunner_Tenacious) == 0x0001C0, "Member 'UPassive_Gunner_Tenacious_C::RsrcCntrlr_GbxAbilityResourceController_ResourcePoolDelegate_Passive_Gunner_Tenacious' has a wrong offset!");

}

