#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Siren_DLCSkill_11

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Passive_Siren_DLCSkill_11.Passive_Siren_DLCSkill_11_C
// 0x0148 (0x02F8 - 0x01B0)
class UPassive_Siren_DLCSkill_11_C final : public UOakPassiveAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(Transient, DuplicateTransient)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Siren_DLCSkill_11; // 0x01B8(0x0028)()
	struct FDataTableValueHandle                  MaxTargets;                                        // 0x01E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                                SpawnLocation;                                     // 0x01F8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  DamageCalc;                                        // 0x0208(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableValueHandle                  CooldownTime;                                      // 0x0220(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FEnvQueryParams                        EQS_0;                                             // 0x0238(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         CryoThreshold;                                     // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Passive_Siren_DLCSkill_11(int32 EntryPoint);
	void DLCSkill11_OnCausedDeath(const class UDamageComponent* Damaged, const struct FCausedDeathDetails& Details);
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Passive_Siren_DLCSkill_11_C">();
	}
	static class UPassive_Siren_DLCSkill_11_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassive_Siren_DLCSkill_11_C>();
	}
};
static_assert(alignof(UPassive_Siren_DLCSkill_11_C) == 0x000008, "Wrong alignment on UPassive_Siren_DLCSkill_11_C");
static_assert(sizeof(UPassive_Siren_DLCSkill_11_C) == 0x0002F8, "Wrong size on UPassive_Siren_DLCSkill_11_C");
static_assert(offsetof(UPassive_Siren_DLCSkill_11_C, UberGraphFrame) == 0x0001B0, "Member 'UPassive_Siren_DLCSkill_11_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassive_Siren_DLCSkill_11_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Siren_DLCSkill_11) == 0x0001B8, "Member 'UPassive_Siren_DLCSkill_11_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Siren_DLCSkill_11' has a wrong offset!");
static_assert(offsetof(UPassive_Siren_DLCSkill_11_C, MaxTargets) == 0x0001E0, "Member 'UPassive_Siren_DLCSkill_11_C::MaxTargets' has a wrong offset!");
static_assert(offsetof(UPassive_Siren_DLCSkill_11_C, SpawnLocation) == 0x0001F8, "Member 'UPassive_Siren_DLCSkill_11_C::SpawnLocation' has a wrong offset!");
static_assert(offsetof(UPassive_Siren_DLCSkill_11_C, DamageCalc) == 0x000208, "Member 'UPassive_Siren_DLCSkill_11_C::DamageCalc' has a wrong offset!");
static_assert(offsetof(UPassive_Siren_DLCSkill_11_C, CooldownTime) == 0x000220, "Member 'UPassive_Siren_DLCSkill_11_C::CooldownTime' has a wrong offset!");
static_assert(offsetof(UPassive_Siren_DLCSkill_11_C, EQS_0) == 0x000238, "Member 'UPassive_Siren_DLCSkill_11_C::EQS_0' has a wrong offset!");
static_assert(offsetof(UPassive_Siren_DLCSkill_11_C, CryoThreshold) == 0x0002F0, "Member 'UPassive_Siren_DLCSkill_11_C::CryoThreshold' has a wrong offset!");

}

