#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveSkill_Siren_IlluminatedFist

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PassiveSkill_Siren_IlluminatedFist.PassiveSkill_Siren_IlluminatedFist_C
// 0x00E0 (0x02C8 - 0x01E8)
class UPassiveSkill_Siren_IlluminatedFist_C final : public UOakPassiveAbility_Siren
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E8(0x0008)(Transient, DuplicateTransient)
	class UOakActionAbility_PhaseTrance*          OwnerActionAbility;                                // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEnvQueryParams                        EQS_Query;                                         // 0x01F8(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AActor*                                 EQS_Result_Actor;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhaseTranceEffectType                        PhasetranceEffectType;                             // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerMeleeStateComponent*             MeleeComponent;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PassiveSkill_Siren_IlluminatedFist(int32 EntryPoint);
	void OnActivated();
	void OnAttunedElementChanged();
	void OnDeactivated();
	void OnPaused();
	void ToothAndNail_RemoveDamageType();
	void ToothAndNail_SetDamageType();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassiveSkill_Siren_IlluminatedFist_C">();
	}
	static class UPassiveSkill_Siren_IlluminatedFist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassiveSkill_Siren_IlluminatedFist_C>();
	}
};
static_assert(alignof(UPassiveSkill_Siren_IlluminatedFist_C) == 0x000008, "Wrong alignment on UPassiveSkill_Siren_IlluminatedFist_C");
static_assert(sizeof(UPassiveSkill_Siren_IlluminatedFist_C) == 0x0002C8, "Wrong size on UPassiveSkill_Siren_IlluminatedFist_C");
static_assert(offsetof(UPassiveSkill_Siren_IlluminatedFist_C, UberGraphFrame) == 0x0001E8, "Member 'UPassiveSkill_Siren_IlluminatedFist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_IlluminatedFist_C, OwnerActionAbility) == 0x0001F0, "Member 'UPassiveSkill_Siren_IlluminatedFist_C::OwnerActionAbility' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_IlluminatedFist_C, EQS_Query) == 0x0001F8, "Member 'UPassiveSkill_Siren_IlluminatedFist_C::EQS_Query' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_IlluminatedFist_C, EQS_Result_Actor) == 0x0002B0, "Member 'UPassiveSkill_Siren_IlluminatedFist_C::EQS_Result_Actor' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_IlluminatedFist_C, PhasetranceEffectType) == 0x0002B8, "Member 'UPassiveSkill_Siren_IlluminatedFist_C::PhasetranceEffectType' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_IlluminatedFist_C, MeleeComponent) == 0x0002C0, "Member 'UPassiveSkill_Siren_IlluminatedFist_C::MeleeComponent' has a wrong offset!");

}

