#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Siren_DLCSkill_6

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Passive_Siren_DLCSkill_6.Passive_Siren_DLCSkill_6_C
// 0x0048 (0x01F8 - 0x01B0)
class UPassive_Siren_DLCSkill_6_C final : public UOakPassiveAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(Transient, DuplicateTransient)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Siren_DLCSkill_6; // 0x01B8(0x0028)()
	struct FDataTableValueHandle                  Scalar;                                            // 0x01E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_Passive_Siren_DLCSkill_6(int32 EntryPoint);
	void DLCSkill6_OnCausedDeath(const class UDamageComponent* Damaged, const struct FCausedDeathDetails& Details);
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Passive_Siren_DLCSkill_6_C">();
	}
	static class UPassive_Siren_DLCSkill_6_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassive_Siren_DLCSkill_6_C>();
	}
};
static_assert(alignof(UPassive_Siren_DLCSkill_6_C) == 0x000008, "Wrong alignment on UPassive_Siren_DLCSkill_6_C");
static_assert(sizeof(UPassive_Siren_DLCSkill_6_C) == 0x0001F8, "Wrong size on UPassive_Siren_DLCSkill_6_C");
static_assert(offsetof(UPassive_Siren_DLCSkill_6_C, UberGraphFrame) == 0x0001B0, "Member 'UPassive_Siren_DLCSkill_6_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassive_Siren_DLCSkill_6_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Siren_DLCSkill_6) == 0x0001B8, "Member 'UPassive_Siren_DLCSkill_6_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Siren_DLCSkill_6' has a wrong offset!");
static_assert(offsetof(UPassive_Siren_DLCSkill_6_C, Scalar) == 0x0001E0, "Member 'UPassive_Siren_DLCSkill_6_C::Scalar' has a wrong offset!");

}

