#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Beastmaster_DLCSkill_2

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Passive_Beastmaster_DLCSkill_2.Passive_Beastmaster_DLCSkill_2_C.ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2
// 0x02F8 (0x02F8 - 0x0000)
struct Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasShieldEquipped_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             Temp_struct_Variable1;                             // 0x0098(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(class AOakCharacter* Pet)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameResourcePoolReference& ResourcePool)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameResourcePoolReference& ResourcePool)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameResourcePoolReference             K2Node_CustomEvent_ResourcePool;                   // 0x0158(0x0018)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsAbilityTimerActive_ReturnValue;         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ResourcePoolDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate; // 0x0178(0x0030)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec;             // 0x01B0(0x0018)(NoDestructor)
	float                                         CallFunc_DamageCalc_Res;                           // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Beastmaster_C*                  K2Node_DynamicCast_AsBPChar_Beastmaster;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CallFunc_GetCurrentPet_Res;                        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DamageCalc_Res1;                          // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue1; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue2; // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          CallFunc_GetCurrentPet_Res1;                       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakPlayerAbilityEventHub_Beastmaster*  K2Node_DynamicCast_AsOak_Player_Ability_Event_Hub_Beastmaster; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0218(0x0028)(NoDestructor)
	class AOakCharacter*                          K2Node_CustomEvent_Pet;                            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ResourcePoolDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate1; // 0x0248(0x0030)(NoDestructor, ContainsInstancedReference)
	TDelegate<void(const struct FGameResourcePoolReference& ResourcePool)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0278(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameResourcePoolReference& ResourcePool)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ResourcePoolDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate2; // 0x0298(0x0030)(NoDestructor, ContainsInstancedReference)
	struct FGbxAbilityResourceSpec_ResourcePoolDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate3; // 0x02C8(0x0030)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2) == 0x000008, "Wrong alignment on Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2");
static_assert(sizeof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2) == 0x0002F8, "Wrong size on Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, EntryPoint) == 0x000000, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_HasShieldEquipped_ReturnValue) == 0x000004, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_HasShieldEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, Temp_struct_Variable) == 0x000008, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, Temp_struct_Variable1) == 0x000098, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_CreateDelegate_OutputDelegate) == 0x000128, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_CreateDelegate_OutputDelegate1) == 0x000138, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_CreateDelegate_OutputDelegate2) == 0x000148, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_CustomEvent_ResourcePool) == 0x000158, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_CustomEvent_ResourcePool' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_IsAbilityTimerActive_ReturnValue) == 0x000170, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_IsAbilityTimerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate) == 0x000178, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_Not_PreBool_ReturnValue) == 0x0001A8, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_BooleanAND_ReturnValue) == 0x0001A9, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x0001AC, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_MakeStruct_OakAbilityTimerSpec) == 0x0001B0, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_MakeStruct_OakAbilityTimerSpec' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_DamageCalc_Res) == 0x0001C8, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_DamageCalc_Res' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_DynamicCast_AsBPChar_Beastmaster) == 0x0001D0, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_DynamicCast_AsBPChar_Beastmaster' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_GetCurrentPet_Res) == 0x0001E0, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_GetCurrentPet_Res' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_DamageCalc_Res1) == 0x0001EC, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_DamageCalc_Res1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_GetDataTableValueFromHandle_ReturnValue1) == 0x0001F0, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_GetDataTableValueFromHandle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_GetDataTableValueFromHandle_ReturnValue2) == 0x0001F4, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_GetDataTableValueFromHandle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_GetCurrentPet_Res1) == 0x0001F8, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_GetCurrentPet_Res1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, CallFunc_IsValid_ReturnValue1) == 0x000200, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_DynamicCast_AsOak_Player_Ability_Event_Hub_Beastmaster) == 0x000208, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_DynamicCast_AsOak_Player_Ability_Event_Hub_Beastmaster' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_DynamicCast_bSuccess1) == 0x000210, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000218, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_CustomEvent_Pet) == 0x000240, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_CustomEvent_Pet' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate1) == 0x000248, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_CreateDelegate_OutputDelegate3) == 0x000278, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_CreateDelegate_OutputDelegate4) == 0x000288, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate2) == 0x000298, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate2' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2, K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate3) == 0x0002C8, "Member 'Passive_Beastmaster_DLCSkill_2_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_2::K2Node_MakeStruct_GbxAbilityResourceSpec_ResourcePoolDelegate3' has a wrong offset!");

// Function Passive_Beastmaster_DLCSkill_2.Passive_Beastmaster_DLCSkill_2_C.OnPetSpawned
// 0x0008 (0x0008 - 0x0000)
struct Passive_Beastmaster_DLCSkill_2_C_OnPetSpawned final
{
public:
	class AOakCharacter*                          Pet;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_DLCSkill_2_C_OnPetSpawned) == 0x000008, "Wrong alignment on Passive_Beastmaster_DLCSkill_2_C_OnPetSpawned");
static_assert(sizeof(Passive_Beastmaster_DLCSkill_2_C_OnPetSpawned) == 0x000008, "Wrong size on Passive_Beastmaster_DLCSkill_2_C_OnPetSpawned");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_OnPetSpawned, Pet) == 0x000000, "Member 'Passive_Beastmaster_DLCSkill_2_C_OnPetSpawned::Pet' has a wrong offset!");

// Function Passive_Beastmaster_DLCSkill_2.Passive_Beastmaster_DLCSkill_2_C.DLCSkill2_TriggerSkill
// 0x0018 (0x0018 - 0x0000)
struct Passive_Beastmaster_DLCSkill_2_C_DLCSkill2_TriggerSkill final
{
public:
	struct FGameResourcePoolReference             ResourcePool;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Passive_Beastmaster_DLCSkill_2_C_DLCSkill2_TriggerSkill) == 0x000008, "Wrong alignment on Passive_Beastmaster_DLCSkill_2_C_DLCSkill2_TriggerSkill");
static_assert(sizeof(Passive_Beastmaster_DLCSkill_2_C_DLCSkill2_TriggerSkill) == 0x000018, "Wrong size on Passive_Beastmaster_DLCSkill_2_C_DLCSkill2_TriggerSkill");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_DLCSkill2_TriggerSkill, ResourcePool) == 0x000000, "Member 'Passive_Beastmaster_DLCSkill_2_C_DLCSkill2_TriggerSkill::ResourcePool' has a wrong offset!");

// Function Passive_Beastmaster_DLCSkill_2.Passive_Beastmaster_DLCSkill_2_C.DamageCalc
// 0x000C (0x000C - 0x0000)
struct Passive_Beastmaster_DLCSkill_2_C_DamageCalc final
{
public:
	float                                         Res;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_DLCSkill_2_C_DamageCalc) == 0x000004, "Wrong alignment on Passive_Beastmaster_DLCSkill_2_C_DamageCalc");
static_assert(sizeof(Passive_Beastmaster_DLCSkill_2_C_DamageCalc) == 0x00000C, "Wrong size on Passive_Beastmaster_DLCSkill_2_C_DamageCalc");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_DamageCalc, Res) == 0x000000, "Member 'Passive_Beastmaster_DLCSkill_2_C_DamageCalc::Res' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_DamageCalc, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000004, "Member 'Passive_Beastmaster_DLCSkill_2_C_DamageCalc::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_2_C_DamageCalc, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000008, "Member 'Passive_Beastmaster_DLCSkill_2_C_DamageCalc::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

}

