#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Gunner_FullCan

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Passive_Gunner_FullCan.Passive_Gunner_FullCan_C.ExecuteUbergraph_Passive_Gunner_FullCan
// 0x0108 (0x0108 - 0x0000)
struct Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0008(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0028(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0060(0x0018)(NoDestructor, ContainsInstancedReference)
	TDelegate<void(class AOakCharacter_IronBear* IronBear)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UOakPlayerAbilityEventHub_Gunner*       K2Node_DynamicCast_AsOak_Player_Ability_Event_Hub_Gunner; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter_IronBear*                 K2Node_CustomEvent_IronBear1;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_IronBear*                 K2Node_CustomEvent_IronBear;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x00A8(0x0028)(NoDestructor)
	TDelegate<void(class AOakCharacter_IronBear* IronBear)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x00E0(0x0028)(NoDestructor)
};
static_assert(alignof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan) == 0x000008, "Wrong alignment on Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan");
static_assert(sizeof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan) == 0x000108, "Wrong size on Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, EntryPoint) == 0x000000, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_MakeStruct_DataTableValueHandle) == 0x000008, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000020, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_MakeStruct_StatusEffectSpec) == 0x000028, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, CallFunc_AddStatusEffect_ReturnValue) == 0x000060, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_DynamicCast_AsOak_Player_Ability_Event_Hub_Gunner) == 0x000088, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_DynamicCast_AsOak_Player_Ability_Event_Hub_Gunner' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_CustomEvent_IronBear1) == 0x000098, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_CustomEvent_IronBear1' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_CustomEvent_IronBear) == 0x0000A0, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_CustomEvent_IronBear' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x0000A8, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_CreateDelegate_OutputDelegate1) == 0x0000D0, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x0000E0, "Member 'Passive_Gunner_FullCan_C_ExecuteUbergraph_Passive_Gunner_FullCan::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");

// Function Passive_Gunner_FullCan.Passive_Gunner_FullCan_C.EnteredIronBear_FullCan
// 0x0008 (0x0008 - 0x0000)
struct Passive_Gunner_FullCan_C_EnteredIronBear_FullCan final
{
public:
	class AOakCharacter_IronBear*                 IronBear;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Gunner_FullCan_C_EnteredIronBear_FullCan) == 0x000008, "Wrong alignment on Passive_Gunner_FullCan_C_EnteredIronBear_FullCan");
static_assert(sizeof(Passive_Gunner_FullCan_C_EnteredIronBear_FullCan) == 0x000008, "Wrong size on Passive_Gunner_FullCan_C_EnteredIronBear_FullCan");
static_assert(offsetof(Passive_Gunner_FullCan_C_EnteredIronBear_FullCan, IronBear) == 0x000000, "Member 'Passive_Gunner_FullCan_C_EnteredIronBear_FullCan::IronBear' has a wrong offset!");

// Function Passive_Gunner_FullCan.Passive_Gunner_FullCan_C.ExitedIronBear_FullCan
// 0x0008 (0x0008 - 0x0000)
struct Passive_Gunner_FullCan_C_ExitedIronBear_FullCan final
{
public:
	class AOakCharacter_IronBear*                 IronBear;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Gunner_FullCan_C_ExitedIronBear_FullCan) == 0x000008, "Wrong alignment on Passive_Gunner_FullCan_C_ExitedIronBear_FullCan");
static_assert(sizeof(Passive_Gunner_FullCan_C_ExitedIronBear_FullCan) == 0x000008, "Wrong size on Passive_Gunner_FullCan_C_ExitedIronBear_FullCan");
static_assert(offsetof(Passive_Gunner_FullCan_C_ExitedIronBear_FullCan, IronBear) == 0x000000, "Member 'Passive_Gunner_FullCan_C_ExitedIronBear_FullCan::IronBear' has a wrong offset!");

}

