#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveSkill_Siren_LaidBare

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PassiveSkill_Siren_LaidBare.PassiveSkill_Siren_LaidBare_C
// 0x0048 (0x01F8 - 0x01B0)
class UPassiveSkill_Siren_LaidBare_C final : public UOakPassiveAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(Transient, DuplicateTransient)
	struct FDataTableValueHandle                  ExposureDuration;                                  // 0x01B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_PassiveSkill_Siren_Exposure; // 0x01D0(0x0028)()

public:
	void ExecuteUbergraph_PassiveSkill_Siren_LaidBare(int32 EntryPoint);
	void SirenSkillEvent_OnCausedAnyDamage(float Damage, class UClass* DamageSource, class UClass* DamageType, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);
	void OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassiveSkill_Siren_LaidBare_C">();
	}
	static class UPassiveSkill_Siren_LaidBare_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassiveSkill_Siren_LaidBare_C>();
	}
};
static_assert(alignof(UPassiveSkill_Siren_LaidBare_C) == 0x000008, "Wrong alignment on UPassiveSkill_Siren_LaidBare_C");
static_assert(sizeof(UPassiveSkill_Siren_LaidBare_C) == 0x0001F8, "Wrong size on UPassiveSkill_Siren_LaidBare_C");
static_assert(offsetof(UPassiveSkill_Siren_LaidBare_C, UberGraphFrame) == 0x0001B0, "Member 'UPassiveSkill_Siren_LaidBare_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_LaidBare_C, ExposureDuration) == 0x0001B8, "Member 'UPassiveSkill_Siren_LaidBare_C::ExposureDuration' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_LaidBare_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_PassiveSkill_Siren_Exposure) == 0x0001D0, "Member 'UPassiveSkill_Siren_LaidBare_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_PassiveSkill_Siren_Exposure' has a wrong offset!");

}

