#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Beastmaster_Ranged10_NEW

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Passive_Beastmaster_Ranged10_NEW.Passive_Beastmaster_Ranged10_NEW_C.ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW
// 0x00D8 (0x00D8 - 0x0000)
struct Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveAttributeModifier_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                K2Node_CustomEvent_EventWeapon;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AWeapon* EventWeapon)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RandomChanceByGrade_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0028(0x0028)(NoDestructor)
	class AWeapon*                                K2Node_CustomEvent_NewWeapon;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                K2Node_CustomEvent_LastWeapon;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AWeapon* NewWeapon, class AWeapon* LastWeapon)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x0070(0x0028)(NoDestructor)
	bool                                          CallFunc_RemoveAttributeModifier_ReturnValue1;     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                K2Node_CustomEvent_InWeapon;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponFireProjectileComponent*         CallFunc_GetProjectileComponent_FireComponent;     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAttributeModifierActionExecOutput         CallFunc_ApplyAttributeEffect_ModifierActionResult; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeModifierHandle            CallFunc_ApplyAttributeEffect_ReturnValue;         // 0x00B8(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW) == 0x000008, "Wrong alignment on Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW");
static_assert(sizeof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW) == 0x0000D8, "Wrong size on Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, EntryPoint) == 0x000000, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, CallFunc_RemoveAttributeModifier_ReturnValue) == 0x000004, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::CallFunc_RemoveAttributeModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, K2Node_CustomEvent_EventWeapon) == 0x000008, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::K2Node_CustomEvent_EventWeapon' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, CallFunc_RandomChanceByGrade_ReturnValue) == 0x000020, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::CallFunc_RandomChanceByGrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000028, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, K2Node_CustomEvent_NewWeapon) == 0x000050, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::K2Node_CustomEvent_NewWeapon' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, K2Node_CustomEvent_LastWeapon) == 0x000058, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::K2Node_CustomEvent_LastWeapon' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, K2Node_CreateDelegate_OutputDelegate1) == 0x000060, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x000070, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, CallFunc_RemoveAttributeModifier_ReturnValue1) == 0x000098, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::CallFunc_RemoveAttributeModifier_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, K2Node_CustomEvent_InWeapon) == 0x0000A0, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::K2Node_CustomEvent_InWeapon' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, CallFunc_GetProjectileComponent_FireComponent) == 0x0000A8, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::CallFunc_GetProjectileComponent_FireComponent' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, CallFunc_ApplyAttributeEffect_ModifierActionResult) == 0x0000B0, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::CallFunc_ApplyAttributeEffect_ModifierActionResult' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, CallFunc_ApplyAttributeEffect_ReturnValue) == 0x0000B8, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::CallFunc_ApplyAttributeEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, K2Node_SwitchEnum_CmpSuccess) == 0x0000C9, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW, CallFunc_GetWeapon_ReturnValue) == 0x0000D0, "Member 'Passive_Beastmaster_Ranged10_NEW_C_ExecuteUbergraph_Passive_Beastmaster_Ranged10_NEW::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");

// Function Passive_Beastmaster_Ranged10_NEW.Passive_Beastmaster_Ranged10_NEW_C.TryAddProjectileToNextShot
// 0x0008 (0x0008 - 0x0000)
struct Passive_Beastmaster_Ranged10_NEW_C_TryAddProjectileToNextShot final
{
public:
	class AWeapon*                                InWeapon;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_Ranged10_NEW_C_TryAddProjectileToNextShot) == 0x000008, "Wrong alignment on Passive_Beastmaster_Ranged10_NEW_C_TryAddProjectileToNextShot");
static_assert(sizeof(Passive_Beastmaster_Ranged10_NEW_C_TryAddProjectileToNextShot) == 0x000008, "Wrong size on Passive_Beastmaster_Ranged10_NEW_C_TryAddProjectileToNextShot");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_TryAddProjectileToNextShot, InWeapon) == 0x000000, "Member 'Passive_Beastmaster_Ranged10_NEW_C_TryAddProjectileToNextShot::InWeapon' has a wrong offset!");

// Function Passive_Beastmaster_Ranged10_NEW.Passive_Beastmaster_Ranged10_NEW_C.OnWeaponChanged_Ranged10
// 0x0010 (0x0010 - 0x0000)
struct Passive_Beastmaster_Ranged10_NEW_C_OnWeaponChanged_Ranged10 final
{
public:
	class AWeapon*                                NewWeapon;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                LastWeapon;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_Ranged10_NEW_C_OnWeaponChanged_Ranged10) == 0x000008, "Wrong alignment on Passive_Beastmaster_Ranged10_NEW_C_OnWeaponChanged_Ranged10");
static_assert(sizeof(Passive_Beastmaster_Ranged10_NEW_C_OnWeaponChanged_Ranged10) == 0x000010, "Wrong size on Passive_Beastmaster_Ranged10_NEW_C_OnWeaponChanged_Ranged10");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_OnWeaponChanged_Ranged10, NewWeapon) == 0x000000, "Member 'Passive_Beastmaster_Ranged10_NEW_C_OnWeaponChanged_Ranged10::NewWeapon' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_OnWeaponChanged_Ranged10, LastWeapon) == 0x000008, "Member 'Passive_Beastmaster_Ranged10_NEW_C_OnWeaponChanged_Ranged10::LastWeapon' has a wrong offset!");

// Function Passive_Beastmaster_Ranged10_NEW.Passive_Beastmaster_Ranged10_NEW_C.OnWeaponUsed_Ranged10
// 0x0008 (0x0008 - 0x0000)
struct Passive_Beastmaster_Ranged10_NEW_C_OnWeaponUsed_Ranged10 final
{
public:
	class AWeapon*                                EventWeapon;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_Ranged10_NEW_C_OnWeaponUsed_Ranged10) == 0x000008, "Wrong alignment on Passive_Beastmaster_Ranged10_NEW_C_OnWeaponUsed_Ranged10");
static_assert(sizeof(Passive_Beastmaster_Ranged10_NEW_C_OnWeaponUsed_Ranged10) == 0x000008, "Wrong size on Passive_Beastmaster_Ranged10_NEW_C_OnWeaponUsed_Ranged10");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_OnWeaponUsed_Ranged10, EventWeapon) == 0x000000, "Member 'Passive_Beastmaster_Ranged10_NEW_C_OnWeaponUsed_Ranged10::EventWeapon' has a wrong offset!");

// Function Passive_Beastmaster_Ranged10_NEW.Passive_Beastmaster_Ranged10_NEW_C.RandomChanceByGrade
// 0x0030 (0x0030 - 0x0000)
struct Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0008(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatFromStream_ReturnValue;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade) == 0x000008, "Wrong alignment on Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade");
static_assert(sizeof(Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade) == 0x000030, "Wrong size on Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade, ReturnValue) == 0x000000, "Member 'Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade::ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade, K2Node_MakeStruct_DataTableValueHandle) == 0x000008, "Member 'Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000020, "Member 'Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000024, "Member 'Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade, CallFunc_RandomFloatFromStream_ReturnValue) == 0x000028, "Member 'Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade::CallFunc_RandomFloatFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'Passive_Beastmaster_Ranged10_NEW_C_RandomChanceByGrade::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function Passive_Beastmaster_Ranged10_NEW.Passive_Beastmaster_Ranged10_NEW_C.GetProjectileComponent
// 0x0018 (0x0018 - 0x0000)
struct Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent final
{
public:
	class AWeapon*                                InWeapon;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponFireProjectileComponent*         FireComponent;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponFireProjectileComponent*         CallFunc_GetUseModeComponentByClass_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent) == 0x000008, "Wrong alignment on Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent");
static_assert(sizeof(Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent) == 0x000018, "Wrong size on Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent, InWeapon) == 0x000000, "Member 'Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent::InWeapon' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent, FireComponent) == 0x000008, "Member 'Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent::FireComponent' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent, CallFunc_GetUseModeComponentByClass_ReturnValue) == 0x000010, "Member 'Passive_Beastmaster_Ranged10_NEW_C_GetProjectileComponent::CallFunc_GetUseModeComponentByClass_ReturnValue' has a wrong offset!");

}

