#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Beastmaster_DLCSkill_17

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Passive_Beastmaster_DLCSkill_17.Passive_Beastmaster_DLCSkill_17_C.CalculateAbilityState
// 0x001C (0x001C - 0x0000)
struct Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState final
{
public:
	EGbxAbilityState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAbilityState                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentShield_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxShield_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAbilityState                              CallFunc_CalculateAbilityState_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState) == 0x000004, "Wrong alignment on Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState");
static_assert(sizeof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState) == 0x00001C, "Wrong size on Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, ReturnValue) == 0x000000, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, Temp_bool_Variable) == 0x000001, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, Temp_byte_Variable) == 0x000002, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, Temp_byte_Variable1) == 0x000003, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, CallFunc_GetCurrentShield_ReturnValue) == 0x000008, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::CallFunc_GetCurrentShield_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, CallFunc_GetMaxShield_ReturnValue) == 0x00000C, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::CallFunc_GetMaxShield_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, CallFunc_CalculateAbilityState_ReturnValue) == 0x000010, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::CallFunc_CalculateAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState, K2Node_Select_Default) == 0x000019, "Member 'Passive_Beastmaster_DLCSkill_17_C_CalculateAbilityState::K2Node_Select_Default' has a wrong offset!");

}

