#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveSkill_Gunner_DrowningInBrass

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function PassiveSkill_Gunner_DrowningInBrass.PassiveSkill_Gunner_DrowningInBrass_C.ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass
// 0x00B0 (0x00B0 - 0x0000)
struct PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageComponent*                 K2Node_CustomEvent_Damaged;                        // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x0010(0x0068)(ConstParm)
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0088(0x0028)(NoDestructor)
};
static_assert(alignof(PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass) == 0x000008, "Wrong alignment on PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass");
static_assert(sizeof(PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass) == 0x0000B0, "Wrong size on PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass");
static_assert(offsetof(PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass, EntryPoint) == 0x000000, "Member 'PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass, K2Node_CustomEvent_Damaged) == 0x000008, "Member 'PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass, K2Node_CustomEvent_Details) == 0x000010, "Member 'PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000088, "Member 'PassiveSkill_Gunner_DrowningInBrass_C_ExecuteUbergraph_PassiveSkill_Gunner_DrowningInBrass::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

// Function PassiveSkill_Gunner_DrowningInBrass.PassiveSkill_Gunner_DrowningInBrass_C.CausedDeath_DrowningInBrass
// 0x0070 (0x0070 - 0x0000)
struct PassiveSkill_Gunner_DrowningInBrass_C_CausedDeath_DrowningInBrass final
{
public:
	const class UDamageComponent*                 Damaged;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PassiveSkill_Gunner_DrowningInBrass_C_CausedDeath_DrowningInBrass) == 0x000008, "Wrong alignment on PassiveSkill_Gunner_DrowningInBrass_C_CausedDeath_DrowningInBrass");
static_assert(sizeof(PassiveSkill_Gunner_DrowningInBrass_C_CausedDeath_DrowningInBrass) == 0x000070, "Wrong size on PassiveSkill_Gunner_DrowningInBrass_C_CausedDeath_DrowningInBrass");
static_assert(offsetof(PassiveSkill_Gunner_DrowningInBrass_C_CausedDeath_DrowningInBrass, Damaged) == 0x000000, "Member 'PassiveSkill_Gunner_DrowningInBrass_C_CausedDeath_DrowningInBrass::Damaged' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_DrowningInBrass_C_CausedDeath_DrowningInBrass, Details) == 0x000008, "Member 'PassiveSkill_Gunner_DrowningInBrass_C_CausedDeath_DrowningInBrass::Details' has a wrong offset!");

}

