#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Beastmaster_Bond3

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Passive_Beastmaster_Bond3.Passive_Beastmaster_Bond3_C.ExecuteUbergraph_Passive_Beastmaster_Bond3
// 0x0160 (0x0160 - 0x0000)
struct Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec;             // 0x0008(0x0018)(NoDestructor)
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec1;            // 0x0020(0x0018)(NoDestructor)
	TDelegate<void(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UDamageCauserComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageInstigator;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0068(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   K2Node_CustomEvent_Details;                        // 0x0078(0x0060)(ContainsInstancedReference)
	bool                                          CallFunc_CanHealPet_Res;                           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Beastmaster_C> K2Node_DynamicCast_AsIBPChar_Beastmaster;          // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CallFunc_GetCurrentPet_Res;                        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0108(0x0028)(NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityTimerActive_ReturnValue;         // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_Event_Spec;                                 // 0x0138(0x0018)(ConstParm, NoDestructor)
	struct FOakAbilityTimerResult                 K2Node_Event_Result;                               // 0x0150(0x000C)(ConstParm, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3");
static_assert(sizeof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3) == 0x000160, "Wrong size on Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, EntryPoint) == 0x000000, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_MakeStruct_OakAbilityTimerSpec) == 0x000008, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_MakeStruct_OakAbilityTimerSpec' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_MakeStruct_OakAbilityTimerSpec1) == 0x000020, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_MakeStruct_OakAbilityTimerSpec1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_CustomEvent_DamageInstigator) == 0x000050, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_CustomEvent_DamageInstigator' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_CustomEvent_Damage) == 0x000058, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_CustomEvent_DamageType) == 0x000060, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_CustomEvent_DamageSource) == 0x000068, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_CustomEvent_DamagedActor) == 0x000070, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_CustomEvent_Details) == 0x000078, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, CallFunc_CanHealPet_Res) == 0x0000D8, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::CallFunc_CanHealPet_Res' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_DynamicCast_AsIBPChar_Beastmaster) == 0x0000E0, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_DynamicCast_AsIBPChar_Beastmaster' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F1, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, CallFunc_GetCurrentPet_Res) == 0x0000F8, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::CallFunc_GetCurrentPet_Res' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000108, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, CallFunc_Add_FloatFloat_ReturnValue) == 0x000130, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, CallFunc_IsAbilityTimerActive_ReturnValue) == 0x000134, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::CallFunc_IsAbilityTimerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_Event_Spec) == 0x000138, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_Event_Spec' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, K2Node_Event_Result) == 0x000150, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00015C, "Member 'Passive_Beastmaster_Bond3_C_ExecuteUbergraph_Passive_Beastmaster_Bond3::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function Passive_Beastmaster_Bond3.Passive_Beastmaster_Bond3_C.OnAbilityTimerEnded
// 0x0028 (0x0028 - 0x0000)
struct Passive_Beastmaster_Bond3_C_OnAbilityTimerEnded final
{
public:
	struct FOakAbilityTimerSpec                   Spec;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FOakAbilityTimerResult                 Result;                                            // 0x0018(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond3_C_OnAbilityTimerEnded) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond3_C_OnAbilityTimerEnded");
static_assert(sizeof(Passive_Beastmaster_Bond3_C_OnAbilityTimerEnded) == 0x000028, "Wrong size on Passive_Beastmaster_Bond3_C_OnAbilityTimerEnded");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_OnAbilityTimerEnded, Spec) == 0x000000, "Member 'Passive_Beastmaster_Bond3_C_OnAbilityTimerEnded::Spec' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_OnAbilityTimerEnded, Result) == 0x000018, "Member 'Passive_Beastmaster_Bond3_C_OnAbilityTimerEnded::Result' has a wrong offset!");

// Function Passive_Beastmaster_Bond3.Passive_Beastmaster_Bond3_C.OnCausedDamage_Bond3
// 0x0088 (0x0088 - 0x0000)
struct Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3 final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0028(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3");
static_assert(sizeof(Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3) == 0x000088, "Wrong size on Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3, DamageInstigator) == 0x000000, "Member 'Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3::DamageInstigator' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3, Damage) == 0x000008, "Member 'Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3::Damage' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3, DamageType) == 0x000010, "Member 'Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3::DamageType' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3, DamageSource) == 0x000018, "Member 'Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3::DamageSource' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3, DamagedActor) == 0x000020, "Member 'Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3::DamagedActor' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3, Details) == 0x000028, "Member 'Passive_Beastmaster_Bond3_C_OnCausedDamage_Bond3::Details' has a wrong offset!");

// Function Passive_Beastmaster_Bond3.Passive_Beastmaster_Bond3_C.DoPetHeal
// 0x00B8 (0x00B8 - 0x0000)
struct Passive_Beastmaster_Bond3_C_DoPetHeal final
{
public:
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0000(0x0018)(NoDestructor)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0018(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_Bond3_C_DoPetHeal) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond3_C_DoPetHeal");
static_assert(sizeof(Passive_Beastmaster_Bond3_C_DoPetHeal) == 0x0000B8, "Wrong size on Passive_Beastmaster_Bond3_C_DoPetHeal");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_DoPetHeal, K2Node_MakeStruct_DataTableValueHandle) == 0x000000, "Member 'Passive_Beastmaster_Bond3_C_DoPetHeal::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_DoPetHeal, Temp_struct_Variable) == 0x000018, "Member 'Passive_Beastmaster_Bond3_C_DoPetHeal::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_DoPetHeal, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x0000A8, "Member 'Passive_Beastmaster_Bond3_C_DoPetHeal::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_DoPetHeal, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000AC, "Member 'Passive_Beastmaster_Bond3_C_DoPetHeal::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_DoPetHeal, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'Passive_Beastmaster_Bond3_C_DoPetHeal::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function Passive_Beastmaster_Bond3.Passive_Beastmaster_Bond3_C.CanHealPet
// 0x0030 (0x0030 - 0x0000)
struct Passive_Beastmaster_Bond3_C_CanHealPet final
{
public:
	class UObject*                                DamageInst;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Res;                                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue1;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond3_C_CanHealPet) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond3_C_CanHealPet");
static_assert(sizeof(Passive_Beastmaster_Bond3_C_CanHealPet) == 0x000030, "Wrong size on Passive_Beastmaster_Bond3_C_CanHealPet");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, DamageInst) == 0x000000, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::DamageInst' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, DamageSource) == 0x000008, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::DamageSource' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, Res) == 0x000010, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::Res' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_ClassIsChildOf_ReturnValue) == 0x000020, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000023, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_ClassIsChildOf_ReturnValue1) == 0x000024, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_ClassIsChildOf_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_Not_PreBool_ReturnValue1) == 0x000025, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000026, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_BooleanAND_ReturnValue) == 0x000027, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_BooleanAND_ReturnValue1) == 0x000028, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond3_C_CanHealPet, CallFunc_BooleanAND_ReturnValue2) == 0x000029, "Member 'Passive_Beastmaster_Bond3_C_CanHealPet::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

}

