#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Beastmaster_DLCSkill_9

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Passive_Beastmaster_DLCSkill_9.Passive_Beastmaster_DLCSkill_9_C
// 0x0070 (0x0220 - 0x01B0)
class UPassive_Beastmaster_DLCSkill_9_C final : public UOakPassiveAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(Transient, DuplicateTransient)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Beastmaster_DLCSkill_9; // 0x01B8(0x0028)()
	class ABPChar_Beastmaster_C*                  Beastmaster;                                       // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          Pet;                                               // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakAbilityResourceController_WeaponShotModifier RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Passive_Beastmaster_DLCSkill_9; // 0x01F0(0x0028)()
	bool                                          BonusDamageReadied;                                // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Passive_Beastmaster_DLCSkill_9(int32 EntryPoint);
	void OnActivated();
	void DLCSkill9_Player_OnWeaponUsed(class AWeapon* EventWeapon);
	void DLCSkill9_Pet_OnCausedAnyDamage(class AActor* DamageInstigator, float Damage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);
	void DLCSkill9_OnBeastmasterPetReleased(class AOakCharacter* Pet_0);
	void DLCSkill9_OnBeastPetSpawned(class AOakCharacter* Pet_0);
	void RemovePetDamageEvent();
	void SetupPetDamageEvent();

	void GetManualHUDIconValues(int32* OutStackCount, float* OutDuration, float* OutTimeRemaining) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Passive_Beastmaster_DLCSkill_9_C">();
	}
	static class UPassive_Beastmaster_DLCSkill_9_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassive_Beastmaster_DLCSkill_9_C>();
	}
};
static_assert(alignof(UPassive_Beastmaster_DLCSkill_9_C) == 0x000008, "Wrong alignment on UPassive_Beastmaster_DLCSkill_9_C");
static_assert(sizeof(UPassive_Beastmaster_DLCSkill_9_C) == 0x000220, "Wrong size on UPassive_Beastmaster_DLCSkill_9_C");
static_assert(offsetof(UPassive_Beastmaster_DLCSkill_9_C, UberGraphFrame) == 0x0001B0, "Member 'UPassive_Beastmaster_DLCSkill_9_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_DLCSkill_9_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Beastmaster_DLCSkill_9) == 0x0001B8, "Member 'UPassive_Beastmaster_DLCSkill_9_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Beastmaster_DLCSkill_9' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_DLCSkill_9_C, Beastmaster) == 0x0001E0, "Member 'UPassive_Beastmaster_DLCSkill_9_C::Beastmaster' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_DLCSkill_9_C, Pet) == 0x0001E8, "Member 'UPassive_Beastmaster_DLCSkill_9_C::Pet' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_DLCSkill_9_C, RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Passive_Beastmaster_DLCSkill_9) == 0x0001F0, "Member 'UPassive_Beastmaster_DLCSkill_9_C::RsrcCntrlr_OakAbilityResourceController_WeaponShotModifier_Passive_Beastmaster_DLCSkill_9' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_DLCSkill_9_C, BonusDamageReadied) == 0x000218, "Member 'UPassive_Beastmaster_DLCSkill_9_C::BonusDamageReadied' has a wrong offset!");

}

