#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveSkill_Siren_GuardianAngel

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "PassiveSkill_Siren_WIthNova_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PassiveSkill_Siren_GuardianAngel.PassiveSkill_Siren_GuardianAngel_C
// 0x0068 (0x0250 - 0x01E8)
class UPassiveSkill_Siren_GuardianAngel_C final : public UPassiveSkill_Siren_WIthNova_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E8(0x0008)(Transient, DuplicateTransient)
	bool                                          GuardianAngelReadied;                              // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_PassiveSkill_Siren_GuardianAngel; // 0x01F8(0x0028)()
	struct FDataTableValueHandle                  HealthRestore;                                     // 0x0220(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableValueHandle                  CooldownTime;                                      // 0x0238(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_PassiveSkill_Siren_GuardianAngel(int32 EntryPoint);
	void OnActivated();
	void GuardianAngel_OnKilledEnemy(const class UDamageComponent* Damaged, const struct FCausedDeathDetails& Details);
	void ActiveGuardianAngel();
	void OnAbilityTimerEnded(const struct FOakAbilityTimerSpec& Spec, const struct FOakAbilityTimerResult& Result);
	void OnDownStateStart();
	void GetNovaDamage(float* Res);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PassiveSkill_Siren_GuardianAngel_C">();
	}
	static class UPassiveSkill_Siren_GuardianAngel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassiveSkill_Siren_GuardianAngel_C>();
	}
};
static_assert(alignof(UPassiveSkill_Siren_GuardianAngel_C) == 0x000008, "Wrong alignment on UPassiveSkill_Siren_GuardianAngel_C");
static_assert(sizeof(UPassiveSkill_Siren_GuardianAngel_C) == 0x000250, "Wrong size on UPassiveSkill_Siren_GuardianAngel_C");
static_assert(offsetof(UPassiveSkill_Siren_GuardianAngel_C, UberGraphFrame) == 0x0001E8, "Member 'UPassiveSkill_Siren_GuardianAngel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_GuardianAngel_C, GuardianAngelReadied) == 0x0001F0, "Member 'UPassiveSkill_Siren_GuardianAngel_C::GuardianAngelReadied' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_GuardianAngel_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_PassiveSkill_Siren_GuardianAngel) == 0x0001F8, "Member 'UPassiveSkill_Siren_GuardianAngel_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_PassiveSkill_Siren_GuardianAngel' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_GuardianAngel_C, HealthRestore) == 0x000220, "Member 'UPassiveSkill_Siren_GuardianAngel_C::HealthRestore' has a wrong offset!");
static_assert(offsetof(UPassiveSkill_Siren_GuardianAngel_C, CooldownTime) == 0x000238, "Member 'UPassiveSkill_Siren_GuardianAngel_C::CooldownTime' has a wrong offset!");

}

