#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveSkill_Siren_BareKnuckle

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function PassiveSkill_Siren_BareKnuckle.PassiveSkill_Siren_BareKnuckle_C.ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle
// 0x00D0 (0x00D0 - 0x0000)
struct PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_DamageSource;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_DamageType;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   K2Node_CustomEvent_Details;                        // 0x0020(0x0060)(ContainsInstancedReference)
	bool                                          CallFunc_IsConsideredMeleeDamage_Res;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float Damage, class UClass* DamageSource, class UClass* DamageType, class AActor* DamagedActor, const struct FCausedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UBPEventHub_Siren_C*                    K2Node_DynamicCast_AsBPEvent_Hub_Siren;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x00A8(0x0028)(NoDestructor)
};
static_assert(alignof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle) == 0x000008, "Wrong alignment on PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle");
static_assert(sizeof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle) == 0x0000D0, "Wrong size on PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, EntryPoint) == 0x000000, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, K2Node_CustomEvent_Damage) == 0x000004, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, K2Node_CustomEvent_DamageSource) == 0x000008, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, K2Node_CustomEvent_DamageType) == 0x000010, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, K2Node_CustomEvent_DamagedActor) == 0x000018, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, K2Node_CustomEvent_Details) == 0x000020, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, CallFunc_IsConsideredMeleeDamage_Res) == 0x000080, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::CallFunc_IsConsideredMeleeDamage_Res' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, K2Node_DynamicCast_AsBPEvent_Hub_Siren) == 0x000098, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::K2Node_DynamicCast_AsBPEvent_Hub_Siren' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x0000A8, "Member 'PassiveSkill_Siren_BareKnuckle_C_ExecuteUbergraph_PassiveSkill_Siren_BareKnuckle::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

// Function PassiveSkill_Siren_BareKnuckle.PassiveSkill_Siren_BareKnuckle_C.SirenSkillEvent_OnCausedAnyDamage
// 0x0080 (0x0080 - 0x0000)
struct PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DamageSource;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DamageType;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0020(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage) == 0x000008, "Wrong alignment on PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage");
static_assert(sizeof(PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage) == 0x000080, "Wrong size on PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage, Damage) == 0x000000, "Member 'PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage, DamageSource) == 0x000008, "Member 'PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage::DamageSource' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage, DamageType) == 0x000010, "Member 'PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage, DamagedActor) == 0x000018, "Member 'PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage::DamagedActor' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage, Details) == 0x000020, "Member 'PassiveSkill_Siren_BareKnuckle_C_SirenSkillEvent_OnCausedAnyDamage::Details' has a wrong offset!");

// Function PassiveSkill_Siren_BareKnuckle.PassiveSkill_Siren_BareKnuckle_C.IsConsideredMeleeDamage
// 0x0010 (0x0010 - 0x0000)
struct PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage final
{
public:
	class UClass*                                 Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Res;                                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue1;              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue2;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage) == 0x000008, "Wrong alignment on PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage");
static_assert(sizeof(PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage) == 0x000010, "Wrong size on PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage, Source) == 0x000000, "Member 'PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage::Source' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage, Res) == 0x000008, "Member 'PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage::Res' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage, CallFunc_ClassIsChildOf_ReturnValue) == 0x000009, "Member 'PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage, CallFunc_ClassIsChildOf_ReturnValue1) == 0x00000A, "Member 'PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage::CallFunc_ClassIsChildOf_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage, CallFunc_ClassIsChildOf_ReturnValue2) == 0x00000B, "Member 'PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage::CallFunc_ClassIsChildOf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage, CallFunc_BooleanOR_ReturnValue) == 0x00000C, "Member 'PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage, CallFunc_BooleanOR_ReturnValue1) == 0x00000D, "Member 'PassiveSkill_Siren_BareKnuckle_C_IsConsideredMeleeDamage::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");

}

