#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveSkill_Operative_Multitasker

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function PassiveSkill_Operative_Multitasker.PassiveSkill_Operative_Multitasker_C.ExecuteUbergraph_PassiveSkill_Operative_Multitasker
// 0x00E0 (0x00E0 - 0x0000)
struct PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0028(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x0050(0x0028)(NoDestructor)
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility1;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0088(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x00C0(0x0018)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveStatusEffectInstance_ReturnValue;   // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker) == 0x000008, "Wrong alignment on PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker");
static_assert(sizeof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker) == 0x0000E0, "Wrong size on PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, EntryPoint) == 0x000000, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, K2Node_CreateDelegate_OutputDelegate1) == 0x000018, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000028, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x000050, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, K2Node_CustomEvent_ActionAbility1) == 0x000078, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::K2Node_CustomEvent_ActionAbility1' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, K2Node_CustomEvent_ActionAbility) == 0x000080, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::K2Node_CustomEvent_ActionAbility' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, K2Node_MakeStruct_StatusEffectSpec) == 0x000088, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, CallFunc_AddStatusEffect_ReturnValue) == 0x0000C0, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker, CallFunc_RemoveStatusEffectInstance_ReturnValue) == 0x0000DC, "Member 'PassiveSkill_Operative_Multitasker_C_ExecuteUbergraph_PassiveSkill_Operative_Multitasker::CallFunc_RemoveStatusEffectInstance_ReturnValue' has a wrong offset!");

// Function PassiveSkill_Operative_Multitasker.PassiveSkill_Operative_Multitasker_C.Multitasker_OnActionSkillActivated
// 0x0008 (0x0008 - 0x0000)
struct PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillActivated final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillActivated) == 0x000008, "Wrong alignment on PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillActivated");
static_assert(sizeof(PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillActivated) == 0x000008, "Wrong size on PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillActivated");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillActivated, ActionAbility) == 0x000000, "Member 'PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillActivated::ActionAbility' has a wrong offset!");

// Function PassiveSkill_Operative_Multitasker.PassiveSkill_Operative_Multitasker_C.Multitasker_OnActionSkillCoolingDown
// 0x0008 (0x0008 - 0x0000)
struct PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillCoolingDown final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillCoolingDown) == 0x000008, "Wrong alignment on PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillCoolingDown");
static_assert(sizeof(PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillCoolingDown) == 0x000008, "Wrong size on PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillCoolingDown");
static_assert(offsetof(PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillCoolingDown, ActionAbility) == 0x000000, "Member 'PassiveSkill_Operative_Multitasker_C_Multitasker_OnActionSkillCoolingDown::ActionAbility' has a wrong offset!");

}

