#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Beastmaster_Bond3

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Passive_Beastmaster_Bond3.Passive_Beastmaster_Bond3_C
// 0x0048 (0x01F8 - 0x01B0)
class UPassive_Beastmaster_Bond3_C final : public UOakPassiveAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(Transient, DuplicateTransient)
	float                                         NewDamageDealt;                                    // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageSource*                          NewDamageSource;                                   // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          ActivePet;                                         // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Beastmaster_Bond3; // 0x01D0(0x0028)()

public:
	void ExecuteUbergraph_Passive_Beastmaster_Bond3(int32 EntryPoint);
	void OnAbilityTimerEnded(const struct FOakAbilityTimerSpec& Spec, const struct FOakAbilityTimerResult& Result);
	void OnCausedDamage_Bond3(class AActor* DamageInstigator, float Damage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);
	void OnActivated();
	void DoPetHeal();
	void CanHealPet(class UObject* DamageInst, const class UDamageSource* DamageSource, bool* Res);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Passive_Beastmaster_Bond3_C">();
	}
	static class UPassive_Beastmaster_Bond3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassive_Beastmaster_Bond3_C>();
	}
};
static_assert(alignof(UPassive_Beastmaster_Bond3_C) == 0x000008, "Wrong alignment on UPassive_Beastmaster_Bond3_C");
static_assert(sizeof(UPassive_Beastmaster_Bond3_C) == 0x0001F8, "Wrong size on UPassive_Beastmaster_Bond3_C");
static_assert(offsetof(UPassive_Beastmaster_Bond3_C, UberGraphFrame) == 0x0001B0, "Member 'UPassive_Beastmaster_Bond3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Bond3_C, NewDamageDealt) == 0x0001B8, "Member 'UPassive_Beastmaster_Bond3_C::NewDamageDealt' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Bond3_C, NewDamageSource) == 0x0001C0, "Member 'UPassive_Beastmaster_Bond3_C::NewDamageSource' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Bond3_C, ActivePet) == 0x0001C8, "Member 'UPassive_Beastmaster_Bond3_C::ActivePet' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Bond3_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Beastmaster_Bond3) == 0x0001D0, "Member 'UPassive_Beastmaster_Bond3_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Beastmaster_Bond3' has a wrong offset!");

}

