#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Beastmaster_Ranged3

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Passive_Beastmaster_Ranged3.Passive_Beastmaster_Ranged3_C
// 0x00C8 (0x0278 - 0x01B0)
class UPassive_Beastmaster_Ranged3_C final : public UOakPassiveAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01B0(0x0008)(Transient, DuplicateTransient)
	class AWeapon*                                PlayerFiredWeapon;                                 // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Killed_Beast;                                      // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Killed_Human;                                      // 0x01C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Killed_Robot;                                      // 0x01C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NewTarget;                                         // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tags_Humanoid;                                     // 0x01D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  Tags_Robot;                                        // 0x01F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  Tags_Beast;                                        // 0x0210(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGbxAbilityResourceController_ScriptDelegate RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Beastmaster_Ranged3; // 0x0230(0x0028)()
	class UBPEventHub_Beastmaster_C*              OwnerEventHub;                                     // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableValueHandle                  PetEffectDuration;                                 // 0x0260(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_Passive_Beastmaster_Ranged3(int32 EntryPoint);
	void ClassModUnique03_KillSkillTrigger(class AActor* DamagedActor);
	void HandleTriggeredAbility(class AActor* DamagedActor);
	void OnActivated();
	void OnCausedDeath_Ranged3(const class UDamageComponent* Damaged, const struct FCausedDeathDetails& Details);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Passive_Beastmaster_Ranged3_C">();
	}
	static class UPassive_Beastmaster_Ranged3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPassive_Beastmaster_Ranged3_C>();
	}
};
static_assert(alignof(UPassive_Beastmaster_Ranged3_C) == 0x000008, "Wrong alignment on UPassive_Beastmaster_Ranged3_C");
static_assert(sizeof(UPassive_Beastmaster_Ranged3_C) == 0x000278, "Wrong size on UPassive_Beastmaster_Ranged3_C");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, UberGraphFrame) == 0x0001B0, "Member 'UPassive_Beastmaster_Ranged3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, PlayerFiredWeapon) == 0x0001B8, "Member 'UPassive_Beastmaster_Ranged3_C::PlayerFiredWeapon' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, Killed_Beast) == 0x0001C0, "Member 'UPassive_Beastmaster_Ranged3_C::Killed_Beast' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, Killed_Human) == 0x0001C1, "Member 'UPassive_Beastmaster_Ranged3_C::Killed_Human' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, Killed_Robot) == 0x0001C2, "Member 'UPassive_Beastmaster_Ranged3_C::Killed_Robot' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, NewTarget) == 0x0001C8, "Member 'UPassive_Beastmaster_Ranged3_C::NewTarget' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, Tags_Humanoid) == 0x0001D0, "Member 'UPassive_Beastmaster_Ranged3_C::Tags_Humanoid' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, Tags_Robot) == 0x0001F0, "Member 'UPassive_Beastmaster_Ranged3_C::Tags_Robot' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, Tags_Beast) == 0x000210, "Member 'UPassive_Beastmaster_Ranged3_C::Tags_Beast' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Beastmaster_Ranged3) == 0x000230, "Member 'UPassive_Beastmaster_Ranged3_C::RsrcCntrlr_GbxAbilityResourceController_ScriptDelegate_Passive_Beastmaster_Ranged3' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, OwnerEventHub) == 0x000258, "Member 'UPassive_Beastmaster_Ranged3_C::OwnerEventHub' has a wrong offset!");
static_assert(offsetof(UPassive_Beastmaster_Ranged3_C, PetEffectDuration) == 0x000260, "Member 'UPassive_Beastmaster_Ranged3_C::PetEffectDuration' has a wrong offset!");

}

