#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Gunner_DLCSkill_5

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Passive_Gunner_DLCSkill_5.Passive_Gunner_DLCSkill_5_C.ExecuteUbergraph_Passive_Gunner_DLCSkill_5
// 0x0308 (0x0308 - 0x0000)
struct Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventorySlotData*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetEquippedInventoryForSlot_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0038(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0070(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FStatusEffectRemoveSpec                K2Node_MakeStruct_StatusEffectRemoveSpec;          // 0x0088(0x0010)(NoDestructor)
	bool                                          CallFunc_RemoveStatusEffect_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                K2Node_CustomEvent_NewWeapon;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                K2Node_CustomEvent_LastWeapon;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AWeapon* NewWeapon, class AWeapon* LastWeapon)> K2Node_CreateDelegate_OutputDelegate1;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x00F0(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x0118(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2; // 0x0140(0x0028)(NoDestructor)
	class AActor*                                 K2Node_CustomEvent_EquippedActor;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventorySlotData*                     K2Node_CustomEvent_SlotData;                       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* UnequippedActor, class UInventorySlotData* SlotData)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate3; // 0x0188(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate4; // 0x01B0(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate5; // 0x01D8(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate6; // 0x0200(0x0028)(NoDestructor)
	class UBPFightForYourLifeComponent_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPEventHub_Gunner_C*                   K2Node_DynamicCast_AsBPEvent_Hub_Gunner;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter_IronBear*                 K2Node_CustomEvent_IronBear;                       // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AOakCharacter_IronBear* IronBear)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate7; // 0x0268(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate8; // 0x0290(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate9; // 0x02B8(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate10; // 0x02E0(0x0028)(NoDestructor)
};
static_assert(alignof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5) == 0x000008, "Wrong alignment on Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5");
static_assert(sizeof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5) == 0x000308, "Wrong size on Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, EntryPoint) == 0x000000, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, Temp_bool_Has_Been_Initd_Variable) == 0x000019, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, Temp_int_Variable) == 0x00001C, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_Array_Get_Item) == 0x000020, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_GetEquippedInventoryForSlot_ReturnValue) == 0x000030, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_GetEquippedInventoryForSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_StatusEffectSpec) == 0x000038, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_AddStatusEffect_ReturnValue) == 0x000070, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_StatusEffectRemoveSpec) == 0x000088, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_StatusEffectRemoveSpec' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_RemoveStatusEffect_ReturnValue) == 0x000098, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_RemoveStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_GetWeapon_ReturnValue) == 0x0000A0, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CustomEvent_NewWeapon) == 0x0000A8, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CustomEvent_NewWeapon' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CustomEvent_LastWeapon) == 0x0000B0, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CustomEvent_LastWeapon' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CreateDelegate_OutputDelegate1) == 0x0000B8, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C8, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000CC, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, Temp_int_Loop_Counter_Variable) == 0x0000D0, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CreateDelegate_OutputDelegate2) == 0x0000E0, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x0000F0, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x000118, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2) == 0x000140, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate2' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CustomEvent_EquippedActor) == 0x000168, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CustomEvent_EquippedActor' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CustomEvent_SlotData) == 0x000170, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CustomEvent_SlotData' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CreateDelegate_OutputDelegate3) == 0x000178, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate3) == 0x000188, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate3' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate4) == 0x0001B0, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate4' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate5) == 0x0001D8, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate5' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate6) == 0x000200, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate6' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, CallFunc_GetComponentByClass_ReturnValue) == 0x000228, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_DynamicCast_AsBPEvent_Hub_Gunner) == 0x000230, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_DynamicCast_AsBPEvent_Hub_Gunner' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CustomEvent_IronBear) == 0x000240, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CustomEvent_IronBear' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CreateDelegate_OutputDelegate4) == 0x000248, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_CreateDelegate_OutputDelegate5) == 0x000258, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate7) == 0x000268, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate7' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate8) == 0x000290, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate8' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate9) == 0x0002B8, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate9' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate10) == 0x0002E0, "Member 'Passive_Gunner_DLCSkill_5_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_5::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate10' has a wrong offset!");

// Function Passive_Gunner_DLCSkill_5.Passive_Gunner_DLCSkill_5_C.DLCSkill5_IronBearExitedAndPlayerReady
// 0x0008 (0x0008 - 0x0000)
struct Passive_Gunner_DLCSkill_5_C_DLCSkill5_IronBearExitedAndPlayerReady final
{
public:
	class AOakCharacter_IronBear*                 IronBear;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Gunner_DLCSkill_5_C_DLCSkill5_IronBearExitedAndPlayerReady) == 0x000008, "Wrong alignment on Passive_Gunner_DLCSkill_5_C_DLCSkill5_IronBearExitedAndPlayerReady");
static_assert(sizeof(Passive_Gunner_DLCSkill_5_C_DLCSkill5_IronBearExitedAndPlayerReady) == 0x000008, "Wrong size on Passive_Gunner_DLCSkill_5_C_DLCSkill5_IronBearExitedAndPlayerReady");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_DLCSkill5_IronBearExitedAndPlayerReady, IronBear) == 0x000000, "Member 'Passive_Gunner_DLCSkill_5_C_DLCSkill5_IronBearExitedAndPlayerReady::IronBear' has a wrong offset!");

// Function Passive_Gunner_DLCSkill_5.Passive_Gunner_DLCSkill_5_C.DLC5_OnGrenadeSlotChanged
// 0x0010 (0x0010 - 0x0000)
struct Passive_Gunner_DLCSkill_5_C_DLC5_OnGrenadeSlotChanged final
{
public:
	class AActor*                                 EquippedActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventorySlotData*                     SlotData;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Gunner_DLCSkill_5_C_DLC5_OnGrenadeSlotChanged) == 0x000008, "Wrong alignment on Passive_Gunner_DLCSkill_5_C_DLC5_OnGrenadeSlotChanged");
static_assert(sizeof(Passive_Gunner_DLCSkill_5_C_DLC5_OnGrenadeSlotChanged) == 0x000010, "Wrong size on Passive_Gunner_DLCSkill_5_C_DLC5_OnGrenadeSlotChanged");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_DLC5_OnGrenadeSlotChanged, EquippedActor) == 0x000000, "Member 'Passive_Gunner_DLCSkill_5_C_DLC5_OnGrenadeSlotChanged::EquippedActor' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_DLC5_OnGrenadeSlotChanged, SlotData) == 0x000008, "Member 'Passive_Gunner_DLCSkill_5_C_DLC5_OnGrenadeSlotChanged::SlotData' has a wrong offset!");

// Function Passive_Gunner_DLCSkill_5.Passive_Gunner_DLCSkill_5_C.DLCSkill5_OnWeaponChanged
// 0x0010 (0x0010 - 0x0000)
struct Passive_Gunner_DLCSkill_5_C_DLCSkill5_OnWeaponChanged final
{
public:
	class AWeapon*                                NewWeapon;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                LastWeapon;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Gunner_DLCSkill_5_C_DLCSkill5_OnWeaponChanged) == 0x000008, "Wrong alignment on Passive_Gunner_DLCSkill_5_C_DLCSkill5_OnWeaponChanged");
static_assert(sizeof(Passive_Gunner_DLCSkill_5_C_DLCSkill5_OnWeaponChanged) == 0x000010, "Wrong size on Passive_Gunner_DLCSkill_5_C_DLCSkill5_OnWeaponChanged");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_DLCSkill5_OnWeaponChanged, NewWeapon) == 0x000000, "Member 'Passive_Gunner_DLCSkill_5_C_DLCSkill5_OnWeaponChanged::NewWeapon' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_DLCSkill5_OnWeaponChanged, LastWeapon) == 0x000008, "Member 'Passive_Gunner_DLCSkill_5_C_DLCSkill5_OnWeaponChanged::LastWeapon' has a wrong offset!");

// Function Passive_Gunner_DLCSkill_5.Passive_Gunner_DLCSkill_5_C.GetItemDamageType
// 0x0058 (0x0058 - 0x0000)
struct Passive_Gunner_DLCSkill_5_C_GetItemDamageType final
{
public:
	class AActor*                                 InvSlot;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LocalDamageType;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryBalanceStateComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetDamageType_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue1;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue2;       // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue3;       // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue4;       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType) == 0x000008, "Wrong alignment on Passive_Gunner_DLCSkill_5_C_GetItemDamageType");
static_assert(sizeof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType) == 0x000058, "Wrong size on Passive_Gunner_DLCSkill_5_C_GetItemDamageType");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, InvSlot) == 0x000000, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::InvSlot' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, LocalDamageType) == 0x000008, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::LocalDamageType' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, Temp_int_Variable) == 0x000010, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, Temp_int_Variable1) == 0x000020, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_GetDamageType_ReturnValue) == 0x000028, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_GetDamageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, Temp_int_Variable2) == 0x000030, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, Temp_int_Variable3) == 0x000034, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, Temp_int_Variable4) == 0x000038, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_Add_IntInt_ReturnValue1) == 0x000040, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_Add_IntInt_ReturnValue2) == 0x000044, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_Add_IntInt_ReturnValue3) == 0x000048, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_Add_IntInt_ReturnValue4) == 0x00004C, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000050, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_EqualEqual_ClassClass_ReturnValue1) == 0x000051, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_EqualEqual_ClassClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_EqualEqual_ClassClass_ReturnValue2) == 0x000052, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_EqualEqual_ClassClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_EqualEqual_ClassClass_ReturnValue3) == 0x000053, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_EqualEqual_ClassClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetItemDamageType, CallFunc_EqualEqual_ClassClass_ReturnValue4) == 0x000054, "Member 'Passive_Gunner_DLCSkill_5_C_GetItemDamageType::CallFunc_EqualEqual_ClassClass_ReturnValue4' has a wrong offset!");

// Function Passive_Gunner_DLCSkill_5.Passive_Gunner_DLCSkill_5_C.GetNumberOfBonuses
// 0x0028 (0x0028 - 0x0000)
struct Passive_Gunner_DLCSkill_5_C_GetNumberOfBonuses final
{
public:
	class UClass*                                 LocalDamageType;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue1;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue2;       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue3;       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue4;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGbxDamageType*                   CallFunc_GetDamageType_ReturnValue;                // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Gunner_DLCSkill_5_C_GetNumberOfBonuses) == 0x000008, "Wrong alignment on Passive_Gunner_DLCSkill_5_C_GetNumberOfBonuses");
static_assert(sizeof(Passive_Gunner_DLCSkill_5_C_GetNumberOfBonuses) == 0x000028, "Wrong size on Passive_Gunner_DLCSkill_5_C_GetNumberOfBonuses");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetNumberOfBonuses, LocalDamageType) == 0x000000, "Member 'Passive_Gunner_DLCSkill_5_C_GetNumberOfBonuses::LocalDamageType' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_5_C_GetNumberOfBonuses, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000008, "Member 'Passive_Gunner_DLCSkill_5_C_GetNumberOfBonuses::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
