#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveSkill_Siren_Vigor

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function PassiveSkill_Siren_Vigor.PassiveSkill_Siren_Vigor_C.ExecuteUbergraph_PassiveSkill_Siren_Vigor
// 0x00C0 (0x00C0 - 0x0000)
struct PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetAbilityOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageComponent*                 K2Node_CustomEvent_Damaged;                        // 0x0020(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x0028(0x0068)(ConstParm)
	class UOakDamageCauserComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0098(0x0028)(NoDestructor)
};
static_assert(alignof(PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor) == 0x000008, "Wrong alignment on PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor");
static_assert(sizeof(PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor) == 0x0000C0, "Wrong size on PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor");
static_assert(offsetof(PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor, EntryPoint) == 0x000000, "Member 'PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor, CallFunc_GetAbilityOwner_ReturnValue) == 0x000018, "Member 'PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor::CallFunc_GetAbilityOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor, K2Node_CustomEvent_Damaged) == 0x000020, "Member 'PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor, K2Node_CustomEvent_Details) == 0x000028, "Member 'PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor, CallFunc_GetComponentByClass_ReturnValue) == 0x000090, "Member 'PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000098, "Member 'PassiveSkill_Siren_Vigor_C_ExecuteUbergraph_PassiveSkill_Siren_Vigor::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

// Function PassiveSkill_Siren_Vigor.PassiveSkill_Siren_Vigor_C.OnCausedActionSkillDeath
// 0x0070 (0x0070 - 0x0000)
struct PassiveSkill_Siren_Vigor_C_OnCausedActionSkillDeath final
{
public:
	const class UDamageComponent*                 Damaged;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PassiveSkill_Siren_Vigor_C_OnCausedActionSkillDeath) == 0x000008, "Wrong alignment on PassiveSkill_Siren_Vigor_C_OnCausedActionSkillDeath");
static_assert(sizeof(PassiveSkill_Siren_Vigor_C_OnCausedActionSkillDeath) == 0x000070, "Wrong size on PassiveSkill_Siren_Vigor_C_OnCausedActionSkillDeath");
static_assert(offsetof(PassiveSkill_Siren_Vigor_C_OnCausedActionSkillDeath, Damaged) == 0x000000, "Member 'PassiveSkill_Siren_Vigor_C_OnCausedActionSkillDeath::Damaged' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_Vigor_C_OnCausedActionSkillDeath, Details) == 0x000008, "Member 'PassiveSkill_Siren_Vigor_C_OnCausedActionSkillDeath::Details' has a wrong offset!");

}

