#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Siren_DLCSkill_11

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function Passive_Siren_DLCSkill_11.Passive_Siren_DLCSkill_11_C.ExecuteUbergraph_Passive_Siren_DLCSkill_11
// 0x0320 (0x0320 - 0x0000)
struct Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec;             // 0x0010(0x0018)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue1; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageComponent*                 K2Node_CustomEvent_Damaged;                        // 0x0050(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x0058(0x0068)(ConstParm)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x00C0(0x0028)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakStatusEffectManagerComponent*       CallFunc_GetComponentByClass_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0130(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x013C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0148(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityTimerActive_ReturnValue;         // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue2; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_RunEnvQueryForAllActors_ResultActors;     // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_RunEnvQueryForAllActors_ReturnValue;      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0184(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0194(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakLightProjectileInitializationData  K2Node_MakeStruct_OakLightProjectileInitializationData; // 0x01C0(0x0158)(ContainsInstancedReference)
	bool                                          CallFunc_IsAffectedByElementalType_ReturnValue;    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11) == 0x000010, "Wrong alignment on Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11");
static_assert(sizeof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11) == 0x000320, "Wrong size on Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, EntryPoint) == 0x000000, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000004, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, K2Node_MakeStruct_OakAbilityTimerSpec) == 0x000010, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::K2Node_MakeStruct_OakAbilityTimerSpec' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_GetDataTableValueFromHandle_ReturnValue1) == 0x000030, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_GetDataTableValueFromHandle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_FTrunc_ReturnValue) == 0x000034, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, K2Node_CustomEvent_Damaged) == 0x000050, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, K2Node_CustomEvent_Details) == 0x000058, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x0000C0, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_GetOwner_ReturnValue) == 0x0000E8, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_GetComponentByClass_ReturnValue) == 0x0000F0, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_GetActorSocket_ReturnValue) == 0x000100, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_BreakTransform_Location) == 0x000130, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_BreakTransform_Rotation) == 0x00013C, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_BreakTransform_Scale) == 0x000148, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_IsAbilityTimerActive_ReturnValue) == 0x000154, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_IsAbilityTimerActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_GetDataTableValueFromHandle_ReturnValue2) == 0x000158, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_GetDataTableValueFromHandle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_RunEnvQueryForAllActors_ResultActors) == 0x000160, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_RunEnvQueryForAllActors_ResultActors' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_RunEnvQueryForAllActors_ReturnValue) == 0x000170, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_RunEnvQueryForAllActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_Add_IntInt_ReturnValue) == 0x000174, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_Array_Get_Item) == 0x000178, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_GetActorUpVector_ReturnValue) == 0x000184, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_Less_IntInt_ReturnValue1) == 0x000190, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000194, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_BooleanAND_ReturnValue) == 0x0001A0, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001A4, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B0, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, K2Node_MakeStruct_OakLightProjectileInitializationData) == 0x0001C0, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::K2Node_MakeStruct_OakLightProjectileInitializationData' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11, CallFunc_IsAffectedByElementalType_ReturnValue) == 0x000318, "Member 'Passive_Siren_DLCSkill_11_C_ExecuteUbergraph_Passive_Siren_DLCSkill_11::CallFunc_IsAffectedByElementalType_ReturnValue' has a wrong offset!");

// Function Passive_Siren_DLCSkill_11.Passive_Siren_DLCSkill_11_C.DLCSkill11_OnCausedDeath
// 0x0070 (0x0070 - 0x0000)
struct Passive_Siren_DLCSkill_11_C_DLCSkill11_OnCausedDeath final
{
public:
	const class UDamageComponent*                 Damaged;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Passive_Siren_DLCSkill_11_C_DLCSkill11_OnCausedDeath) == 0x000008, "Wrong alignment on Passive_Siren_DLCSkill_11_C_DLCSkill11_OnCausedDeath");
static_assert(sizeof(Passive_Siren_DLCSkill_11_C_DLCSkill11_OnCausedDeath) == 0x000070, "Wrong size on Passive_Siren_DLCSkill_11_C_DLCSkill11_OnCausedDeath");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_DLCSkill11_OnCausedDeath, Damaged) == 0x000000, "Member 'Passive_Siren_DLCSkill_11_C_DLCSkill11_OnCausedDeath::Damaged' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_11_C_DLCSkill11_OnCausedDeath, Details) == 0x000008, "Member 'Passive_Siren_DLCSkill_11_C_DLCSkill11_OnCausedDeath::Details' has a wrong offset!");

}

