#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveSkill_Siren_PersonalSpace

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function PassiveSkill_Siren_PersonalSpace.PassiveSkill_Siren_PersonalSpace_C.ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace
// 0x0030 (0x0030 - 0x0000)
struct PassiveSkill_Siren_PersonalSpace_C_ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ConditionalDamageModifier K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier; // 0x0008(0x0028)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PassiveSkill_Siren_PersonalSpace_C_ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace) == 0x000008, "Wrong alignment on PassiveSkill_Siren_PersonalSpace_C_ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace");
static_assert(sizeof(PassiveSkill_Siren_PersonalSpace_C_ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace) == 0x000030, "Wrong size on PassiveSkill_Siren_PersonalSpace_C_ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace, EntryPoint) == 0x000000, "Member 'PassiveSkill_Siren_PersonalSpace_C_ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace, K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier) == 0x000008, "Member 'PassiveSkill_Siren_PersonalSpace_C_ExecuteUbergraph_PassiveSkill_Siren_PersonalSpace::K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier' has a wrong offset!");

// Function PassiveSkill_Siren_PersonalSpace.PassiveSkill_Siren_PersonalSpace_C.CalculateAbilityState
// 0x0008 (0x0008 - 0x0000)
struct PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState final
{
public:
	EGbxAbilityState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAbilityState                              CallFunc_CalculateAbilityState_ReturnValue;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttached_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              CallFunc_CalculateAbilityState_ReturnValue1;       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAbilityState                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState) == 0x000001, "Wrong alignment on PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState");
static_assert(sizeof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState) == 0x000008, "Wrong size on PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState, ReturnValue) == 0x000000, "Member 'PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState::ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState, Temp_bool_Variable) == 0x000001, "Member 'PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState, Temp_byte_Variable) == 0x000002, "Member 'PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState, CallFunc_CalculateAbilityState_ReturnValue) == 0x000003, "Member 'PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState::CallFunc_CalculateAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState, CallFunc_IsAttached_ReturnValue) == 0x000005, "Member 'PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState::CallFunc_IsAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState, CallFunc_CalculateAbilityState_ReturnValue1) == 0x000006, "Member 'PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState::CallFunc_CalculateAbilityState_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState, K2Node_Select_Default) == 0x000007, "Member 'PassiveSkill_Siren_PersonalSpace_C_CalculateAbilityState::K2Node_Select_Default' has a wrong offset!");

}

