#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Gunner_DLCSkill_13

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Passive_Gunner_DLCSkill_13.Passive_Gunner_DLCSkill_13_C.ExecuteUbergraph_Passive_Gunner_DLCSkill_13
// 0x0050 (0x0050 - 0x0000)
struct Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Causer;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectSpec                      K2Node_Event_Spec;                                 // 0x0010(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13) == 0x000008, "Wrong alignment on Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13");
static_assert(sizeof(Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13) == 0x000050, "Wrong size on Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13, EntryPoint) == 0x000000, "Member 'Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13, K2Node_Event_Causer) == 0x000008, "Member 'Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13::K2Node_Event_Causer' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13, K2Node_Event_Spec) == 0x000010, "Member 'Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13::K2Node_Event_Spec' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'Passive_Gunner_DLCSkill_13_C_ExecuteUbergraph_Passive_Gunner_DLCSkill_13::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function Passive_Gunner_DLCSkill_13.Passive_Gunner_DLCSkill_13_C.GunnerCausedElementalEffect
// 0x0040 (0x0040 - 0x0000)
struct Passive_Gunner_DLCSkill_13_C_GunnerCausedElementalEffect final
{
public:
	class AActor*                                 Causer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectSpec                      Spec;                                              // 0x0008(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Passive_Gunner_DLCSkill_13_C_GunnerCausedElementalEffect) == 0x000008, "Wrong alignment on Passive_Gunner_DLCSkill_13_C_GunnerCausedElementalEffect");
static_assert(sizeof(Passive_Gunner_DLCSkill_13_C_GunnerCausedElementalEffect) == 0x000040, "Wrong size on Passive_Gunner_DLCSkill_13_C_GunnerCausedElementalEffect");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_GunnerCausedElementalEffect, Causer) == 0x000000, "Member 'Passive_Gunner_DLCSkill_13_C_GunnerCausedElementalEffect::Causer' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_GunnerCausedElementalEffect, Spec) == 0x000008, "Member 'Passive_Gunner_DLCSkill_13_C_GunnerCausedElementalEffect::Spec' has a wrong offset!");

// Function Passive_Gunner_DLCSkill_13.Passive_Gunner_DLCSkill_13_C.CalculateAbilityState
// 0x0018 (0x0018 - 0x0000)
struct Passive_Gunner_DLCSkill_13_C_CalculateAbilityState final
{
public:
	EGbxAbilityState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakActionAbility*                      CallFunc_GetPrimaryActionAbility_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxAbilityState                              CallFunc_CalculateAbilityState_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGbxAbilityState                              K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Gunner_DLCSkill_13_C_CalculateAbilityState) == 0x000008, "Wrong alignment on Passive_Gunner_DLCSkill_13_C_CalculateAbilityState");
static_assert(sizeof(Passive_Gunner_DLCSkill_13_C_CalculateAbilityState) == 0x000018, "Wrong size on Passive_Gunner_DLCSkill_13_C_CalculateAbilityState");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_CalculateAbilityState, ReturnValue) == 0x000000, "Member 'Passive_Gunner_DLCSkill_13_C_CalculateAbilityState::ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_CalculateAbilityState, Temp_bool_Variable) == 0x000001, "Member 'Passive_Gunner_DLCSkill_13_C_CalculateAbilityState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_CalculateAbilityState, Temp_byte_Variable) == 0x000002, "Member 'Passive_Gunner_DLCSkill_13_C_CalculateAbilityState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_CalculateAbilityState, CallFunc_GetPrimaryActionAbility_ReturnValue) == 0x000008, "Member 'Passive_Gunner_DLCSkill_13_C_CalculateAbilityState::CallFunc_GetPrimaryActionAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_CalculateAbilityState, CallFunc_CalculateAbilityState_ReturnValue) == 0x000010, "Member 'Passive_Gunner_DLCSkill_13_C_CalculateAbilityState::CallFunc_CalculateAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_CalculateAbilityState, CallFunc_IsActive_ReturnValue) == 0x000011, "Member 'Passive_Gunner_DLCSkill_13_C_CalculateAbilityState::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Gunner_DLCSkill_13_C_CalculateAbilityState, K2Node_Select_Default) == 0x000012, "Member 'Passive_Gunner_DLCSkill_13_C_CalculateAbilityState::K2Node_Select_Default' has a wrong offset!");

}

