#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Siren_DLCSkill_7

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Passive_Siren_DLCSkill_7.Passive_Siren_DLCSkill_7_C.ExecuteUbergraph_Passive_Siren_DLCSkill_7
// 0x00B0 (0x00B0 - 0x0000)
struct Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	const class UDamageComponent*                 K2Node_CustomEvent_Damaged;                        // 0x0018(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x0020(0x0068)(ConstParm)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0088(0x0028)(NoDestructor)
};
static_assert(alignof(Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7) == 0x000008, "Wrong alignment on Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7");
static_assert(sizeof(Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7) == 0x0000B0, "Wrong size on Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7");
static_assert(offsetof(Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7, EntryPoint) == 0x000000, "Member 'Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7, K2Node_CustomEvent_Damaged) == 0x000018, "Member 'Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7, K2Node_CustomEvent_Details) == 0x000020, "Member 'Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000088, "Member 'Passive_Siren_DLCSkill_7_C_ExecuteUbergraph_Passive_Siren_DLCSkill_7::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

// Function Passive_Siren_DLCSkill_7.Passive_Siren_DLCSkill_7_C.DLCSkill7_OnCausedDeath
// 0x0070 (0x0070 - 0x0000)
struct Passive_Siren_DLCSkill_7_C_DLCSkill7_OnCausedDeath final
{
public:
	const class UDamageComponent*                 Damaged;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Passive_Siren_DLCSkill_7_C_DLCSkill7_OnCausedDeath) == 0x000008, "Wrong alignment on Passive_Siren_DLCSkill_7_C_DLCSkill7_OnCausedDeath");
static_assert(sizeof(Passive_Siren_DLCSkill_7_C_DLCSkill7_OnCausedDeath) == 0x000070, "Wrong size on Passive_Siren_DLCSkill_7_C_DLCSkill7_OnCausedDeath");
static_assert(offsetof(Passive_Siren_DLCSkill_7_C_DLCSkill7_OnCausedDeath, Damaged) == 0x000000, "Member 'Passive_Siren_DLCSkill_7_C_DLCSkill7_OnCausedDeath::Damaged' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_7_C_DLCSkill7_OnCausedDeath, Details) == 0x000008, "Member 'Passive_Siren_DLCSkill_7_C_DLCSkill7_OnCausedDeath::Details' has a wrong offset!");

}

