#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PassiveSkill_Gunner_FireInSkagDen

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function PassiveSkill_Gunner_FireInSkagDen.PassiveSkill_Gunner_FireInSkagDen_C.ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen
// 0x00A8 (0x00A8 - 0x0000)
struct PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AOakCharacter_IronBear* IronBear)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ConditionalDamageModifier K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier; // 0x0018(0x0028)(NoDestructor, ContainsInstancedReference)
	class AOakCharacter_IronBear*                 K2Node_CustomEvent_IronBear;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityEventHub_Gunner*       K2Node_DynamicCast_AsOak_Player_Ability_Event_Hub_Gunner; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0058(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ConditionalDamageModifier K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier1; // 0x0080(0x0028)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen) == 0x000008, "Wrong alignment on PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen");
static_assert(sizeof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen) == 0x0000A8, "Wrong size on PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen");
static_assert(offsetof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen, EntryPoint) == 0x000000, "Member 'PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen, K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier) == 0x000018, "Member 'PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen::K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen, K2Node_CustomEvent_IronBear) == 0x000040, "Member 'PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen::K2Node_CustomEvent_IronBear' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen, K2Node_DynamicCast_AsOak_Player_Ability_Event_Hub_Gunner) == 0x000048, "Member 'PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen::K2Node_DynamicCast_AsOak_Player_Ability_Event_Hub_Gunner' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000058, "Member 'PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen, K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier1) == 0x000080, "Member 'PassiveSkill_Gunner_FireInSkagDen_C_ExecuteUbergraph_PassiveSkill_Gunner_FireInSkagDen::K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier1' has a wrong offset!");

// Function PassiveSkill_Gunner_FireInSkagDen.PassiveSkill_Gunner_FireInSkagDen_C.OnEnteredIronBear_FireSkagDen
// 0x0008 (0x0008 - 0x0000)
struct PassiveSkill_Gunner_FireInSkagDen_C_OnEnteredIronBear_FireSkagDen final
{
public:
	class AOakCharacter_IronBear*                 IronBear;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassiveSkill_Gunner_FireInSkagDen_C_OnEnteredIronBear_FireSkagDen) == 0x000008, "Wrong alignment on PassiveSkill_Gunner_FireInSkagDen_C_OnEnteredIronBear_FireSkagDen");
static_assert(sizeof(PassiveSkill_Gunner_FireInSkagDen_C_OnEnteredIronBear_FireSkagDen) == 0x000008, "Wrong size on PassiveSkill_Gunner_FireInSkagDen_C_OnEnteredIronBear_FireSkagDen");
static_assert(offsetof(PassiveSkill_Gunner_FireInSkagDen_C_OnEnteredIronBear_FireSkagDen, IronBear) == 0x000000, "Member 'PassiveSkill_Gunner_FireInSkagDen_C_OnEnteredIronBear_FireSkagDen::IronBear' has a wrong offset!");

}

