#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Beastmaster_DLCSkill_13

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Passive_Beastmaster_DLCSkill_13.Passive_Beastmaster_DLCSkill_13_C.ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13
// 0x0138 (0x0138 - 0x0000)
struct Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AOakCharacter* Pet)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class IIBPChar_Beastmaster_C> K2Node_DynamicCast_AsIBPChar_Beastmaster;          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CallFunc_GetCurrentPet_Res;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPEventHub_Beastmaster_C*              K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBPChar_Beastmaster_C> K2Node_DynamicCast_AsIBPChar_Beastmaster1;         // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0080(0x0028)(NoDestructor)
	class AOakCharacter*                          CallFunc_GetCurrentPet_Res1;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ConditionalDamageModifier K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier; // 0x00B8(0x0028)(NoDestructor, ContainsInstancedReference)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x00E0(0x0028)(NoDestructor)
	struct FGbxAbilityResourceSpec_ConditionalDamageModifier K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier1; // 0x0108(0x0028)(NoDestructor, ContainsInstancedReference)
	class AOakCharacter*                          K2Node_CustomEvent_Pet;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13) == 0x000008, "Wrong alignment on Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13");
static_assert(sizeof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13) == 0x000138, "Wrong size on Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, EntryPoint) == 0x000000, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_CreateDelegate_OutputDelegate1) == 0x000018, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_DynamicCast_AsIBPChar_Beastmaster) == 0x000028, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_DynamicCast_AsIBPChar_Beastmaster' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, CallFunc_GetCurrentPet_Res) == 0x000040, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::CallFunc_GetCurrentPet_Res' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster) == 0x000058, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_DynamicCast_AsIBPChar_Beastmaster1) == 0x000068, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_DynamicCast_AsIBPChar_Beastmaster1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_DynamicCast_bSuccess2) == 0x000078, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000080, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, CallFunc_GetCurrentPet_Res1) == 0x0000A8, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::CallFunc_GetCurrentPet_Res1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, CallFunc_IsValid_ReturnValue1) == 0x0000B0, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier) == 0x0000B8, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x0000E0, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier1) == 0x000108, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_MakeStruct_GbxAbilityResourceSpec_ConditionalDamageModifier1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13, K2Node_CustomEvent_Pet) == 0x000130, "Member 'Passive_Beastmaster_DLCSkill_13_C_ExecuteUbergraph_Passive_Beastmaster_DLCSkill_13::K2Node_CustomEvent_Pet' has a wrong offset!");

// Function Passive_Beastmaster_DLCSkill_13.Passive_Beastmaster_DLCSkill_13_C.Beastmaster_DLCSkill13_OnPetSpawned
// 0x0008 (0x0008 - 0x0000)
struct Passive_Beastmaster_DLCSkill_13_C_Beastmaster_DLCSkill13_OnPetSpawned final
{
public:
	class AOakCharacter*                          Pet;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_DLCSkill_13_C_Beastmaster_DLCSkill13_OnPetSpawned) == 0x000008, "Wrong alignment on Passive_Beastmaster_DLCSkill_13_C_Beastmaster_DLCSkill13_OnPetSpawned");
static_assert(sizeof(Passive_Beastmaster_DLCSkill_13_C_Beastmaster_DLCSkill13_OnPetSpawned) == 0x000008, "Wrong size on Passive_Beastmaster_DLCSkill_13_C_Beastmaster_DLCSkill13_OnPetSpawned");
static_assert(offsetof(Passive_Beastmaster_DLCSkill_13_C_Beastmaster_DLCSkill13_OnPetSpawned, Pet) == 0x000000, "Member 'Passive_Beastmaster_DLCSkill_13_C_Beastmaster_DLCSkill13_OnPetSpawned::Pet' has a wrong offset!");

}

