#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Siren_DLCSkill_6

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Passive_Siren_DLCSkill_6.Passive_Siren_DLCSkill_6_C.ExecuteUbergraph_Passive_Siren_DLCSkill_6
// 0x0160 (0x0160 - 0x0000)
struct Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	const class UDamageComponent*                 K2Node_CustomEvent_Damaged;                        // 0x00A8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    K2Node_CustomEvent_Details;                        // 0x00B0(0x0068)(ConstParm)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0118(0x0028)(NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6) == 0x000008, "Wrong alignment on Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6");
static_assert(sizeof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6) == 0x000160, "Wrong size on Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, EntryPoint) == 0x000000, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, Temp_struct_Variable) == 0x000008, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, K2Node_CustomEvent_Damaged) == 0x0000A8, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::K2Node_CustomEvent_Damaged' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, K2Node_CustomEvent_Details) == 0x0000B0, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000118, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, CallFunc_GetObjectClass_ReturnValue) == 0x000140, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, CallFunc_ClassIsChildOf_ReturnValue) == 0x000148, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00014C, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000150, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000154, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000158, "Member 'Passive_Siren_DLCSkill_6_C_ExecuteUbergraph_Passive_Siren_DLCSkill_6::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");

// Function Passive_Siren_DLCSkill_6.Passive_Siren_DLCSkill_6_C.DLCSkill6_OnCausedDeath
// 0x0070 (0x0070 - 0x0000)
struct Passive_Siren_DLCSkill_6_C_DLCSkill6_OnCausedDeath final
{
public:
	const class UDamageComponent*                 Damaged;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDeathDetails                    Details;                                           // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Passive_Siren_DLCSkill_6_C_DLCSkill6_OnCausedDeath) == 0x000008, "Wrong alignment on Passive_Siren_DLCSkill_6_C_DLCSkill6_OnCausedDeath");
static_assert(sizeof(Passive_Siren_DLCSkill_6_C_DLCSkill6_OnCausedDeath) == 0x000070, "Wrong size on Passive_Siren_DLCSkill_6_C_DLCSkill6_OnCausedDeath");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_DLCSkill6_OnCausedDeath, Damaged) == 0x000000, "Member 'Passive_Siren_DLCSkill_6_C_DLCSkill6_OnCausedDeath::Damaged' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_6_C_DLCSkill6_OnCausedDeath, Details) == 0x000008, "Member 'Passive_Siren_DLCSkill_6_C_DLCSkill6_OnCausedDeath::Details' has a wrong offset!");

}

