#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Siren_DLCSkill_15

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"


namespace SDK::Params
{

// Function Passive_Siren_DLCSkill_15.Passive_Siren_DLCSkill_15_C.ExecuteUbergraph_Passive_Siren_DLCSkill_15
// 0x0048 (0x0048 - 0x0000)
struct Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UOakActionAbility* ActionAbility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UOakActionAbility*                      K2Node_CustomEvent_ActionAbility;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0020(0x0028)(NoDestructor)
};
static_assert(alignof(Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15) == 0x000008, "Wrong alignment on Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15");
static_assert(sizeof(Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15) == 0x000048, "Wrong size on Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15");
static_assert(offsetof(Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15, EntryPoint) == 0x000000, "Member 'Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15, K2Node_CustomEvent_ActionAbility) == 0x000018, "Member 'Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15::K2Node_CustomEvent_ActionAbility' has a wrong offset!");
static_assert(offsetof(Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000020, "Member 'Passive_Siren_DLCSkill_15_C_ExecuteUbergraph_Passive_Siren_DLCSkill_15::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");

// Function Passive_Siren_DLCSkill_15.Passive_Siren_DLCSkill_15_C.TriggerAbilityEffect
// 0x0008 (0x0008 - 0x0000)
struct Passive_Siren_DLCSkill_15_C_TriggerAbilityEffect final
{
public:
	class UOakActionAbility*                      ActionAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Siren_DLCSkill_15_C_TriggerAbilityEffect) == 0x000008, "Wrong alignment on Passive_Siren_DLCSkill_15_C_TriggerAbilityEffect");
static_assert(sizeof(Passive_Siren_DLCSkill_15_C_TriggerAbilityEffect) == 0x000008, "Wrong size on Passive_Siren_DLCSkill_15_C_TriggerAbilityEffect");
static_assert(offsetof(Passive_Siren_DLCSkill_15_C_TriggerAbilityEffect, ActionAbility) == 0x000000, "Member 'Passive_Siren_DLCSkill_15_C_TriggerAbilityEffect::ActionAbility' has a wrong offset!");

}

