#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Passive_Beastmaster_Bond10

#include "Basic.hpp"

#include "GbxAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.ExecuteUbergraph_Passive_Beastmaster_Bond10
// 0x0308 (0x0308 - 0x0000)
struct Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0020(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_Event_Spec1;                                // 0x0040(0x0018)(ConstParm, NoDestructor)
	struct FOakAbilityTimerSpec                   K2Node_Event_Spec;                                 // 0x0058(0x0018)(ConstParm, NoDestructor)
	struct FOakAbilityTimerResult                 K2Node_Event_Result;                               // 0x0070(0x000C)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageReceiver;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details)> K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             Temp_struct_Variable1;                             // 0x00A0(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_DetermineTargetClassification_FinalDurationScalar; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveStatusEffectInstance_ReturnValue;   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageInstigator;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_CustomEvent_DamageType;                     // 0x0150(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_CustomEvent_DamageSource;                   // 0x0158(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   K2Node_CustomEvent_Details;                        // 0x0168(0x0060)(ContainsInstancedReference)
	bool                                          CallFunc_TryApplyDominate_ReturnValue;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_TryApplyDominate_ActorToDominate;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue1;              // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAbilityTimerSpec                   K2Node_MakeStruct_OakAbilityTimerSpec;             // 0x01E8(0x0018)(NoDestructor)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsZoomedIn_ReturnValue;                   // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate; // 0x0210(0x0028)(NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0238(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_DetermineTargetClassification_FinalDurationScalar1; // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0258(0x0038)(NoDestructor)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0298(0x0018)(NoDestructor, ContainsInstancedReference)
	class UOakDamageComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamageReceiver, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate1;             // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGbxAbilityResourceSpec_ScriptDelegate K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1; // 0x02C8(0x0028)(NoDestructor)
	class UOakPlayerAbilityManagerComponent*      CallFunc_GetComponentByClass_ReturnValue1;         // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPEventHub_Beastmaster_C*              K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster;      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10) == 0x000308, "Wrong size on Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, EntryPoint) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::EntryPoint' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_GetDataTableValue_OutValue) == 0x000004, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_GetDataTableValue_ReturnValue) == 0x000008, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, Temp_struct_Variable) == 0x000010, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_MakeStruct_DataTableValueHandle) == 0x000020, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000038, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_Event_Spec1) == 0x000040, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_Event_Spec1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_Event_Spec) == 0x000058, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_Event_Spec' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_Event_Result) == 0x000070, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00007C, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CustomEvent_DamageReceiver) == 0x000080, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CustomEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CustomEvent_DamageCauser) == 0x000088, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, Temp_struct_Variable1) == 0x0000A0, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_DetermineTargetClassification_FinalDurationScalar) == 0x000130, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_DetermineTargetClassification_FinalDurationScalar' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_Multiply_IntInt_ReturnValue) == 0x000134, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_RemoveStatusEffectInstance_ReturnValue) == 0x000138, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_RemoveStatusEffectInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CustomEvent_DamageInstigator) == 0x000140, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CustomEvent_DamageInstigator' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CustomEvent_Damage) == 0x000148, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CustomEvent_DamageType) == 0x000150, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CustomEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CustomEvent_DamageSource) == 0x000158, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CustomEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CustomEvent_DamagedActor) == 0x000160, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CustomEvent_Details) == 0x000168, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_TryApplyDominate_ReturnValue) == 0x0001C8, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_TryApplyDominate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_TryApplyDominate_ActorToDominate) == 0x0001D0, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_TryApplyDominate_ActorToDominate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_GetObjectClass_ReturnValue) == 0x0001D8, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_ClassIsChildOf_ReturnValue) == 0x0001E0, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_ClassIsChildOf_ReturnValue1) == 0x0001E1, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_ClassIsChildOf_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_BooleanAND_ReturnValue) == 0x0001E2, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_MakeStruct_OakAbilityTimerSpec) == 0x0001E8, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_MakeStruct_OakAbilityTimerSpec' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_GetWeapon_ReturnValue) == 0x000200, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_IsZoomedIn_ReturnValue) == 0x000208, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_IsZoomedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_BooleanAND_ReturnValue1) == 0x000209, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_BooleanOR_ReturnValue) == 0x00020A, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate) == 0x000210, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000238, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000244, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_IsValid_ReturnValue) == 0x000248, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_DetermineTargetClassification_FinalDurationScalar1) == 0x00024C, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_DetermineTargetClassification_FinalDurationScalar1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000250, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000254, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_MakeStruct_StatusEffectSpec) == 0x000258, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_MakeStruct_StatusEffectSpec' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_K2Play_ReturnValue) == 0x000290, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_K2Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_AddStatusEffect_ReturnValue) == 0x000298, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_AddStatusEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_GetComponentByClass_ReturnValue) == 0x0002B0, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_CreateDelegate_OutputDelegate1) == 0x0002B8, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1) == 0x0002C8, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_MakeStruct_GbxAbilityResourceSpec_ScriptDelegate1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, CallFunc_GetComponentByClass_ReturnValue1) == 0x0002F0, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster) == 0x0002F8, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_DynamicCast_AsBPEvent_Hub_Beastmaster' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10, K2Node_DynamicCast_bSuccess) == 0x000300, "Member 'Passive_Beastmaster_Bond10_C_ExecuteUbergraph_Passive_Beastmaster_Bond10::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.OnCausedDamage_HitAndRun9
// 0x0088 (0x0088 - 0x0000)
struct Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9 final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0028(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9) == 0x000088, "Wrong size on Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9, DamageInstigator) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9::DamageInstigator' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9, Damage) == 0x000008, "Member 'Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9::Damage' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9, DamageType) == 0x000010, "Member 'Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9::DamageType' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9, DamageSource) == 0x000018, "Member 'Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9::DamageSource' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9, DamagedActor) == 0x000020, "Member 'Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9::DamagedActor' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9, Details) == 0x000028, "Member 'Passive_Beastmaster_Bond10_C_OnCausedDamage_HitAndRun9::Details' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.OnDeath_DominateTarget_HitRun9
// 0x0010 (0x0010 - 0x0000)
struct Passive_Beastmaster_Bond10_C_OnDeath_DominateTarget_HitRun9 final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_OnDeath_DominateTarget_HitRun9) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_OnDeath_DominateTarget_HitRun9");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_OnDeath_DominateTarget_HitRun9) == 0x000010, "Wrong size on Passive_Beastmaster_Bond10_C_OnDeath_DominateTarget_HitRun9");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnDeath_DominateTarget_HitRun9, DamageReceiver) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_OnDeath_DominateTarget_HitRun9::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnDeath_DominateTarget_HitRun9, DamageCauser) == 0x000008, "Member 'Passive_Beastmaster_Bond10_C_OnDeath_DominateTarget_HitRun9::DamageCauser' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.OnAbilityTimerEnded
// 0x0028 (0x0028 - 0x0000)
struct Passive_Beastmaster_Bond10_C_OnAbilityTimerEnded final
{
public:
	struct FOakAbilityTimerSpec                   Spec;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FOakAbilityTimerResult                 Result;                                            // 0x0018(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_OnAbilityTimerEnded) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_OnAbilityTimerEnded");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_OnAbilityTimerEnded) == 0x000028, "Wrong size on Passive_Beastmaster_Bond10_C_OnAbilityTimerEnded");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnAbilityTimerEnded, Spec) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_OnAbilityTimerEnded::Spec' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnAbilityTimerEnded, Result) == 0x000018, "Member 'Passive_Beastmaster_Bond10_C_OnAbilityTimerEnded::Result' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.OnAbilityTimerStarted
// 0x0018 (0x0018 - 0x0000)
struct Passive_Beastmaster_Bond10_C_OnAbilityTimerStarted final
{
public:
	struct FOakAbilityTimerSpec                   Spec;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_OnAbilityTimerStarted) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_OnAbilityTimerStarted");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_OnAbilityTimerStarted) == 0x000018, "Wrong size on Passive_Beastmaster_Bond10_C_OnAbilityTimerStarted");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnAbilityTimerStarted, Spec) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_OnAbilityTimerStarted::Spec' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.DoHealthPercentDamage
// 0x00B8 (0x00B8 - 0x0000)
struct Passive_Beastmaster_Bond10_C_DoHealthPercentDamage final
{
public:
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0000(0x0018)(NoDestructor)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0018(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_DoHealthPercentDamage) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_DoHealthPercentDamage");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_DoHealthPercentDamage) == 0x0000B8, "Wrong size on Passive_Beastmaster_Bond10_C_DoHealthPercentDamage");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DoHealthPercentDamage, K2Node_MakeStruct_DataTableValueHandle) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_DoHealthPercentDamage::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DoHealthPercentDamage, Temp_struct_Variable) == 0x000018, "Member 'Passive_Beastmaster_Bond10_C_DoHealthPercentDamage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DoHealthPercentDamage, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x0000A8, "Member 'Passive_Beastmaster_Bond10_C_DoHealthPercentDamage::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DoHealthPercentDamage, CallFunc_GetValueOfAttribute_ReturnValue) == 0x0000AC, "Member 'Passive_Beastmaster_Bond10_C_DoHealthPercentDamage::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DoHealthPercentDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'Passive_Beastmaster_Bond10_C_DoHealthPercentDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.HandleDominateTimerFinished
// 0x0020 (0x0020 - 0x0000)
struct Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished final
{
public:
	class UObject*                                InSpecTimer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakAbilityTimerResult                        InResult;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                NewInSpecTimer;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakAbilityTimerResult                        NewInResult;                                       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished) == 0x000020, "Wrong size on Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished, InSpecTimer) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished::InSpecTimer' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished, InResult) == 0x000008, "Member 'Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished::InResult' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished, NewInSpecTimer) == 0x000010, "Member 'Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished::NewInSpecTimer' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished, NewInResult) == 0x000018, "Member 'Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished::NewInResult' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001A, "Member 'Passive_Beastmaster_Bond10_C_HandleDominateTimerFinished::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.AddDominateTargetToList
// 0x0010 (0x0010 - 0x0000)
struct Passive_Beastmaster_Bond10_C_AddDominateTargetToList final
{
public:
	class AActor*                                 NewTarget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_AddDominateTargetToList) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_AddDominateTargetToList");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_AddDominateTargetToList) == 0x000010, "Wrong size on Passive_Beastmaster_Bond10_C_AddDominateTargetToList");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_AddDominateTargetToList, NewTarget) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_AddDominateTargetToList::NewTarget' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_AddDominateTargetToList, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'Passive_Beastmaster_Bond10_C_AddDominateTargetToList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.TryApplyDominate
// 0x0070 (0x0070 - 0x0000)
struct Passive_Beastmaster_Bond10_C_TryApplyDominate final
{
public:
	const class UDamageSource*                    DamageSource;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Instigator;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ActorToDominate_0;                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageSource*                          NewDmgSource;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                NewInstigator;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 NewHitTarget;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Compare_Damage_Source_Equal;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Compare_Damage_Source_Not_Equal;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_TryApplyDominate) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_TryApplyDominate");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_TryApplyDominate) == 0x000070, "Wrong size on Passive_Beastmaster_Bond10_C_TryApplyDominate");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, DamageSource) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::DamageSource' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, Instigator) == 0x000008, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::Instigator' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, Target) == 0x000010, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::Target' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, ReturnValue) == 0x000018, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, ActorToDominate_0) == 0x000020, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::ActorToDominate_0' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, NewDmgSource) == 0x000028, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::NewDmgSource' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, NewInstigator) == 0x000030, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::NewInstigator' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, NewHitTarget) == 0x000038, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::NewHitTarget' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000044, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_Compare_Damage_Source_Equal) == 0x000048, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_Compare_Damage_Source_Equal' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_Compare_Damage_Source_Not_Equal) == 0x000049, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_Compare_Damage_Source_Not_Equal' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00004A, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_Not_PreBool_ReturnValue) == 0x00004B, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000050, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_Array_Contains_ReturnValue) == 0x000061, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000062, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000063, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, Temp_bool_Variable) == 0x000064, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_Not_PreBool_ReturnValue1) == 0x000065, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_BooleanAND_ReturnValue) == 0x000066, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_BooleanAND_ReturnValue1) == 0x000067, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_TryApplyDominate, CallFunc_BooleanAND_ReturnValue2) == 0x000068, "Member 'Passive_Beastmaster_Bond10_C_TryApplyDominate::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.RemoveDominateTargetFromList
// 0x0010 (0x0010 - 0x0000)
struct Passive_Beastmaster_Bond10_C_RemoveDominateTargetFromList final
{
public:
	class AActor*                                 NewTarget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_RemoveDominateTargetFromList) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_RemoveDominateTargetFromList");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_RemoveDominateTargetFromList) == 0x000010, "Wrong size on Passive_Beastmaster_Bond10_C_RemoveDominateTargetFromList");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_RemoveDominateTargetFromList, NewTarget) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_RemoveDominateTargetFromList::NewTarget' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_RemoveDominateTargetFromList, CallFunc_Array_RemoveItem_ReturnValue) == 0x000008, "Member 'Passive_Beastmaster_Bond10_C_RemoveDominateTargetFromList::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.DetermineTargetClassification
// 0x0038 (0x0038 - 0x0000)
struct Passive_Beastmaster_Bond10_C_DetermineTargetClassification final
{
public:
	int32                                         FinalDurationScalar;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_DetermineTargetClassification");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification) == 0x000038, "Wrong size on Passive_Beastmaster_Bond10_C_DetermineTargetClassification");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification, FinalDurationScalar) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_DetermineTargetClassification::FinalDurationScalar' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification, Temp_bool_Variable) == 0x000004, "Member 'Passive_Beastmaster_Bond10_C_DetermineTargetClassification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification, Temp_int_Variable) == 0x000008, "Member 'Passive_Beastmaster_Bond10_C_DetermineTargetClassification::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification, Temp_int_Variable1) == 0x00000C, "Member 'Passive_Beastmaster_Bond10_C_DetermineTargetClassification::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification, Temp_bool_Variable1) == 0x000010, "Member 'Passive_Beastmaster_Bond10_C_DetermineTargetClassification::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000018, "Member 'Passive_Beastmaster_Bond10_C_DetermineTargetClassification::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Passive_Beastmaster_Bond10_C_DetermineTargetClassification::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification, K2Node_Select_Default) == 0x00002C, "Member 'Passive_Beastmaster_Bond10_C_DetermineTargetClassification::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_DetermineTargetClassification, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000030, "Member 'Passive_Beastmaster_Bond10_C_DetermineTargetClassification::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function Passive_Beastmaster_Bond10.Passive_Beastmaster_Bond10_C.OnRep_DominateTarget
// 0x0088 (0x0088 - 0x0000)
struct Passive_Beastmaster_Bond10_C_OnRep_DominateTarget final
{
public:
	int32                                         CallFunc_DetermineTargetClassification_FinalDurationScalar; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTeamComponent*                         CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0018(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectSpec                      K2Node_MakeStruct_StatusEffectSpec;                // 0x0038(0x0038)(NoDestructor)
	struct FStatusEffectInstanceReference         CallFunc_AddStatusEffect_ReturnValue;              // 0x0070(0x0018)(NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Passive_Beastmaster_Bond10_C_OnRep_DominateTarget) == 0x000008, "Wrong alignment on Passive_Beastmaster_Bond10_C_OnRep_DominateTarget");
static_assert(sizeof(Passive_Beastmaster_Bond10_C_OnRep_DominateTarget) == 0x000088, "Wrong size on Passive_Beastmaster_Bond10_C_OnRep_DominateTarget");
static_assert(offsetof(Passive_Beastmaster_Bond10_C_OnRep_DominateTarget, CallFunc_DetermineTargetClassification_FinalDurationScalar) == 0x000000, "Member 'Passive_Beastmaster_Bond10_C_OnRep_DominateTarget::CallFunc_DetermineTargetClassification_FinalDurationScalar' has a wrong offset!");
