#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_OakClothActor

#include "Basic.hpp"

#include "Struct_MasterMaterial_BaseParams_Layer4_structs.hpp"
#include "Struct_MasterMaterial_BaseParams_Layer2_structs.hpp"
#include "GbxAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_MasterMaterial_BaseParams_Layer3_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_MasterMaterial_Colorize_structs.hpp"
#include "Struct_ColorScheme_structs.hpp"
#include "Struct_MasterMaterial_BaseParams_structs.hpp"


namespace SDK::Params
{

// Function PC_OakClothActor.PC_OakClothActor_C.Set Per Element Layer 4 Base Material Parameters
// 0x0100 (0x0100 - 0x0000)
struct PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters final
{
public:
	class UMaterialInstanceDynamic*               Material_Instance_Dynamic;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Array_index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Default_Material_In;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynamic_Material_Instance;                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Array_Index_Out;                                   // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Default_Material_Out;                              // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Material_ID;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Default_Material;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynamic_Material;                                  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue1;  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_MasterMaterial_BaseParams_Layer4 CallFunc_Array_Get_Item;                           // 0x0050(0x0044)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue1;       // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue3;       // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue1;    // 0x00A8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue1;     // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue2;    // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue2;     // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue2;  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue3;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x00D0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue1;  // 0x00E0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue2;  // 0x00F0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters) == 0x000008, "Wrong alignment on PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters");
static_assert(sizeof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters) == 0x000100, "Wrong size on PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, Material_Instance_Dynamic) == 0x000000, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::Material_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, Array_index) == 0x000008, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::Array_index' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, Default_Material_In) == 0x000010, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::Default_Material_In' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, Dynamic_Material_Instance) == 0x000018, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::Dynamic_Material_Instance' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, Array_Index_Out) == 0x000020, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::Array_Index_Out' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, Default_Material_Out) == 0x000028, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::Default_Material_Out' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, Material_ID) == 0x000030, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::Material_ID' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, Default_Material) == 0x000038, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::Default_Material' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, Dynamic_Material) == 0x000040, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::Dynamic_Material' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000048, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue1) == 0x00004C, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_Array_Get_Item) == 0x000050, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000094, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue1) == 0x000095, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x000096, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue3) == 0x000097, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000098, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0000A4, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_Conv_LinearColorToVector_ReturnValue1) == 0x0000A8, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_Conv_LinearColorToVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue1) == 0x0000B4, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, K2Node_SwitchEnum_CmpSuccess) == 0x0000B5, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_Conv_LinearColorToVector_ReturnValue2) == 0x0000B8, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_Conv_LinearColorToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, K2Node_SwitchEnum1_CmpSuccess) == 0x0000C4, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue2) == 0x0000C5, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue2) == 0x0000C8, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue3) == 0x0000CC, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x0000D0, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_K2_GetVectorParameterValue_ReturnValue1) == 0x0000E0, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_K2_GetVectorParameterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters, CallFunc_K2_GetVectorParameterValue_ReturnValue2) == 0x0000F0, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_4_Base_Material_Parameters::CallFunc_K2_GetVectorParameterValue_ReturnValue2' has a wrong offset!");

// Function PC_OakClothActor.PC_OakClothActor_C.Set Per Element Layer 3 Base Material Parameters
// 0x0100 (0x0100 - 0x0000)
struct PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters final
{
public:
	class UMaterialInstanceDynamic*               Material_Instance_Dynamic;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Array_index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Default_Material_In;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynamic_Material_Instance;                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Array_Index_Out;                                   // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Default_Material_Out;                              // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Material_ID;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Dynamic_Material;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Default_Material;                                  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue1;  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue2;  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue3;  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0058(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue1;  // 0x0068(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue2;  // 0x0078(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_MasterMaterial_BaseParams_Layer3 CallFunc_Array_Get_Item;                           // 0x0088(0x0044)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue1;       // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue3;       // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue1;    // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue1;     // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue2;    // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue2;     // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters) == 0x000008, "Wrong alignment on PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters");
static_assert(sizeof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters) == 0x000100, "Wrong size on PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, Material_Instance_Dynamic) == 0x000000, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::Material_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, Array_index) == 0x000008, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::Array_index' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, Default_Material_In) == 0x000010, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::Default_Material_In' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, Dynamic_Material_Instance) == 0x000018, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::Dynamic_Material_Instance' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, Array_Index_Out) == 0x000020, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::Array_Index_Out' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, Default_Material_Out) == 0x000028, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::Default_Material_Out' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, Material_ID) == 0x000030, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::Material_ID' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, Dynamic_Material) == 0x000038, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::Dynamic_Material' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, Default_Material) == 0x000040, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::Default_Material' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000048, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue1) == 0x00004C, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue2) == 0x000050, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue3) == 0x000054, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000058, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_K2_GetVectorParameterValue_ReturnValue1) == 0x000068, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_K2_GetVectorParameterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_K2_GetVectorParameterValue_ReturnValue2) == 0x000078, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_K2_GetVectorParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_Array_Get_Item) == 0x000088, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, K2Node_SwitchEnum_CmpSuccess) == 0x0000CC, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000CD, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue1) == 0x0000CE, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x0000CF, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000D0, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue3) == 0x0000DC, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0000DD, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, K2Node_SwitchEnum1_CmpSuccess) == 0x0000DE, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_Conv_LinearColorToVector_ReturnValue1) == 0x0000E0, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_Conv_LinearColorToVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue1) == 0x0000EC, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_Conv_LinearColorToVector_ReturnValue2) == 0x0000F0, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_Conv_LinearColorToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue2) == 0x0000FC, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_3_Base_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue2' has a wrong offset!");

// Function PC_OakClothActor.PC_OakClothActor_C.Set Per Element Layer 2 Base Material Parameters
// 0x0100 (0x0100 - 0x0000)
struct PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters final
{
public:
	class UMaterialInstanceDynamic*               Material_Instance_Dynamic;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Array_index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Default_Material_In;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynamic_Material_Instance;                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Array_Index_Out;                                   // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Default_Material_Out;                              // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Default_Material;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Material_ID;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Dynamic_Material;                                  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue1;  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue2;  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue3;  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0058(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue1;  // 0x0068(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue2;  // 0x0078(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_MasterMaterial_BaseParams_Layer2 CallFunc_Array_Get_Item;                           // 0x0088(0x0044)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue1;       // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue3;       // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x00D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue1;    // 0x00DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue1;     // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue2;    // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue2;     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters) == 0x000008, "Wrong alignment on PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters");
static_assert(sizeof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters) == 0x000100, "Wrong size on PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, Material_Instance_Dynamic) == 0x000000, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::Material_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, Array_index) == 0x000008, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::Array_index' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, Default_Material_In) == 0x000010, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::Default_Material_In' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, Dynamic_Material_Instance) == 0x000018, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::Dynamic_Material_Instance' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, Array_Index_Out) == 0x000020, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::Array_Index_Out' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, Default_Material_Out) == 0x000028, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::Default_Material_Out' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, Default_Material) == 0x000030, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::Default_Material' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, Material_ID) == 0x000038, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::Material_ID' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, Dynamic_Material) == 0x000040, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::Dynamic_Material' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000048, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue1) == 0x00004C, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue2) == 0x000050, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_K2_GetScalarParameterValue_ReturnValue3) == 0x000054, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_K2_GetScalarParameterValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000058, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_K2_GetVectorParameterValue_ReturnValue1) == 0x000068, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_K2_GetVectorParameterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_K2_GetVectorParameterValue_ReturnValue2) == 0x000078, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_K2_GetVectorParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_Array_Get_Item) == 0x000088, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000CC, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue1) == 0x0000CD, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x0000CE, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_EqualEqual_FloatFloat_ReturnValue3) == 0x0000CF, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_EqualEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x0000D0, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_Conv_LinearColorToVector_ReturnValue1) == 0x0000DC, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_Conv_LinearColorToVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0000E8, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue1) == 0x0000E9, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, K2Node_SwitchEnum_CmpSuccess) == 0x0000EA, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_Conv_LinearColorToVector_ReturnValue2) == 0x0000EC, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_Conv_LinearColorToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, CallFunc_EqualEqual_VectorVector_ReturnValue2) == 0x0000F8, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::CallFunc_EqualEqual_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters, K2Node_SwitchEnum1_CmpSuccess) == 0x0000F9, "Member 'PC_OakClothActor_C_Set_Per_Element_Layer_2_Base_Material_Parameters::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");

// Function PC_OakClothActor.PC_OakClothActor_C.Set Randomized Colorization
// 0x0908 (0x0908 - 0x0000)
struct PC_OakClothActor_C_Set_Randomized_Colorization final
{
public:
	class UMaterialInstanceDynamic*               Material_Instance_Dynamic;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaterialID;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Default_Material;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Material_Instance_Dynamic_Out;                     // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Material_ID_Out;                                   // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Default_Material_Out;                              // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Random_Int_3;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Random_Int_2;                                      // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Random_Int_1;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random_Float_3;                                    // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random_Float_2;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Random_Float_1;                                    // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colorize_Tertiary_Color2;                          // 0x0048(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colorize_Tertiary_Color1;                          // 0x0058(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colorize_Secondary_Color2;                         // 0x0068(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colorize_Secondary_Color1;                         // 0x0078(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colorize_Primary_Color2;                           // 0x0088(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colorize_Primary_Color1;                           // 0x0098(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Material_ID;                                       // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DefaultMaterial;                                   // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue1;                      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue3;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue4;                      // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue5;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0108(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R1;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G1;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B1;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A1;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R2;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G2;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B2;                            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A2;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue1;    // 0x0134(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue2;    // 0x0140(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R3;                            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G3;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B3;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A3;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R4;                            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G4;                            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B4;                            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A4;                            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue3;    // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue4;    // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R5;                            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G5;                            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B5;                            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A5;                            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue1;             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue2;             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue6;                      // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue3;             // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue4;             // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue5;             // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x01B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
