#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PD_Bottle_Beer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PD_Bottle_Beer.PD_Bottle_Beer_C.ExecuteUbergraph_PD_Bottle_Beer
// 0x001C (0x001C - 0x0000)
struct PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_HitPoint;               // 0x0004(0x000C)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_HitDirection;           // 0x0010(0x000C)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer) == 0x000004, "Wrong alignment on PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer");
static_assert(sizeof(PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer) == 0x00001C, "Wrong size on PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer");
static_assert(offsetof(PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer, EntryPoint) == 0x000000, "Member 'PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer::EntryPoint' has a wrong offset!");
static_assert(offsetof(PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer, K2Node_ComponentBoundEvent_HitPoint) == 0x000004, "Member 'PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer::K2Node_ComponentBoundEvent_HitPoint' has a wrong offset!");
static_assert(offsetof(PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer, K2Node_ComponentBoundEvent_HitDirection) == 0x000010, "Member 'PD_Bottle_Beer_C_ExecuteUbergraph_PD_Bottle_Beer::K2Node_ComponentBoundEvent_HitDirection' has a wrong offset!");

// Function PD_Bottle_Beer.PD_Bottle_Beer_C.BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer
// 0x0018 (0x0018 - 0x0000)
struct PD_Bottle_Beer_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer final
{
public:
	struct FVector                                HitPoint;                                          // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitDirection;                                      // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PD_Bottle_Beer_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer) == 0x000004, "Wrong alignment on PD_Bottle_Beer_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer");
static_assert(sizeof(PD_Bottle_Beer_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer) == 0x000018, "Wrong size on PD_Bottle_Beer_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer");
static_assert(offsetof(PD_Bottle_Beer_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer, HitPoint) == 0x000000, "Member 'PD_Bottle_Beer_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer::HitPoint' has a wrong offset!");
static_assert(offsetof(PD_Bottle_Beer_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer, HitDirection) == 0x00000C, "Member 'PD_Bottle_Beer_C_BndEvt__DestructibleComponent_K2Node_ComponentBoundEvent_5_ComponentFractureSignature__DelegateSignature_PD_Bottle_Beer::HitDirection' has a wrong offset!");

}

