#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PD_Rock_Formation_Pile_Eridian_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DestructibleGameplayAndNetworkRelevant_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PD_Rock_Formation_Pile_Eridian_Parent.PD_Rock_Formation_Pile_Eridian_Parent_C
// 0x0080 (0x05C0 - 0x0540)
class APD_Rock_Formation_Pile_Eridian_Parent_C : public ABP_DestructibleGameplayAndNetworkRelevant_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PD_Rock_Formation_Pile_Eridian_Parent_C; // 0x0540(0x0008)(Transient, DuplicateTransient)
	class UOakLootableComponent*                  OakLootable;                                       // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USocketComponent*                       MeleeSocket;                                       // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTargetableComponent*                   Targetable;                                        // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameplayTagContainerComponent*         GameplayTagContainer;                              // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUsableComponent*                       Usable;                                            // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USocketComponent*                       LootSocket;                                        // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakDamageComponent*                    OakDamage;                                         // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Dissolve_DissolvePercent_B3805AAF4C24033A40688289FBDA7116; // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Dissolve__Direction_B3805AAF4C24033A40688289FBDA7116; // 0x0584(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_585[0x3];                                      // 0x0585(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Dissolve;                                          // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResonatorHit_Max;                                  // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResonatorHit_Count;                                // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       EridianPile_dMaterialInst;                         // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   CrystalDestroyed;                                  // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UItemPoolListInterface*                 EridiumLoot;                                       // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CrystalDestroyed__DelegateSignature();
	void ExecuteUbergraph_PD_Rock_Formation_Pile_Eridian_Parent(int32 EntryPoint);
	void FractureCrystal(class UDestructibleComponent* Crystal);
	void DestroyCrystal();
	void ReceiveBeginPlay();
	void Damaged(const struct FVector& HitLocation, const struct FVector& ImpulseDir, class AController* Controller);
	void BndEvt__OakDamage_K2Node_ComponentBoundEvent_4_TakeAnyPipelineDamageDelegate__DelegateSignature_PD_Rock_Formation_Pile_Eridian(class UDamageComponent* DamageReceiver, float Damage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, const struct FReceivedDamageDetails& Details);
	void Dissolve__FinishedFunc();
	void Dissolve__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PD_Rock_Formation_Pile_Eridian_Parent_C">();
	}
	static class APD_Rock_Formation_Pile_Eridian_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APD_Rock_Formation_Pile_Eridian_Parent_C>();
	}
};
static_assert(alignof(APD_Rock_Formation_Pile_Eridian_Parent_C) == 0x000008, "Wrong alignment on APD_Rock_Formation_Pile_Eridian_Parent_C");
static_assert(sizeof(APD_Rock_Formation_Pile_Eridian_Parent_C) == 0x0005C0, "Wrong size on APD_Rock_Formation_Pile_Eridian_Parent_C");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, UberGraphFrame_PD_Rock_Formation_Pile_Eridian_Parent_C) == 0x000540, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::UberGraphFrame_PD_Rock_Formation_Pile_Eridian_Parent_C' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, OakLootable) == 0x000548, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::OakLootable' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, MeleeSocket) == 0x000550, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::MeleeSocket' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, Targetable) == 0x000558, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::Targetable' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, GameplayTagContainer) == 0x000560, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::GameplayTagContainer' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, Usable) == 0x000568, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::Usable' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, LootSocket) == 0x000570, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::LootSocket' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, OakDamage) == 0x000578, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::OakDamage' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, Dissolve_DissolvePercent_B3805AAF4C24033A40688289FBDA7116) == 0x000580, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::Dissolve_DissolvePercent_B3805AAF4C24033A40688289FBDA7116' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, Dissolve__Direction_B3805AAF4C24033A40688289FBDA7116) == 0x000584, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::Dissolve__Direction_B3805AAF4C24033A40688289FBDA7116' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, Dissolve) == 0x000588, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::Dissolve' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, ResonatorHit_Max) == 0x000590, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::ResonatorHit_Max' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, ResonatorHit_Count) == 0x000594, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::ResonatorHit_Count' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, EridianPile_dMaterialInst) == 0x000598, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::EridianPile_dMaterialInst' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, CrystalDestroyed) == 0x0005A8, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::CrystalDestroyed' has a wrong offset!");
static_assert(offsetof(APD_Rock_Formation_Pile_Eridian_Parent_C, EridiumLoot) == 0x0005B8, "Member 'APD_Rock_Formation_Pile_Eridian_Parent_C::EridiumLoot' has a wrong offset!");

}

