#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Siren_DLCSkill_WalkingPotato_Attack_7

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Proj_Siren_DLCSkill_WalkingPotato_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_Siren_DLCSkill_WalkingPotato_Attack_7.Proj_Siren_DLCSkill_WalkingPotato_Attack_7_C
// 0x0018 (0x09E0 - 0x09C8)
class AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C final : public AProj_Siren_DLCSkill_WalkingPotato_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Proj_Siren_DLCSkill_WalkingPotato_Attack_7_C; // 0x09C8(0x0008)(Transient, DuplicateTransient)
	int32                                         MiniShots;                                         // 0x09D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D4[0x4];                                      // 0x09D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 MiniShotTarget;                                    // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_Siren_DLCSkill_WalkingPotato_Attack_7(int32 EntryPoint);
	void StartFiringShots();
	void FireShotAtEnemy();
	void SirenDLCActionSkill_OnCausedAnyDamage(class AActor* DamageInstigator, float Damage, const class UGbxDamageType* DamageType, const class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_Siren_DLCSkill_WalkingPotato_Attack_7_C">();
	}
	static class AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C>();
	}
};
static_assert(alignof(AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C) == 0x000008, "Wrong alignment on AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C");
static_assert(sizeof(AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C) == 0x0009E0, "Wrong size on AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C");
static_assert(offsetof(AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C, UberGraphFrame_Proj_Siren_DLCSkill_WalkingPotato_Attack_7_C) == 0x0009C8, "Member 'AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C::UberGraphFrame_Proj_Siren_DLCSkill_WalkingPotato_Attack_7_C' has a wrong offset!");
static_assert(offsetof(AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C, MiniShots) == 0x0009D0, "Member 'AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C::MiniShots' has a wrong offset!");
static_assert(offsetof(AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C, MiniShotTarget) == 0x0009D8, "Member 'AProj_Siren_DLCSkill_WalkingPotato_Attack_7_C::MiniShotTarget' has a wrong offset!");

}

