#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Weapon_TOR_PS_Troy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxWeapon_structs.hpp"


namespace SDK::Params
{

// Function Proj_Weapon_TOR_PS_Troy.Proj_Weapon_TOR_PS_Troy_C.ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy
// 0x0230 (0x0230 - 0x0000)
struct Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_StaticGetParticleEffect_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnCone_ReturnValue;         // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00B0(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue1;            // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x00D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x00F0(0x0140)(ContainsInstancedReference)
};
static_assert(alignof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy) == 0x000010, "Wrong alignment on Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy");
static_assert(sizeof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy) == 0x000230, "Wrong size on Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, EntryPoint) == 0x000000, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, Temp_bool_Variable) == 0x000008, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue) == 0x00000C, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_StaticGetParticleEffect_ReturnValue) == 0x000010, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_StaticGetParticleEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_GetForwardVector_ReturnValue) == 0x000018, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000024, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_RandomFloatInRange_ReturnValue) == 0x000038, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_RandomFloatInRange_ReturnValue1) == 0x00003C, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_RandomFloatInRange_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000040, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00004C, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_GeneratePointsOnCone_ReturnValue) == 0x000058, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_GeneratePointsOnCone_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Array_Get_Item) == 0x000070, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_BreakTransform_Location) == 0x0000A4, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_BreakTransform_Rotation) == 0x0000B0, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_BreakTransform_Scale) == 0x0000BC, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_GetForwardVector_ReturnValue1) == 0x0000C8, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_GetForwardVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x0000D4, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E0, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy, K2Node_MakeStruct_LightProjectileInitializationData) == 0x0000F0, "Member 'Proj_Weapon_TOR_PS_Troy_C_ExecuteUbergraph_Proj_Weapon_TOR_PS_Troy::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");

}

