#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Weapon_MAL_KybsWorth

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Proj_Weapon_BaseProjectile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_Weapon_MAL_KybsWorth.Proj_Weapon_MAL_KybsWorth_C
// 0x0030 (0x07C0 - 0x0790)
class AProj_Weapon_MAL_KybsWorth_C final : public AProj_Weapon_BaseProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Proj_Weapon_MAL_KybsWorth_C;        // 0x0790(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_MAL_KybsWorth_HealAura;                         // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               TracerTrailFX;                                     // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         AttachedTargets;                                   // 0x07A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         Dot_DamageScale;                                   // 0x07B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_Weapon_MAL_KybsWorth(int32 EntryPoint);
	void ReceiveDestroyed();
	void OnExplode();
	void WeaponProjectileExplode();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnHitWorld(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_Weapon_MAL_KybsWorth_C">();
	}
	static class AProj_Weapon_MAL_KybsWorth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_Weapon_MAL_KybsWorth_C>();
	}
};
static_assert(alignof(AProj_Weapon_MAL_KybsWorth_C) == 0x000008, "Wrong alignment on AProj_Weapon_MAL_KybsWorth_C");
static_assert(sizeof(AProj_Weapon_MAL_KybsWorth_C) == 0x0007C0, "Wrong size on AProj_Weapon_MAL_KybsWorth_C");
static_assert(offsetof(AProj_Weapon_MAL_KybsWorth_C, UberGraphFrame_Proj_Weapon_MAL_KybsWorth_C) == 0x000790, "Member 'AProj_Weapon_MAL_KybsWorth_C::UberGraphFrame_Proj_Weapon_MAL_KybsWorth_C' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_MAL_KybsWorth_C, PS_MAL_KybsWorth_HealAura) == 0x000798, "Member 'AProj_Weapon_MAL_KybsWorth_C::PS_MAL_KybsWorth_HealAura' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_MAL_KybsWorth_C, TracerTrailFX) == 0x0007A0, "Member 'AProj_Weapon_MAL_KybsWorth_C::TracerTrailFX' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_MAL_KybsWorth_C, AttachedTargets) == 0x0007A8, "Member 'AProj_Weapon_MAL_KybsWorth_C::AttachedTargets' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_MAL_KybsWorth_C, Dot_DamageScale) == 0x0007B8, "Member 'AProj_Weapon_MAL_KybsWorth_C::Dot_DamageScale' has a wrong offset!");

}

