#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_ServiceBot_LeftArm

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_ServiceBot_LeftArm.Proj_ServiceBot_LeftArm_C
// 0x0018 (0x06F8 - 0x06E0)
class AProj_ServiceBot_LeftArm_C : public AOakAIBalancedProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E0(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PartMesh;                                          // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxProjectileMovementComponent*        GbxProjectileMovement;                             // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_ServiceBot_LeftArm(int32 EntryPoint);
	void BndEvt__PartMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature_Proj_ServiceBot_LeftArm(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_ServiceBot_LeftArm_C">();
	}
	static class AProj_ServiceBot_LeftArm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_ServiceBot_LeftArm_C>();
	}
};
static_assert(alignof(AProj_ServiceBot_LeftArm_C) == 0x000008, "Wrong alignment on AProj_ServiceBot_LeftArm_C");
static_assert(sizeof(AProj_ServiceBot_LeftArm_C) == 0x0006F8, "Wrong size on AProj_ServiceBot_LeftArm_C");
static_assert(offsetof(AProj_ServiceBot_LeftArm_C, UberGraphFrame) == 0x0006E0, "Member 'AProj_ServiceBot_LeftArm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProj_ServiceBot_LeftArm_C, PartMesh) == 0x0006E8, "Member 'AProj_ServiceBot_LeftArm_C::PartMesh' has a wrong offset!");
static_assert(offsetof(AProj_ServiceBot_LeftArm_C, GbxProjectileMovement) == 0x0006F0, "Member 'AProj_ServiceBot_LeftArm_C::GbxProjectileMovement' has a wrong offset!");

}

