#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_MAL_SM_DNA

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxWeapon_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Proj_MAL_SM_DNA.Proj_MAL_SM_DNA_C.ExecuteUbergraph_Proj_MAL_SM_DNA
// 0x03A0 (0x03A0 - 0x0000)
struct Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable1;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable2;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable3;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        K2Node_Select1_Default;                            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00A4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00C8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x017C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment;             // 0x0188(0x0028)(NoDestructor, ContainsInstancedReference)
	struct FLightBeamAttachment                   K2Node_MakeStruct_LightBeamAttachment1;            // 0x01B0(0x0028)(NoDestructor, ContainsInstancedReference)
	struct FDamageGoreModifiers                   K2Node_MakeStruct_DamageGoreModifiers;             // 0x01D8(0x0008)(NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakLightBeamInitializationData        K2Node_MakeStruct_OakLightBeamInitializationData;  // 0x01E8(0x0138)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_323[0x1];                                      // 0x0323(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnFan_ReturnValue;          // 0x0328(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AProj_MAL_SM_DNA_Split_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_Select3_Default;                            // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        K2Node_Select4_Default;                            // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA) == 0x000010, "Wrong alignment on Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA");
static_assert(sizeof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA) == 0x0003A0, "Wrong size on Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, EntryPoint) == 0x000000, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_int_Variable) == 0x000004, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_float_Variable) == 0x000008, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_float_Variable1) == 0x00000C, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_float_Variable2) == 0x000010, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_float_Variable3) == 0x000014, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_int_Variable1) == 0x000018, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_object_Variable) == 0x000020, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_object_Variable1) == 0x000028, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_object_Variable2) == 0x000030, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_object_Variable3) == 0x000038, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_int_Variable2) == 0x000040, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_class_Variable) == 0x000048, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_class_Variable1) == 0x000050, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_class_Variable2) == 0x000058, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_class_Variable3) == 0x000060, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_int_Variable3) == 0x000068, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_int_Variable4) == 0x00006C, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Select_Default) == 0x000070, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Select1_Default) == 0x000078, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_int_Array_Index_Variable) == 0x000080, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Event_MyComp) == 0x000088, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Event_Other) == 0x000090, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Event_OtherComp) == 0x000098, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Event_bSelfMoved) == 0x0000A0, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Event_HitLocation) == 0x0000A4, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Event_HitNormal) == 0x0000B0, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Event_NormalImpulse) == 0x0000BC, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Event_Hit) == 0x0000C8, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_GetInstigator_ReturnValue) == 0x000158, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_GetOwner_ReturnValue) == 0x000160, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, Temp_int_Loop_Counter_Variable) == 0x000168, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00016C, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_Add_IntInt_ReturnValue) == 0x000178, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_GetActorForwardVector_ReturnValue) == 0x00017C, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_MakeStruct_LightBeamAttachment) == 0x000188, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_MakeStruct_LightBeamAttachment' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_MakeStruct_LightBeamAttachment1) == 0x0001B0, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_MakeStruct_LightBeamAttachment1' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_MakeStruct_DamageGoreModifiers) == 0x0001D8, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_MakeStruct_DamageGoreModifiers' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_GetOwner_ReturnValue1) == 0x0001E0, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_MakeStruct_OakLightBeamInitializationData) == 0x0001E8, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_MakeStruct_OakLightBeamInitializationData' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_IsValid_ReturnValue) == 0x000320, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_IsValid_ReturnValue1) == 0x000321, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_BooleanAND_ReturnValue) == 0x000322, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Select2_Default) == 0x000324, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_GeneratePointsOnFan_ReturnValue) == 0x000328, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_GeneratePointsOnFan_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000338, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_Array_Get_Item) == 0x000340, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000370, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_Array_Length_ReturnValue) == 0x000378, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_Less_IntInt_ReturnValue) == 0x00037C, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, CallFunc_FinishSpawningActor_ReturnValue) == 0x000380, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Select3_Default) == 0x000388, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA, K2Node_Select4_Default) == 0x000390, "Member 'Proj_MAL_SM_DNA_C_ExecuteUbergraph_Proj_MAL_SM_DNA::K2Node_Select4_Default' has a wrong offset!");

// Function Proj_MAL_SM_DNA.Proj_MAL_SM_DNA_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct Proj_MAL_SM_DNA_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_MAL_SM_DNA_C_ReceiveHit) == 0x000008, "Wrong alignment on Proj_MAL_SM_DNA_C_ReceiveHit");
static_assert(sizeof(Proj_MAL_SM_DNA_C_ReceiveHit) == 0x0000D0, "Wrong size on Proj_MAL_SM_DNA_C_ReceiveHit");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ReceiveHit, MyComp) == 0x000000, "Member 'Proj_MAL_SM_DNA_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ReceiveHit, Other) == 0x000008, "Member 'Proj_MAL_SM_DNA_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Proj_MAL_SM_DNA_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'Proj_MAL_SM_DNA_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'Proj_MAL_SM_DNA_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ReceiveHit, HitNormal) == 0x000028, "Member 'Proj_MAL_SM_DNA_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'Proj_MAL_SM_DNA_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Proj_MAL_SM_DNA_C_ReceiveHit, Hit) == 0x000040, "Member 'Proj_MAL_SM_DNA_C_ReceiveHit::Hit' has a wrong offset!");

}

