#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Weapon_TOR_HW_BeeHive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Proj_Weapon_BaseProjectile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_Weapon_TOR_HW_BeeHive.Proj_Weapon_TOR_HW_BeeHive_C
// 0x00E8 (0x0878 - 0x0790)
class AProj_Weapon_TOR_HW_BeeHive_C final : public AProj_Weapon_BaseProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Proj_Weapon_TOR_HW_BeeHive_C;       // 0x0790(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               TracerTrailFX;                                     // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FEnvQueryParams                        HomingQuery;                                       // 0x07A0(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AActor*                                 HomingTarget;                                      // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LightProjectile;                                   // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         FireID;                                            // 0x0868(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869[0x3];                                      // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ProjectilesSpawned;                                // 0x086C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Flags_0;                                           // 0x0870(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_Weapon_TOR_HW_BeeHive(int32 EntryPoint);
	void BurnItDown();
	void ReleaseTheBEEEEEEEEEEEEEES();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void TargetFound();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void MakeBees();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_Weapon_TOR_HW_BeeHive_C">();
	}
	static class AProj_Weapon_TOR_HW_BeeHive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_Weapon_TOR_HW_BeeHive_C>();
	}
};
static_assert(alignof(AProj_Weapon_TOR_HW_BeeHive_C) == 0x000008, "Wrong alignment on AProj_Weapon_TOR_HW_BeeHive_C");
static_assert(sizeof(AProj_Weapon_TOR_HW_BeeHive_C) == 0x000878, "Wrong size on AProj_Weapon_TOR_HW_BeeHive_C");
static_assert(offsetof(AProj_Weapon_TOR_HW_BeeHive_C, UberGraphFrame_Proj_Weapon_TOR_HW_BeeHive_C) == 0x000790, "Member 'AProj_Weapon_TOR_HW_BeeHive_C::UberGraphFrame_Proj_Weapon_TOR_HW_BeeHive_C' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_TOR_HW_BeeHive_C, TracerTrailFX) == 0x000798, "Member 'AProj_Weapon_TOR_HW_BeeHive_C::TracerTrailFX' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_TOR_HW_BeeHive_C, HomingQuery) == 0x0007A0, "Member 'AProj_Weapon_TOR_HW_BeeHive_C::HomingQuery' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_TOR_HW_BeeHive_C, HomingTarget) == 0x000858, "Member 'AProj_Weapon_TOR_HW_BeeHive_C::HomingTarget' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_TOR_HW_BeeHive_C, LightProjectile) == 0x000860, "Member 'AProj_Weapon_TOR_HW_BeeHive_C::LightProjectile' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_TOR_HW_BeeHive_C, FireID) == 0x000868, "Member 'AProj_Weapon_TOR_HW_BeeHive_C::FireID' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_TOR_HW_BeeHive_C, ProjectilesSpawned) == 0x00086C, "Member 'AProj_Weapon_TOR_HW_BeeHive_C::ProjectilesSpawned' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_TOR_HW_BeeHive_C, Flags_0) == 0x000870, "Member 'AProj_Weapon_TOR_HW_BeeHive_C::Flags_0' has a wrong offset!");

}

