#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_PetLoader_ShockOrb

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_PetLoader_ShockOrb_structs.hpp"


namespace SDK::Params
{

// Function Proj_PetLoader_ShockOrb.Proj_PetLoader_ShockOrb_C.ExecuteUbergraph_Proj_PetLoader_ShockOrb
// 0x02A8 (0x02A8 - 0x0000)
struct Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_PetLoader_ShockOrb                       Temp_byte_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  Temp_struct_Variable1;                             // 0x00A0(0x0018)(ConstParm, NoDestructor)
	Enum_PetLoader_ShockOrb                       Temp_byte_Variable1;                               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  Temp_struct_Variable2;                             // 0x00C0(0x0018)(ConstParm, NoDestructor)
	Enum_PetLoader_ShockOrb                       Temp_byte_Variable2;                               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UExplosionData*                         Temp_object_Variable;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExplosionData*                         Temp_object_Variable1;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExplosionData*                         Temp_object_Variable2;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExplosionData*                         Temp_object_Variable3;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExplosionData*                         Temp_object_Variable4;                             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_PetLoader_ShockOrb                       Temp_byte_Variable3;                               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImpactData*                            Temp_object_Variable5;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImpactData*                            Temp_object_Variable6;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImpactData*                            Temp_object_Variable7;                             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImpactData*                            Temp_object_Variable8;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImpactData*                            Temp_object_Variable9;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamageReceiver, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate;              // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_ComponentBoundEvent_TouchingActor;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsPlayer;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ComponentBoundEvent_ComponentTouched;       // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTargetableComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFriendly_ReturnValue;                   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_Select_Default;                             // 0x0180(0x0018)(ConstParm, NoDestructor)
	struct FDataTableValueHandle                  K2Node_Select1_Default;                            // 0x0198(0x0018)(ConstParm, NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UExplosionData*                         K2Node_Select2_Default;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImpactData*                            K2Node_Select3_Default;                            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue1; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageReceiver;                 // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakDamageComponent*                    CallFunc_GetComponentByClass_ReturnValue1;         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue1;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver;         // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Damage;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_ComponentBoundEvent_DamageType;             // 0x0220(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_ComponentBoundEvent_DamageSource;           // 0x0228(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_ComponentBoundEvent_InstigatedBy;           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_ComponentBoundEvent_Details;                // 0x0240(0x0058)(ContainsInstancedReference)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFriendly_ReturnValue1;                  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb) == 0x000008, "Wrong alignment on Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb");
static_assert(sizeof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb) == 0x0002A8, "Wrong size on Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, EntryPoint) == 0x000000, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_struct_Variable) == 0x000008, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_byte_Variable) == 0x000098, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_struct_Variable1) == 0x0000A0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_byte_Variable1) == 0x0000B8, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_struct_Variable2) == 0x0000C0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_byte_Variable2) == 0x0000D8, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable) == 0x0000E0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable1) == 0x0000E8, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable2) == 0x0000F0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable3) == 0x0000F8, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable4) == 0x000100, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_byte_Variable3) == 0x000108, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable5) == 0x000110, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable6) == 0x000118, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable7) == 0x000120, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable8) == 0x000128, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable8' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, Temp_object_Variable9) == 0x000130, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::Temp_object_Variable9' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_CreateDelegate_OutputDelegate) == 0x000138, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_TouchingActor) == 0x000148, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_TouchingActor' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_bIsPlayer) == 0x000150, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_bIsPlayer' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_ComponentTouched) == 0x000158, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_ComponentTouched' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_IsAlive_ReturnValue) == 0x000160, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_GetOwner_ReturnValue) == 0x000168, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_GetComponentByClass_ReturnValue) == 0x000170, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_IsFriendly_ReturnValue) == 0x000178, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_IsFriendly_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_Not_PreBool_ReturnValue) == 0x000179, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00017A, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x00017B, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_BooleanAND_ReturnValue) == 0x00017C, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_BooleanAND_ReturnValue1) == 0x00017D, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_Select_Default) == 0x000180, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_Select1_Default) == 0x000198, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x0001B0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_Select2_Default) == 0x0001B8, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_GetOwner_ReturnValue1) == 0x0001C0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_Select3_Default) == 0x0001C8, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_GetDataTableValueFromHandle_ReturnValue1) == 0x0001D0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_GetDataTableValueFromHandle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_GetOwner_ReturnValue2) == 0x0001D8, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001E0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_CustomEvent_DamageReceiver) == 0x0001F0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_CustomEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_CustomEvent_DamageCauser) == 0x0001F8, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_GetComponentByClass_ReturnValue1) == 0x000200, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_IsAlive_ReturnValue1) == 0x000208, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_IsAlive_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_DamageReceiver) == 0x000210, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_Damage) == 0x000218, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_Damage' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_DamageType) == 0x000220, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_DamageSource) == 0x000228, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_InstigatedBy) == 0x000230, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_DamageCauser) == 0x000238, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, K2Node_ComponentBoundEvent_Details) == 0x000240, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::K2Node_ComponentBoundEvent_Details' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_K2_GetPawn_ReturnValue) == 0x000298, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_IsFriendly_ReturnValue1) == 0x0002A0, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_IsFriendly_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_BooleanAND_ReturnValue2) == 0x0002A1, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb, CallFunc_BooleanAND_ReturnValue3) == 0x0002A2, "Member 'Proj_PetLoader_ShockOrb_C_ExecuteUbergraph_Proj_PetLoader_ShockOrb::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");

// Function Proj_PetLoader_ShockOrb.Proj_PetLoader_ShockOrb_C.BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb
// 0x0088 (0x0088 - 0x0000)
struct Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0030(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb) == 0x000008, "Wrong alignment on Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb");
static_assert(sizeof(Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb) == 0x000088, "Wrong size on Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, DamageReceiver) == 0x000000, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, Damage) == 0x000008, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::Damage' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, DamageType) == 0x000010, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::DamageType' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, DamageSource) == 0x000018, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::DamageSource' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, InstigatedBy) == 0x000020, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, DamageCauser) == 0x000028, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::DamageCauser' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, Details) == 0x000030, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::Details' has a wrong offset!");

// Function Proj_PetLoader_ShockOrb.Proj_PetLoader_ShockOrb_C.ShockOrb_OnTargetDied
// 0x0010 (0x0010 - 0x0000)
struct Proj_PetLoader_ShockOrb_C_ShockOrb_OnTargetDied final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_PetLoader_ShockOrb_C_ShockOrb_OnTargetDied) == 0x000008, "Wrong alignment on Proj_PetLoader_ShockOrb_C_ShockOrb_OnTargetDied");
static_assert(sizeof(Proj_PetLoader_ShockOrb_C_ShockOrb_OnTargetDied) == 0x000010, "Wrong size on Proj_PetLoader_ShockOrb_C_ShockOrb_OnTargetDied");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ShockOrb_OnTargetDied, DamageReceiver) == 0x000000, "Member 'Proj_PetLoader_ShockOrb_C_ShockOrb_OnTargetDied::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_ShockOrb_OnTargetDied, DamageCauser) == 0x000008, "Member 'Proj_PetLoader_ShockOrb_C_ShockOrb_OnTargetDied::DamageCauser' has a wrong offset!");

// Function Proj_PetLoader_ShockOrb.Proj_PetLoader_ShockOrb_C.BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb
// 0x0018 (0x0018 - 0x0000)
struct Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb) == 0x000008, "Wrong alignment on Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb");
static_assert(sizeof(Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb) == 0x000018, "Wrong size on Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, TouchingActor) == 0x000000, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::TouchingActor' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, bIsPlayer) == 0x000008, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb, ComponentTouched) == 0x000010, "Member 'Proj_PetLoader_ShockOrb_C_BndEvt__OakTrigger_K2Node_ComponentBoundEvent_1_OakTouchedTriggerDelegate__DelegateSignature_Proj_PetLoader_ShockOrb::ComponentTouched' has a wrong offset!");

// Function Proj_PetLoader_ShockOrb.Proj_PetLoader_ShockOrb_C.OnRep_OrbState
// 0x0001 (0x0001 - 0x0000)
struct Proj_PetLoader_ShockOrb_C_OnRep_OrbState final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_PetLoader_ShockOrb_C_OnRep_OrbState) == 0x000001, "Wrong alignment on Proj_PetLoader_ShockOrb_C_OnRep_OrbState");
static_assert(sizeof(Proj_PetLoader_ShockOrb_C_OnRep_OrbState) == 0x000001, "Wrong size on Proj_PetLoader_ShockOrb_C_OnRep_OrbState");
static_assert(offsetof(Proj_PetLoader_ShockOrb_C_OnRep_OrbState, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'Proj_PetLoader_ShockOrb_C_OnRep_OrbState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

