#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Artifact_Sparkplug_Augment

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_Artifact_Sparkplug_Augment.Proj_Artifact_Sparkplug_Augment_C
// 0x0050 (0x0730 - 0x06E0)
class AProj_Artifact_Sparkplug_Augment_C final : public AOakProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E0(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               ShockFX;                                           // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TaserMesh;                                         // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxProjectileMovementComponent*        GbxProjectileMovement;                             // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USocketComponent*                       FXSocket;                                          // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakTriggerComponent*                   OakTrigger;                                        // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       TriggerCollision;                                  // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         AttachedTargets;                                   // 0x0720(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Proj_Artifact_Sparkplug_Augment(int32 EntryPoint);
	void ReceiveDestroyed();
	void BndEvt__OakTrigger_K2Node_ComponentBoundEvent_4_OakUnTouchedTriggerDelegate__DelegateSignature_Proj_Artifact_Sparkplug(class AActor* LeavingActor, bool bIsPlayer);
	void BndEvt__OakTrigger_K2Node_ComponentBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature_Proj_Artifact_Sparkplug(class AActor* TouchingActor, bool bIsPlayer, class UActorComponent* ComponentTouched);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_Artifact_Sparkplug_Augment_C">();
	}
	static class AProj_Artifact_Sparkplug_Augment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_Artifact_Sparkplug_Augment_C>();
	}
};
static_assert(alignof(AProj_Artifact_Sparkplug_Augment_C) == 0x000008, "Wrong alignment on AProj_Artifact_Sparkplug_Augment_C");
static_assert(sizeof(AProj_Artifact_Sparkplug_Augment_C) == 0x000730, "Wrong size on AProj_Artifact_Sparkplug_Augment_C");
static_assert(offsetof(AProj_Artifact_Sparkplug_Augment_C, UberGraphFrame) == 0x0006E0, "Member 'AProj_Artifact_Sparkplug_Augment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProj_Artifact_Sparkplug_Augment_C, ShockFX) == 0x0006E8, "Member 'AProj_Artifact_Sparkplug_Augment_C::ShockFX' has a wrong offset!");
static_assert(offsetof(AProj_Artifact_Sparkplug_Augment_C, TaserMesh) == 0x0006F0, "Member 'AProj_Artifact_Sparkplug_Augment_C::TaserMesh' has a wrong offset!");
static_assert(offsetof(AProj_Artifact_Sparkplug_Augment_C, GbxProjectileMovement) == 0x0006F8, "Member 'AProj_Artifact_Sparkplug_Augment_C::GbxProjectileMovement' has a wrong offset!");
static_assert(offsetof(AProj_Artifact_Sparkplug_Augment_C, FXSocket) == 0x000700, "Member 'AProj_Artifact_Sparkplug_Augment_C::FXSocket' has a wrong offset!");
static_assert(offsetof(AProj_Artifact_Sparkplug_Augment_C, OakTrigger) == 0x000708, "Member 'AProj_Artifact_Sparkplug_Augment_C::OakTrigger' has a wrong offset!");
static_assert(offsetof(AProj_Artifact_Sparkplug_Augment_C, TriggerCollision) == 0x000710, "Member 'AProj_Artifact_Sparkplug_Augment_C::TriggerCollision' has a wrong offset!");
static_assert(offsetof(AProj_Artifact_Sparkplug_Augment_C, ParticleSystem) == 0x000718, "Member 'AProj_Artifact_Sparkplug_Augment_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AProj_Artifact_Sparkplug_Augment_C, AttachedTargets) == 0x000720, "Member 'AProj_Artifact_Sparkplug_Augment_C::AttachedTargets' has a wrong offset!");

}

