#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Projectile_PetSpiderant_BileBomb

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WwiseAudio_structs.hpp"


namespace SDK::Params
{

// Function Projectile_PetSpiderant_BileBomb.Projectile_PetSpiderant_BileBomb_C.ExecuteUbergraph_Projectile_PetSpiderant_BileBomb
// 0x0200 (0x0200 - 0x0000)
struct Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0008(0x0018)()
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit1;                                 // 0x0028(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00B8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0158(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x01E8(0x0010)(NoDestructor)
	float                                         CallFunc_GetValueFromAttributeDefinedRow_ReturnValue; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb) == 0x000008, "Wrong alignment on Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb");
static_assert(sizeof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb) == 0x000200, "Wrong size on Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, EntryPoint) == 0x000000, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::EntryPoint' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, CallFunc_PostWwiseEvent_ReturnValue) == 0x000008, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, CallFunc_GetDataTableValue_OutValue) == 0x000020, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, CallFunc_GetDataTableValue_ReturnValue) == 0x000024, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::CallFunc_GetDataTableValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, Temp_bool_Has_Been_Initd_Variable) == 0x000025, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, Temp_bool_IsClosed_Variable) == 0x000026, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, Temp_bool_Has_Been_Initd_Variable1) == 0x000027, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, K2Node_Event_Hit1) == 0x000028, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::K2Node_Event_Hit1' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, K2Node_Event_Hit) == 0x0000B8, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, Temp_bool_IsClosed_Variable1) == 0x000148, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, CallFunc_GetInstigator_ReturnValue) == 0x000150, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, Temp_struct_Variable) == 0x000158, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, K2Node_MakeStruct_DataTableRowHandle) == 0x0001E8, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb, CallFunc_GetValueFromAttributeDefinedRow_ReturnValue) == 0x0001F8, "Member 'Projectile_PetSpiderant_BileBomb_C_ExecuteUbergraph_Projectile_PetSpiderant_BileBomb::CallFunc_GetValueFromAttributeDefinedRow_ReturnValue' has a wrong offset!");

// Function Projectile_PetSpiderant_BileBomb.Projectile_PetSpiderant_BileBomb_C.OnHitDamagableObject
// 0x0090 (0x0090 - 0x0000)
struct Projectile_PetSpiderant_BileBomb_C_OnHitDamagableObject final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Projectile_PetSpiderant_BileBomb_C_OnHitDamagableObject) == 0x000008, "Wrong alignment on Projectile_PetSpiderant_BileBomb_C_OnHitDamagableObject");
static_assert(sizeof(Projectile_PetSpiderant_BileBomb_C_OnHitDamagableObject) == 0x000090, "Wrong size on Projectile_PetSpiderant_BileBomb_C_OnHitDamagableObject");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_OnHitDamagableObject, Hit) == 0x000000, "Member 'Projectile_PetSpiderant_BileBomb_C_OnHitDamagableObject::Hit' has a wrong offset!");

// Function Projectile_PetSpiderant_BileBomb.Projectile_PetSpiderant_BileBomb_C.OnHitWorld
// 0x0090 (0x0090 - 0x0000)
struct Projectile_PetSpiderant_BileBomb_C_OnHitWorld final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Projectile_PetSpiderant_BileBomb_C_OnHitWorld) == 0x000008, "Wrong alignment on Projectile_PetSpiderant_BileBomb_C_OnHitWorld");
static_assert(sizeof(Projectile_PetSpiderant_BileBomb_C_OnHitWorld) == 0x000090, "Wrong size on Projectile_PetSpiderant_BileBomb_C_OnHitWorld");
static_assert(offsetof(Projectile_PetSpiderant_BileBomb_C_OnHitWorld, Hit) == 0x000000, "Member 'Projectile_PetSpiderant_BileBomb_C_OnHitWorld::Hit' has a wrong offset!");

}

