#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_HW_COV_Mechanic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Proj_HW_COV_Mechanic.Proj_HW_COV_Mechanic_C.ExecuteUbergraph_Proj_HW_COV_Mechanic
// 0x0218 (0x0218 - 0x0000)
struct Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0010(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x00A0(0x0018)()
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00B8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0154(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue1;         // 0x01C8(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue2;         // 0x01F8(0x0018)()
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue1;         // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic) == 0x000008, "Wrong alignment on Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic");
static_assert(sizeof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic) == 0x000218, "Wrong size on Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, EntryPoint) == 0x000000, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, Temp_struct_Variable) == 0x000010, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_PostEventAtLocation_ReturnValue) == 0x0000A0, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, K2Node_Event_Hit) == 0x0000B8, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_bBlockingHit) == 0x000148, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_bInitialOverlap) == 0x000149, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_Location) == 0x000154, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_ImpactPoint) == 0x000160, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_Normal) == 0x00016C, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_ImpactNormal) == 0x000178, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_HitItem) == 0x0001A8, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_FaceIndex) == 0x0001AC, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_TraceStart) == 0x0001B0, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_BreakHitResult_TraceEnd) == 0x0001BC, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_PostEventAtLocation_ReturnValue1) == 0x0001C8, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_PostEventAtLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0001E0, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_GetOwner_ReturnValue) == 0x0001F0, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_PostEventAtLocation_ReturnValue2) == 0x0001F8, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_PostEventAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000210, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic, CallFunc_GetValueOfAttribute_ReturnValue1) == 0x000214, "Member 'Proj_HW_COV_Mechanic_C_ExecuteUbergraph_Proj_HW_COV_Mechanic::CallFunc_GetValueOfAttribute_ReturnValue1' has a wrong offset!");

// Function Proj_HW_COV_Mechanic.Proj_HW_COV_Mechanic_C.OnHitWorld
// 0x0090 (0x0090 - 0x0000)
struct Proj_HW_COV_Mechanic_C_OnHitWorld final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_HW_COV_Mechanic_C_OnHitWorld) == 0x000008, "Wrong alignment on Proj_HW_COV_Mechanic_C_OnHitWorld");
static_assert(sizeof(Proj_HW_COV_Mechanic_C_OnHitWorld) == 0x000090, "Wrong size on Proj_HW_COV_Mechanic_C_OnHitWorld");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_OnHitWorld, Hit) == 0x000000, "Member 'Proj_HW_COV_Mechanic_C_OnHitWorld::Hit' has a wrong offset!");

// Function Proj_HW_COV_Mechanic.Proj_HW_COV_Mechanic_C.ProjectileDetonate
// 0x0001 (0x0001 - 0x0000)
struct Proj_HW_COV_Mechanic_C_ProjectileDetonate final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_HW_COV_Mechanic_C_ProjectileDetonate) == 0x000001, "Wrong alignment on Proj_HW_COV_Mechanic_C_ProjectileDetonate");
static_assert(sizeof(Proj_HW_COV_Mechanic_C_ProjectileDetonate) == 0x000001, "Wrong size on Proj_HW_COV_Mechanic_C_ProjectileDetonate");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ProjectileDetonate, Success) == 0x000000, "Member 'Proj_HW_COV_Mechanic_C_ProjectileDetonate::Success' has a wrong offset!");

// Function Proj_HW_COV_Mechanic.Proj_HW_COV_Mechanic_C.ProjectileArm
// 0x0001 (0x0001 - 0x0000)
struct Proj_HW_COV_Mechanic_C_ProjectileArm final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_HW_COV_Mechanic_C_ProjectileArm) == 0x000001, "Wrong alignment on Proj_HW_COV_Mechanic_C_ProjectileArm");
static_assert(sizeof(Proj_HW_COV_Mechanic_C_ProjectileArm) == 0x000001, "Wrong size on Proj_HW_COV_Mechanic_C_ProjectileArm");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ProjectileArm, Success) == 0x000000, "Member 'Proj_HW_COV_Mechanic_C_ProjectileArm::Success' has a wrong offset!");

// Function Proj_HW_COV_Mechanic.Proj_HW_COV_Mechanic_C.ProjectileDisarm
// 0x0001 (0x0001 - 0x0000)
struct Proj_HW_COV_Mechanic_C_ProjectileDisarm final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_HW_COV_Mechanic_C_ProjectileDisarm) == 0x000001, "Wrong alignment on Proj_HW_COV_Mechanic_C_ProjectileDisarm");
static_assert(sizeof(Proj_HW_COV_Mechanic_C_ProjectileDisarm) == 0x000001, "Wrong size on Proj_HW_COV_Mechanic_C_ProjectileDisarm");
static_assert(offsetof(Proj_HW_COV_Mechanic_C_ProjectileDisarm, Success) == 0x000000, "Member 'Proj_HW_COV_Mechanic_C_ProjectileDisarm::Success' has a wrong offset!");

}

