#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Projectile_Operative_BarrierSpawner

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Projectile_Operative_BarrierSpawner.Projectile_Operative_BarrierSpawner_C
// 0x0020 (0x0728 - 0x0708)
class AProjectile_Operative_BarrierSpawner_C final : public AOakProjectile_ActionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0708(0x0008)(Transient, DuplicateTransient)
	class UGbxSkeletalMeshComponent*              GbxSkeletalMesh;                                   // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxProjectileMovementComponent*        GbxProjectileMovement;                             // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Projectile_Operative_BarrierSpawner(int32 EntryPoint);
	void OpenHitWorldGate();
	void OnHitWorld(const struct FHitResult& Hit);
	void OnExplode();
	void SpawnBarrier();
	void BndEvt__GbxProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature_Projectile_Operative_BarrierSpawner(const struct FHitResult& ImpactResult);
	void UserConstructionScript();
	void GetBarrierPlacementTransform(struct FTransform* Res);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Projectile_Operative_BarrierSpawner_C">();
	}
	static class AProjectile_Operative_BarrierSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProjectile_Operative_BarrierSpawner_C>();
	}
};
static_assert(alignof(AProjectile_Operative_BarrierSpawner_C) == 0x000008, "Wrong alignment on AProjectile_Operative_BarrierSpawner_C");
static_assert(sizeof(AProjectile_Operative_BarrierSpawner_C) == 0x000728, "Wrong size on AProjectile_Operative_BarrierSpawner_C");
static_assert(offsetof(AProjectile_Operative_BarrierSpawner_C, UberGraphFrame) == 0x000708, "Member 'AProjectile_Operative_BarrierSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProjectile_Operative_BarrierSpawner_C, GbxSkeletalMesh) == 0x000710, "Member 'AProjectile_Operative_BarrierSpawner_C::GbxSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AProjectile_Operative_BarrierSpawner_C, Sphere) == 0x000718, "Member 'AProjectile_Operative_BarrierSpawner_C::Sphere' has a wrong offset!");
static_assert(offsetof(AProjectile_Operative_BarrierSpawner_C, GbxProjectileMovement) == 0x000720, "Member 'AProjectile_Operative_BarrierSpawner_C::GbxProjectileMovement' has a wrong offset!");

}

