#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Nog_AttackDrone

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_NogBuff_structs.hpp"


namespace SDK::Params
{

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.ExecuteUbergraph_Proj_Nog_AttackDrone
// 0x0510 (0x0510 - 0x0000)
struct Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Current_Tick_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_TickRate_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_MaxDuration_Variable;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_BuffReceiver;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_StateName;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_Event_PathNodeList;                         // 0x0048(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_MaxTicks_Variable;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0060(0x0018)()
	bool                                          CallFunc_HasTargets_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageReceiver;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakDamageComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_WasDestroyed;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver;         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Damage;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_ComponentBoundEvent_DamageType;             // 0x00B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_ComponentBoundEvent_DamageSource;           // 0x00B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_ComponentBoundEvent_InstigatedBy;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_ComponentBoundEvent_Details;                // 0x00D0(0x0058)(ContainsInstancedReference)
	bool                                          Temp_bool_Running_Variable;                        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Nog_C>            K2Node_DynamicCast_AsBPI_Nog;                      // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBestTargetActor_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetActorSocket_ReturnValue;               // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0194(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01A0(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x01B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x01D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcThrowVelocity_ResultVelocity;         // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcThrowVelocity_ResultGravityScale;     // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x01F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0200(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0210(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTargets_ReturnValue1;                  // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBestTargetActor_ReturnValue1;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue1;     // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_TrialBoss_C>      K2Node_DynamicCast_AsBPI_Trial_Boss;               // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOakElementalType                             K2Node_Event_ElementType;                          // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             CallFunc_GetElement_CurrentElement;                // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x02D4(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakLightProjectileInitializationData  K2Node_MakeStruct_OakLightProjectileInitializationData; // 0x02E8(0x0158)(ContainsInstancedReference)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue1;     // 0x0440(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue2;     // 0x0450(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue3;     // 0x0460(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue4;     // 0x0470(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_482[0x6];                                      // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_CustomEvent_EndPlayReason;                  // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Event_NogBuff;                              // 0x0498(0x0010)(NoDestructor)
	class AActor*                                 K2Node_Event_BuffTarget;                           // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamageReceiver, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate1;             // 0x04B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FStruct_NogBuff                        CallFunc_GetDataTableRowFromHandle_OutRow;         // 0x04C0(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromHandle_ReturnValue;    // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone) == 0x000010, "Wrong alignment on Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone");
static_assert(sizeof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone) == 0x000510, "Wrong size on Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, EntryPoint) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, Temp_int_Current_Tick_Variable) == 0x000004, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::Temp_int_Current_Tick_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, Temp_float_TickRate_Variable) == 0x000008, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::Temp_float_TickRate_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, Temp_bool_IsClosed_Variable) == 0x000010, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, Temp_float_MaxDuration_Variable) == 0x000028, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::Temp_float_MaxDuration_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, Temp_bool_Has_Been_Initd_Variable) == 0x00002C, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002D, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_Event_BuffReceiver) == 0x000030, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_Event_BuffReceiver' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_Event_StateName) == 0x000038, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_Event_StateName' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_Event_PathNodeList) == 0x000048, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_Event_PathNodeList' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, Temp_int_MaxTicks_Variable) == 0x000058, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::Temp_int_MaxTicks_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_PostWwiseEvent_ReturnValue) == 0x000060, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_HasTargets_ReturnValue) == 0x000078, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_HasTargets_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_CustomEvent_DamageReceiver) == 0x000080, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_CustomEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_CustomEvent_DamageCauser) == 0x000088, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetComponentByClass_ReturnValue) == 0x000090, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_Event_WasDestroyed) == 0x000098, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_Event_WasDestroyed' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_ComponentBoundEvent_DamageReceiver) == 0x0000A0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_ComponentBoundEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_ComponentBoundEvent_Damage) == 0x0000A8, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_ComponentBoundEvent_Damage' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_ComponentBoundEvent_DamageType) == 0x0000B0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_ComponentBoundEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_ComponentBoundEvent_DamageSource) == 0x0000B8, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_ComponentBoundEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_ComponentBoundEvent_InstigatedBy) == 0x0000C0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_ComponentBoundEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_ComponentBoundEvent_DamageCauser) == 0x0000C8, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_ComponentBoundEvent_Details) == 0x0000D0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_ComponentBoundEvent_Details' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, Temp_bool_Running_Variable) == 0x000128, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::Temp_bool_Running_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, Temp_int_Variable) == 0x00012C, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000130, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_Event_EndPlayReason) == 0x000131, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_DynamicCast_AsBPI_Nog) == 0x000138, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_DynamicCast_AsBPI_Nog' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_IsValid_ReturnValue) == 0x000149, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetBestTargetActor_ReturnValue) == 0x000150, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetBestTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetActorSocket_ReturnValue) == 0x000160, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetActorSocket_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000190, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_BreakTransform_Location) == 0x000194, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_BreakTransform_Rotation) == 0x0001A0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_BreakTransform_Scale) == 0x0001AC, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetVelocity_ReturnValue) == 0x0001B8, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001C4, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001C8, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x0001D4, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_CalcThrowVelocity_ResultVelocity) == 0x0001E0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_CalcThrowVelocity_ResultVelocity' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_CalcThrowVelocity_ResultGravityScale) == 0x0001EC, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_CalcThrowVelocity_ResultGravityScale' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_VSize_ReturnValue) == 0x0001F0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x0001F4, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_Add_VectorVector_ReturnValue) == 0x000200, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_HasAuthority_ReturnValue) == 0x00020C, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000210, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_Event_DeltaSeconds) == 0x0002A0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_HasTargets_ReturnValue1) == 0x0002A4, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_HasTargets_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetBestTargetActor_ReturnValue1) == 0x0002A8, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetBestTargetActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetHorizontalDistanceTo_ReturnValue1) == 0x0002B0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetHorizontalDistanceTo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetOwner_ReturnValue) == 0x0002B8, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_DynamicCast_AsBPI_Trial_Boss) == 0x0002C0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_DynamicCast_AsBPI_Trial_Boss' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_DynamicCast_bSuccess1) == 0x0002D0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_Event_ElementType) == 0x0002D1, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_Event_ElementType' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetElement_CurrentElement) == 0x0002D2, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetElement_CurrentElement' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_SwitchEnum_CmpSuccess) == 0x0002D3, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetVectorParameterValue_ReturnValue) == 0x0002D4, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_MakeStruct_OakLightProjectileInitializationData) == 0x0002E8, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_MakeStruct_OakLightProjectileInitializationData' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetVectorParameterValue_ReturnValue1) == 0x000440, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetVectorParameterValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetVectorParameterValue_ReturnValue2) == 0x000450, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetVectorParameterValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetVectorParameterValue_ReturnValue3) == 0x000460, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetVectorParameterValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetVectorParameterValue_ReturnValue4) == 0x000470, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetVectorParameterValue_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000480, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000481, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_CustomEvent_Actor) == 0x000488, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_CustomEvent_EndPlayReason) == 0x000490, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_CustomEvent_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_Event_NogBuff) == 0x000498, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_Event_NogBuff' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_Event_BuffTarget) == 0x0004A8, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_Event_BuffTarget' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, K2Node_CreateDelegate_OutputDelegate1) == 0x0004B0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetDataTableRowFromHandle_OutRow) == 0x0004C0, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetDataTableRowFromHandle_OutRow' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone, CallFunc_GetDataTableRowFromHandle_ReturnValue) == 0x000508, "Member 'Proj_Nog_AttackDrone_C_ExecuteUbergraph_Proj_Nog_AttackDrone::CallFunc_GetDataTableRowFromHandle_ReturnValue' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.Nog_BuffDrone_RegisterBuffData
// 0x0018 (0x0018 - 0x0000)
struct Proj_Nog_AttackDrone_C_Nog_BuffDrone_RegisterBuffData final
{
public:
	struct FDataTableRowHandle                    NogBuff_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class AActor*                                 BuffTarget;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_RegisterBuffData) == 0x000008, "Wrong alignment on Proj_Nog_AttackDrone_C_Nog_BuffDrone_RegisterBuffData");
static_assert(sizeof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_RegisterBuffData) == 0x000018, "Wrong size on Proj_Nog_AttackDrone_C_Nog_BuffDrone_RegisterBuffData");
static_assert(offsetof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_RegisterBuffData, NogBuff_0) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_Nog_BuffDrone_RegisterBuffData::NogBuff_0' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_RegisterBuffData, BuffTarget) == 0x000010, "Member 'Proj_Nog_AttackDrone_C_Nog_BuffDrone_RegisterBuffData::BuffTarget' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.OnBuffReceiverEnd
// 0x0010 (0x0010 - 0x0000)
struct Proj_Nog_AttackDrone_C_OnBuffReceiverEnd final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_OnBuffReceiverEnd) == 0x000008, "Wrong alignment on Proj_Nog_AttackDrone_C_OnBuffReceiverEnd");
static_assert(sizeof(Proj_Nog_AttackDrone_C_OnBuffReceiverEnd) == 0x000010, "Wrong size on Proj_Nog_AttackDrone_C_OnBuffReceiverEnd");
static_assert(offsetof(Proj_Nog_AttackDrone_C_OnBuffReceiverEnd, Actor) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_OnBuffReceiverEnd::Actor' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_OnBuffReceiverEnd, EndPlayReason) == 0x000008, "Member 'Proj_Nog_AttackDrone_C_OnBuffReceiverEnd::EndPlayReason' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.InitializeElement
// 0x0001 (0x0001 - 0x0000)
struct Proj_Nog_AttackDrone_C_InitializeElement final
{
public:
	EOakElementalType                             ElementType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_InitializeElement) == 0x000001, "Wrong alignment on Proj_Nog_AttackDrone_C_InitializeElement");
static_assert(sizeof(Proj_Nog_AttackDrone_C_InitializeElement) == 0x000001, "Wrong size on Proj_Nog_AttackDrone_C_InitializeElement");
static_assert(offsetof(Proj_Nog_AttackDrone_C_InitializeElement, ElementType) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_InitializeElement::ElementType' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Proj_Nog_AttackDrone_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_ReceiveTick) == 0x000004, "Wrong alignment on Proj_Nog_AttackDrone_C_ReceiveTick");
static_assert(sizeof(Proj_Nog_AttackDrone_C_ReceiveTick) == 0x000004, "Wrong size on Proj_Nog_AttackDrone_C_ReceiveTick");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Proj_Nog_AttackDrone_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Proj_Nog_AttackDrone_C_ReceiveEndPlay");
static_assert(sizeof(Proj_Nog_AttackDrone_C_ReceiveEndPlay) == 0x000001, "Wrong size on Proj_Nog_AttackDrone_C_ReceiveEndPlay");
static_assert(offsetof(Proj_Nog_AttackDrone_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone
// 0x0088 (0x0088 - 0x0000)
struct Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0030(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone) == 0x000008, "Wrong alignment on Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone");
static_assert(sizeof(Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone) == 0x000088, "Wrong size on Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone");
static_assert(offsetof(Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone, DamageReceiver) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone, Damage) == 0x000008, "Member 'Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone::Damage' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone, DamageType) == 0x000010, "Member 'Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone::DamageType' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone, DamageSource) == 0x000018, "Member 'Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone::DamageSource' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone, InstigatedBy) == 0x000020, "Member 'Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone, DamageCauser) == 0x000028, "Member 'Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone::DamageCauser' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone, Details) == 0x000030, "Member 'Proj_Nog_AttackDrone_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_2_TakeAnyPipelineDamageDelegate__DelegateSignature_Proj_Nog_BuffDrone::Details' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.Nog_BuffDrone_Detonate
// 0x0001 (0x0001 - 0x0000)
struct Proj_Nog_AttackDrone_C_Nog_BuffDrone_Detonate final
{
public:
	bool                                          WasDestroyed;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_Detonate) == 0x000001, "Wrong alignment on Proj_Nog_AttackDrone_C_Nog_BuffDrone_Detonate");
static_assert(sizeof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_Detonate) == 0x000001, "Wrong size on Proj_Nog_AttackDrone_C_Nog_BuffDrone_Detonate");
static_assert(offsetof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_Detonate, WasDestroyed) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_Nog_BuffDrone_Detonate::WasDestroyed' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.OnBuffReceiverDied
// 0x0010 (0x0010 - 0x0000)
struct Proj_Nog_AttackDrone_C_OnBuffReceiverDied final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_OnBuffReceiverDied) == 0x000008, "Wrong alignment on Proj_Nog_AttackDrone_C_OnBuffReceiverDied");
static_assert(sizeof(Proj_Nog_AttackDrone_C_OnBuffReceiverDied) == 0x000010, "Wrong size on Proj_Nog_AttackDrone_C_OnBuffReceiverDied");
static_assert(offsetof(Proj_Nog_AttackDrone_C_OnBuffReceiverDied, DamageReceiver) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_OnBuffReceiverDied::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_OnBuffReceiverDied, DamageCauser) == 0x000008, "Member 'Proj_Nog_AttackDrone_C_OnBuffReceiverDied::DamageCauser' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.Nog_BuffDrone_SupplyPath
// 0x0010 (0x0010 - 0x0000)
struct Proj_Nog_AttackDrone_C_Nog_BuffDrone_SupplyPath final
{
public:
	TArray<class AActor*>                         PathNodeList;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_SupplyPath) == 0x000008, "Wrong alignment on Proj_Nog_AttackDrone_C_Nog_BuffDrone_SupplyPath");
static_assert(sizeof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_SupplyPath) == 0x000010, "Wrong size on Proj_Nog_AttackDrone_C_Nog_BuffDrone_SupplyPath");
static_assert(offsetof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_SupplyPath, PathNodeList) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_Nog_BuffDrone_SupplyPath::PathNodeList' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.Nog_BuffDrone_SwarmState
// 0x0010 (0x0010 - 0x0000)
struct Proj_Nog_AttackDrone_C_Nog_BuffDrone_SwarmState final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_SwarmState) == 0x000008, "Wrong alignment on Proj_Nog_AttackDrone_C_Nog_BuffDrone_SwarmState");
static_assert(sizeof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_SwarmState) == 0x000010, "Wrong size on Proj_Nog_AttackDrone_C_Nog_BuffDrone_SwarmState");
static_assert(offsetof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_SwarmState, StateName) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_Nog_BuffDrone_SwarmState::StateName' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.Nog_BuffDrone_ReceiverInfo
// 0x0008 (0x0008 - 0x0000)
struct Proj_Nog_AttackDrone_C_Nog_BuffDrone_ReceiverInfo final
{
public:
	class AActor*                                 BuffReceiver;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_ReceiverInfo) == 0x000008, "Wrong alignment on Proj_Nog_AttackDrone_C_Nog_BuffDrone_ReceiverInfo");
static_assert(sizeof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_ReceiverInfo) == 0x000008, "Wrong size on Proj_Nog_AttackDrone_C_Nog_BuffDrone_ReceiverInfo");
static_assert(offsetof(Proj_Nog_AttackDrone_C_Nog_BuffDrone_ReceiverInfo, BuffReceiver) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_Nog_BuffDrone_ReceiverInfo::BuffReceiver' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.SetupMaterials
// 0x0028 (0x0028 - 0x0000)
struct Proj_Nog_AttackDrone_C_SetupMaterials final
{
public:
	TScriptInterface<class IBPI_Nog_C>            K2Node_DynamicCast_AsBPI_Nog;                      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Nog_GetDroneMaterial_DroneMaterial;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_SetupMaterials) == 0x000008, "Wrong alignment on Proj_Nog_AttackDrone_C_SetupMaterials");
static_assert(sizeof(Proj_Nog_AttackDrone_C_SetupMaterials) == 0x000028, "Wrong size on Proj_Nog_AttackDrone_C_SetupMaterials");
static_assert(offsetof(Proj_Nog_AttackDrone_C_SetupMaterials, K2Node_DynamicCast_AsBPI_Nog) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_SetupMaterials::K2Node_DynamicCast_AsBPI_Nog' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_SetupMaterials, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Proj_Nog_AttackDrone_C_SetupMaterials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_SetupMaterials, CallFunc_Nog_GetDroneMaterial_DroneMaterial) == 0x000018, "Member 'Proj_Nog_AttackDrone_C_SetupMaterials::CallFunc_Nog_GetDroneMaterial_DroneMaterial' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_SetupMaterials, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'Proj_Nog_AttackDrone_C_SetupMaterials::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.SetDroneColor
// 0x0010 (0x0010 - 0x0000)
struct Proj_Nog_AttackDrone_C_SetDroneColor final
{
public:
	struct FLinearColor                           EmissiveColor;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_SetDroneColor) == 0x000004, "Wrong alignment on Proj_Nog_AttackDrone_C_SetDroneColor");
static_assert(sizeof(Proj_Nog_AttackDrone_C_SetDroneColor) == 0x000010, "Wrong size on Proj_Nog_AttackDrone_C_SetDroneColor");
static_assert(offsetof(Proj_Nog_AttackDrone_C_SetDroneColor, EmissiveColor) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_SetDroneColor::EmissiveColor' has a wrong offset!");

// Function Proj_Nog_AttackDrone.Proj_Nog_AttackDrone_C.SetDroneFaceTarget
// 0x0006 (0x0006 - 0x0000)
struct Proj_Nog_AttackDrone_C_SetDroneFaceTarget final
{
public:
	bool                                          FaceTarget;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_Nog_AttackDrone_C_SetDroneFaceTarget) == 0x000001, "Wrong alignment on Proj_Nog_AttackDrone_C_SetDroneFaceTarget");
static_assert(sizeof(Proj_Nog_AttackDrone_C_SetDroneFaceTarget) == 0x000006, "Wrong size on Proj_Nog_AttackDrone_C_SetDroneFaceTarget");
static_assert(offsetof(Proj_Nog_AttackDrone_C_SetDroneFaceTarget, FaceTarget) == 0x000000, "Member 'Proj_Nog_AttackDrone_C_SetDroneFaceTarget::FaceTarget' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_SetDroneFaceTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'Proj_Nog_AttackDrone_C_SetDroneFaceTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Nog_AttackDrone_C_SetDroneFaceTarget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'Proj_Nog_AttackDrone_C_SetDroneFaceTarget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
