#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Projectile_Bubble

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Proj_Weapon_BaseProjectile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Projectile_Bubble.Projectile_Bubble_C
// 0x0060 (0x07F0 - 0x0790)
class AProjectile_Bubble_C final : public AProj_Weapon_BaseProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Projectile_Bubble_C;                // 0x0790(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_BubbleBlaster_Proj;                             // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Pattern4_NewTrack_0_917E912A45312630914DA49CB16FF351; // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Pattern4__Direction_917E912A45312630914DA49CB16FF351; // 0x07A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A5[0x3];                                      // 0x07A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Pattern4;                                          // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pattern3_NewTrack_0_6FFF888F4CF7B9842964E7853200DA3D; // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Pattern3__Direction_6FFF888F4CF7B9842964E7853200DA3D; // 0x07B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B5[0x3];                                      // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Pattern3;                                          // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GravityScale_NewTrack_0_30FEE2454B3C85D7F663B4BDBB46EF8E; // 0x07C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            GravityScale__Direction_30FEE2454B3C85D7F663B4BDBB46EF8E; // 0x07C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C5[0x3];                                      // 0x07C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     GravityScale;                                      // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pattern2_NewTrack_0_32AA288C4B68540B5D4911A940102E19; // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Pattern2__Direction_32AA288C4B68540B5D4911A940102E19; // 0x07D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D5[0x3];                                      // 0x07D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Pattern2;                                          // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pattern1_NewTrack_0_9DE1BEE541C665244522D8A3FE3A792A; // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Pattern1__Direction_9DE1BEE541C665244522D8A3FE3A792A; // 0x07E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E5[0x3];                                      // 0x07E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Pattern1;                                          // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Projectile_Bubble(int32 EntryPoint);
	void GravityScale__FinishedFunc();
	void GravityScale__UpdateFunc();
	void Pattern1__FinishedFunc();
	void Pattern1__UpdateFunc();
	void Pattern2__FinishedFunc();
	void Pattern2__UpdateFunc();
	void Pattern3__FinishedFunc();
	void Pattern3__UpdateFunc();
	void Pattern4__FinishedFunc();
	void Pattern4__UpdateFunc();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Projectile_Bubble_C">();
	}
	static class AProjectile_Bubble_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProjectile_Bubble_C>();
	}
};
static_assert(alignof(AProjectile_Bubble_C) == 0x000008, "Wrong alignment on AProjectile_Bubble_C");
static_assert(sizeof(AProjectile_Bubble_C) == 0x0007F0, "Wrong size on AProjectile_Bubble_C");
static_assert(offsetof(AProjectile_Bubble_C, UberGraphFrame_Projectile_Bubble_C) == 0x000790, "Member 'AProjectile_Bubble_C::UberGraphFrame_Projectile_Bubble_C' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, PS_BubbleBlaster_Proj) == 0x000798, "Member 'AProjectile_Bubble_C::PS_BubbleBlaster_Proj' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern4_NewTrack_0_917E912A45312630914DA49CB16FF351) == 0x0007A0, "Member 'AProjectile_Bubble_C::Pattern4_NewTrack_0_917E912A45312630914DA49CB16FF351' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern4__Direction_917E912A45312630914DA49CB16FF351) == 0x0007A4, "Member 'AProjectile_Bubble_C::Pattern4__Direction_917E912A45312630914DA49CB16FF351' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern4) == 0x0007A8, "Member 'AProjectile_Bubble_C::Pattern4' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern3_NewTrack_0_6FFF888F4CF7B9842964E7853200DA3D) == 0x0007B0, "Member 'AProjectile_Bubble_C::Pattern3_NewTrack_0_6FFF888F4CF7B9842964E7853200DA3D' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern3__Direction_6FFF888F4CF7B9842964E7853200DA3D) == 0x0007B4, "Member 'AProjectile_Bubble_C::Pattern3__Direction_6FFF888F4CF7B9842964E7853200DA3D' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern3) == 0x0007B8, "Member 'AProjectile_Bubble_C::Pattern3' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, GravityScale_NewTrack_0_30FEE2454B3C85D7F663B4BDBB46EF8E) == 0x0007C0, "Member 'AProjectile_Bubble_C::GravityScale_NewTrack_0_30FEE2454B3C85D7F663B4BDBB46EF8E' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, GravityScale__Direction_30FEE2454B3C85D7F663B4BDBB46EF8E) == 0x0007C4, "Member 'AProjectile_Bubble_C::GravityScale__Direction_30FEE2454B3C85D7F663B4BDBB46EF8E' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, GravityScale) == 0x0007C8, "Member 'AProjectile_Bubble_C::GravityScale' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern2_NewTrack_0_32AA288C4B68540B5D4911A940102E19) == 0x0007D0, "Member 'AProjectile_Bubble_C::Pattern2_NewTrack_0_32AA288C4B68540B5D4911A940102E19' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern2__Direction_32AA288C4B68540B5D4911A940102E19) == 0x0007D4, "Member 'AProjectile_Bubble_C::Pattern2__Direction_32AA288C4B68540B5D4911A940102E19' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern2) == 0x0007D8, "Member 'AProjectile_Bubble_C::Pattern2' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern1_NewTrack_0_9DE1BEE541C665244522D8A3FE3A792A) == 0x0007E0, "Member 'AProjectile_Bubble_C::Pattern1_NewTrack_0_9DE1BEE541C665244522D8A3FE3A792A' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern1__Direction_9DE1BEE541C665244522D8A3FE3A792A) == 0x0007E4, "Member 'AProjectile_Bubble_C::Pattern1__Direction_9DE1BEE541C665244522D8A3FE3A792A' has a wrong offset!");
static_assert(offsetof(AProjectile_Bubble_C, Pattern1) == 0x0007E8, "Member 'AProjectile_Bubble_C::Pattern1' has a wrong offset!");

}

