#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Projectile_BloodyHarvest_Ghost

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.ExecuteUbergraph_Projectile_BloodyHarvest_Ghost
// 0x0260 (0x0260 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit1;                                 // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0098(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver1;        // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser1;          // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ForceInstantSpawn_;             // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AOakCharacter_Player*>           CallFunc_GetAllPlayerCharacters_Characters;        // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0168(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter_Player*                   CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_Player*                   CallFunc_FindFarthestPlayerCharacters_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver;         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Damage;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   K2Node_ComponentBoundEvent_DamageType;             // 0x01A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    K2Node_ComponentBoundEvent_DamageSource;           // 0x01B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_ComponentBoundEvent_InstigatedBy;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_ComponentBoundEvent_Details;                // 0x01C8(0x0058)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0224(0x000C)(IsPlainOldData, NoDestructor)
	class AOakCharacter*                          CallFunc_TryFindNextValidTarget_NewTarget;         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMayhemModeActive_ReturnValue;           // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x023B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue1;                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0258(0x0008)(NoDestructor)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost) == 0x000260, "Wrong size on Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, EntryPoint) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::EntryPoint' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_Event_Hit1) == 0x000008, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_Event_Hit1' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_Event_Hit) == 0x000098, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, Temp_bool_Has_Been_Initd_Variable) == 0x000128, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_ComponentBoundEvent_DamageReceiver1) == 0x000130, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_ComponentBoundEvent_DamageReceiver1' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_ComponentBoundEvent_DamageCauser1) == 0x000138, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_ComponentBoundEvent_DamageCauser1' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_GetOwner_ReturnValue) == 0x000140, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_RandomFloatInRange_ReturnValue) == 0x000148, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_CustomEvent_ForceInstantSpawn_) == 0x00014C, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_CustomEvent_ForceInstantSpawn_' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_Not_PreBool_ReturnValue) == 0x00014D, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, Temp_int_Array_Index_Variable) == 0x000150, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_Array_Add_ReturnValue) == 0x000154, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_GetAllPlayerCharacters_Characters) == 0x000158, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_GetAllPlayerCharacters_Characters' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000168, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_Array_Get_Item) == 0x000178, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_FindFarthestPlayerCharacters_ReturnValue) == 0x000180, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_FindFarthestPlayerCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, Temp_int_Loop_Counter_Variable) == 0x00018C, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_Less_IntInt_ReturnValue) == 0x000190, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_Add_IntInt_ReturnValue) == 0x000194, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_ComponentBoundEvent_DamageReceiver) == 0x000198, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_ComponentBoundEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_ComponentBoundEvent_Damage) == 0x0001A0, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_ComponentBoundEvent_Damage' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_ComponentBoundEvent_DamageType) == 0x0001A8, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_ComponentBoundEvent_DamageType' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_ComponentBoundEvent_DamageSource) == 0x0001B0, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_ComponentBoundEvent_DamageSource' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_ComponentBoundEvent_InstigatedBy) == 0x0001B8, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_ComponentBoundEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_ComponentBoundEvent_DamageCauser) == 0x0001C0, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_ComponentBoundEvent_Details) == 0x0001C8, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_ComponentBoundEvent_Details' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_IsValid_ReturnValue) == 0x000220, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_MakeRotFromX_ReturnValue) == 0x000224, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_TryFindNextValidTarget_NewTarget) == 0x000230, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_TryFindNextValidTarget_NewTarget' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_IsValid_ReturnValue1) == 0x000238, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_ActorHasTag_ReturnValue) == 0x000239, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_IsMayhemModeActive_ReturnValue) == 0x00023A, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_IsMayhemModeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, Temp_bool_IsClosed_Variable) == 0x00023B, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, K2Node_CreateDelegate_OutputDelegate) == 0x000240, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_ActorHasTag_ReturnValue1) == 0x000250, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_ActorHasTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000258, "Member 'Projectile_BloodyHarvest_Ghost_C_ExecuteUbergraph_Projectile_BloodyHarvest_Ghost::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon
// 0x0088 (0x0088 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0030(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon) == 0x000088, "Wrong size on Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon, DamageReceiver) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon, Damage) == 0x000008, "Member 'Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon::Damage' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon, DamageType) == 0x000010, "Member 'Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon::DamageType' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon, DamageSource) == 0x000018, "Member 'Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon::DamageSource' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon, InstigatedBy) == 0x000020, "Member 'Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon, DamageCauser) == 0x000028, "Member 'Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon::DamageCauser' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon, Details) == 0x000030, "Member 'Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_TakeAnyPipelineDamageDelegate__DelegateSignature_DroneProj_TED_TenGallon::Details' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.DoEndSpawnPresentation
// 0x0001 (0x0001 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_DoEndSpawnPresentation final
{
public:
	bool                                          ForceInstantSpawn_;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_DoEndSpawnPresentation) == 0x000001, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_DoEndSpawnPresentation");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_DoEndSpawnPresentation) == 0x000001, "Wrong size on Projectile_BloodyHarvest_Ghost_C_DoEndSpawnPresentation");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoEndSpawnPresentation, ForceInstantSpawn_) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_DoEndSpawnPresentation::ForceInstantSpawn_' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost
// 0x0010 (0x0010 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost) == 0x000010, "Wrong size on Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost, DamageReceiver) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost, DamageCauser) == 0x000008, "Member 'Projectile_BloodyHarvest_Ghost_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_0_DamageCompHealthDepletedDelegate__DelegateSignature_Projectile_BloodyHarvest_Ghost::DamageCauser' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.OnHitWorld
// 0x0090 (0x0090 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_OnHitWorld final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_OnHitWorld) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_OnHitWorld");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_OnHitWorld) == 0x000090, "Wrong size on Projectile_BloodyHarvest_Ghost_C_OnHitWorld");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_OnHitWorld, Hit) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_OnHitWorld::Hit' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.OnHitDamagableObject
// 0x0090 (0x0090 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_OnHitDamagableObject final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_OnHitDamagableObject) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_OnHitDamagableObject");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_OnHitDamagableObject) == 0x000090, "Wrong size on Projectile_BloodyHarvest_Ghost_C_OnHitDamagableObject");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_OnHitDamagableObject, Hit) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_OnHitDamagableObject::Hit' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.DoSpawnInPresentation
// 0x0040 (0x0040 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x0010(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation) == 0x000040, "Wrong size on Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation, CallFunc_PostEventAtLocation_ReturnValue) == 0x000010, "Member 'Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000028, "Member 'Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000038, "Member 'Projectile_BloodyHarvest_Ghost_C_DoSpawnInPresentation::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.InitGhost
// 0x0028 (0x0028 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_InitGhost final
{
public:
	int32                                         NewOwnerLevel;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBalanceStateComponent*                 CallFunc_GetBalanceComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBalanceStateComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGameStage_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_InitGhost) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_InitGhost");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_InitGhost) == 0x000028, "Wrong size on Projectile_BloodyHarvest_Ghost_C_InitGhost");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_InitGhost, NewOwnerLevel) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_InitGhost::NewOwnerLevel' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_InitGhost, CallFunc_GetBalanceComponent_ReturnValue) == 0x000008, "Member 'Projectile_BloodyHarvest_Ghost_C_InitGhost::CallFunc_GetBalanceComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_InitGhost, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Projectile_BloodyHarvest_Ghost_C_InitGhost::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_InitGhost, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'Projectile_BloodyHarvest_Ghost_C_InitGhost::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_InitGhost, CallFunc_GetGameStage_ReturnValue) == 0x000020, "Member 'Projectile_BloodyHarvest_Ghost_C_InitGhost::CallFunc_GetGameStage_ReturnValue' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.DoStartSpawnPresentation
// 0x0040 (0x0040 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation final
{
public:
	bool                                          ForceInstantSpawn_;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x0010(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation) == 0x000040, "Wrong size on Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation, ForceInstantSpawn_) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation::ForceInstantSpawn_' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation, CallFunc_PostEventAtLocation_ReturnValue) == 0x000010, "Member 'Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000028, "Member 'Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000038, "Member 'Projectile_BloodyHarvest_Ghost_C_DoStartSpawnPresentation::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.SpawnLoot
// 0x00F0 (0x00F0 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_SpawnLoot final
{
public:
	TArray<struct FAttributeEffectData>           BHLootAttributeEffects;                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAttributeEffectData>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	struct FSpawnDroppedPickupLootRequest         K2Node_MakeStruct_SpawnDroppedPickupLootRequest;   // 0x0020(0x00B8)(ContainsInstancedReference)
	TArray<class ADroppedInventoryItemPickup*>    CallFunc_SpawnLoot_AllDroppedPickups;              // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_SpawnLootAsync_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_SpawnLoot) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_SpawnLoot");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_SpawnLoot) == 0x0000F0, "Wrong size on Projectile_BloodyHarvest_Ghost_C_SpawnLoot");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_SpawnLoot, BHLootAttributeEffects) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_SpawnLoot::BHLootAttributeEffects' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_SpawnLoot, K2Node_MakeArray_Array) == 0x000010, "Member 'Projectile_BloodyHarvest_Ghost_C_SpawnLoot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_SpawnLoot, K2Node_MakeStruct_SpawnDroppedPickupLootRequest) == 0x000020, "Member 'Projectile_BloodyHarvest_Ghost_C_SpawnLoot::K2Node_MakeStruct_SpawnDroppedPickupLootRequest' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_SpawnLoot, CallFunc_SpawnLoot_AllDroppedPickups) == 0x0000D8, "Member 'Projectile_BloodyHarvest_Ghost_C_SpawnLoot::CallFunc_SpawnLoot_AllDroppedPickups' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_SpawnLoot, CallFunc_SpawnLootAsync_ReturnValue) == 0x0000E8, "Member 'Projectile_BloodyHarvest_Ghost_C_SpawnLoot::CallFunc_SpawnLootAsync_ReturnValue' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.TrySecondWind
// 0x0040 (0x0040 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_TrySecondWind final
{
public:
	class AOakCharacter_Player*                   NewAlly;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_Player*                   K2Node_DynamicCast_AsOak_Character_Player;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPFightForYourLifeComponent_C*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_TrySecondWind");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind) == 0x000040, "Wrong size on Projectile_BloodyHarvest_Ghost_C_TrySecondWind");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, NewAlly) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::NewAlly' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, CallFunc_Array_Get_Item) == 0x000018, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, K2Node_DynamicCast_AsOak_Character_Player) == 0x000020, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::K2Node_DynamicCast_AsOak_Character_Player' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TrySecondWind, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'Projectile_BloodyHarvest_Ghost_C_TrySecondWind::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.CauseDamageGhost
// 0x00A0 (0x00A0 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost final
{
public:
	struct FHitResult                             Temp_struct_Variable;                              // 0x0000(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost) == 0x0000A0, "Wrong size on Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost, Temp_struct_Variable) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000090, "Member 'Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000094, "Member 'Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000098, "Member 'Projectile_BloodyHarvest_Ghost_C_CauseDamageGhost::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function Projectile_BloodyHarvest_Ghost.Projectile_BloodyHarvest_Ghost_C.TryFindNextValidTarget
// 0x0070 (0x0070 - 0x0000)
struct Projectile_BloodyHarvest_Ghost_C_TryFindNextValidTarget final
{
public:
	class AOakCharacter*                          SourcePlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          NewTarget;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter_Player*                   K2Node_DynamicCast_AsOak_Character_Player;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakPlayerAbilityAllyQuerySpec         K2Node_MakeStruct_OakPlayerAbilityAllyQuerySpec;   // 0x0028(0x0010)(NoDestructor)
	struct FOakPlayerAbilityAllyQueryResult       CallFunc_QueryAllies_ReturnValue;                  // 0x0038(0x0020)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter_Player*                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Projectile_BloodyHarvest_Ghost_C_TryFindNextValidTarget) == 0x000008, "Wrong alignment on Projectile_BloodyHarvest_Ghost_C_TryFindNextValidTarget");
static_assert(sizeof(Projectile_BloodyHarvest_Ghost_C_TryFindNextValidTarget) == 0x000070, "Wrong size on Projectile_BloodyHarvest_Ghost_C_TryFindNextValidTarget");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TryFindNextValidTarget, SourcePlayer) == 0x000000, "Member 'Projectile_BloodyHarvest_Ghost_C_TryFindNextValidTarget::SourcePlayer' has a wrong offset!");
static_assert(offsetof(Projectile_BloodyHarvest_Ghost_C_TryFindNextValidTarget, NewTarget) == 0x000008, "Member 'Projectile_BloodyHarvest_Ghost_C_TryFindNextValidTarget::NewTarget' has a wrong offset!");
