#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_COV_Explosive_Grenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Proj_COV_Explosive_Grenade.Proj_COV_Explosive_Grenade_C.ExecuteUbergraph_Proj_COV_Explosive_Grenade
// 0x02A0 (0x02A0 - 0x0000)
struct Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_ImpactVelocity;                       // 0x0098(0x000C)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x00D0(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             Temp_struct_Variable;                              // 0x0160(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x01F0(0x0018)()
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0208(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade) == 0x000008, "Wrong alignment on Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade");
static_assert(sizeof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade) == 0x0002A0, "Wrong size on Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, EntryPoint) == 0x000000, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, K2Node_Event_Hit) == 0x000008, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, K2Node_Event_ImpactVelocity) == 0x000098, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::K2Node_Event_ImpactVelocity' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, K2Node_ComponentBoundEvent_HitComponent) == 0x0000A8, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, K2Node_ComponentBoundEvent_OtherActor) == 0x0000B0, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, K2Node_ComponentBoundEvent_OtherComp) == 0x0000B8, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0000C0, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, K2Node_ComponentBoundEvent_Hit) == 0x0000D0, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, Temp_struct_Variable) == 0x000160, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, CallFunc_PostWwiseEvent_ReturnValue) == 0x0001F0, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, K2Node_ComponentBoundEvent_ImpactResult) == 0x000208, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000298, "Member 'Proj_COV_Explosive_Grenade_C_ExecuteUbergraph_Proj_COV_Explosive_Grenade::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function Proj_COV_Explosive_Grenade.Proj_COV_Explosive_Grenade_C.BndEvt__GbxProjectileMovement_K2Node_ComponentBoundEvent_4_OnProjectileStopDelegate__DelegateSignature_Proj_PsychoMale_Shared_ThrownExplosive_Grenade
// 0x0090 (0x0090 - 0x0000)
struct Proj_COV_Explosive_Grenade_C_BndEvt__GbxProjectileMovement_K2Node_ComponentBoundEvent_4_OnProjectileStopDelegate__DelegateSignature_Proj_PsychoMale_Shared_ThrownExplosive_Grenade final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_COV_Explosive_Grenade_C_BndEvt__GbxProjectileMovement_K2Node_ComponentBoundEvent_4_OnProjectileStopDelegate__DelegateSignature_Proj_PsychoMale_Shared_ThrownExplosive_Grenade) == 0x000008, "Wrong alignment on Proj_COV_Explosive_Grenade_C_BndEvt__GbxProjectileMovement_K2Node_ComponentBoundEvent_4_OnProjectileStopDelegate__DelegateSignature_Proj_PsychoMale_Shared_ThrownExplosive_Grenade");
static_assert(sizeof(Proj_COV_Explosive_Grenade_C_BndEvt__GbxProjectileMovement_K2Node_ComponentBoundEvent_4_OnProjectileStopDelegate__DelegateSignature_Proj_PsychoMale_Shared_ThrownExplosive_Grenade) == 0x000090, "Wrong size on Proj_COV_Explosive_Grenade_C_BndEvt__GbxProjectileMovement_K2Node_ComponentBoundEvent_4_OnProjectileStopDelegate__DelegateSignature_Proj_PsychoMale_Shared_ThrownExplosive_Grenade");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_BndEvt__GbxProjectileMovement_K2Node_ComponentBoundEvent_4_OnProjectileStopDelegate__DelegateSignature_Proj_PsychoMale_Shared_ThrownExplosive_Grenade, ImpactResult) == 0x000000, "Member 'Proj_COV_Explosive_Grenade_C_BndEvt__GbxProjectileMovement_K2Node_ComponentBoundEvent_4_OnProjectileStopDelegate__DelegateSignature_Proj_PsychoMale_Shared_ThrownExplosive_Grenade::ImpactResult' has a wrong offset!");

// Function Proj_COV_Explosive_Grenade.Proj_COV_Explosive_Grenade_C.BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov
// 0x00B8 (0x00B8 - 0x0000)
struct Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit;                                               // 0x0028(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov) == 0x000008, "Wrong alignment on Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov");
static_assert(sizeof(Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov) == 0x0000B8, "Wrong size on Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov, HitComponent) == 0x000000, "Member 'Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov::HitComponent' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov, OtherActor) == 0x000008, "Member 'Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov::OtherActor' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov, OtherComp) == 0x000010, "Member 'Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov::OtherComp' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov, NormalImpulse) == 0x000018, "Member 'Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov, Hit) == 0x000028, "Member 'Proj_COV_Explosive_Grenade_C_BndEvt__MolotovMesh_K2Node_ComponentBoundEvent_5_ComponentHitSignature__DelegateSignature_Proj_PsychoMale_Shared_Molotov::Hit' has a wrong offset!");

// Function Proj_COV_Explosive_Grenade.Proj_COV_Explosive_Grenade_C.OnBounce
// 0x00A0 (0x00A0 - 0x0000)
struct Proj_COV_Explosive_Grenade_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x0090(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_COV_Explosive_Grenade_C_OnBounce) == 0x000008, "Wrong alignment on Proj_COV_Explosive_Grenade_C_OnBounce");
static_assert(sizeof(Proj_COV_Explosive_Grenade_C_OnBounce) == 0x0000A0, "Wrong size on Proj_COV_Explosive_Grenade_C_OnBounce");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_OnBounce, Hit) == 0x000000, "Member 'Proj_COV_Explosive_Grenade_C_OnBounce::Hit' has a wrong offset!");
static_assert(offsetof(Proj_COV_Explosive_Grenade_C_OnBounce, ImpactVelocity) == 0x000090, "Member 'Proj_COV_Explosive_Grenade_C_OnBounce::ImpactVelocity' has a wrong offset!");

}

