#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Trooper_Shield

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Proj_AIShield_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_Trooper_Shield.Proj_Trooper_Shield_C
// 0x0020 (0x0738 - 0x0718)
class AProj_Trooper_Shield_C final : public AProj_AIShield_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Proj_Trooper_Shield_C;              // 0x0718(0x0008)(Transient, DuplicateTransient)
	class UWwiseAudioComponent*                   WwiseAudio;                                        // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakDamageComponent*                    OakDamage;                                         // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_Trooper_Shield(int32 EntryPoint);
	void OnHitWorld(const struct FHitResult& Hit);
	void HNT_Drop();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_Trooper_Shield_C">();
	}
	static class AProj_Trooper_Shield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_Trooper_Shield_C>();
	}
};
static_assert(alignof(AProj_Trooper_Shield_C) == 0x000008, "Wrong alignment on AProj_Trooper_Shield_C");
static_assert(sizeof(AProj_Trooper_Shield_C) == 0x000738, "Wrong size on AProj_Trooper_Shield_C");
static_assert(offsetof(AProj_Trooper_Shield_C, UberGraphFrame_Proj_Trooper_Shield_C) == 0x000718, "Member 'AProj_Trooper_Shield_C::UberGraphFrame_Proj_Trooper_Shield_C' has a wrong offset!");
static_assert(offsetof(AProj_Trooper_Shield_C, WwiseAudio) == 0x000720, "Member 'AProj_Trooper_Shield_C::WwiseAudio' has a wrong offset!");
static_assert(offsetof(AProj_Trooper_Shield_C, PointLight) == 0x000728, "Member 'AProj_Trooper_Shield_C::PointLight' has a wrong offset!");
static_assert(offsetof(AProj_Trooper_Shield_C, OakDamage) == 0x000730, "Member 'AProj_Trooper_Shield_C::OakDamage' has a wrong offset!");

}

