#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_HOTSpring

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Proj_Weapon_BaseProjectile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_HOTSpring.Proj_HOTSpring_C
// 0x0020 (0x07B0 - 0x0790)
class AProj_HOTSpring_C final : public AProj_Weapon_BaseProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Proj_HOTSpring_C;                   // 0x0790(0x0008)(Transient, DuplicateTransient)
	class UWwiseAudioComponent*                   WwiseAudio;                                        // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_HealAura;                                       // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               TracerTrailFX;                                     // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_HOTSpring(int32 EntryPoint);
	void OnHitWorld(const struct FHitResult& Hit);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void CustomEvent();
	void OnExplode();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_HOTSpring_C">();
	}
	static class AProj_HOTSpring_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_HOTSpring_C>();
	}
};
static_assert(alignof(AProj_HOTSpring_C) == 0x000008, "Wrong alignment on AProj_HOTSpring_C");
static_assert(sizeof(AProj_HOTSpring_C) == 0x0007B0, "Wrong size on AProj_HOTSpring_C");
static_assert(offsetof(AProj_HOTSpring_C, UberGraphFrame_Proj_HOTSpring_C) == 0x000790, "Member 'AProj_HOTSpring_C::UberGraphFrame_Proj_HOTSpring_C' has a wrong offset!");
static_assert(offsetof(AProj_HOTSpring_C, WwiseAudio) == 0x000798, "Member 'AProj_HOTSpring_C::WwiseAudio' has a wrong offset!");
static_assert(offsetof(AProj_HOTSpring_C, PS_HealAura) == 0x0007A0, "Member 'AProj_HOTSpring_C::PS_HealAura' has a wrong offset!");
static_assert(offsetof(AProj_HOTSpring_C, TracerTrailFX) == 0x0007A8, "Member 'AProj_HOTSpring_C::TracerTrailFX' has a wrong offset!");

}

