#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_HeavyShared_Bomb

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Proj_HeavyShared_Bomb.Proj_HeavyShared_Bomb_C.ExecuteUbergraph_Proj_HeavyShared_Bomb
// 0x05C0 (0x05C0 - 0x0000)
struct Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TransformSplat_SplatTransform;            // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Actor1;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InstanceIndex1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InstanceIndex;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Actor, int32 InstanceIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Actor, int32 InstanceIndex)> K2Node_CreateDelegate_OutputDelegate1;             // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0120(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseEvent*                            CallFunc_Map_Find_Value;                           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USplatData*                       CallFunc_Map_Find_Value1;                          // 0x0368(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue1;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Map_Find_Value2;                          // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue2;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue;     // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            CallFunc_Map_Find_Value3;                          // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue3;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x03A0(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseEvent*                            CallFunc_Map_Find_Value4;                          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue4;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x03D8(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x03F0(0x0018)()
	struct FHitResult                             K2Node_Event_Hit2;                                 // 0x0408(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit1;                                 // 0x0498(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0528(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb) == 0x000010, "Wrong alignment on Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb");
static_assert(sizeof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb) == 0x0005C0, "Wrong size on Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, EntryPoint) == 0x000000, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, Temp_struct_Variable) == 0x000008, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_TransformSplat_SplatTransform) == 0x0000A0, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_TransformSplat_SplatTransform' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_CustomEvent_Actor1) == 0x0000D0, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_CustomEvent_Actor1' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_CustomEvent_InstanceIndex1) == 0x0000D8, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_CustomEvent_InstanceIndex1' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_CustomEvent_Actor) == 0x0000E0, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_CustomEvent_InstanceIndex) == 0x0000E8, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_CustomEvent_InstanceIndex' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, Temp_bool_Has_Been_Initd_Variable) == 0x0000EC, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_HasAuthority_ReturnValue) == 0x000100, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_HasAuthority_ReturnValue1) == 0x000101, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_CreateDelegate_OutputDelegate1) == 0x000108, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000120, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_SpawnActorAsync_ReturnValue) == 0x000350, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_Value) == 0x000358, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_ReturnValue) == 0x000360, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_Value1) == 0x000368, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_Value1' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_ReturnValue1) == 0x000370, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_Value2) == 0x000378, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_Value2' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_ReturnValue2) == 0x000380, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, Temp_bool_IsClosed_Variable) == 0x000381, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_GetDefaultWwiseComponent_ReturnValue) == 0x000388, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_GetDefaultWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_Value3) == 0x000390, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_Value3' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_ReturnValue3) == 0x000398, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_PostWwiseEvent_ReturnValue) == 0x0003A0, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003B8, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_Value4) == 0x0003C8, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_Value4' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_Map_Find_ReturnValue4) == 0x0003D0, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_Map_Find_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_PostEventAtLocation_ReturnValue) == 0x0003D8, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, CallFunc_PostWwiseEvent_ReturnValue1) == 0x0003F0, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_Event_Hit2) == 0x000408, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_Event_Hit2' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_Event_Hit1) == 0x000498, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_Event_Hit1' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb, K2Node_Event_Hit) == 0x000528, "Member 'Proj_HeavyShared_Bomb_C_ExecuteUbergraph_Proj_HeavyShared_Bomb::K2Node_Event_Hit' has a wrong offset!");

// Function Proj_HeavyShared_Bomb.Proj_HeavyShared_Bomb_C.OnHitEnemy
// 0x0090 (0x0090 - 0x0000)
struct Proj_HeavyShared_Bomb_C_OnHitEnemy final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_HeavyShared_Bomb_C_OnHitEnemy) == 0x000008, "Wrong alignment on Proj_HeavyShared_Bomb_C_OnHitEnemy");
static_assert(sizeof(Proj_HeavyShared_Bomb_C_OnHitEnemy) == 0x000090, "Wrong size on Proj_HeavyShared_Bomb_C_OnHitEnemy");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_OnHitEnemy, Hit) == 0x000000, "Member 'Proj_HeavyShared_Bomb_C_OnHitEnemy::Hit' has a wrong offset!");

// Function Proj_HeavyShared_Bomb.Proj_HeavyShared_Bomb_C.OnHitDamagableObject
// 0x0090 (0x0090 - 0x0000)
struct Proj_HeavyShared_Bomb_C_OnHitDamagableObject final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_HeavyShared_Bomb_C_OnHitDamagableObject) == 0x000008, "Wrong alignment on Proj_HeavyShared_Bomb_C_OnHitDamagableObject");
static_assert(sizeof(Proj_HeavyShared_Bomb_C_OnHitDamagableObject) == 0x000090, "Wrong size on Proj_HeavyShared_Bomb_C_OnHitDamagableObject");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_OnHitDamagableObject, Hit) == 0x000000, "Member 'Proj_HeavyShared_Bomb_C_OnHitDamagableObject::Hit' has a wrong offset!");

// Function Proj_HeavyShared_Bomb.Proj_HeavyShared_Bomb_C.OnHitWorld
// 0x0090 (0x0090 - 0x0000)
struct Proj_HeavyShared_Bomb_C_OnHitWorld final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_HeavyShared_Bomb_C_OnHitWorld) == 0x000008, "Wrong alignment on Proj_HeavyShared_Bomb_C_OnHitWorld");
static_assert(sizeof(Proj_HeavyShared_Bomb_C_OnHitWorld) == 0x000090, "Wrong size on Proj_HeavyShared_Bomb_C_OnHitWorld");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_OnHitWorld, Hit) == 0x000000, "Member 'Proj_HeavyShared_Bomb_C_OnHitWorld::Hit' has a wrong offset!");

// Function Proj_HeavyShared_Bomb.Proj_HeavyShared_Bomb_C.GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45
// 0x0010 (0x0010 - 0x0000)
struct Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45 final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InstanceIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45) == 0x000008, "Wrong alignment on Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45");
static_assert(sizeof(Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45) == 0x000010, "Wrong size on Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45, Actor) == 0x000000, "Member 'Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45::Actor' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45, InstanceIndex) == 0x000008, "Member 'Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Spawned_89670D364599A8041F57B796F202DE45::InstanceIndex' has a wrong offset!");

// Function Proj_HeavyShared_Bomb.Proj_HeavyShared_Bomb_C.GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45
// 0x0010 (0x0010 - 0x0000)
struct Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45 final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InstanceIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45) == 0x000008, "Wrong alignment on Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45");
static_assert(sizeof(Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45) == 0x000010, "Wrong size on Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45, Actor) == 0x000000, "Member 'Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45::Actor' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45, InstanceIndex) == 0x000008, "Member 'Proj_HeavyShared_Bomb_C_GbxAsyncRequest_Failed_89670D364599A8041F57B796F202DE45::InstanceIndex' has a wrong offset!");

// Function Proj_HeavyShared_Bomb.Proj_HeavyShared_Bomb_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct Proj_HeavyShared_Bomb_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_HeavyShared_Bomb_C_UserConstructionScript) == 0x000001, "Wrong alignment on Proj_HeavyShared_Bomb_C_UserConstructionScript");
static_assert(sizeof(Proj_HeavyShared_Bomb_C_UserConstructionScript) == 0x000001, "Wrong size on Proj_HeavyShared_Bomb_C_UserConstructionScript");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_UserConstructionScript, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'Proj_HeavyShared_Bomb_C_UserConstructionScript::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Proj_HeavyShared_Bomb.Proj_HeavyShared_Bomb_C.InitProjetileByElement
// 0x0028 (0x0028 - 0x0000)
struct Proj_HeavyShared_Bomb_C_InitProjetileByElement final
{
public:
	TScriptInterface<class IBPI_HeavyShared_C>    K2Node_DynamicCast_AsBPI_Heavy_Shared;             // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOakElementalType                             CallFunc_Heavy_GetElementalMode_ElementalMode;     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_HeavyShared_Bomb_C_InitProjetileByElement) == 0x000008, "Wrong alignment on Proj_HeavyShared_Bomb_C_InitProjetileByElement");
static_assert(sizeof(Proj_HeavyShared_Bomb_C_InitProjetileByElement) == 0x000028, "Wrong size on Proj_HeavyShared_Bomb_C_InitProjetileByElement");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_InitProjetileByElement, K2Node_DynamicCast_AsBPI_Heavy_Shared) == 0x000000, "Member 'Proj_HeavyShared_Bomb_C_InitProjetileByElement::K2Node_DynamicCast_AsBPI_Heavy_Shared' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_InitProjetileByElement, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Proj_HeavyShared_Bomb_C_InitProjetileByElement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_InitProjetileByElement, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000011, "Member 'Proj_HeavyShared_Bomb_C_InitProjetileByElement::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_InitProjetileByElement, CallFunc_Heavy_GetElementalMode_ElementalMode) == 0x000012, "Member 'Proj_HeavyShared_Bomb_C_InitProjetileByElement::CallFunc_Heavy_GetElementalMode_ElementalMode' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_InitProjetileByElement, CallFunc_Map_Find_Value) == 0x000018, "Member 'Proj_HeavyShared_Bomb_C_InitProjetileByElement::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Proj_HeavyShared_Bomb_C_InitProjetileByElement, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'Proj_HeavyShared_Bomb_C_InitProjetileByElement::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

