#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_ATL_HW_PodRocket_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Proj_Weapon_BaseProjectile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_ATL_HW_PodRocket_Master.Proj_ATL_HW_PodRocket_Master_C
// 0x0040 (0x07D0 - 0x0790)
class AProj_ATL_HW_PodRocket_Master_C : public AProj_Weapon_BaseProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Proj_ATL_HW_PodRocket_Master_C;     // 0x0790(0x0008)(Transient, DuplicateTransient)
	class UWwiseAudioComponent*                   WwiseAudio;                                        // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Homing_Lock;                                       // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDrunkenRandomMovementComponent*        DrunkenRandomMovement;                             // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileHomingComponent*             ProjectileHoming;                                  // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Trail;                                             // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABPWeap_ATL_BaseWeapon_C*               ATL_BaseWeapon;                                    // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TargetBeam;                                        // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_ATL_HW_PodRocket_Master(int32 EntryPoint);
	void RetyHoming();
	void TargetLockBeam(class AActor* HomingTarget);
	void OnExplode();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void ProjectileDetonate(bool* Success);
	void ProjectileArm(bool* Success);
	void ProjectileDisarm(bool* Success);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_ATL_HW_PodRocket_Master_C">();
	}
	static class AProj_ATL_HW_PodRocket_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_ATL_HW_PodRocket_Master_C>();
	}
};
static_assert(alignof(AProj_ATL_HW_PodRocket_Master_C) == 0x000008, "Wrong alignment on AProj_ATL_HW_PodRocket_Master_C");
static_assert(sizeof(AProj_ATL_HW_PodRocket_Master_C) == 0x0007D0, "Wrong size on AProj_ATL_HW_PodRocket_Master_C");
static_assert(offsetof(AProj_ATL_HW_PodRocket_Master_C, UberGraphFrame_Proj_ATL_HW_PodRocket_Master_C) == 0x000790, "Member 'AProj_ATL_HW_PodRocket_Master_C::UberGraphFrame_Proj_ATL_HW_PodRocket_Master_C' has a wrong offset!");
static_assert(offsetof(AProj_ATL_HW_PodRocket_Master_C, WwiseAudio) == 0x000798, "Member 'AProj_ATL_HW_PodRocket_Master_C::WwiseAudio' has a wrong offset!");
static_assert(offsetof(AProj_ATL_HW_PodRocket_Master_C, Homing_Lock) == 0x0007A0, "Member 'AProj_ATL_HW_PodRocket_Master_C::Homing_Lock' has a wrong offset!");
static_assert(offsetof(AProj_ATL_HW_PodRocket_Master_C, DrunkenRandomMovement) == 0x0007A8, "Member 'AProj_ATL_HW_PodRocket_Master_C::DrunkenRandomMovement' has a wrong offset!");
static_assert(offsetof(AProj_ATL_HW_PodRocket_Master_C, ProjectileHoming) == 0x0007B0, "Member 'AProj_ATL_HW_PodRocket_Master_C::ProjectileHoming' has a wrong offset!");
static_assert(offsetof(AProj_ATL_HW_PodRocket_Master_C, Trail) == 0x0007B8, "Member 'AProj_ATL_HW_PodRocket_Master_C::Trail' has a wrong offset!");
static_assert(offsetof(AProj_ATL_HW_PodRocket_Master_C, ATL_BaseWeapon) == 0x0007C0, "Member 'AProj_ATL_HW_PodRocket_Master_C::ATL_BaseWeapon' has a wrong offset!");
static_assert(offsetof(AProj_ATL_HW_PodRocket_Master_C, TargetBeam) == 0x0007C8, "Member 'AProj_ATL_HW_PodRocket_Master_C::TargetBeam' has a wrong offset!");

}

