#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Projectile_FalconStrikeNuke

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Projectile_FalconStrikeNuke.Projectile_FalconStrikeNuke_C.ExecuteUbergraph_Projectile_FalconStrikeNuke
// 0x04D8 (0x04D8 - 0x0000)
struct Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FHitResult& Result)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             K2Node_CustomEvent_Result1;                        // 0x0018(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             Temp_struct_Variable;                              // 0x00A8(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_CustomEvent_Result;                         // 0x0138(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0230(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x023C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0248(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle1;           // 0x0268(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue1; // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCauseDamageStatusEffectOverrides      K2Node_MakeStruct_CauseDamageStatusEffectOverrides; // 0x0284(0x001C)(NoDestructor)
	TDelegate<void(struct FHitResult& Result)>    K2Node_CreateDelegate_OutputDelegate1;             // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionUnitVector_ReturnValue;       // 0x02C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02CC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x02D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x02E8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x02F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0300(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateAttributeInitializer_ReturnValue; // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable1;                             // 0x0338(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x03C8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGbxTraceAsyncRequest                  K2Node_MakeStruct_GbxTraceAsyncRequest;            // 0x03D8(0x00B0)(ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x0488(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue;     // 0x0498(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x04A0(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x04B8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke) == 0x000008, "Wrong alignment on Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke");
static_assert(sizeof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke) == 0x0004D8, "Wrong size on Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, EntryPoint) == 0x000000, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::EntryPoint' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, K2Node_CustomEvent_Result1) == 0x000018, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::K2Node_CustomEvent_Result1' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, Temp_struct_Variable) == 0x0000A8, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, K2Node_CustomEvent_Result) == 0x000138, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_bBlockingHit) == 0x0001C8, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001C9, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_Time) == 0x0001CC, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_Distance) == 0x0001D0, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_Location) == 0x0001D4, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_ImpactPoint) == 0x0001E0, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_Normal) == 0x0001EC, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F8, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_PhysMat) == 0x000208, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_HitActor) == 0x000210, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_HitComponent) == 0x000218, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_HitBoneName) == 0x000220, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_FaceIndex) == 0x00022C, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_TraceStart) == 0x000230, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_BreakHitResult_TraceEnd) == 0x00023C, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, K2Node_MakeStruct_DataTableValueHandle) == 0x000248, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000260, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000264, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, K2Node_MakeStruct_DataTableValueHandle1) == 0x000268, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::K2Node_MakeStruct_DataTableValueHandle1' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_GetDataTableValueFromHandle_ReturnValue1) == 0x000280, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_GetDataTableValueFromHandle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, K2Node_MakeStruct_CauseDamageStatusEffectOverrides) == 0x000284, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::K2Node_MakeStruct_CauseDamageStatusEffectOverrides' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, K2Node_CreateDelegate_OutputDelegate1) == 0x0002A0, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_HasAuthority_ReturnValue) == 0x0002B0, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002B4, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_GetDirectionUnitVector_ReturnValue) == 0x0002C0, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_GetDirectionUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002CC, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0002D8, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0002E4, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_Normal_ReturnValue) == 0x0002E8, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_Multiply_VectorFloat_ReturnValue1) == 0x0002F4, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_Multiply_VectorFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_Add_VectorVector_ReturnValue) == 0x000300, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_GetOwner_ReturnValue) == 0x000310, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_GetOwner_ReturnValue1) == 0x000318, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_HasAuthority_ReturnValue1) == 0x000320, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_EvaluateAttributeInitializer_ReturnValue) == 0x000324, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_EvaluateAttributeInitializer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_GetOwner_ReturnValue2) == 0x000328, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_GetInstigator_ReturnValue) == 0x000330, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, Temp_struct_Variable1) == 0x000338, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, K2Node_MakeArray_Array) == 0x0003C8, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, K2Node_MakeStruct_GbxTraceAsyncRequest) == 0x0003D8, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::K2Node_MakeStruct_GbxTraceAsyncRequest' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x000488, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_GetDefaultWwiseComponent_ReturnValue) == 0x000498, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_GetDefaultWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_PostEventAtLocation_ReturnValue) == 0x0004A0, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_PostWwiseEvent_ReturnValue) == 0x0004B8, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke, CallFunc_IsValid_ReturnValue) == 0x0004D0, "Member 'Projectile_FalconStrikeNuke_C_ExecuteUbergraph_Projectile_FalconStrikeNuke::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Projectile_FalconStrikeNuke.Projectile_FalconStrikeNuke_C.GbxAsyncRequest_Hit_FB153E514BCFA0D9652350A562778064
// 0x0090 (0x0090 - 0x0000)
struct Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Hit_FB153E514BCFA0D9652350A562778064 final
{
public:
	struct FHitResult                             Result;                                            // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Hit_FB153E514BCFA0D9652350A562778064) == 0x000008, "Wrong alignment on Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Hit_FB153E514BCFA0D9652350A562778064");
static_assert(sizeof(Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Hit_FB153E514BCFA0D9652350A562778064) == 0x000090, "Wrong size on Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Hit_FB153E514BCFA0D9652350A562778064");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Hit_FB153E514BCFA0D9652350A562778064, Result) == 0x000000, "Member 'Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Hit_FB153E514BCFA0D9652350A562778064::Result' has a wrong offset!");

// Function Projectile_FalconStrikeNuke.Projectile_FalconStrikeNuke_C.GbxAsyncRequest_Miss_FB153E514BCFA0D9652350A562778064
// 0x0090 (0x0090 - 0x0000)
struct Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Miss_FB153E514BCFA0D9652350A562778064 final
{
public:
	struct FHitResult                             Result;                                            // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Miss_FB153E514BCFA0D9652350A562778064) == 0x000008, "Wrong alignment on Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Miss_FB153E514BCFA0D9652350A562778064");
static_assert(sizeof(Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Miss_FB153E514BCFA0D9652350A562778064) == 0x000090, "Wrong size on Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Miss_FB153E514BCFA0D9652350A562778064");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Miss_FB153E514BCFA0D9652350A562778064, Result) == 0x000000, "Member 'Projectile_FalconStrikeNuke_C_GbxAsyncRequest_Miss_FB153E514BCFA0D9652350A562778064::Result' has a wrong offset!");

// Function Projectile_FalconStrikeNuke.Projectile_FalconStrikeNuke_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct Projectile_FalconStrikeNuke_C_UserConstructionScript final
{
public:
	bool                                          NewVerticalFireHeight;                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Projectile_FalconStrikeNuke_C_UserConstructionScript) == 0x000001, "Wrong alignment on Projectile_FalconStrikeNuke_C_UserConstructionScript");
static_assert(sizeof(Projectile_FalconStrikeNuke_C_UserConstructionScript) == 0x000001, "Wrong size on Projectile_FalconStrikeNuke_C_UserConstructionScript");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_UserConstructionScript, NewVerticalFireHeight) == 0x000000, "Member 'Projectile_FalconStrikeNuke_C_UserConstructionScript::NewVerticalFireHeight' has a wrong offset!");

// Function Projectile_FalconStrikeNuke.Projectile_FalconStrikeNuke_C.InitMissile
// 0x0018 (0x0018 - 0x0000)
struct Projectile_FalconStrikeNuke_C_InitMissile final
{
public:
	bool                                          NewVerticalFireHeight;                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValue_OutValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableValue_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Projectile_FalconStrikeNuke_C_InitMissile) == 0x000008, "Wrong alignment on Projectile_FalconStrikeNuke_C_InitMissile");
static_assert(sizeof(Projectile_FalconStrikeNuke_C_InitMissile) == 0x000018, "Wrong size on Projectile_FalconStrikeNuke_C_InitMissile");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_InitMissile, NewVerticalFireHeight) == 0x000000, "Member 'Projectile_FalconStrikeNuke_C_InitMissile::NewVerticalFireHeight' has a wrong offset!");
static_assert(offsetof(Projectile_FalconStrikeNuke_C_InitMissile, CallFunc_GetDataTableValue_OutValue) == 0x000004, "Member 'Projectile_FalconStrikeNuke_C_InitMissile::CallFunc_GetDataTableValue_OutValue' has a wrong offset!");
