#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_TOR_SG_Boring_Child

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Proj_TOR_SG_Boring_Child.Proj_TOR_SG_Boring_Child_C.ExecuteUbergraph_Proj_TOR_SG_Boring_Child
// 0x0310 (0x0310 - 0x0000)
struct Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FForceSelection                        CallFunc_Conv_FloatToForceSelection_ReturnValue;   // 0x00A8(0x0020)(NoDestructor)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult2;          // 0x00C8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult1;          // 0x0158(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x01E8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0278(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child");
static_assert(sizeof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child) == 0x000310, "Wrong size on Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, EntryPoint) == 0x000000, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, Temp_struct_Variable) == 0x000008, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue) == 0x000098, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::CallFunc_Conv_GbxAttributeFloatToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00009C, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, CallFunc_Conv_FloatToForceSelection_ReturnValue) == 0x0000A8, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::CallFunc_Conv_FloatToForceSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, K2Node_ComponentBoundEvent_ImpactResult2) == 0x0000C8, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::K2Node_ComponentBoundEvent_ImpactResult2' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, K2Node_ComponentBoundEvent_ImpactResult1) == 0x000158, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::K2Node_ComponentBoundEvent_ImpactResult1' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, K2Node_ComponentBoundEvent_ImpactResult) == 0x0001E8, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, K2Node_Event_Hit) == 0x000278, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000308, "Member 'Proj_TOR_SG_Boring_Child_C_ExecuteUbergraph_Proj_TOR_SG_Boring_Child::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

// Function Proj_TOR_SG_Boring_Child.Proj_TOR_SG_Boring_Child_C.BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child
// 0x0090 (0x0090 - 0x0000)
struct Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child");
static_assert(sizeof(Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child) == 0x000090, "Wrong size on Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child, ImpactResult) == 0x000000, "Member 'Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_2_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child::ImpactResult' has a wrong offset!");

// Function Proj_TOR_SG_Boring_Child.Proj_TOR_SG_Boring_Child_C.BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child
// 0x0090 (0x0090 - 0x0000)
struct Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child");
static_assert(sizeof(Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child) == 0x000090, "Wrong size on Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child, ImpactResult) == 0x000000, "Member 'Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_3_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring_Child::ImpactResult' has a wrong offset!");

// Function Proj_TOR_SG_Boring_Child.Proj_TOR_SG_Boring_Child_C.BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_4_OnWalkingProjectileHitUnwalkableSurface__DelegateSignature_Proj_TOR_SG_Boring_Child
// 0x0090 (0x0090 - 0x0000)
struct Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_4_OnWalkingProjectileHitUnwalkableSurface__DelegateSignature_Proj_TOR_SG_Boring_Child final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_4_OnWalkingProjectileHitUnwalkableSurface__DelegateSignature_Proj_TOR_SG_Boring_Child) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_4_OnWalkingProjectileHitUnwalkableSurface__DelegateSignature_Proj_TOR_SG_Boring_Child");
static_assert(sizeof(Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_4_OnWalkingProjectileHitUnwalkableSurface__DelegateSignature_Proj_TOR_SG_Boring_Child) == 0x000090, "Wrong size on Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_4_OnWalkingProjectileHitUnwalkableSurface__DelegateSignature_Proj_TOR_SG_Boring_Child");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_4_OnWalkingProjectileHitUnwalkableSurface__DelegateSignature_Proj_TOR_SG_Boring_Child, ImpactResult) == 0x000000, "Member 'Proj_TOR_SG_Boring_Child_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_4_OnWalkingProjectileHitUnwalkableSurface__DelegateSignature_Proj_TOR_SG_Boring_Child::ImpactResult' has a wrong offset!");

// Function Proj_TOR_SG_Boring_Child.Proj_TOR_SG_Boring_Child_C.OnHitDamagableObject
// 0x0090 (0x0090 - 0x0000)
struct Proj_TOR_SG_Boring_Child_C_OnHitDamagableObject final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_Child_C_OnHitDamagableObject) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_Child_C_OnHitDamagableObject");
static_assert(sizeof(Proj_TOR_SG_Boring_Child_C_OnHitDamagableObject) == 0x000090, "Wrong size on Proj_TOR_SG_Boring_Child_C_OnHitDamagableObject");
static_assert(offsetof(Proj_TOR_SG_Boring_Child_C_OnHitDamagableObject, Hit) == 0x000000, "Member 'Proj_TOR_SG_Boring_Child_C_OnHitDamagableObject::Hit' has a wrong offset!");

}

