#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Weapon_Warmonger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Proj_Weapon_BaseProjectile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Proj_Weapon_Warmonger.Proj_Weapon_Warmonger_C
// 0x0108 (0x0898 - 0x0790)
class AProj_Weapon_Warmonger_C final : public AProj_Weapon_BaseProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Proj_Weapon_Warmonger_C;            // 0x0790(0x0008)(Transient, DuplicateTransient)
	class UDrunkenRandomMovementComponent*        DrunkenRandomMovement;                             // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Trail;                                             // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FEnvQueryParams                        Query;                                             // 0x07A8(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AActor*>                         TargetList;                                        // 0x0860(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 HomingTarget;                                      // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     FireTransforms;                                    // 0x0878(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                EndLocation;                                       // 0x0888(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Proj_Weapon_Warmonger(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Split();
	void SplitVisuals();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proj_Weapon_Warmonger_C">();
	}
	static class AProj_Weapon_Warmonger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProj_Weapon_Warmonger_C>();
	}
};
static_assert(alignof(AProj_Weapon_Warmonger_C) == 0x000008, "Wrong alignment on AProj_Weapon_Warmonger_C");
static_assert(sizeof(AProj_Weapon_Warmonger_C) == 0x000898, "Wrong size on AProj_Weapon_Warmonger_C");
static_assert(offsetof(AProj_Weapon_Warmonger_C, UberGraphFrame_Proj_Weapon_Warmonger_C) == 0x000790, "Member 'AProj_Weapon_Warmonger_C::UberGraphFrame_Proj_Weapon_Warmonger_C' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_Warmonger_C, DrunkenRandomMovement) == 0x000798, "Member 'AProj_Weapon_Warmonger_C::DrunkenRandomMovement' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_Warmonger_C, Trail) == 0x0007A0, "Member 'AProj_Weapon_Warmonger_C::Trail' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_Warmonger_C, Query) == 0x0007A8, "Member 'AProj_Weapon_Warmonger_C::Query' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_Warmonger_C, TargetList) == 0x000860, "Member 'AProj_Weapon_Warmonger_C::TargetList' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_Warmonger_C, HomingTarget) == 0x000870, "Member 'AProj_Weapon_Warmonger_C::HomingTarget' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_Warmonger_C, FireTransforms) == 0x000878, "Member 'AProj_Weapon_Warmonger_C::FireTransforms' has a wrong offset!");
static_assert(offsetof(AProj_Weapon_Warmonger_C, EndLocation) == 0x000888, "Member 'AProj_Weapon_Warmonger_C::EndLocation' has a wrong offset!");

}

