#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Drone_VDayHeart_Corrosive

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function Proj_Drone_VDayHeart_Corrosive.Proj_Drone_VDayHeart_Corrosive_C.ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive
// 0x00A8 (0x00A8 - 0x0000)
struct Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageComponent*                       K2Node_ComponentBoundEvent_DamageReceiver;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 K2Node_ComponentBoundEvent_DamageCauser;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetAssociatedController_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0048(0x0018)(NoDestructor)
	TArray<class AActor*>                         CallFunc_RunEnvQueryForAllActors_ResultActors;     // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_RunEnvQueryForAllActors_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectInstanceReference         CallFunc_TriggerElementalEffect_ReturnValue;       // 0x0088(0x0018)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive) == 0x000008, "Wrong alignment on Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive");
static_assert(sizeof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive) == 0x0000A8, "Wrong size on Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, EntryPoint) == 0x000000, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, K2Node_ComponentBoundEvent_DamageReceiver) == 0x000010, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::K2Node_ComponentBoundEvent_DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, K2Node_ComponentBoundEvent_DamageCauser) == 0x000018, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::K2Node_ComponentBoundEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_GetOwner_ReturnValue1) == 0x000028, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_GetAssociatedController_ReturnValue) == 0x000038, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_GetAssociatedController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000040, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, K2Node_MakeStruct_DataTableValueHandle) == 0x000048, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_RunEnvQueryForAllActors_ResultActors) == 0x000060, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_RunEnvQueryForAllActors_ResultActors' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_RunEnvQueryForAllActors_ReturnValue) == 0x000070, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_RunEnvQueryForAllActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000074, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_Array_Get_Item) == 0x000078, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000080, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_TriggerElementalEffect_ReturnValue) == 0x000088, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_TriggerElementalEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'Proj_Drone_VDayHeart_Corrosive_C_ExecuteUbergraph_Proj_Drone_VDayHeart_Corrosive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Proj_Drone_VDayHeart_Corrosive.Proj_Drone_VDayHeart_Corrosive_C.BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire
// 0x0010 (0x0010 - 0x0000)
struct Proj_Drone_VDayHeart_Corrosive_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Drone_VDayHeart_Corrosive_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire) == 0x000008, "Wrong alignment on Proj_Drone_VDayHeart_Corrosive_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire");
static_assert(sizeof(Proj_Drone_VDayHeart_Corrosive_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire) == 0x000010, "Wrong size on Proj_Drone_VDayHeart_Corrosive_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire, DamageReceiver) == 0x000000, "Member 'Proj_Drone_VDayHeart_Corrosive_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Proj_Drone_VDayHeart_Corrosive_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire, DamageCauser) == 0x000008, "Member 'Proj_Drone_VDayHeart_Corrosive_C_BndEvt__OakDamage_K2Node_ComponentBoundEvent_1_DamageCompHealthDepletedDelegate__DelegateSignature_Proj_Drone_VDayHeart_Fire::DamageCauser' has a wrong offset!");

}

