#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Grenade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Proj_Grenade.Proj_Grenade_C.ExecuteUbergraph_Proj_Grenade
// 0x00B0 (0x00B0 - 0x0000)
struct Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0008(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_ImpactVelocity;                       // 0x0098(0x000C)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00A8(0x0008)(NoDestructor)
};
static_assert(alignof(Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade) == 0x000008, "Wrong alignment on Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade");
static_assert(sizeof(Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade) == 0x0000B0, "Wrong size on Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade");
static_assert(offsetof(Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade, EntryPoint) == 0x000000, "Member 'Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade, K2Node_Event_Hit) == 0x000008, "Member 'Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade, K2Node_Event_ImpactVelocity) == 0x000098, "Member 'Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade::K2Node_Event_ImpactVelocity' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade, CallFunc_K2_SetTimer_ReturnValue) == 0x0000A8, "Member 'Proj_Grenade_C_ExecuteUbergraph_Proj_Grenade::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function Proj_Grenade.Proj_Grenade_C.OnBounce
// 0x00A0 (0x00A0 - 0x0000)
struct Proj_Grenade_C_OnBounce final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x0090(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Grenade_C_OnBounce) == 0x000008, "Wrong alignment on Proj_Grenade_C_OnBounce");
static_assert(sizeof(Proj_Grenade_C_OnBounce) == 0x0000A0, "Wrong size on Proj_Grenade_C_OnBounce");
static_assert(offsetof(Proj_Grenade_C_OnBounce, Hit) == 0x000000, "Member 'Proj_Grenade_C_OnBounce::Hit' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_OnBounce, ImpactVelocity) == 0x000090, "Member 'Proj_Grenade_C_OnBounce::ImpactVelocity' has a wrong offset!");

// Function Proj_Grenade.Proj_Grenade_C.TriggerGrenadeDodge
// 0x0010 (0x0010 - 0x0000)
struct Proj_Grenade_C_TriggerGrenadeDodge final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Grenade_C_TriggerGrenadeDodge) == 0x000004, "Wrong alignment on Proj_Grenade_C_TriggerGrenadeDodge");
static_assert(sizeof(Proj_Grenade_C_TriggerGrenadeDodge) == 0x000010, "Wrong size on Proj_Grenade_C_TriggerGrenadeDodge");
static_assert(offsetof(Proj_Grenade_C_TriggerGrenadeDodge, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'Proj_Grenade_C_TriggerGrenadeDodge::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_TriggerGrenadeDodge, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Proj_Grenade_C_TriggerGrenadeDodge::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function Proj_Grenade.Proj_Grenade_C.AIProjectileDisarm
// 0x0040 (0x0040 - 0x0000)
struct Proj_Grenade_C_AIProjectileDisarm final
{
public:
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GrenadeUsesPayload_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGrenadeHomingComponent*                CallFunc_GetHomingComponent_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue1;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue2;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue3;       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue2;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue4;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_Grenade_C_AIProjectileDisarm) == 0x000008, "Wrong alignment on Proj_Grenade_C_AIProjectileDisarm");
static_assert(sizeof(Proj_Grenade_C_AIProjectileDisarm) == 0x000040, "Wrong size on Proj_Grenade_C_AIProjectileDisarm");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_GetObjectClass_ReturnValue) == 0x000000, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_GrenadeUsesPayload_ReturnValue) == 0x000008, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_GrenadeUsesPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000009, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_GetObjectClass_ReturnValue1) == 0x000010, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_GetObjectClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_GetHomingComponent_ReturnValue) == 0x000018, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_GetHomingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_EqualEqual_ClassClass_ReturnValue1) == 0x000020, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_EqualEqual_ClassClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_EqualEqual_ClassClass_ReturnValue2) == 0x000021, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_EqualEqual_ClassClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_EqualEqual_ClassClass_ReturnValue3) == 0x000022, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_EqualEqual_ClassClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_BooleanOR_ReturnValue1) == 0x000028, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_GetObjectClass_ReturnValue2) == 0x000030, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_GetObjectClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileDisarm, CallFunc_EqualEqual_ClassClass_ReturnValue4) == 0x000038, "Member 'Proj_Grenade_C_AIProjectileDisarm::CallFunc_EqualEqual_ClassClass_ReturnValue4' has a wrong offset!");

// Function Proj_Grenade.Proj_Grenade_C.AIProjectileArm
// 0x0030 (0x0030 - 0x0000)
struct Proj_Grenade_C_AIProjectileArm final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGrenadeHomingComponent*                CallFunc_GetHomingComponent_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue1;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue2;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue3;       // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_Grenade_C_AIProjectileArm) == 0x000008, "Wrong alignment on Proj_Grenade_C_AIProjectileArm");
static_assert(sizeof(Proj_Grenade_C_AIProjectileArm) == 0x000030, "Wrong size on Proj_Grenade_C_AIProjectileArm");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_GetObjectClass_ReturnValue) == 0x000008, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000010, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_GetHomingComponent_ReturnValue) == 0x000018, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_GetHomingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_GetObjectClass_ReturnValue1) == 0x000020, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_GetObjectClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_EqualEqual_ClassClass_ReturnValue1) == 0x000028, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_EqualEqual_ClassClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_EqualEqual_ClassClass_ReturnValue2) == 0x000029, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_EqualEqual_ClassClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_EqualEqual_ClassClass_ReturnValue3) == 0x00002A, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_EqualEqual_ClassClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_BooleanOR_ReturnValue) == 0x00002B, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectileArm, CallFunc_BooleanOR_ReturnValue1) == 0x00002C, "Member 'Proj_Grenade_C_AIProjectileArm::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");

// Function Proj_Grenade.Proj_Grenade_C.AIProjectile_CanBeStolen
// 0x0018 (0x0018 - 0x0000)
struct Proj_Grenade_C_AIProjectile_CanBeStolen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GrenadeUsesPayload_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GrenadeUsesPayload_ReturnValue1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AIProjectile_CanBeStolen_ReturnValue;     // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_Grenade_C_AIProjectile_CanBeStolen) == 0x000008, "Wrong alignment on Proj_Grenade_C_AIProjectile_CanBeStolen");
static_assert(sizeof(Proj_Grenade_C_AIProjectile_CanBeStolen) == 0x000018, "Wrong size on Proj_Grenade_C_AIProjectile_CanBeStolen");
static_assert(offsetof(Proj_Grenade_C_AIProjectile_CanBeStolen, ReturnValue) == 0x000000, "Member 'Proj_Grenade_C_AIProjectile_CanBeStolen::ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectile_CanBeStolen, CallFunc_GrenadeUsesPayload_ReturnValue) == 0x000001, "Member 'Proj_Grenade_C_AIProjectile_CanBeStolen::CallFunc_GrenadeUsesPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectile_CanBeStolen, CallFunc_GetObjectClass_ReturnValue) == 0x000008, "Member 'Proj_Grenade_C_AIProjectile_CanBeStolen::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectile_CanBeStolen, CallFunc_GrenadeUsesPayload_ReturnValue1) == 0x000010, "Member 'Proj_Grenade_C_AIProjectile_CanBeStolen::CallFunc_GrenadeUsesPayload_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectile_CanBeStolen, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000011, "Member 'Proj_Grenade_C_AIProjectile_CanBeStolen::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectile_CanBeStolen, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'Proj_Grenade_C_AIProjectile_CanBeStolen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Grenade_C_AIProjectile_CanBeStolen, CallFunc_AIProjectile_CanBeStolen_ReturnValue) == 0x000013, "Member 'Proj_Grenade_C_AIProjectile_CanBeStolen::CallFunc_AIProjectile_CanBeStolen_ReturnValue' has a wrong offset!");

}

