#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_TOR_SG_Boring

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Proj_TOR_SG_Boring.Proj_TOR_SG_Boring_C.ExecuteUbergraph_Proj_TOR_SG_Boring
// 0x0700 (0x0700 - 0x0000)
struct Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x002C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit2;                                 // 0x0050(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit1;                                 // 0x00E0(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0170(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x020C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0218(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0224(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0230(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0268(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0274(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x0280(0x0018)()
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult1;          // 0x0298(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_Event_ImpactResult;                         // 0x0328(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x03C0(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0464(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnFan_ReturnValue;          // 0x0470(0x0010)(ZeroConstructor, ReferenceParm)
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0480(0x0030)(IsPlainOldData, NoDestructor)
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x04B0(0x0230)(ContainsInstancedReference)
	struct FGbxAttributeFloat                     CallFunc_MakeGbxAttributeFloat_ReturnValue;        // 0x06E0(0x000C)(HasGetValueTypeHash)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring) == 0x000010, "Wrong alignment on Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring");
static_assert(sizeof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring) == 0x000700, "Wrong size on Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, EntryPoint) == 0x000000, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, Temp_bool_Has_Been_Initd_Variable) == 0x000009, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_MyComp) == 0x000010, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_Other) == 0x000018, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_OtherComp) == 0x000020, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_bSelfMoved) == 0x000028, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_HitLocation) == 0x00002C, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_HitNormal) == 0x000038, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_NormalImpulse) == 0x000044, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_Hit2) == 0x000050, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_Hit2' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_Hit1) == 0x0000E0, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_Hit1' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_Hit) == 0x000170, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_bBlockingHit) == 0x000200, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_bInitialOverlap) == 0x000201, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_Time) == 0x000204, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_Distance) == 0x000208, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_Location) == 0x00020C, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_ImpactPoint) == 0x000218, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_Normal) == 0x000224, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_ImpactNormal) == 0x000230, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_PhysMat) == 0x000240, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_HitActor) == 0x000248, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_HitComponent) == 0x000250, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_HitBoneName) == 0x000258, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_HitItem) == 0x000260, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_FaceIndex) == 0x000264, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_TraceStart) == 0x000268, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakHitResult_TraceEnd) == 0x000274, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_PostEventAtLocation_ReturnValue) == 0x000280, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_ComponentBoundEvent_ImpactResult1) == 0x000298, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_ComponentBoundEvent_ImpactResult1' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_Event_ImpactResult) == 0x000328, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_Event_ImpactResult' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_GetOwner_ReturnValue) == 0x0003B8, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_ComponentBoundEvent_ImpactResult) == 0x0003C0, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, Temp_int_Loop_Counter_Variable) == 0x000450, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_Add_IntInt_ReturnValue) == 0x000454, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakVector_X) == 0x000458, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakVector_Y) == 0x00045C, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_BreakVector_Z) == 0x000460, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_MakeVector_ReturnValue) == 0x000464, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_GeneratePointsOnFan_ReturnValue) == 0x000470, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_GeneratePointsOnFan_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_Array_Get_Item) == 0x000480, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x0004B0, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_MakeGbxAttributeFloat_ReturnValue) == 0x0006E0, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_MakeGbxAttributeFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_SpawnActorAsync_ReturnValue) == 0x0006EC, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_Array_Length_ReturnValue) == 0x0006F0, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring, CallFunc_Less_IntInt_ReturnValue) == 0x0006F4, "Member 'Proj_TOR_SG_Boring_C_ExecuteUbergraph_Proj_TOR_SG_Boring::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Proj_TOR_SG_Boring.Proj_TOR_SG_Boring_C.BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring
// 0x0090 (0x0090 - 0x0000)
struct Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring");
static_assert(sizeof(Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring) == 0x000090, "Wrong size on Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring");
static_assert(offsetof(Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring, ImpactResult) == 0x000000, "Member 'Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_1_OnProjectilePostLastBounceDelegate__DelegateSignature_Proj_TOR_SG_Boring::ImpactResult' has a wrong offset!");

// Function Proj_TOR_SG_Boring.Proj_TOR_SG_Boring_C.OnLastBounce
// 0x0090 (0x0090 - 0x0000)
struct Proj_TOR_SG_Boring_C_OnLastBounce final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_C_OnLastBounce) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_C_OnLastBounce");
static_assert(sizeof(Proj_TOR_SG_Boring_C_OnLastBounce) == 0x000090, "Wrong size on Proj_TOR_SG_Boring_C_OnLastBounce");
static_assert(offsetof(Proj_TOR_SG_Boring_C_OnLastBounce, ImpactResult) == 0x000000, "Member 'Proj_TOR_SG_Boring_C_OnLastBounce::ImpactResult' has a wrong offset!");

// Function Proj_TOR_SG_Boring.Proj_TOR_SG_Boring_C.BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring
// 0x0090 (0x0090 - 0x0000)
struct Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring");
static_assert(sizeof(Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring) == 0x000090, "Wrong size on Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring");
static_assert(offsetof(Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring, ImpactResult) == 0x000000, "Member 'Proj_TOR_SG_Boring_C_BndEvt__WalkingProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature_Proj_TOR_SG_Boring::ImpactResult' has a wrong offset!");

// Function Proj_TOR_SG_Boring.Proj_TOR_SG_Boring_C.OnHitDamagableObject
// 0x0090 (0x0090 - 0x0000)
struct Proj_TOR_SG_Boring_C_OnHitDamagableObject final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_C_OnHitDamagableObject) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_C_OnHitDamagableObject");
static_assert(sizeof(Proj_TOR_SG_Boring_C_OnHitDamagableObject) == 0x000090, "Wrong size on Proj_TOR_SG_Boring_C_OnHitDamagableObject");
static_assert(offsetof(Proj_TOR_SG_Boring_C_OnHitDamagableObject, Hit) == 0x000000, "Member 'Proj_TOR_SG_Boring_C_OnHitDamagableObject::Hit' has a wrong offset!");

// Function Proj_TOR_SG_Boring.Proj_TOR_SG_Boring_C.OnHitWorld
// 0x0090 (0x0090 - 0x0000)
struct Proj_TOR_SG_Boring_C_OnHitWorld final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_C_OnHitWorld) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_C_OnHitWorld");
static_assert(sizeof(Proj_TOR_SG_Boring_C_OnHitWorld) == 0x000090, "Wrong size on Proj_TOR_SG_Boring_C_OnHitWorld");
static_assert(offsetof(Proj_TOR_SG_Boring_C_OnHitWorld, Hit) == 0x000000, "Member 'Proj_TOR_SG_Boring_C_OnHitWorld::Hit' has a wrong offset!");

// Function Proj_TOR_SG_Boring.Proj_TOR_SG_Boring_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct Proj_TOR_SG_Boring_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_TOR_SG_Boring_C_ReceiveHit) == 0x000008, "Wrong alignment on Proj_TOR_SG_Boring_C_ReceiveHit");
static_assert(sizeof(Proj_TOR_SG_Boring_C_ReceiveHit) == 0x0000D0, "Wrong size on Proj_TOR_SG_Boring_C_ReceiveHit");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ReceiveHit, MyComp) == 0x000000, "Member 'Proj_TOR_SG_Boring_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ReceiveHit, Other) == 0x000008, "Member 'Proj_TOR_SG_Boring_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Proj_TOR_SG_Boring_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Proj_TOR_SG_Boring_C_ReceiveHit::OtherComp' has a wrong offset!");
