#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proj_Trooper_Grenade_Hover

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "WwiseAudio_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_DamageTypeColors_structs.hpp"


namespace SDK::Params
{

// Function Proj_Trooper_Grenade_Hover.Proj_Trooper_Grenade_Hover_C.ExecuteUbergraph_Proj_Trooper_Grenade_Hover
// 0x0548 (0x0548 - 0x0000)
struct Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_DamageTypeColors               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0004(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Result1;                        // 0x0068(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_CustomEvent_Result;                         // 0x00F8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EOakElementalType                             Temp_byte_Variable;                                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0190(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x01A8(0x0018)()
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue2;              // 0x01C8(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x0200(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0290(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0324(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue3;              // 0x0330(0x0018)()
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0348(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FHitResult& Result)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0368(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue1;            // 0x0374(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0380(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0398(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x03C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x03D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x03DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x03E8(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(struct FHitResult& Result)>    K2Node_CreateDelegate_OutputDelegate1;             // 0x0478(0x0010)(ZeroConstructor, NoDestructor)
	class UTargetableComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxTraceAsyncRequest                  K2Node_MakeStruct_GbxTraceAsyncRequest;            // 0x0490(0x00B0)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover) == 0x000008, "Wrong alignment on Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover");
static_assert(sizeof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover) == 0x000548, "Wrong size on Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, EntryPoint) == 0x000000, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::EntryPoint' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_GetDataTableRowFromName_OutRow) == 0x000004, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000064, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_CustomEvent_Result1) == 0x000068, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_CustomEvent_Result1' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_CustomEvent_Result) == 0x0000F8, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, Temp_byte_Variable) == 0x000188, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, Temp_bool_IsClosed_Variable) == 0x000189, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, Temp_bool_IsClosed_Variable1) == 0x00018A, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, Temp_bool_Has_Been_Initd_Variable) == 0x00018B, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00018C, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_PostWwiseEvent_ReturnValue) == 0x000190, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_PostWwiseEvent_ReturnValue1) == 0x0001A8, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, Temp_bool_Has_Been_Initd_Variable1) == 0x0001C0, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_PostWwiseEvent_ReturnValue2) == 0x0001C8, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_PostWwiseEvent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001E0, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_Lerp_ReturnValue) == 0x0001EC, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_VLerp_ReturnValue) == 0x0001F0, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, Temp_struct_Variable) == 0x000200, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000290, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000320, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_MakeVector_ReturnValue) == 0x000324, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_PostWwiseEvent_ReturnValue3) == 0x000330, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_PostWwiseEvent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_Add_VectorVector_ReturnValue) == 0x000348, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_CreateDelegate_OutputDelegate) == 0x000358, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000368, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_Add_VectorVector_ReturnValue1) == 0x000374, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_Add_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_Select_Default) == 0x000380, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000390, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000398, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_Event_MyComp) == 0x0003A8, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_Event_Other) == 0x0003B0, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_Event_OtherComp) == 0x0003B8, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_Event_bSelfMoved) == 0x0003C0, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_Event_HitLocation) == 0x0003C4, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_Event_HitNormal) == 0x0003D0, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_Event_NormalImpulse) == 0x0003DC, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_Event_Hit) == 0x0003E8, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_CreateDelegate_OutputDelegate1) == 0x000478, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_GetComponentByClass_ReturnValue) == 0x000488, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, K2Node_MakeStruct_GbxTraceAsyncRequest) == 0x000490, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::K2Node_MakeStruct_GbxTraceAsyncRequest' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover, CallFunc_IsValid_ReturnValue) == 0x000540, "Member 'Proj_Trooper_Grenade_Hover_C_ExecuteUbergraph_Proj_Trooper_Grenade_Hover::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Proj_Trooper_Grenade_Hover.Proj_Trooper_Grenade_Hover_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct Proj_Trooper_Grenade_Hover_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_Trooper_Grenade_Hover_C_ReceiveHit) == 0x000008, "Wrong alignment on Proj_Trooper_Grenade_Hover_C_ReceiveHit");
static_assert(sizeof(Proj_Trooper_Grenade_Hover_C_ReceiveHit) == 0x0000D0, "Wrong size on Proj_Trooper_Grenade_Hover_C_ReceiveHit");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ReceiveHit, MyComp) == 0x000000, "Member 'Proj_Trooper_Grenade_Hover_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ReceiveHit, Other) == 0x000008, "Member 'Proj_Trooper_Grenade_Hover_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ReceiveHit, OtherComp) == 0x000010, "Member 'Proj_Trooper_Grenade_Hover_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'Proj_Trooper_Grenade_Hover_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'Proj_Trooper_Grenade_Hover_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ReceiveHit, HitNormal) == 0x000028, "Member 'Proj_Trooper_Grenade_Hover_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'Proj_Trooper_Grenade_Hover_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_ReceiveHit, Hit) == 0x000040, "Member 'Proj_Trooper_Grenade_Hover_C_ReceiveHit::Hit' has a wrong offset!");

// Function Proj_Trooper_Grenade_Hover.Proj_Trooper_Grenade_Hover_C.GbxAsyncRequest_Hit_5BCA88024E485380DC8F2DBDB0AECBAC
// 0x0090 (0x0090 - 0x0000)
struct Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Hit_5BCA88024E485380DC8F2DBDB0AECBAC final
{
public:
	struct FHitResult                             Result;                                            // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Hit_5BCA88024E485380DC8F2DBDB0AECBAC) == 0x000008, "Wrong alignment on Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Hit_5BCA88024E485380DC8F2DBDB0AECBAC");
static_assert(sizeof(Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Hit_5BCA88024E485380DC8F2DBDB0AECBAC) == 0x000090, "Wrong size on Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Hit_5BCA88024E485380DC8F2DBDB0AECBAC");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Hit_5BCA88024E485380DC8F2DBDB0AECBAC, Result) == 0x000000, "Member 'Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Hit_5BCA88024E485380DC8F2DBDB0AECBAC::Result' has a wrong offset!");

// Function Proj_Trooper_Grenade_Hover.Proj_Trooper_Grenade_Hover_C.GbxAsyncRequest_Miss_5BCA88024E485380DC8F2DBDB0AECBAC
// 0x0090 (0x0090 - 0x0000)
struct Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Miss_5BCA88024E485380DC8F2DBDB0AECBAC final
{
public:
	struct FHitResult                             Result;                                            // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Miss_5BCA88024E485380DC8F2DBDB0AECBAC) == 0x000008, "Wrong alignment on Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Miss_5BCA88024E485380DC8F2DBDB0AECBAC");
static_assert(sizeof(Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Miss_5BCA88024E485380DC8F2DBDB0AECBAC) == 0x000090, "Wrong size on Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Miss_5BCA88024E485380DC8F2DBDB0AECBAC");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Miss_5BCA88024E485380DC8F2DBDB0AECBAC, Result) == 0x000000, "Member 'Proj_Trooper_Grenade_Hover_C_GbxAsyncRequest_Miss_5BCA88024E485380DC8F2DBDB0AECBAC::Result' has a wrong offset!");

// Function Proj_Trooper_Grenade_Hover.Proj_Trooper_Grenade_Hover_C.UserConstructionScript
// 0x0138 (0x0138 - 0x0000)
struct Proj_Trooper_Grenade_Hover_C_UserConstructionScript final
{
public:
	EOakElementalType                             Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable3;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable4;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable5;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             Temp_byte_Variable1;                               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable5;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_DamageTypeColors               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOakElementalType                             Temp_byte_Variable2;                               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxBlackboardKeySelector              K2Node_MakeStruct_GbxBlackboardKeySelector;        // 0x00D8(0x0010)(NoDestructor)
	class UClass*                                 K2Node_Select_Default;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_Select1_Default;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select2_Default;                            // 0x00F8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOakElementalType                             CallFunc_GetElementalTypeFromWeapon_WeaponElement; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValueAsEnum_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0124(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proj_Trooper_Grenade_Hover_C_UserConstructionScript) == 0x000008, "Wrong alignment on Proj_Trooper_Grenade_Hover_C_UserConstructionScript");
static_assert(sizeof(Proj_Trooper_Grenade_Hover_C_UserConstructionScript) == 0x000138, "Wrong size on Proj_Trooper_Grenade_Hover_C_UserConstructionScript");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'Proj_Trooper_Grenade_Hover_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Proj_Trooper_Grenade_Hover_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'Proj_Trooper_Grenade_Hover_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
