#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResurrectTravelStationObject

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "WwiseAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ResurrectTravelStationObject.ResurrectTravelStationObject_C
// 0x00D8 (0x06A8 - 0x05D0)
class AResurrectTravelStationObject_C : public ACheckpointTravelStationObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USocketComponent*                       StandinSocket;                                     // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakDialogComponent*                    GbxDialog;                                         // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxNavMeshPainterComponent*            GbxNavMeshPainter;                                 // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxNavBoxComponent*                    GbxNavBox;                                         // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationVehicleSpawnPointComponent* TravelStationVehicleSpawnPoint1;                   // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationVehicleSpawnPointComponent* TravelStationVehicleSpawnPoint3;                   // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationVehicleSpawnPointComponent* TravelStationVehicleSpawnPoint2;                   // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationVehicleSpawnPointComponent* TravelStationVehicleSpawnPoint;                    // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxAreaComponent*                      ActivationArea;                                    // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_Projector_Main_Eye;                             // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakTravelStationResurrectComponent_C*  OakTravelStationResurrectComponent;                // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationSpawnPointComponent*      TravelStationSpawnPoint4;                          // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationSpawnPointComponent*      TravelStationSpawnPoint3;                          // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationSpawnPointComponent*      TravelStationSpawnPoint2;                          // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelStationSpawnPointComponent*      TravelStationSpawnPoint1;                          // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   PlayerSpawned;                                     // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FWwisePlaybackInstance                 Audio_TravelStationLoop;                           // 0x0678(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWwiseEvent*                            Audio_Activate;                                    // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            Audio_Deactivate;                                  // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LockVisuals;                                       // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ActivateResurrectStation(class AActor* ActivatingActor);
	void UserConstructionScript();
	void BndEvt__OakTravelStationResurrectComponent_K2Node_ComponentBoundEvent_5_TravelStationResurrectChanged__DelegateSignature_ResurrectTravelStationObject(class AActor* OtherStation);
	void FX_Open();
	void FX_Close();
	void TraveledTo(class AActor* SpawnedActor);
	void BndEvt__OakTravelStationResurrectComponent_K2Node_ComponentBoundEvent_4_TravelStationResurrectChanged__DelegateSignature_ResurrectTravelStationObject(class AActor* OtherStation);
	void ReceiveBeginPlay();
	void OnDisabling();
	void OnEnabling();
	void BndEvt__OakTravelStationResurrectComponent_K2Node_ComponentBoundEvent_0_TravelStationCharacterResurrected__DelegateSignature_ResurrectTravelStationObject(class APawn* ResurrectedCharacter);
	void OnEnabled();
	void OnDisabled();
	void ExecuteUbergraph_ResurrectTravelStationObject(int32 EntryPoint);
	void PlayerSpawned__DelegateSignature(class AOakCharacter_Player* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ResurrectTravelStationObject_C">();
	}
	static class AResurrectTravelStationObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AResurrectTravelStationObject_C>();
	}
};
static_assert(alignof(AResurrectTravelStationObject_C) == 0x000008, "Wrong alignment on AResurrectTravelStationObject_C");
static_assert(sizeof(AResurrectTravelStationObject_C) == 0x0006A8, "Wrong size on AResurrectTravelStationObject_C");
static_assert(offsetof(AResurrectTravelStationObject_C, UberGraphFrame) == 0x0005D0, "Member 'AResurrectTravelStationObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, Camera) == 0x0005D8, "Member 'AResurrectTravelStationObject_C::Camera' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, SkeletalMesh1) == 0x0005E0, "Member 'AResurrectTravelStationObject_C::SkeletalMesh1' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, StandinSocket) == 0x0005E8, "Member 'AResurrectTravelStationObject_C::StandinSocket' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, GbxDialog) == 0x0005F0, "Member 'AResurrectTravelStationObject_C::GbxDialog' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, GbxNavMeshPainter) == 0x0005F8, "Member 'AResurrectTravelStationObject_C::GbxNavMeshPainter' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, GbxNavBox) == 0x000600, "Member 'AResurrectTravelStationObject_C::GbxNavBox' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, TravelStationVehicleSpawnPoint1) == 0x000608, "Member 'AResurrectTravelStationObject_C::TravelStationVehicleSpawnPoint1' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, TravelStationVehicleSpawnPoint3) == 0x000610, "Member 'AResurrectTravelStationObject_C::TravelStationVehicleSpawnPoint3' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, TravelStationVehicleSpawnPoint2) == 0x000618, "Member 'AResurrectTravelStationObject_C::TravelStationVehicleSpawnPoint2' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, TravelStationVehicleSpawnPoint) == 0x000620, "Member 'AResurrectTravelStationObject_C::TravelStationVehicleSpawnPoint' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, ActivationArea) == 0x000628, "Member 'AResurrectTravelStationObject_C::ActivationArea' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, SkeletalMesh) == 0x000630, "Member 'AResurrectTravelStationObject_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, FX_Projector_Main_Eye) == 0x000638, "Member 'AResurrectTravelStationObject_C::FX_Projector_Main_Eye' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, OakTravelStationResurrectComponent) == 0x000640, "Member 'AResurrectTravelStationObject_C::OakTravelStationResurrectComponent' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, TravelStationSpawnPoint4) == 0x000648, "Member 'AResurrectTravelStationObject_C::TravelStationSpawnPoint4' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, TravelStationSpawnPoint3) == 0x000650, "Member 'AResurrectTravelStationObject_C::TravelStationSpawnPoint3' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, TravelStationSpawnPoint2) == 0x000658, "Member 'AResurrectTravelStationObject_C::TravelStationSpawnPoint2' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, TravelStationSpawnPoint1) == 0x000660, "Member 'AResurrectTravelStationObject_C::TravelStationSpawnPoint1' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, PlayerSpawned) == 0x000668, "Member 'AResurrectTravelStationObject_C::PlayerSpawned' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, Audio_TravelStationLoop) == 0x000678, "Member 'AResurrectTravelStationObject_C::Audio_TravelStationLoop' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, Audio_Activate) == 0x000690, "Member 'AResurrectTravelStationObject_C::Audio_Activate' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, Audio_Deactivate) == 0x000698, "Member 'AResurrectTravelStationObject_C::Audio_Deactivate' has a wrong offset!");
static_assert(offsetof(AResurrectTravelStationObject_C, LockVisuals) == 0x0006A0, "Member 'AResurrectTravelStationObject_C::LockVisuals' has a wrong offset!");

}

