#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sanctuary3_M_Watership

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "GbxInventory_structs.hpp"


namespace SDK::Params
{

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.PlayDoorErrorSound
// 0x0030 (0x0030 - 0x0000)
struct Sanctuary3_M_Watership_C_PlayDoorErrorSound final
{
public:
	class AOakMissionWaypointBox*                 Trigger;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostEventAtLocation_ReturnValue;          // 0x0018(0x0018)()
};
static_assert(alignof(Sanctuary3_M_Watership_C_PlayDoorErrorSound) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_PlayDoorErrorSound");
static_assert(sizeof(Sanctuary3_M_Watership_C_PlayDoorErrorSound) == 0x000030, "Wrong size on Sanctuary3_M_Watership_C_PlayDoorErrorSound");
static_assert(offsetof(Sanctuary3_M_Watership_C_PlayDoorErrorSound, Trigger) == 0x000000, "Member 'Sanctuary3_M_Watership_C_PlayDoorErrorSound::Trigger' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_PlayDoorErrorSound, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'Sanctuary3_M_Watership_C_PlayDoorErrorSound::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_PlayDoorErrorSound, CallFunc_PostEventAtLocation_ReturnValue) == 0x000018, "Member 'Sanctuary3_M_Watership_C_PlayDoorErrorSound::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.ToggleHyperspeedFSEmitter
// 0x0048 (0x0048 - 0x0000)
struct Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter final
{
public:
	bool                                          bActivate_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AOakCharacter_Player*>           CallFunc_GetAllPlayerCharacters_Characters;        // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class AOakCharacter_Player*                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScreenParticleManagerComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter");
static_assert(sizeof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter) == 0x000048, "Wrong size on Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, bActivate_0) == 0x000000, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::bActivate_0' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, CallFunc_GetAllPlayerCharacters_Characters) == 0x000010, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::CallFunc_GetAllPlayerCharacters_Characters' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, CallFunc_Array_Get_Item) == 0x000020, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, CallFunc_GetAssociatedPlayerController_ReturnValue) == 0x000030, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::CallFunc_GetAssociatedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'Sanctuary3_M_Watership_C_ToggleHyperspeedFSEmitter::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_47_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_2_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature final
{
public:
	class ASpawnPoint*                            SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature, SpawnPoint) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature::SpawnPoint' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature, Actor) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature::Actor' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262 final
{
public:
	class ASpawnPoint*                            SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262) == 0x000010, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262, SpawnPoint) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262::SpawnPoint' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262, Actor) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_0_K2Node_ActorBoundEvent_1_SpawnPointEvent__DelegateSignature_UNIX1560527262::Actor' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_5_K2Node_ActorBoundEvent_3_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_6_K2Node_ActorBoundEvent_4_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature final
{
public:
	class ASpawnPoint*                            SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature, SpawnPoint) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature::SpawnPoint' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature, Actor) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_6_K2Node_ActorBoundEvent_5_SpawnPointEvent__DelegateSignature::Actor' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature final
{
public:
	class ASpawnPoint*                            SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature, SpawnPoint) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature::SpawnPoint' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature, Actor) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakSpawnPoint_7_K2Node_ActorBoundEvent_6_SpawnPointEvent__DelegateSignature::Actor' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_7_K2Node_ActorBoundEvent_7_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_8_K2Node_ActorBoundEvent_8_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature final
{
public:
	class ASpawner*                               Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature, Spawner) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature::Spawner' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature, Actor) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_3_K2Node_ActorBoundEvent_9_SpawnerEvent__DelegateSignature::Actor' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_10_K2Node_ActorBoundEvent_10_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246 final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300246::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248 final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300248::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250 final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300250::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252 final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_12_K2Node_ActorBoundEvent_11_OakTouchedTriggerDelegate__DelegateSignature_UNIX1561300252::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature final
{
public:
	class ASpawner*                               Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature, Spawner) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature::Spawner' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature, Actor) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_4_K2Node_ActorBoundEvent_16_SpawnerEvent__DelegateSignature::Actor' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature final
{
public:
	class ASpawner*                               Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature, Spawner) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature::Spawner' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature, Actor) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionSpawner_0_K2Node_ActorBoundEvent_17_SpawnerEvent__DelegateSignature::Actor' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Watership_C_BndEvt__OakMissionWaypointBox_11_K2Node_ActorBoundEvent_18_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Watership.Sanctuary3_M_Watership_C.ExecuteUbergraph_Sanctuary3_M_Watership
// 0x10D0 (0x10D0 - 0x0000)
struct Sanctuary3_M_Watership_C_ExecuteUbergraph_Sanctuary3_M_Watership final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
