#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sanctuary3_M_Ep06MeetMaya

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxInventory_structs.hpp"


namespace SDK::Params
{

// Function Sanctuary3_M_Ep06MeetMaya.Sanctuary3_M_Ep06MeetMaya_C.BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_Ep06MeetMaya_C_BndEvt__OakTriggerBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_Ep06MeetMaya.Sanctuary3_M_Ep06MeetMaya_C.ExecuteUbergraph_Sanctuary3_M_Ep06MeetMaya
// 0x26C8 (0x26C8 - 0x0000)
struct Sanctuary3_M_Ep06MeetMaya_C_ExecuteUbergraph_Sanctuary3_M_Ep06MeetMaya final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0220(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0438(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0650(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0868(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x0874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x0880(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0A98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A99[0x3];                                      // 0x0A99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0A9C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x0AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0AAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0AAD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AAE[0x2];                                      // 0x0AAE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x0AB0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x0ABC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x0AC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x0AC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC2[0x6];                                      // 0x0AC2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AC8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0CE0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x0EF8(0x0218)()
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x1110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1111[0x7];                                     // 0x1111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemPoolInfo                          Temp_struct_Variable;                              // 0x1118(0x0088)(ConstParm)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue1;        // 0x11A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue2;        // 0x11A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A2[0x6];                                     // 0x11A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x11A8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue9;            // 0x13C0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue10;           // 0x15D8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue11;           // 0x17F0(0x0218)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x1A08(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x1A18(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x1A28(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue3;        // 0x1A38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A39[0x7];                                     // 0x1A39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue12;           // 0x1A40(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x1C58(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x1C64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x1C68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x1C69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C6A[0x6];                                     // 0x1C6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x1C70(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x1C80(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x1C8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x1C90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x1C91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C92[0x2];                                     // 0x1C92(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x1C94(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x1CA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x1CA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x1CA5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA6[0x2];                                     // 0x1CA6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x1CA8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x1CB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x1CB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x1CB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CBA[0x2];                                     // 0x1CBA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation7;                // 0x1CBC(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID7;                  // 0x1CC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue7;                 // 0x1CCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x1CCD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CCE[0x2];                                     // 0x1CCE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x1CD0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x1CE0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x1CF0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x1D00(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x1D10(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x1D20(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x1D30(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x1D40(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue4;        // 0x1D50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D51[0x7];                                     // 0x1D51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue;          // 0x1D58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue13;           // 0x1D60(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation8;                // 0x1F78(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID8;                  // 0x1F84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue8;                 // 0x1F88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x1F89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F8A[0x2];                                     // 0x1F8A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation9;                // 0x1F8C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID9;                  // 0x1F98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue9;                 // 0x1F9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x1F9D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9E[0x2];                                     // 0x1F9E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation10;               // 0x1FA0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID10;                 // 0x1FAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue10;                // 0x1FB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue10;             // 0x1FB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FB2[0x6];                                     // 0x1FB2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Ava_C*                          CallFunc_GetMissionCharacter_ReturnValue1;         // 0x1FB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue2;         // 0x1FC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x1FC8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x1FD8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate14;            // 0x1FE8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x1FF8(0x0010)(ZeroConstructor, NoDestructor)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue3;         // 0x2008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue4;         // 0x2010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue5;         // 0x2018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue6;         // 0x2020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue7;         // 0x2028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue8;         // 0x2030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue9;         // 0x2038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue10;        // 0x2040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue11;        // 0x2048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue12;        // 0x2050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue13;        // 0x2058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue14;        // 0x2060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue15;        // 0x2068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue16;        // 0x2070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue17;        // 0x2078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue18;        // 0x2080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Ava_C*                          CallFunc_GetMissionCharacter_ReturnValue19;        // 0x2088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue20;        // 0x2090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue21;        // 0x2098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_NPC_C>            K2Node_DynamicCast_AsBPI_NPC;                      // 0x20A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x20B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20B1[0x7];                                     // 0x20B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTask_ScriptedFollow*           CallFunc_BeginScriptedFollow_ReturnValue;          // 0x20B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x20C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20C1[0x7];                                     // 0x20C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Maya_C*                         CallFunc_GetMissionCharacter_ReturnValue22;        // 0x20C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue14;           // 0x20D0(0x0218)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate16;            // 0x22E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate17;            // 0x22F8(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue15;           // 0x2308(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation11;               // 0x2520(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID11;                 // 0x252C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue11;                // 0x2530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2531[0x7];                                     // 0x2531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate18;            // 0x2538(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue11;             // 0x2548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2549[0x3];                                     // 0x2549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation12;               // 0x254C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID12;                 // 0x2558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue12;                // 0x255C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue12;             // 0x255D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255E[0x2];                                     // 0x255E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue;            // 0x2560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x2568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2569[0x3];                                     // 0x2569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation13;               // 0x256C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID13;                 // 0x2578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue13;                // 0x257C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue13;             // 0x257D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_257E[0x2];                                     // 0x257E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation14;               // 0x2580(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID14;                 // 0x258C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue14;                // 0x2590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue14;             // 0x2591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2592[0x2];                                     // 0x2592(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation15;               // 0x2594(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID15;                 // 0x25A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue15;                // 0x25A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue15;             // 0x25A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A6[0x2];                                     // 0x25A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue23;        // 0x25A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Maya_C*                         CallFunc_GetMissionCharacter_ReturnValue24;        // 0x25B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Ava_C*                          CallFunc_GetMissionCharacter_ReturnValue25;        // 0x25B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_NPC_C>            K2Node_DynamicCast_AsBPI_NPC1;                     // 0x25C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x25D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x25D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D2[0x6];                                     // 0x25D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate19;            // 0x25D8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_ActorBoundEvent_TouchingActor;              // 0x25E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ActorBoundEvent_bIsPlayer;                  // 0x25F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25F1[0x7];                                     // 0x25F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ActorBoundEvent_ComponentTouched;           // 0x25F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate20;            // 0x2600(0x0010)(ZeroConstructor, NoDestructor)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue26;        // 0x2610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_SmartAction*              CallFunc_BeginSmartAction_ReturnValue;             // 0x2618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x2620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2621[0x7];                                     // 0x2621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue27;        // 0x2628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x2630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2631[0x7];                                     // 0x2631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue28;        // 0x2638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue29;        // 0x2640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue30;        // 0x2648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate21;            // 0x2650(0x0010)(ZeroConstructor, NoDestructor)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue1;           // 0x2660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x2668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2669[0x7];                                     // 0x2669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate22;            // 0x2670(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate23;            // 0x2680(0x0010)(ZeroConstructor, NoDestructor)
	class ABPChar_Ava_C*                          CallFunc_GetMissionCharacter_ReturnValue31;        // 0x2690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Hermes_C*                       CallFunc_GetMissionCharacter_ReturnValue32;        // 0x2698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedFollow*           CallFunc_BeginScriptedFollow_ReturnValue1;         // 0x26A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x26A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x26A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue1;                 // 0x26AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue2;                 // 0x26AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26AC[0x4];                                     // 0x26AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue33;        // 0x26B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue34;        // 0x26B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue35;        // 0x26C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_Ep06MeetMaya_C_ExecuteUbergraph_Sanctuary3_M_Ep06MeetMaya) == 0x000008, "Wrong alignment on Sanctuary3_M_Ep06MeetMaya_C_ExecuteUbergraph_Sanctuary3_M_Ep06MeetMaya");
static_assert(sizeof(Sanctuary3_M_Ep06MeetMaya_C_ExecuteUbergraph_Sanctuary3_M_Ep06MeetMaya) == 0x0026C8, "Wrong size on Sanctuary3_M_Ep06MeetMaya_C_ExecuteUbergraph_Sanctuary3_M_Ep06MeetMaya");
static_assert(offsetof(Sanctuary3_M_Ep06MeetMaya_C_ExecuteUbergraph_Sanctuary3_M_Ep06MeetMaya, EntryPoint) == 0x000000, "Member 'Sanctuary3_M_Ep06MeetMaya_C_ExecuteUbergraph_Sanctuary3_M_Ep06MeetMaya::EntryPoint' has a wrong offset!");
