#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sanctuary3_M_SanctuaryPreparation

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.GbxAsyncRequest_PickupSpawned_D73E72784C370CDDCE1EA2913CC6A3B2
// 0x0008 (0x0008 - 0x0000)
struct Sanctuary3_Mission_C_GbxAsyncRequest_PickupSpawned_D73E72784C370CDDCE1EA2913CC6A3B2 final
{
public:
	class ADroppedInventoryItemPickup*            Pickup;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_GbxAsyncRequest_PickupSpawned_D73E72784C370CDDCE1EA2913CC6A3B2) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_GbxAsyncRequest_PickupSpawned_D73E72784C370CDDCE1EA2913CC6A3B2");
static_assert(sizeof(Sanctuary3_Mission_C_GbxAsyncRequest_PickupSpawned_D73E72784C370CDDCE1EA2913CC6A3B2) == 0x000008, "Wrong size on Sanctuary3_Mission_C_GbxAsyncRequest_PickupSpawned_D73E72784C370CDDCE1EA2913CC6A3B2");
static_assert(offsetof(Sanctuary3_Mission_C_GbxAsyncRequest_PickupSpawned_D73E72784C370CDDCE1EA2913CC6A3B2, Pickup) == 0x000000, "Member 'Sanctuary3_Mission_C_GbxAsyncRequest_PickupSpawned_D73E72784C370CDDCE1EA2913CC6A3B2::Pickup' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.OnEnd_87404FFA499868B64A9CA495ADE54BB7
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_OnEnd_87404FFA499868B64A9CA495ADE54BB7 final
{
public:
	EGbxActionEndState                            EndState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_OnEnd_87404FFA499868B64A9CA495ADE54BB7) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_OnEnd_87404FFA499868B64A9CA495ADE54BB7");
static_assert(sizeof(Sanctuary3_Mission_C_OnEnd_87404FFA499868B64A9CA495ADE54BB7) == 0x000010, "Wrong size on Sanctuary3_Mission_C_OnEnd_87404FFA499868B64A9CA495ADE54BB7");
static_assert(offsetof(Sanctuary3_Mission_C_OnEnd_87404FFA499868B64A9CA495ADE54BB7, EndState) == 0x000000, "Member 'Sanctuary3_Mission_C_OnEnd_87404FFA499868B64A9CA495ADE54BB7::EndState' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_OnEnd_87404FFA499868B64A9CA495ADE54BB7, Actor) == 0x000008, "Member 'Sanctuary3_Mission_C_OnEnd_87404FFA499868B64A9CA495ADE54BB7::Actor' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.OnEnd_200274AE4CBFCFED46D1068CB3040EF5
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_OnEnd_200274AE4CBFCFED46D1068CB3040EF5 final
{
public:
	EGbxActionEndState                            EndState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_OnEnd_200274AE4CBFCFED46D1068CB3040EF5) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_OnEnd_200274AE4CBFCFED46D1068CB3040EF5");
static_assert(sizeof(Sanctuary3_Mission_C_OnEnd_200274AE4CBFCFED46D1068CB3040EF5) == 0x000010, "Wrong size on Sanctuary3_Mission_C_OnEnd_200274AE4CBFCFED46D1068CB3040EF5");
static_assert(offsetof(Sanctuary3_Mission_C_OnEnd_200274AE4CBFCFED46D1068CB3040EF5, EndState) == 0x000000, "Member 'Sanctuary3_Mission_C_OnEnd_200274AE4CBFCFED46D1068CB3040EF5::EndState' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_OnEnd_200274AE4CBFCFED46D1068CB3040EF5, Actor) == 0x000008, "Member 'Sanctuary3_Mission_C_OnEnd_200274AE4CBFCFED46D1068CB3040EF5::Actor' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.OnEnd_FA45E2004014E6484DDA99A5D51669C0
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_OnEnd_FA45E2004014E6484DDA99A5D51669C0 final
{
public:
	EGbxActionEndState                            EndState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_OnEnd_FA45E2004014E6484DDA99A5D51669C0) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_OnEnd_FA45E2004014E6484DDA99A5D51669C0");
static_assert(sizeof(Sanctuary3_Mission_C_OnEnd_FA45E2004014E6484DDA99A5D51669C0) == 0x000010, "Wrong size on Sanctuary3_Mission_C_OnEnd_FA45E2004014E6484DDA99A5D51669C0");
static_assert(offsetof(Sanctuary3_Mission_C_OnEnd_FA45E2004014E6484DDA99A5D51669C0, EndState) == 0x000000, "Member 'Sanctuary3_Mission_C_OnEnd_FA45E2004014E6484DDA99A5D51669C0::EndState' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_OnEnd_FA45E2004014E6484DDA99A5D51669C0, Actor) == 0x000008, "Member 'Sanctuary3_Mission_C_OnEnd_FA45E2004014E6484DDA99A5D51669C0::Actor' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150
// 0x0038 (0x0038 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150 final
{
public:
	struct FMissionObjectiveReference             Objective;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150) == 0x000038, "Wrong size on Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150, Objective) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150::Objective' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150, ObjectiveEvent) == 0x000030, "Member 'Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150, ObjectiveCount) == 0x000034, "Member 'Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1554059150::ObjectiveCount' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature final
{
public:
	class ASpawner*                               Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature) == 0x000008, "Wrong size on Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature, Spawner) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature::Spawner' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation final
{
public:
	class UClass*                                 Mission;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionEvent                                 MissionEvent;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation) == 0x000010, "Wrong size on Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation, Mission) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation::Mission' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation, MissionEvent) == 0x000008, "Member 'Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_7_MissionObserverMissionUpdate__DelegateSignature_Sanctuary3_M_SanctuaryPreparation::MissionEvent' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352
// 0x0038 (0x0038 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352 final
{
public:
	struct FMissionObjectiveReference             Objective;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352) == 0x000038, "Wrong size on Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352, Objective) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352::Objective' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352, ObjectiveEvent) == 0x000030, "Member 'Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352, ObjectiveCount) == 0x000034, "Member 'Sanctuary3_Mission_C_BndEvt__LevelMissionObserver_K2Node_ComponentBoundEvent_0_MissionObserverMissionObjectiveUpdate__DelegateSignature_Sanctuary3_Mission_UNIX1538069352::ObjectiveCount' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_Mission_C_BndEvt__OakTriggerBox_2_K2Node_ActorBoundEvent_876_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature final
{
public:
	class ASpawnPoint*                            SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature, SpawnPoint) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature::SpawnPoint' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature, Actor) == 0x000008, "Member 'Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_28_K2Node_ActorBoundEvent_1885_SpawnPointEvent__DelegateSignature::Actor' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature final
{
public:
	class ASpawnPoint*                            SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature, SpawnPoint) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature::SpawnPoint' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature, Actor) == 0x000008, "Member 'Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_24_K2Node_ActorBoundEvent_1845_SpawnPointEvent__DelegateSignature::Actor' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature final
{
public:
	class ASpawnPoint*                            SpawnPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature, SpawnPoint) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature::SpawnPoint' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature, Actor) == 0x000008, "Member 'Sanctuary3_Mission_C_BndEvt__OakSpawnPoint_30_K2Node_ActorBoundEvent_1149_SpawnPointEvent__DelegateSignature::Actor' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_3_K2Node_ActorBoundEvent_527_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_68_SetReleasePlayerFromZeroG__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_68_SetReleasePlayerFromZeroG__DelegateSignature final
{
public:
	class AOakCharacter_Player*                   OakCharacterPlayer;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_68_SetReleasePlayerFromZeroG__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_68_SetReleasePlayerFromZeroG__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_68_SetReleasePlayerFromZeroG__DelegateSignature) == 0x000008, "Wrong size on Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_68_SetReleasePlayerFromZeroG__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_68_SetReleasePlayerFromZeroG__DelegateSignature, OakCharacterPlayer) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_68_SetReleasePlayerFromZeroG__DelegateSignature::OakCharacterPlayer' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_2166_SetPlayerInZeroG__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_2166_SetPlayerInZeroG__DelegateSignature final
{
public:
	class AOakCharacter_Player*                   OakCharacterPlayer;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_2166_SetPlayerInZeroG__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_2166_SetPlayerInZeroG__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_2166_SetPlayerInZeroG__DelegateSignature) == 0x000008, "Wrong size on Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_2166_SetPlayerInZeroG__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_2166_SetPlayerInZeroG__DelegateSignature, OakCharacterPlayer) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__IO_Sanctuary_GravityHelper_36_K2Node_ActorBoundEvent_2166_SetPlayerInZeroG__DelegateSignature::OakCharacterPlayer' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__IO_Switch_IndustrialSwitch_V_15_K2Node_ActorBoundEvent_706_On_SwitchUsed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__IO_Switch_IndustrialSwitch_V_15_K2Node_ActorBoundEvent_706_On_SwitchUsed__DelegateSignature final
{
public:
	class AController*                            UserController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__IO_Switch_IndustrialSwitch_V_15_K2Node_ActorBoundEvent_706_On_SwitchUsed__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__IO_Switch_IndustrialSwitch_V_15_K2Node_ActorBoundEvent_706_On_SwitchUsed__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__IO_Switch_IndustrialSwitch_V_15_K2Node_ActorBoundEvent_706_On_SwitchUsed__DelegateSignature) == 0x000008, "Wrong size on Sanctuary3_Mission_C_BndEvt__IO_Switch_IndustrialSwitch_V_15_K2Node_ActorBoundEvent_706_On_SwitchUsed__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__IO_Switch_IndustrialSwitch_V_15_K2Node_ActorBoundEvent_706_On_SwitchUsed__DelegateSignature, UserController) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__IO_Switch_IndustrialSwitch_V_15_K2Node_ActorBoundEvent_706_On_SwitchUsed__DelegateSignature::UserController' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_Mission_C_BndEvt__OakTriggerVolume_4_K2Node_ActorBoundEvent_146_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.HealthDepleted_Pipe3
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_HealthDepleted_Pipe3 final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_HealthDepleted_Pipe3) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_HealthDepleted_Pipe3");
static_assert(sizeof(Sanctuary3_Mission_C_HealthDepleted_Pipe3) == 0x000010, "Wrong size on Sanctuary3_Mission_C_HealthDepleted_Pipe3");
static_assert(offsetof(Sanctuary3_Mission_C_HealthDepleted_Pipe3, DamageReceiver) == 0x000000, "Member 'Sanctuary3_Mission_C_HealthDepleted_Pipe3::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_HealthDepleted_Pipe3, DamageCauser) == 0x000008, "Member 'Sanctuary3_Mission_C_HealthDepleted_Pipe3::DamageCauser' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.HealthDepleted_Pipe2
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_HealthDepleted_Pipe2 final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_HealthDepleted_Pipe2) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_HealthDepleted_Pipe2");
static_assert(sizeof(Sanctuary3_Mission_C_HealthDepleted_Pipe2) == 0x000010, "Wrong size on Sanctuary3_Mission_C_HealthDepleted_Pipe2");
static_assert(offsetof(Sanctuary3_Mission_C_HealthDepleted_Pipe2, DamageReceiver) == 0x000000, "Member 'Sanctuary3_Mission_C_HealthDepleted_Pipe2::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_HealthDepleted_Pipe2, DamageCauser) == 0x000008, "Member 'Sanctuary3_Mission_C_HealthDepleted_Pipe2::DamageCauser' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.HealthDepleted_Pipe1
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_HealthDepleted_Pipe1 final
{
public:
	class UDamageComponent*                       DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageCauserComponent*                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_HealthDepleted_Pipe1) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_HealthDepleted_Pipe1");
static_assert(sizeof(Sanctuary3_Mission_C_HealthDepleted_Pipe1) == 0x000010, "Wrong size on Sanctuary3_Mission_C_HealthDepleted_Pipe1");
static_assert(offsetof(Sanctuary3_Mission_C_HealthDepleted_Pipe1, DamageReceiver) == 0x000000, "Member 'Sanctuary3_Mission_C_HealthDepleted_Pipe1::DamageReceiver' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_HealthDepleted_Pipe1, DamageCauser) == 0x000008, "Member 'Sanctuary3_Mission_C_HealthDepleted_Pipe1::DamageCauser' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature_UNIX1557843519
// 0x0008 (0x0008 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature_UNIX1557843519 final
{
public:
	class ASpawner*                               Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature_UNIX1557843519) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature_UNIX1557843519");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature_UNIX1557843519) == 0x000008, "Wrong size on Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature_UNIX1557843519");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature_UNIX1557843519, Spawner) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__OakMissionSpawner_CrimsonAlliance_K2Node_ActorBoundEvent_6_SpawnerDoneEvent__DelegateSignature_UNIX1557843519::Spawner' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature final
{
public:
	bool                                          PurchasedSomething;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          CrazyEarl;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature, PurchasedSomething) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature::PurchasedSomething' has a wrong offset!");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature, CrazyEarl) == 0x000008, "Member 'Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_11_ExitedMenu__DelegateSignature::CrazyEarl' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_0_OpenDoorSlide__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_0_OpenDoorSlide__DelegateSignature final
{
public:
	class AOakCharacter*                          CrazyEarl;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_0_OpenDoorSlide__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_0_OpenDoorSlide__DelegateSignature");
static_assert(sizeof(Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_0_OpenDoorSlide__DelegateSignature) == 0x000008, "Wrong size on Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_0_OpenDoorSlide__DelegateSignature");
static_assert(offsetof(Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_0_OpenDoorSlide__DelegateSignature, CrazyEarl) == 0x000000, "Member 'Sanctuary3_Mission_C_BndEvt__BP_CrazyEarlDoor_7_K2Node_ActorBoundEvent_0_OpenDoorSlide__DelegateSignature::CrazyEarl' has a wrong offset!");

// Function Sanctuary3_M_SanctuaryPreparation.Sanctuary3_Mission_C.ExecuteUbergraph_Sanctuary3_M_SanctuaryPreparation
// 0x6B68 (0x6B68 - 0x0000)
struct Sanctuary3_Mission_C_ExecuteUbergraph_Sanctuary3_M_SanctuaryPreparation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0220(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0238(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0450(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0668(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0880(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0891(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_892[0x6];                                      // 0x0892(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x0898(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AB0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0CC8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x0EE0(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x10F8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x1104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x1108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1109[0x3];                                     // 0x1109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x110C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x1118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x111C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x111D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x111E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111F[0x1];                                     // 0x111F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x1120(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue9;            // 0x1338(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x1550(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x155C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x1560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x1561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1562[0x6];                                     // 0x1562(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue10;           // 0x1568(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue11;           // 0x1780(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue12;           // 0x1998(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue13;           // 0x1BB0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue14;           // 0x1DC8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue15;           // 0x1FE0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue16;           // 0x21F8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue17;           // 0x2410(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue18;           // 0x2628(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x2840(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x284C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x2850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x2851(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2852[0x2];                                     // 0x2852(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x2854(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x2860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x2864(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x2865(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2866[0x2];                                     // 0x2866(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue19;           // 0x2868(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation7;                // 0x2A80(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID7;                  // 0x2A8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue7;                 // 0x2A90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x2A91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x2A92(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A93[0x1];                                     // 0x2A93(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation8;                // 0x2A94(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID8;                  // 0x2AA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue8;                 // 0x2AA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x2AA5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA6[0x2];                                     // 0x2AA6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x2AA8(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation9;                // 0x2AB8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID9;                  // 0x2AC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue9;                 // 0x2AC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x2AC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ACA[0x2];                                     // 0x2ACA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation10;               // 0x2ACC(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID10;                 // 0x2AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue10;                // 0x2ADC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue10;             // 0x2ADD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ADE[0x2];                                     // 0x2ADE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation11;               // 0x2AE0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID11;                 // 0x2AEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue11;                // 0x2AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue11;             // 0x2AF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AF2[0x2];                                     // 0x2AF2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation12;               // 0x2AF4(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID12;                 // 0x2B00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue12;                // 0x2B04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue12;             // 0x2B05(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B06[0x2];                                     // 0x2B06(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation13;               // 0x2B08(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID13;                 // 0x2B14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue13;                // 0x2B18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue13;             // 0x2B19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
