#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sanctuary3_M_EP19_DesertVault

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GbxDialog_structs.hpp"
#include "OakGame_structs.hpp"
#include "EMapNames_structs.hpp"
#include "GbxInventory_structs.hpp"


namespace SDK::Params
{

// Function Sanctuary3_M_EP19_DesertVault.Sanctuary3_M_EP19_DesertVault_C.OnEnd_68DB9DEA4272EA51D5C23594CAF97957
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_EP19_DesertVault_C_OnEnd_68DB9DEA4272EA51D5C23594CAF97957 final
{
public:
	EGbxActionEndState                            EndState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_68DB9DEA4272EA51D5C23594CAF97957) == 0x000008, "Wrong alignment on Sanctuary3_M_EP19_DesertVault_C_OnEnd_68DB9DEA4272EA51D5C23594CAF97957");
static_assert(sizeof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_68DB9DEA4272EA51D5C23594CAF97957) == 0x000010, "Wrong size on Sanctuary3_M_EP19_DesertVault_C_OnEnd_68DB9DEA4272EA51D5C23594CAF97957");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_68DB9DEA4272EA51D5C23594CAF97957, EndState) == 0x000000, "Member 'Sanctuary3_M_EP19_DesertVault_C_OnEnd_68DB9DEA4272EA51D5C23594CAF97957::EndState' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_68DB9DEA4272EA51D5C23594CAF97957, Actor) == 0x000008, "Member 'Sanctuary3_M_EP19_DesertVault_C_OnEnd_68DB9DEA4272EA51D5C23594CAF97957::Actor' has a wrong offset!");

// Function Sanctuary3_M_EP19_DesertVault.Sanctuary3_M_EP19_DesertVault_C.OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_EP19_DesertVault_C_OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71 final
{
public:
	EGbxActionEndState                            EndState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71) == 0x000008, "Wrong alignment on Sanctuary3_M_EP19_DesertVault_C_OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71");
static_assert(sizeof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71) == 0x000010, "Wrong size on Sanctuary3_M_EP19_DesertVault_C_OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71, EndState) == 0x000000, "Member 'Sanctuary3_M_EP19_DesertVault_C_OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71::EndState' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71, Actor) == 0x000008, "Member 'Sanctuary3_M_EP19_DesertVault_C_OnEnd_0A46FC3F402C9B39CDB8F5AABEE2CF71::Actor' has a wrong offset!");

// Function Sanctuary3_M_EP19_DesertVault.Sanctuary3_M_EP19_DesertVault_C.OnEnd_8EC72BF14547CCD1E47F108A661F8B1E
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_EP19_DesertVault_C_OnEnd_8EC72BF14547CCD1E47F108A661F8B1E final
{
public:
	EGbxActionEndState                            EndState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_8EC72BF14547CCD1E47F108A661F8B1E) == 0x000008, "Wrong alignment on Sanctuary3_M_EP19_DesertVault_C_OnEnd_8EC72BF14547CCD1E47F108A661F8B1E");
static_assert(sizeof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_8EC72BF14547CCD1E47F108A661F8B1E) == 0x000010, "Wrong size on Sanctuary3_M_EP19_DesertVault_C_OnEnd_8EC72BF14547CCD1E47F108A661F8B1E");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_8EC72BF14547CCD1E47F108A661F8B1E, EndState) == 0x000000, "Member 'Sanctuary3_M_EP19_DesertVault_C_OnEnd_8EC72BF14547CCD1E47F108A661F8B1E::EndState' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_8EC72BF14547CCD1E47F108A661F8B1E, Actor) == 0x000008, "Member 'Sanctuary3_M_EP19_DesertVault_C_OnEnd_8EC72BF14547CCD1E47F108A661F8B1E::Actor' has a wrong offset!");

// Function Sanctuary3_M_EP19_DesertVault.Sanctuary3_M_EP19_DesertVault_C.OnEnd_24AF94244DC1A8C6A9389F84FC0C7007
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_EP19_DesertVault_C_OnEnd_24AF94244DC1A8C6A9389F84FC0C7007 final
{
public:
	EGbxActionEndState                            EndState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_24AF94244DC1A8C6A9389F84FC0C7007) == 0x000008, "Wrong alignment on Sanctuary3_M_EP19_DesertVault_C_OnEnd_24AF94244DC1A8C6A9389F84FC0C7007");
static_assert(sizeof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_24AF94244DC1A8C6A9389F84FC0C7007) == 0x000010, "Wrong size on Sanctuary3_M_EP19_DesertVault_C_OnEnd_24AF94244DC1A8C6A9389F84FC0C7007");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_24AF94244DC1A8C6A9389F84FC0C7007, EndState) == 0x000000, "Member 'Sanctuary3_M_EP19_DesertVault_C_OnEnd_24AF94244DC1A8C6A9389F84FC0C7007::EndState' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_OnEnd_24AF94244DC1A8C6A9389F84FC0C7007, Actor) == 0x000008, "Member 'Sanctuary3_M_EP19_DesertVault_C_OnEnd_24AF94244DC1A8C6A9389F84FC0C7007::Actor' has a wrong offset!");

// Function Sanctuary3_M_EP19_DesertVault.Sanctuary3_M_EP19_DesertVault_C.BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature final
{
public:
	class AActor*                                 TouchingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayer;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        ComponentTouched;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature) == 0x000018, "Wrong size on Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature, TouchingActor) == 0x000000, "Member 'Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature::TouchingActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature, bIsPlayer) == 0x000008, "Member 'Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature::bIsPlayer' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature, ComponentTouched) == 0x000010, "Member 'Sanctuary3_M_EP19_DesertVault_C_BndEvt__OakMissionWaypointBox_1_K2Node_ActorBoundEvent_0_OakTouchedTriggerDelegate__DelegateSignature::ComponentTouched' has a wrong offset!");

// Function Sanctuary3_M_EP19_DesertVault.Sanctuary3_M_EP19_DesertVault_C.BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature final
{
public:
	class AActor*                                 NodeActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ArrivedPawn;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature) == 0x000008, "Wrong alignment on Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature");
static_assert(sizeof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature) == 0x000010, "Wrong size on Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature, NodeActor) == 0x000000, "Member 'Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature::NodeActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature, ArrivedPawn) == 0x000008, "Member 'Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature::ArrivedPawn' has a wrong offset!");

// Function Sanctuary3_M_EP19_DesertVault.Sanctuary3_M_EP19_DesertVault_C.BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365
// 0x0010 (0x0010 - 0x0000)
struct Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365 final
{
public:
	class AActor*                                 NodeActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ArrivedPawn;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365) == 0x000008, "Wrong alignment on Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365");
static_assert(sizeof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365) == 0x000010, "Wrong size on Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365, NodeActor) == 0x000000, "Member 'Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365::NodeActor' has a wrong offset!");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365, ArrivedPawn) == 0x000008, "Member 'Sanctuary3_M_EP19_DesertVault_C_BndEvt__AINode_9_K2Node_ActorBoundEvent_1_AINodeEvent__DelegateSignature_UNIX1556556365::ArrivedPawn' has a wrong offset!");

// Function Sanctuary3_M_EP19_DesertVault.Sanctuary3_M_EP19_DesertVault_C.CE_DesertVault_AvaUsed
// 0x0018 (0x0018 - 0x0000)
struct Sanctuary3_M_EP19_DesertVault_C_CE_DesertVault_AvaUsed final
{
public:
	struct FUseEvent                              UseEvent;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Sanctuary3_M_EP19_DesertVault_C_CE_DesertVault_AvaUsed) == 0x000008, "Wrong alignment on Sanctuary3_M_EP19_DesertVault_C_CE_DesertVault_AvaUsed");
static_assert(sizeof(Sanctuary3_M_EP19_DesertVault_C_CE_DesertVault_AvaUsed) == 0x000018, "Wrong size on Sanctuary3_M_EP19_DesertVault_C_CE_DesertVault_AvaUsed");
static_assert(offsetof(Sanctuary3_M_EP19_DesertVault_C_CE_DesertVault_AvaUsed, UseEvent) == 0x000000, "Member 'Sanctuary3_M_EP19_DesertVault_C_CE_DesertVault_AvaUsed::UseEvent' has a wrong offset!");

// Function Sanctuary3_M_EP19_DesertVault.Sanctuary3_M_EP19_DesertVault_C.ExecuteUbergraph_Sanctuary3_M_EP19_DesertVault
// 0x44F0 (0x44F0 - 0x0000)
struct Sanctuary3_M_EP19_DesertVault_C_ExecuteUbergraph_Sanctuary3_M_EP19_DesertVault final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0018(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0230(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0448(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0660(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x0878(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0A90(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0CA8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x0EC0(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x10D8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x10E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x10E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E9[0x7];                                     // 0x10E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x10F0(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x1308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1309[0x3];                                     // 0x1309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x130C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x1318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x131C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x131D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131E[0x2];                                     // 0x131E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue9;            // 0x1320(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue10;           // 0x1538(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x1750(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x175C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x1760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x1761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1762[0x2];                                     // 0x1762(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x1764(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x1770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x1774(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x1775(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1776[0x2];                                     // 0x1776(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue11;           // 0x1778(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x1990(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x199C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x19A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A1[0x7];                                     // 0x19A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x19A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x19B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B9[0x7];                                     // 0x19B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActionRegister>             Temp_struct_Variable1;                             // 0x19C0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable2;                             // 0x19D0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable3;                             // 0x19E0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue12;           // 0x19F0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue13;           // 0x1C08(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue14;           // 0x1E20(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue15;           // 0x2038(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue16;           // 0x2250(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue17;           // 0x2468(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue18;           // 0x2680(0x0218)()
	struct FItemPoolInfo                          K2Node_MakeStruct_ItemPoolInfo;                    // 0x2898(0x0088)()
	struct FItemPoolInfo                          K2Node_MakeStruct_ItemPoolInfo1;                   // 0x2920(0x0088)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x29A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x29B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x29C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x29D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x29E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x29F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x2A08(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x2A18(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x2A28(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x2A38(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x2A48(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x2A58(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x2A68(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate14;            // 0x2A78(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x2A88(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate16;            // 0x2A98(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate17;            // 0x2AA8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate18;            // 0x2AB8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate19;            // 0x2AC8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate20;            // 0x2AD8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate21;            // 0x2AE8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate22;            // 0x2AF8(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue19;           // 0x2B08(0x0218)()
	TArray<struct FGbxActionRegister>             Temp_struct_Variable4;                             // 0x2D20(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x2D30(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x2D3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x2D40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x2D41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D42[0x6];                                     // 0x2D42(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate23;            // 0x2D48(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate24;            // 0x2D58(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate25;            // 0x2D68(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate26;            // 0x2D78(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate27;            // 0x2D88(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate28;            // 0x2D98(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate29;            // 0x2DA8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate30;            // 0x2DB8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate31;            // 0x2DC8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x2DD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DD9[0x7];                                     // 0x2DD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUseEvent& UseEvent)> K2Node_CreateDelegate_OutputDelegate32;            // 0x2DE0(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue20;           // 0x2DF0(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x3008(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x3014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x3018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x3019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301A[0x2];                                     // 0x301A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation7;                // 0x301C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID7;                  // 0x3028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue7;                 // 0x302C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x302D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302E[0x2];                                     // 0x302E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation8;                // 0x3030(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID8;                  // 0x303C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue8;                 // 0x3040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x3041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3042[0x2];                                     // 0x3042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation9;                // 0x3044(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID9;                  // 0x3050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue9;                 // 0x3054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x3055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3056[0x2];                                     // 0x3056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation10;               // 0x3058(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID10;                 // 0x3064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue10;                // 0x3068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue10;             // 0x3069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_306A[0x2];                                     // 0x306A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation11;               // 0x306C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID11;                 // 0x3078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue11;                // 0x307C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue11;             // 0x307D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_307E[0x2];                                     // 0x307E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation12;               // 0x3080(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID12;                 // 0x308C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue12;                // 0x3090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue12;             // 0x3091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3092[0x2];                                     // 0x3092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation13;               // 0x3094(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID13;                 // 0x30A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue13;                // 0x30A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue13;             // 0x30A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A6[0x2];                                     // 0x30A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation14;               // 0x30A8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID14;                 // 0x30B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue14;                // 0x30B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue14;             // 0x30B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30BA[0x6];                                     // 0x30BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue21;           // 0x30C0(0x0218)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate33;            // 0x32D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate34;            // 0x32E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate35;            // 0x32F8(0x0010)(ZeroConstructor, NoDestructor)
	EGbxActionEndState                            K2Node_CustomEvent_EndState3;                      // 0x3308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3309[0x7];                                     // 0x3309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor3;                         // 0x3310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGbxActionEndState EndState, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate36;            // 0x3318(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable;                              // 0x3328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            Temp_byte_Variable;                                // 0x3330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3331[0x7];                                     // 0x3331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate37;            // 0x3338(0x0010)(ZeroConstructor, NoDestructor)
	EGbxActionEndState                            K2Node_CustomEvent_EndState2;                      // 0x3348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3349[0x7];                                     // 0x3349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor2;                         // 0x3350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGbxActionEndState EndState, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate38;            // 0x3358(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable1;                             // 0x3368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            Temp_byte_Variable1;                               // 0x3370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3371[0x7];                                     // 0x3371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate39;            // 0x3378(0x0010)(ZeroConstructor, NoDestructor)
	EGbxActionEndState                            K2Node_CustomEvent_EndState1;                      // 0x3388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3389[0x7];                                     // 0x3389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor1;                         // 0x3390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGbxActionEndState EndState, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate40;            // 0x3398(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable2;                             // 0x33A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            Temp_byte_Variable2;                               // 0x33B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B1[0x7];                                     // 0x33B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate41;            // 0x33B8(0x0010)(ZeroConstructor, NoDestructor)
	EGbxActionEndState                            K2Node_CustomEvent_EndState;                       // 0x33C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C9[0x7];                                     // 0x33C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x33D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGbxActionEndState EndState, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate42;            // 0x33D8(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 Temp_object_Variable3;                             // 0x33E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGbxActionEndState                            Temp_byte_Variable3;                               // 0x33F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x33F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x33F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F3[0x5];                                     // 0x33F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue22;           // 0x33F8(0x0218)()
	bool                                          Temp_bool_Event01_happened_Variable;               // 0x3610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Event02_happened_Variable;               // 0x3611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x3612(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3613[0x5];                                     // 0x3613(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue23;           // 0x3618(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation15;               // 0x3830(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID15;                 // 0x383C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue15;                // 0x3840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue15;             // 0x3841(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3842[0x2];                                     // 0x3842(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation16;               // 0x3844(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID16;                 // 0x3850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue16;                // 0x3854(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue16;             // 0x3855(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3856[0x2];                                     // 0x3856(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation17;               // 0x3858(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID17;                 // 0x3864(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue17;                // 0x3868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue17;             // 0x3869(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_386A[0x6];                                     // 0x386A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate43;            // 0x3870(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate44;            // 0x3880(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate45;            // 0x3890(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate46;            // 0x38A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate47;            // 0x38B0(0x0010)(ZeroConstructor, NoDestructor)
	class ABPChar_Marcus_C*                       CallFunc_GetMissionCharacter_ReturnValue;          // 0x38C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Hammerlock_C*                   CallFunc_GetMissionCharacter_ReturnValue1;         // 0x38C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_TouchingActor;              // 0x38D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ActorBoundEvent_bIsPlayer;                  // 0x38D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D9[0x7];                                     // 0x38D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ActorBoundEvent_ComponentTouched;           // 0x38E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate48;            // 0x38E8(0x0010)(ZeroConstructor, NoDestructor)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue2;         // 0x38F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x3900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue;            // 0x3908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x3910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3911[0x7];                                     // 0x3911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate49;            // 0x3918(0x0010)(ZeroConstructor, NoDestructor)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue3;         // 0x3928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue1;           // 0x3930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x3938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3939[0x7];                                     // 0x3939(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue4;         // 0x3940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue2;           // 0x3948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x3950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3951[0x7];                                     // 0x3951(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate50;            // 0x3958(0x0010)(ZeroConstructor, NoDestructor)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue5;         // 0x3968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue6;         // 0x3970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue3;           // 0x3978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x3980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3981[0x7];                                     // 0x3981(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue7;         // 0x3988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue4;           // 0x3990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate51;            // 0x3998(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x39A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A9[0x7];                                     // 0x39A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue8;         // 0x39B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue9;         // 0x39B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue5;           // 0x39C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x39C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39C9[0x7];                                     // 0x39C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue10;        // 0x39D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue6;           // 0x39D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate52;            // 0x39E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x39F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39F1[0x7];                                     // 0x39F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue11;        // 0x39F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Ava_C*                          CallFunc_GetMissionCharacter_ReturnValue12;        // 0x3A00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue7;           // 0x3A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue8;           // 0x3A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x3A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x3A19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1A[0x6];                                     // 0x3A1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue13;        // 0x3A20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate53;            // 0x3A28(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_ActorBoundEvent_NodeActor1;                 // 0x3A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_ArrivedPawn1;               // 0x3A40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue9;           // 0x3A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x3A50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A51[0x7];                                     // 0x3A51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Tannis_C*                       CallFunc_GetMissionCharacter_ReturnValue14;        // 0x3A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_NodeActor;                  // 0x3A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_ArrivedPawn;                // 0x3A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue10;          // 0x3A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x3A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A79[0x7];                                     // 0x3A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPChar_Lilith_C*                       CallFunc_GetMissionCharacter_ReturnValue15;        // 0x3A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPChar_Ava_C*                          CallFunc_GetMissionCharacter_ReturnValue16;        // 0x3A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x3A90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A91[0x7];                                     // 0x3A91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate54;            // 0x3A98(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate55;            // 0x3AA8(0x0010)(ZeroConstructor, NoDestructor)
	class ABPChar_Claptrap_C*                     CallFunc_GetMissionCharacter_ReturnValue17;        // 0x3AB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTask_ScriptedMove*             CallFunc_BeginScriptedMove_ReturnValue11;          // 0x3AC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
