#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShieldAug_Recharge_Rate

#include "Basic.hpp"

#include "Struct_ShieldAugData_structs.hpp"


namespace SDK::Params
{

// Function ShieldAug_Recharge_Rate.ShieldAug_Recharge_Rate_C.GetValueForAttribute
// 0x0090 (0x0090 - 0x0000)
struct ShieldAug_Recharge_Rate_C_GetValueForAttribute final
{
public:
	const class UGbxAttributeData*                Attribute;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UObject*                          Context;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MyReturn;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MyContext;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_ShieldAugData                  CallFunc_GetDataTableRowFromHandle_OutRow;         // 0x0028(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromHandle_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldAug_Recharge_Rate_C_GetValueForAttribute) == 0x000008, "Wrong alignment on ShieldAug_Recharge_Rate_C_GetValueForAttribute");
static_assert(sizeof(ShieldAug_Recharge_Rate_C_GetValueForAttribute) == 0x000090, "Wrong size on ShieldAug_Recharge_Rate_C_GetValueForAttribute");
static_assert(offsetof(ShieldAug_Recharge_Rate_C_GetValueForAttribute, Attribute) == 0x000000, "Member 'ShieldAug_Recharge_Rate_C_GetValueForAttribute::Attribute' has a wrong offset!");
static_assert(offsetof(ShieldAug_Recharge_Rate_C_GetValueForAttribute, Context) == 0x000008, "Member 'ShieldAug_Recharge_Rate_C_GetValueForAttribute::Context' has a wrong offset!");
static_assert(offsetof(ShieldAug_Recharge_Rate_C_GetValueForAttribute, ReturnValue) == 0x000010, "Member 'ShieldAug_Recharge_Rate_C_GetValueForAttribute::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Recharge_Rate_C_GetValueForAttribute, MyReturn) == 0x000014, "Member 'ShieldAug_Recharge_Rate_C_GetValueForAttribute::MyReturn' has a wrong offset!");
static_assert(offsetof(ShieldAug_Recharge_Rate_C_GetValueForAttribute, MyContext) == 0x000018, "Member 'ShieldAug_Recharge_Rate_C_GetValueForAttribute::MyContext' has a wrong offset!");
static_assert(offsetof(ShieldAug_Recharge_Rate_C_GetValueForAttribute, CallFunc_GetValueOfAttribute_ReturnValue) == 0x000020, "Member 'ShieldAug_Recharge_Rate_C_GetValueForAttribute::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Recharge_Rate_C_GetValueForAttribute, CallFunc_GetDataTableRowFromHandle_OutRow) == 0x000028, "Member 'ShieldAug_Recharge_Rate_C_GetValueForAttribute::CallFunc_GetDataTableRowFromHandle_OutRow' has a wrong offset!");
static_assert(offsetof(ShieldAug_Recharge_Rate_C_GetValueForAttribute, CallFunc_GetDataTableRowFromHandle_ReturnValue) == 0x000088, "Member 'ShieldAug_Recharge_Rate_C_GetValueForAttribute::CallFunc_GetDataTableRowFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Recharge_Rate_C_GetValueForAttribute, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'ShieldAug_Recharge_Rate_C_GetValueForAttribute::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

