#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShieldAug_AureliaSlideKick

#include "Basic.hpp"

#include "GbxWeapon_structs.hpp"
#include "OakGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function ShieldAug_AureliaSlideKick.ShieldAug_AureliaSlideKick_C.K2_OnCausedDamage
// 0x0270 (0x0270 - 0x0000)
struct ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage final
{
public:
	class AShield*                                Shield;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAugmentData                           StackData;                                         // 0x0008(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class AActor*                                 DamageInstigator;                                  // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGbxDamageType*                   DamageType;                                        // 0x0048(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageSource*                    DamageSource;                                      // 0x0050(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedActor;                                      // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCausedDamageDetails                   Details;                                           // 0x0060(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	float                                         FreezeAmount;                                      // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShieldPercent;                                     // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamagedEnemy;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetAssociatedPawn_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueFromStackCount_ReturnValue;       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueOfAttribute_ReturnValue;          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectInstanceReference         CallFunc_TriggerElementalEffect_ReturnValue;       // 0x00F8(0x0018)(NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0124(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightProjectileInitializationData     K2Node_MakeStruct_LightProjectileInitializationData; // 0x0130(0x0140)(ContainsInstancedReference)
};
static_assert(alignof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage) == 0x000008, "Wrong alignment on ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage");
static_assert(sizeof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage) == 0x000270, "Wrong size on ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, Shield) == 0x000000, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::Shield' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, StackData) == 0x000008, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::StackData' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, DamageInstigator) == 0x000038, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::DamageInstigator' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, Damage) == 0x000040, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::Damage' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, DamageType) == 0x000048, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::DamageType' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, DamageSource) == 0x000050, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::DamageSource' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, DamagedActor) == 0x000058, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::DamagedActor' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, Details) == 0x000060, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::Details' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, FreezeAmount) == 0x0000C0, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::FreezeAmount' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, ShieldPercent) == 0x0000C4, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::ShieldPercent' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, DamagedEnemy) == 0x0000C8, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::DamagedEnemy' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_GetAssociatedPawn_ReturnValue) == 0x0000D0, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_GetAssociatedPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_GetValueFromStackCount_ReturnValue) == 0x0000D8, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_GetValueFromStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000DC, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000E0, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_GetValueOfAttribute_ReturnValue) == 0x0000E4, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_GetValueOfAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_GetObjectClass_ReturnValue) == 0x0000E8, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000F0, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_TriggerElementalEffect_ReturnValue) == 0x0000F8, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_TriggerElementalEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_GetOwner_ReturnValue) == 0x000110, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000118, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, CallFunc_Add_VectorVector_ReturnValue) == 0x000124, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage, K2Node_MakeStruct_LightProjectileInitializationData) == 0x000130, "Member 'ShieldAug_AureliaSlideKick_C_K2_OnCausedDamage::K2Node_MakeStruct_LightProjectileInitializationData' has a wrong offset!");

}

