#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShieldAug_Breakup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"


namespace SDK::Params
{

// Function ShieldAug_Breakup.ShieldAug_Breakup_C.K2_OnShieldEquipped
// 0x0310 (0x0310 - 0x0000)
struct ShieldAug_Breakup_C_K2_OnShieldEquipped final
{
public:
	class AShield*                                Shield;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          Equipper;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAugmentData                           StackData;                                         // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	float                                         CallFunc_GetValueFromStackCount_ReturnValue;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ShieldMod_C*                        K2Node_DynamicCast_AsBP_Shield_Mod;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBaseShieldDamage_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetDamageType_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0xF];                                       // 0x00C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x00D0(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldAug_Breakup_C_K2_OnShieldEquipped) == 0x000010, "Wrong alignment on ShieldAug_Breakup_C_K2_OnShieldEquipped");
static_assert(sizeof(ShieldAug_Breakup_C_K2_OnShieldEquipped) == 0x000310, "Wrong size on ShieldAug_Breakup_C_K2_OnShieldEquipped");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, Shield) == 0x000000, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::Shield' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, Equipper) == 0x000008, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::Equipper' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, StackData) == 0x000010, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::StackData' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_GetValueFromStackCount_ReturnValue) == 0x000040, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_GetValueFromStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, K2Node_DynamicCast_AsBP_Shield_Mod) == 0x000048, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::K2Node_DynamicCast_AsBP_Shield_Mod' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_GetBaseShieldDamage_ReturnValue) == 0x000054, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_GetBaseShieldDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_GetDamageType_ReturnValue) == 0x000060, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_GetDamageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_GetOwner_ReturnValue1) == 0x000080, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000090, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000C0, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x0000D0, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldEquipped, CallFunc_SpawnActorAsync_ReturnValue) == 0x000300, "Member 'ShieldAug_Breakup_C_K2_OnShieldEquipped::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");

// Function ShieldAug_Breakup.ShieldAug_Breakup_C.K2_OnShieldDepleted
// 0x02C0 (0x02C0 - 0x0000)
struct ShieldAug_Breakup_C_K2_OnShieldDepleted final
{
public:
	class AShield*                                Shield;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameResourcePoolReference             ResourcePool;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
	struct FAugmentData                           StackData;                                         // 0x0020(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class AActor*                                 ProjOwner;                                         // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueFromStackCount_ReturnValue;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetDamageType_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBaseShieldDamage_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ShieldMod_C*                        K2Node_DynamicCast_AsBP_Shield_Mod;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0080(0x0230)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldAug_Breakup_C_K2_OnShieldDepleted) == 0x000010, "Wrong alignment on ShieldAug_Breakup_C_K2_OnShieldDepleted");
static_assert(sizeof(ShieldAug_Breakup_C_K2_OnShieldDepleted) == 0x0002C0, "Wrong size on ShieldAug_Breakup_C_K2_OnShieldDepleted");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, Shield) == 0x000000, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::Shield' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, ResourcePool) == 0x000008, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::ResourcePool' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, StackData) == 0x000020, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::StackData' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, ProjOwner) == 0x000050, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::ProjOwner' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, CallFunc_GetValueFromStackCount_ReturnValue) == 0x000058, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::CallFunc_GetValueFromStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, CallFunc_GetDamageType_ReturnValue) == 0x000060, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::CallFunc_GetDamageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, CallFunc_GetBaseShieldDamage_ReturnValue) == 0x000068, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::CallFunc_GetBaseShieldDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00006C, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, K2Node_DynamicCast_AsBP_Shield_Mod) == 0x000070, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::K2Node_DynamicCast_AsBP_Shield_Mod' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000080, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, CallFunc_IsValid_ReturnValue) == 0x0002B0, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldDepleted, CallFunc_SpawnActorAsync_ReturnValue) == 0x0002B4, "Member 'ShieldAug_Breakup_C_K2_OnShieldDepleted::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");

// Function ShieldAug_Breakup.ShieldAug_Breakup_C.K2_OnShieldUnequipped
// 0x0040 (0x0040 - 0x0000)
struct ShieldAug_Breakup_C_K2_OnShieldUnequipped final
{
public:
	class AShield*                                Shield;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          Equipper;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAugmentData                           StackData;                                         // 0x0010(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ShieldAug_Breakup_C_K2_OnShieldUnequipped) == 0x000008, "Wrong alignment on ShieldAug_Breakup_C_K2_OnShieldUnequipped");
static_assert(sizeof(ShieldAug_Breakup_C_K2_OnShieldUnequipped) == 0x000040, "Wrong size on ShieldAug_Breakup_C_K2_OnShieldUnequipped");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldUnequipped, Shield) == 0x000000, "Member 'ShieldAug_Breakup_C_K2_OnShieldUnequipped::Shield' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldUnequipped, Equipper) == 0x000008, "Member 'ShieldAug_Breakup_C_K2_OnShieldUnequipped::Equipper' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnShieldUnequipped, StackData) == 0x000010, "Member 'ShieldAug_Breakup_C_K2_OnShieldUnequipped::StackData' has a wrong offset!");

// Function ShieldAug_Breakup.ShieldAug_Breakup_C.K2_OnReplicatedEffectTriggered
// 0x0040 (0x0040 - 0x0000)
struct ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered final
{
public:
	class AShield*                                Shield;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAugmentData                           StackData;                                         // 0x0008(0x0030)(BlueprintVisible, Parm, OutParm, ReferenceParm, NoDestructor)
	class UObject*                                AdditionalContext;                                 // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered) == 0x000008, "Wrong alignment on ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered");
static_assert(sizeof(ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered) == 0x000040, "Wrong size on ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered, Shield) == 0x000000, "Member 'ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered::Shield' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered, StackData) == 0x000008, "Member 'ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered::StackData' has a wrong offset!");
static_assert(offsetof(ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered, AdditionalContext) == 0x000038, "Member 'ShieldAug_Breakup_C_K2_OnReplicatedEffectTriggered::AdditionalContext' has a wrong offset!");

}

