#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SideMission_DLC2_SinisterSounds

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_OakMission_classes.hpp"
#include "GbxMission_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SideMission_DLC2_SinisterSounds.SideMission_DLC2_SinisterSounds_C
// 0x0138 (0x0648 - 0x0510)
class USideMission_DLC2_SinisterSounds_C final : public UBP_OakMission_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SideMission_DLC2_SinisterSounds_C;  // 0x0510(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveSet*                   SET_PickUpRecorder_ObjSetVar;                      // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PickUpRecorder_ObjVar;                         // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_RecordSinisterSounds_ObjVar;                   // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_RunOverFrostbiters_ObjSetVar;                  // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_RunOverFrostbiters_ObjVar;                     // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_KillBadassWolven_ObjSetVar;                    // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillBadassWolven_ObjVar;                       // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_FindBanshee_ObjSetVar;                         // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FindBanshee_ObjVar;                            // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_UseDoorBell_ObjSetVar;                         // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_UseDoorBell_ObjVar;                            // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_PickUpECHO_ObjSetVar;                          // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_PickUpECHO_ObjVar;                             // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GoToSpinsmouthCamp_ObjSetVar;                  // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToSpinsmouthCamp_ObjVar;                     // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_KillDJSpinsmouth_ObjSetVar;                    // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillDJSpinsmouth_ObjVar;                       // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_FreeBanshee_ObjSetVar;                         // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_FreeBanshee_ObjVar;                            // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_TalktoBanshee_ObjSetVar;                       // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_TalkToBanshee_ObjVar;                          // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GiveRecorder_ObjSetVar;                        // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GiveRecorder_ObjVar;                           // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_ListenToDarkMix_ObjSetVar;                     // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_ListenToDarkMix_ObjVar;                        // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_GoToLake_ObjSetVar;                            // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_GoToLake_ObjVar;                               // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_StartRecordSinisterSounds_ObjVar;          // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_Breadcrumb_KillWolven_ObjVar;                  // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_Breadcrumb_FindBanshee_ObjVar;                 // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_KillAmbushers_ObjSetVar;                       // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_KillAmbushers_ObjVar;                          // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_PlayDarkMix_ObjVar;                        // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjectiveSet*                   SET_SecureArea_ObjSetVar;                          // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_SecureArea_ObjVar;                             // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_BansheeScream01_ObjVar;                    // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_INV_BansheeScream02_ObjVar;                    // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionObjective*                      Obj_Breadcrumb_Precheck_ObjVar;                    // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SideMission_DLC2_SinisterSounds(int32 EntryPoint);
	void MissionKickoff();
	void Obj_RecordSinisterSounds(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_Breadcrumb_Precheck(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_INV_BansheeScream02(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_INV_BansheeScream01(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_RecordSinisterSounds_Objective__PROXY_10();
	void MCE_SecureArea(class UObject* Context);
	void SET_SecureArea(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_SecureArea(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_RecordSinisterSounds(class UObject* Context);
	void MCE_PlayDarkMix(class UObject* Context);
	void Obj_INV_PlayDarkMix(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_RecordSinisterSounds_Objective__PROXY_9();
	void MCE_KillAmbushers(class UObject* Context);
	void SET_KillAmbushers(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_KillAmbushers(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_RunOverFrostbiters(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_Breadcrumb_FindBanshee(class UObject* Context);
	void Obj_Breadcrumb_FindBanshee(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_Breadcrumb_KillWolven(class UObject* Context);
	void Obj_Breadcrumb_KillWolven(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void CustomEvent_OnEchoLog_1_Finished();
	void Obj_PickUpRecorder(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_PickUpRecorder(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PickUpRecorder(class UObject* Context);
	void Obj_INV_StartRecordSinisterSounds(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void _Obj_RecordSinisterSounds_Objective__PROXY_8();
	void _Obj_RecordSinisterSounds_Objective__PROXY_7();
	void _Obj_RecordSinisterSounds_Objective__PROXY_6();
	void _Obj_RecordSinisterSounds_Objective__PROXY_5();
	void _Obj_RecordSinisterSounds_Objective__PROXY_4();
	void _Obj_RecordSinisterSounds_Objective__PROXY_3();
	void _Obj_RecordSinisterSounds_Objective__PROXY_2();
	void _Obj_RecordSinisterSounds_Objective__PROXY_1();
	void _Obj_RecordSinisterSounds_Objective__PROXY_0();
	void _Obj_RecordSinisterSounds_Objective__PROXY();
	void SET_RunOverFrostbiters(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_RunOverFrostbiters(class UObject* Context);
	void MCE_GoToLake(class UObject* Context);
	void SET_GoToLake(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GoToLake(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_KillBadassWolven(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_KillBadassWolven(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_KillBadassWolven(class UObject* Context);
	void MCE_ListenToDarkMix(class UObject* Context);
	void SET_ListenToDarkMix(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_ListenToDarkMix(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_FindBanshee(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_FindBanshee(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_GiveRecorder(class UObject* Context);
	void SET_GiveRecorder(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GiveRecorder(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_FindBanshee(class UObject* Context);
	void MCE_TalkToBanshee(class UObject* Context);
	void SET_TalktoBanshee(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_TalkToBanshee(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_UseDoorBell(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_FreeBanshee(class UObject* Context);
	void SET_FreeBanshee(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_FreeBanshee(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_UseDoorBell(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_UseDoorBell(class UObject* Context);
	void MCE_KillDJSpinsmouth(class UObject* Context);
	void SET_KillDJSpinsmouth(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_KillDJSpinsmouth(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void MCE_GoToSpinsmouthCamp(class UObject* Context);
	void SET_GoToSpinsmouthCamp(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void Obj_GoToSpinsmouthCamp(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void Obj_PickUpECHO(EMissionObjectiveEvent ObjectiveEvent, int32 ObjectiveCount);
	void SET_PickUpECHO(EMissionObjectiveSetEvent ObjectiveSetEvent);
	void MCE_PickUpECHO(class UObject* Context);
	void OnDialogSequenceFinished_20();
	void OnDialogSequenceFinished_21();
	void OnDialogSequenceFinished_22();
	void OnDialogSequenceFinished_23();
	void OnDialogSequenceFinished_24();
	void OnDialogSequenceFinished_25();
	void OnDialogSequenceFinished_26();
	void OnDialogSequenceFinished_27();
	void OnDialogSequenceFinished_28();
	void OnDialogSequenceFinished_29();
	void OnDialogSequenceFinished_30();
	void OnDialogSequenceFinished_31();
	void OnDialogSequenceFinished_32();
	void OnDialogSequenceFinished_33();
	void OnDialogSequenceFinished_34();
	void OnDialogSequenceFinished_35();
	void OnDialogSequenceFinished_36();
	void OnDialogSequenceFinished_37();
	void OnDialogSequenceFinished_38();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SideMission_DLC2_SinisterSounds_C">();
	}
	static class USideMission_DLC2_SinisterSounds_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USideMission_DLC2_SinisterSounds_C>();
	}
};
static_assert(alignof(USideMission_DLC2_SinisterSounds_C) == 0x000008, "Wrong alignment on USideMission_DLC2_SinisterSounds_C");
static_assert(sizeof(USideMission_DLC2_SinisterSounds_C) == 0x000648, "Wrong size on USideMission_DLC2_SinisterSounds_C");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, UberGraphFrame_SideMission_DLC2_SinisterSounds_C) == 0x000510, "Member 'USideMission_DLC2_SinisterSounds_C::UberGraphFrame_SideMission_DLC2_SinisterSounds_C' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_PickUpRecorder_ObjSetVar) == 0x000518, "Member 'USideMission_DLC2_SinisterSounds_C::SET_PickUpRecorder_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_PickUpRecorder_ObjVar) == 0x000520, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_PickUpRecorder_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_RecordSinisterSounds_ObjVar) == 0x000528, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_RecordSinisterSounds_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_RunOverFrostbiters_ObjSetVar) == 0x000530, "Member 'USideMission_DLC2_SinisterSounds_C::SET_RunOverFrostbiters_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_RunOverFrostbiters_ObjVar) == 0x000538, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_RunOverFrostbiters_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_KillBadassWolven_ObjSetVar) == 0x000540, "Member 'USideMission_DLC2_SinisterSounds_C::SET_KillBadassWolven_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_KillBadassWolven_ObjVar) == 0x000548, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_KillBadassWolven_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_FindBanshee_ObjSetVar) == 0x000550, "Member 'USideMission_DLC2_SinisterSounds_C::SET_FindBanshee_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_FindBanshee_ObjVar) == 0x000558, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_FindBanshee_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_UseDoorBell_ObjSetVar) == 0x000560, "Member 'USideMission_DLC2_SinisterSounds_C::SET_UseDoorBell_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_UseDoorBell_ObjVar) == 0x000568, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_UseDoorBell_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_PickUpECHO_ObjSetVar) == 0x000570, "Member 'USideMission_DLC2_SinisterSounds_C::SET_PickUpECHO_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_PickUpECHO_ObjVar) == 0x000578, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_PickUpECHO_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_GoToSpinsmouthCamp_ObjSetVar) == 0x000580, "Member 'USideMission_DLC2_SinisterSounds_C::SET_GoToSpinsmouthCamp_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_GoToSpinsmouthCamp_ObjVar) == 0x000588, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_GoToSpinsmouthCamp_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_KillDJSpinsmouth_ObjSetVar) == 0x000590, "Member 'USideMission_DLC2_SinisterSounds_C::SET_KillDJSpinsmouth_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_KillDJSpinsmouth_ObjVar) == 0x000598, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_KillDJSpinsmouth_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_FreeBanshee_ObjSetVar) == 0x0005A0, "Member 'USideMission_DLC2_SinisterSounds_C::SET_FreeBanshee_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_FreeBanshee_ObjVar) == 0x0005A8, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_FreeBanshee_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_TalktoBanshee_ObjSetVar) == 0x0005B0, "Member 'USideMission_DLC2_SinisterSounds_C::SET_TalktoBanshee_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_TalkToBanshee_ObjVar) == 0x0005B8, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_TalkToBanshee_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_GiveRecorder_ObjSetVar) == 0x0005C0, "Member 'USideMission_DLC2_SinisterSounds_C::SET_GiveRecorder_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_GiveRecorder_ObjVar) == 0x0005C8, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_GiveRecorder_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_ListenToDarkMix_ObjSetVar) == 0x0005D0, "Member 'USideMission_DLC2_SinisterSounds_C::SET_ListenToDarkMix_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_ListenToDarkMix_ObjVar) == 0x0005D8, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_ListenToDarkMix_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_GoToLake_ObjSetVar) == 0x0005E0, "Member 'USideMission_DLC2_SinisterSounds_C::SET_GoToLake_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_GoToLake_ObjVar) == 0x0005E8, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_GoToLake_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_INV_StartRecordSinisterSounds_ObjVar) == 0x0005F0, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_INV_StartRecordSinisterSounds_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_Breadcrumb_KillWolven_ObjVar) == 0x0005F8, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_Breadcrumb_KillWolven_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_Breadcrumb_FindBanshee_ObjVar) == 0x000600, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_Breadcrumb_FindBanshee_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_KillAmbushers_ObjSetVar) == 0x000608, "Member 'USideMission_DLC2_SinisterSounds_C::SET_KillAmbushers_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_KillAmbushers_ObjVar) == 0x000610, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_KillAmbushers_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_INV_PlayDarkMix_ObjVar) == 0x000618, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_INV_PlayDarkMix_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, SET_SecureArea_ObjSetVar) == 0x000620, "Member 'USideMission_DLC2_SinisterSounds_C::SET_SecureArea_ObjSetVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_SecureArea_ObjVar) == 0x000628, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_SecureArea_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_INV_BansheeScream01_ObjVar) == 0x000630, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_INV_BansheeScream01_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_INV_BansheeScream02_ObjVar) == 0x000638, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_INV_BansheeScream02_ObjVar' has a wrong offset!");
static_assert(offsetof(USideMission_DLC2_SinisterSounds_C, Obj_Breadcrumb_Precheck_ObjVar) == 0x000640, "Member 'USideMission_DLC2_SinisterSounds_C::Obj_Breadcrumb_Precheck_ObjVar' has a wrong offset!");

}

