#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SideMission_DLC2_Bounty_DebtCollector

#include "Basic.hpp"

#include "GbxDialog_structs.hpp"
#include "GbxMission_structs.hpp"


namespace SDK::Params
{

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector
// 0x1650 (0x1650 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue;             // 0x0008(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue1;            // 0x0220(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue2;            // 0x0438(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation;                 // 0x0650(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID;                   // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue;                  // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_662[0x6];                                      // 0x0662(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue3;            // 0x0668(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation1;                // 0x0880(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID1;                  // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue1;                 // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_891[0x7];                                      // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue4;            // 0x0898(0x0218)()
	bool                                          CallFunc_Conv_IntToBool_ReturnValue1;              // 0x0AB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB1[0x3];                                      // 0x0AB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation2;                // 0x0AB4(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID2;                  // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue2;                 // 0x0AC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x0AC5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC6[0x2];                                      // 0x0AC6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue5;            // 0x0AC8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue6;            // 0x0CE0(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue7;            // 0x0EF8(0x0218)()
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue8;            // 0x1110(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation3;                // 0x1328(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID3;                  // 0x1334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue3;                 // 0x1338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x1339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133A[0x2];                                     // 0x133A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation4;                // 0x133C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID4;                  // 0x1348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue4;                 // 0x134C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x134D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_134E[0x2];                                     // 0x134E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation5;                // 0x1350(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID5;                  // 0x135C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue5;                 // 0x1360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x1361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1362[0x2];                                     // 0x1362(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation6;                // 0x1364(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID6;                  // 0x1370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue6;                 // 0x1374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x1375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1376[0x2];                                     // 0x1376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation7;                // 0x1378(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID7;                  // 0x1384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue7;                 // 0x1388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x1389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_138A[0x6];                                     // 0x138A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogContext                         CallFunc_NewDialogContext_ReturnValue9;            // 0x1390(0x0218)()
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation8;                // 0x15A8(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID8;                  // 0x15B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue8;                 // 0x15B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x15B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15BA[0x6];                                     // 0x15BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x15C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FDialogConversation                    CallFunc_FinishSpeak_Conversation9;                // 0x15D0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FinishSpeak_SequenceID9;                  // 0x15DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FinishSpeak_ReturnValue9;                 // 0x15E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x15E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15E2[0x6];                                     // 0x15E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x15E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x15F8(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context3;         // 0x1608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2; // 0x1610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent3;      // 0x1611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1612[0x2];                                     // 0x1612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount3;      // 0x1614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context2;         // 0x1618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x1620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent2;      // 0x1621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1622[0x2];                                     // 0x1622(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount2;      // 0x1624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1; // 0x1628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x1629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent1;      // 0x162A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162B[0x1];                                     // 0x162B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount1;      // 0x162C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context1;         // 0x1630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x1638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMissionObjectiveSetEvent                     MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent; // 0x1639(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionObjectiveEvent                        MissionK2Node_ObjectiveEvent_ObjectiveEvent;       // 0x163A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163B[0x1];                                     // 0x163B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MissionK2Node_ObjectiveEvent_ObjectiveCount;       // 0x163C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                MissionK2Node_MissionCustomEvent_Context;          // 0x1640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x1648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x1649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector) == 0x000008, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector) == 0x001650, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, EntryPoint) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::EntryPoint' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue) == 0x000008, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue1) == 0x000220, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue2) == 0x000438, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation) == 0x000650, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID) == 0x00065C, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue) == 0x000660, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue) == 0x000661, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue3) == 0x000668, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation1) == 0x000880, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID1) == 0x00088C, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue1) == 0x000890, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue4) == 0x000898, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue1) == 0x000AB0, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation2) == 0x000AB4, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID2) == 0x000AC0, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue2) == 0x000AC4, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue2) == 0x000AC5, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue5) == 0x000AC8, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue6) == 0x000CE0, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue7) == 0x000EF8, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue8) == 0x001110, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation3) == 0x001328, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation3' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID3) == 0x001334, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID3' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue3) == 0x001338, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue3) == 0x001339, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation4) == 0x00133C, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation4' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID4) == 0x001348, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID4' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue4) == 0x00134C, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue4) == 0x00134D, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation5) == 0x001350, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation5' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID5) == 0x00135C, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID5' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue5) == 0x001360, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue5' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue5) == 0x001361, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation6) == 0x001364, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation6' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID6) == 0x001370, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID6' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue6) == 0x001374, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue6' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue6) == 0x001375, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation7) == 0x001378, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation7' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID7) == 0x001384, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID7' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue7) == 0x001388, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue7' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue7) == 0x001389, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_NewDialogContext_ReturnValue9) == 0x001390, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_NewDialogContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation8) == 0x0015A8, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation8' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID8) == 0x0015B4, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID8' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue8) == 0x0015B8, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue8' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue8) == 0x0015B9, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, K2Node_CreateDelegate_OutputDelegate) == 0x0015C0, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_Conversation9) == 0x0015D0, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_Conversation9' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_SequenceID9) == 0x0015DC, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_SequenceID9' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_FinishSpeak_ReturnValue9) == 0x0015E0, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_FinishSpeak_ReturnValue9' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_Conv_IntToBool_ReturnValue9) == 0x0015E1, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_Conv_IntToBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, K2Node_CreateDelegate_OutputDelegate1) == 0x0015E8, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, K2Node_CreateDelegate_OutputDelegate2) == 0x0015F8, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_MissionCustomEvent_Context3) == 0x001608, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_MissionCustomEvent_Context3' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2) == 0x001610, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveEvent_ObjectiveEvent3) == 0x001611, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveEvent_ObjectiveEvent3' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveEvent_ObjectiveCount3) == 0x001614, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveEvent_ObjectiveCount3' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_MissionCustomEvent_Context2) == 0x001618, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_MissionCustomEvent_Context2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, K2Node_SwitchEnum_CmpSuccess) == 0x001620, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveEvent_ObjectiveEvent2) == 0x001621, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveEvent_ObjectiveEvent2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveEvent_ObjectiveCount2) == 0x001624, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveEvent_ObjectiveCount2' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1) == 0x001628, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, K2Node_SwitchEnum1_CmpSuccess) == 0x001629, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveEvent_ObjectiveEvent1) == 0x00162A, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveEvent_ObjectiveEvent1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveEvent_ObjectiveCount1) == 0x00162C, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveEvent_ObjectiveCount1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_MissionCustomEvent_Context1) == 0x001630, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_MissionCustomEvent_Context1' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, K2Node_SwitchEnum2_CmpSuccess) == 0x001638, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent) == 0x001639, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveSetEvent_ObjectiveSetEvent' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveEvent_ObjectiveEvent) == 0x00163A, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveEvent_ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_ObjectiveEvent_ObjectiveCount) == 0x00163C, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_ObjectiveEvent_ObjectiveCount' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, MissionK2Node_MissionCustomEvent_Context) == 0x001640, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::MissionK2Node_MissionCustomEvent_Context' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x001648, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector, K2Node_SwitchEnum3_CmpSuccess) == 0x001649, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_ExecuteUbergraph_SideMission_DLC2_Bounty_DebtCollector::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.MCE_INV_DestroyBottles
// 0x0008 (0x0008 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_MCE_INV_DestroyBottles final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_INV_DestroyBottles) == 0x000008, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_MCE_INV_DestroyBottles");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_INV_DestroyBottles) == 0x000008, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_MCE_INV_DestroyBottles");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_INV_DestroyBottles, Context) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_MCE_INV_DestroyBottles::Context' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.Obj_INV_DestroyBottles
// 0x0008 (0x0008 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_Obj_INV_DestroyBottles final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_INV_DestroyBottles) == 0x000004, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_Obj_INV_DestroyBottles");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_INV_DestroyBottles) == 0x000008, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_Obj_INV_DestroyBottles");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_INV_DestroyBottles, ObjectiveEvent) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Obj_INV_DestroyBottles::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_INV_DestroyBottles, ObjectiveCount) == 0x000004, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Obj_INV_DestroyBottles::ObjectiveCount' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.Set_FindGideon
// 0x0001 (0x0001 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_Set_FindGideon final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_Set_FindGideon) == 0x000001, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_Set_FindGideon");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_Set_FindGideon) == 0x000001, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_Set_FindGideon");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Set_FindGideon, ObjectiveSetEvent) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Set_FindGideon::ObjectiveSetEvent' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.MCE_KillGideon
// 0x0008 (0x0008 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_MCE_KillGideon final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_KillGideon) == 0x000008, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_MCE_KillGideon");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_KillGideon) == 0x000008, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_MCE_KillGideon");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_KillGideon, Context) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_MCE_KillGideon::Context' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.Obj_KillGideon
// 0x0008 (0x0008 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_Obj_KillGideon final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_KillGideon) == 0x000004, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_Obj_KillGideon");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_KillGideon) == 0x000008, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_Obj_KillGideon");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_KillGideon, ObjectiveEvent) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Obj_KillGideon::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_KillGideon, ObjectiveCount) == 0x000004, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Obj_KillGideon::ObjectiveCount' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.Set_KillGideon
// 0x0001 (0x0001 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_Set_KillGideon final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_Set_KillGideon) == 0x000001, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_Set_KillGideon");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_Set_KillGideon) == 0x000001, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_Set_KillGideon");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Set_KillGideon, ObjectiveSetEvent) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Set_KillGideon::ObjectiveSetEvent' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.Obj_FindGideon
// 0x0008 (0x0008 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_Obj_FindGideon final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_FindGideon) == 0x000004, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_Obj_FindGideon");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_FindGideon) == 0x000008, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_Obj_FindGideon");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_FindGideon, ObjectiveEvent) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Obj_FindGideon::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_FindGideon, ObjectiveCount) == 0x000004, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Obj_FindGideon::ObjectiveCount' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.MCE_DestroyBottles
// 0x0008 (0x0008 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_MCE_DestroyBottles final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_DestroyBottles) == 0x000008, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_MCE_DestroyBottles");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_DestroyBottles) == 0x000008, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_MCE_DestroyBottles");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_DestroyBottles, Context) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_MCE_DestroyBottles::Context' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.Obj_DestroyBottles
// 0x0008 (0x0008 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_Obj_DestroyBottles final
{
public:
	EMissionObjectiveEvent                        ObjectiveEvent;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ObjectiveCount;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_DestroyBottles) == 0x000004, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_Obj_DestroyBottles");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_DestroyBottles) == 0x000008, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_Obj_DestroyBottles");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_DestroyBottles, ObjectiveEvent) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Obj_DestroyBottles::ObjectiveEvent' has a wrong offset!");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Obj_DestroyBottles, ObjectiveCount) == 0x000004, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Obj_DestroyBottles::ObjectiveCount' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.Set_DestroyBottles
// 0x0001 (0x0001 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_Set_DestroyBottles final
{
public:
	EMissionObjectiveSetEvent                     ObjectiveSetEvent;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_Set_DestroyBottles) == 0x000001, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_Set_DestroyBottles");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_Set_DestroyBottles) == 0x000001, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_Set_DestroyBottles");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_Set_DestroyBottles, ObjectiveSetEvent) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_Set_DestroyBottles::ObjectiveSetEvent' has a wrong offset!");

// Function SideMission_DLC2_Bounty_DebtCollector.SideMission_DLC2_Bounty_DebtCollector_C.MCE_FindGideon
// 0x0008 (0x0008 - 0x0000)
struct SideMission_DLC2_Bounty_DebtCollector_C_MCE_FindGideon final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_FindGideon) == 0x000008, "Wrong alignment on SideMission_DLC2_Bounty_DebtCollector_C_MCE_FindGideon");
static_assert(sizeof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_FindGideon) == 0x000008, "Wrong size on SideMission_DLC2_Bounty_DebtCollector_C_MCE_FindGideon");
static_assert(offsetof(SideMission_DLC2_Bounty_DebtCollector_C_MCE_FindGideon, Context) == 0x000000, "Member 'SideMission_DLC2_Bounty_DebtCollector_C_MCE_FindGideon::Context' has a wrong offset!");

}

