#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnDLCScript_BloodyHarvest

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_HauntedSpawnType_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SpawnDLCScript_BloodyHarvest.SpawnDLCScript_BloodyHarvest_C.OnActorDied
// 0x03B0 (0x03B0 - 0x0000)
struct SpawnDLCScript_BloodyHarvest_C_OnActorDied final
{
public:
	class USpawnerComponent*                      SpawnerComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTagContainerComponent*         TagComponent;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  GameplayTag_LootGhost;                             // 0x0018(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  GameplayTag_BadassHaunted;                         // 0x0038(0x0020)(Edit, BlueprintVisible)
	Enum_HauntedSpawnType                         DiedAsHauntedType;                                 // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayTag_Haunted;                               // 0x0060(0x0020)(Edit, BlueprintVisible)
	class AActor*                                 InActorDied;                                       // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_HauntedSpawnType                         Temp_byte_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable2;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface1; // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable5;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue1;  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2; // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSpawnTransform_Output;                 // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	Enum_HauntedSpawnType                         Temp_byte_Variable1;                               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue2;  // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select1_Default;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0170(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnDLCScript_BloodyHarvest_C_OnActorDied) == 0x000010, "Wrong alignment on SpawnDLCScript_BloodyHarvest_C_OnActorDied");
static_assert(sizeof(SpawnDLCScript_BloodyHarvest_C_OnActorDied) == 0x0003B0, "Wrong size on SpawnDLCScript_BloodyHarvest_C_OnActorDied");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, SpawnerComponent) == 0x000000, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::SpawnerComponent' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Actor) == 0x000008, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Actor' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, TagComponent) == 0x000010, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::TagComponent' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, GameplayTag_LootGhost) == 0x000018, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::GameplayTag_LootGhost' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, GameplayTag_BadassHaunted) == 0x000038, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::GameplayTag_BadassHaunted' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, DiedAsHauntedType) == 0x000058, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::DiedAsHauntedType' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, GameplayTag_Haunted) == 0x000060, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::GameplayTag_Haunted' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, InActorDied) == 0x000080, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::InActorDied' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_class_Variable) == 0x000088, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_class_Variable1) == 0x000090, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_byte_Variable) == 0x000098, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_class_Variable2) == 0x0000A0, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_class_Variable3) == 0x0000A8, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_class_Variable4) == 0x0000B0, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_bool_Variable) == 0x0000B8, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_bool_Variable1) == 0x0000B9, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000C0, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_bool_Variable2) == 0x0000D1, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000D2, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, K2Node_Select_Default) == 0x0000D8, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface1) == 0x0000E0, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, K2Node_DynamicCast_bSuccess1) == 0x0000F0, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_class_Variable5) == 0x0000F8, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_class_Variable5' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, CallFunc_HasAnyMatchingGameplayTags_ReturnValue1) == 0x000100, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::CallFunc_HasAnyMatchingGameplayTags_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2) == 0x000108, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, K2Node_DynamicCast_bSuccess2) == 0x000118, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, CallFunc_GetComponentByClass_ReturnValue) == 0x000120, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, CallFunc_GetSpawnTransform_Output) == 0x000130, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::CallFunc_GetSpawnTransform_Output' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, Temp_byte_Variable1) == 0x000160, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, CallFunc_HasAnyMatchingGameplayTags_ReturnValue2) == 0x000161, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::CallFunc_HasAnyMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, K2Node_Select1_Default) == 0x000168, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000170, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorDied, CallFunc_SpawnActorAsync_ReturnValue) == 0x0003A0, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorDied::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");

// Function SpawnDLCScript_BloodyHarvest.SpawnDLCScript_BloodyHarvest_C.OnActorSpawned
// 0x0010 (0x0010 - 0x0000)
struct SpawnDLCScript_BloodyHarvest_C_OnActorSpawned final
{
public:
	class USpawnerComponent*                      SpawnerComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnDLCScript_BloodyHarvest_C_OnActorSpawned) == 0x000008, "Wrong alignment on SpawnDLCScript_BloodyHarvest_C_OnActorSpawned");
static_assert(sizeof(SpawnDLCScript_BloodyHarvest_C_OnActorSpawned) == 0x000010, "Wrong size on SpawnDLCScript_BloodyHarvest_C_OnActorSpawned");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorSpawned, SpawnerComponent) == 0x000000, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorSpawned::SpawnerComponent' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_OnActorSpawned, Actor) == 0x000008, "Member 'SpawnDLCScript_BloodyHarvest_C_OnActorSpawned::Actor' has a wrong offset!");

// Function SpawnDLCScript_BloodyHarvest.SpawnDLCScript_BloodyHarvest_C.SpawnEnemyAsHaunted
// 0x0138 (0x0138 - 0x0000)
struct SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted final
{
public:
	class AActor*                                 Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandFloat;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_HauntedSpawnType                         HauntedSpawnType;                                  // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasForcedHauntedTag;                              // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DesiredGameplayTag;                                // 0x0010(0x0020)(Edit, BlueprintVisible)
	class AActor*                                 NewInActor;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0040(0x0018)(NoDestructor)
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0058(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle1;           // 0x0070(0x0018)(NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_HauntedSpawnType                         Temp_byte_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue1;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable1;                             // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable2;                             // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable3;                             // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_HauntedSpawnType                         Temp_byte_Variable1;                               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_107[0x1];                                      // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue1;         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue2;         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue3;         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select1_Default;                            // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted) == 0x000008, "Wrong alignment on SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted");
static_assert(sizeof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted) == 0x000138, "Wrong size on SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Enemy) == 0x000000, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Enemy' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, RandFloat) == 0x000008, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::RandFloat' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, HauntedSpawnType) == 0x00000C, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::HauntedSpawnType' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, bHasForcedHauntedTag) == 0x00000D, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::bHasForcedHauntedTag' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, DesiredGameplayTag) == 0x000010, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::DesiredGameplayTag' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, NewInActor) == 0x000030, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::NewInActor' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_bool_Variable) == 0x000038, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, K2Node_MakeStruct_DataTableValueHandle) == 0x000040, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_struct_Variable) == 0x000058, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000068, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, K2Node_MakeStruct_DataTableValueHandle1) == 0x000070, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::K2Node_MakeStruct_DataTableValueHandle1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000088, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_GetDataTableValueFromHandle_ReturnValue1) == 0x00008C, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_GetDataTableValueFromHandle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_byte_Variable) == 0x000090, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_RandomBoolWithWeight_ReturnValue1) == 0x000091, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_RandomBoolWithWeight_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_struct_Variable1) == 0x000098, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_struct_Variable2) == 0x0000A0, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_struct_Variable3) == 0x0000A8, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_class_Variable) == 0x0000B0, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_class_Variable1) == 0x0000B8, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_class_Variable2) == 0x0000C0, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_BooleanOR_ReturnValue) == 0x0000C8, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_BooleanOR_ReturnValue1) == 0x0000C9, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_GetComponentByClass_ReturnValue) == 0x0000D0, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000D8, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, Temp_byte_Variable1) == 0x0000E9, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000EA, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, K2Node_Select_Default) == 0x0000F0, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000F8, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_Less_FloatFloat_ReturnValue1) == 0x0000F9, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000FA, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x0000FB, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_BooleanAND_ReturnValue) == 0x0000FC, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_BooleanAND_ReturnValue1) == 0x0000FD, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_RandomFloat_ReturnValue) == 0x000100, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000104, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_GreaterEqual_FloatFloat_ReturnValue2) == 0x000105, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_GreaterEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_BooleanAND_ReturnValue2) == 0x000106, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_GetComponentByClass_ReturnValue1) == 0x000108, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_GetComponentByClass_ReturnValue2) == 0x000110, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_K2_EvaluateCondition_ReturnValue) == 0x000118, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_K2_EvaluateCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_HasTag_ReturnValue) == 0x000119, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_K2Play_ReturnValue) == 0x000120, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_K2Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, CallFunc_GetComponentByClass_ReturnValue3) == 0x000128, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::CallFunc_GetComponentByClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted, K2Node_Select1_Default) == 0x000130, "Member 'SpawnDLCScript_BloodyHarvest_C_SpawnEnemyAsHaunted::K2Node_Select1_Default' has a wrong offset!");

// Function SpawnDLCScript_BloodyHarvest.SpawnDLCScript_BloodyHarvest_C.GetSpawnTransform
// 0x00E0 (0x00E0 - 0x0000)
struct SpawnDLCScript_BloodyHarvest_C_GetSpawnTransform final
{
public:
	class AActor*                                 ActorThatDied;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Output;                                            // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0044(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCurrentFacingRotation_ReturnValue;     // 0x0068(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0080(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x008C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     CallFunc_GeneratePointsOnCone_ReturnValue;         // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpawnDLCScript_BloodyHarvest_C_GetSpawnTransform) == 0x000010, "Wrong alignment on SpawnDLCScript_BloodyHarvest_C_GetSpawnTransform");
static_assert(sizeof(SpawnDLCScript_BloodyHarvest_C_GetSpawnTransform) == 0x0000E0, "Wrong size on SpawnDLCScript_BloodyHarvest_C_GetSpawnTransform");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_GetSpawnTransform, ActorThatDied) == 0x000000, "Member 'SpawnDLCScript_BloodyHarvest_C_GetSpawnTransform::ActorThatDied' has a wrong offset!");
static_assert(offsetof(SpawnDLCScript_BloodyHarvest_C_GetSpawnTransform, Output) == 0x000010, "Member 'SpawnDLCScript_BloodyHarvest_C_GetSpawnTransform::Output' has a wrong offset!");
