#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnDLCSCript_VDay_Test

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Enum_VDay_HeartTypes_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SpawnDLCSCript_VDay_Test.SpawnDLCSCript_VDay_Test_C.OnActorSpawned
// 0x03C0 (0x03C0 - 0x0000)
struct SpawnDLCSCript_VDay_Test_C_OnActorSpawned final
{
public:
	class USpawnerComponent*                      SpawnerComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  UndesiredTag_TeamSwap;                             // 0x0010(0x0020)(Edit, BlueprintVisible)
	float                                         RandFloat;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_VDay_HeartTypes                          HeartSpawnType;                                    // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasForcedSpawnTag;                                // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DesiredGameplayTag;                                // 0x0038(0x0020)(Edit, BlueprintVisible)
	class AActor*                                 NewInActor;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0080(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable1;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable5;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_VDay_HeartTypes                          Temp_byte_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue3;     // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue4;     // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue3;             // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue5;     // 0x0117(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue1;         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface1; // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue2;         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue1;  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxSkeletalMeshComponent*              CallFunc_GetComponentByClass_ReturnValue3;         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select1_Default;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x0180(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue4;         // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned) == 0x000010, "Wrong alignment on SpawnDLCSCript_VDay_Test_C_OnActorSpawned");
static_assert(sizeof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned) == 0x0003C0, "Wrong size on SpawnDLCSCript_VDay_Test_C_OnActorSpawned");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, SpawnerComponent) == 0x000000, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::SpawnerComponent' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Actor) == 0x000008, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Actor' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, UndesiredTag_TeamSwap) == 0x000010, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::UndesiredTag_TeamSwap' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, RandFloat) == 0x000030, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::RandFloat' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, HeartSpawnType) == 0x000034, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::HeartSpawnType' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, bHasForcedSpawnTag) == 0x000035, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::bHasForcedSpawnTag' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, DesiredGameplayTag) == 0x000038, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::DesiredGameplayTag' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, NewInActor) == 0x000058, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::NewInActor' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_class_Variable) == 0x000060, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_class_Variable1) == 0x000068, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_class_Variable2) == 0x000070, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_class_Variable3) == 0x000078, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, K2Node_MakeStruct_DataTableValueHandle) == 0x000080, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000098, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_bool_Variable) == 0x00009C, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00009D, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_bool_Variable1) == 0x00009E, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_name_Variable) == 0x0000A0, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_name_Variable1) == 0x0000A8, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_class_Variable4) == 0x0000B0, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_bool_Variable2) == 0x0000B8, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GetComponentByClass_ReturnValue) == 0x0000C0, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_Not_PreBool_ReturnValue) == 0x0000C8, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000D0, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000E4, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000E8, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_class_Variable5) == 0x0000F0, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_class_Variable5' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, Temp_byte_Variable) == 0x0000F8, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000F9, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000FA, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue) == 0x0000FB, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_Less_FloatFloat_ReturnValue1) == 0x0000FC, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue1) == 0x0000FD, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x0000FE, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue2) == 0x0000FF, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000100, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GreaterEqual_FloatFloat_ReturnValue2) == 0x000101, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GreaterEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue3) == 0x000102, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, K2Node_Select_Default) == 0x000108, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000110, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000111, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GreaterEqual_FloatFloat_ReturnValue3) == 0x000112, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GreaterEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GreaterEqual_FloatFloat_ReturnValue4) == 0x000113, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GreaterEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue4) == 0x000114, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue5) == 0x000115, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_Less_FloatFloat_ReturnValue3) == 0x000116, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_Less_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GreaterEqual_FloatFloat_ReturnValue5) == 0x000117, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GreaterEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue6) == 0x000118, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_BooleanOR_ReturnValue) == 0x000119, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GetComponentByClass_ReturnValue1) == 0x000120, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface1) == 0x000128, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, K2Node_DynamicCast_bSuccess1) == 0x000138, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GetComponentByClass_ReturnValue2) == 0x000140, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_HasAnyMatchingGameplayTags_ReturnValue1) == 0x000148, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_HasAnyMatchingGameplayTags_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_HasTag_ReturnValue) == 0x000149, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_Not_PreBool_ReturnValue1) == 0x00014A, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GetComponentByClass_ReturnValue3) == 0x000150, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GetComponentByClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue7) == 0x000158, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue7' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_DoesSocketExist_ReturnValue) == 0x000159, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_Conv_BoolToString_ReturnValue) == 0x000160, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, K2Node_Select1_Default) == 0x000170, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x000180, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_SpawnActorAsync_ReturnValue) == 0x0003B0, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_VDay_Test_C_OnActorSpawned, CallFunc_GetComponentByClass_ReturnValue4) == 0x0003B8, "Member 'SpawnDLCSCript_VDay_Test_C_OnActorSpawned::CallFunc_GetComponentByClass_ReturnValue4' has a wrong offset!");

}

