#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpawnDLCSCript_Cartels

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SpawnDLCSCript_Cartels.SpawnDLCSCript_Cartels_C.OnActorSpawned
// 0x0118 (0x0118 - 0x0000)
struct SpawnDLCSCript_Cartels_C_OnActorSpawned final
{
public:
	class USpawnerComponent*                      SpawnerComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasForcedSpawnTag;                                // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DesiredGameplayTag;                                // 0x0018(0x0020)(Edit, BlueprintVisible)
	class AActor*                                 NewInActor;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x0040(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActionRegister>             Temp_struct_Variable;                              // 0x0060(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue1;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue2;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue1;           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGbxAction*                             CallFunc_K2Play_ReturnValue;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpawnDLCSCript_Cartels_C_OnActorSpawned) == 0x000008, "Wrong alignment on SpawnDLCSCript_Cartels_C_OnActorSpawned");
static_assert(sizeof(SpawnDLCSCript_Cartels_C_OnActorSpawned) == 0x000118, "Wrong size on SpawnDLCSCript_Cartels_C_OnActorSpawned");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, SpawnerComponent) == 0x000000, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::SpawnerComponent' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, Actor) == 0x000008, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::Actor' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, bHasForcedSpawnTag) == 0x000010, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::bHasForcedSpawnTag' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, DesiredGameplayTag) == 0x000018, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::DesiredGameplayTag' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, NewInActor) == 0x000038, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::NewInActor' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, K2Node_MakeStruct_DataTableValueHandle) == 0x000040, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000058, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, Temp_bool_Variable) == 0x00005C, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00005D, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, Temp_struct_Variable) == 0x000060, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_BooleanOR_ReturnValue) == 0x000070, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_GetComponentByClass_ReturnValue) == 0x000078, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_Conv_BoolToString_ReturnValue) == 0x000080, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000090, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A8, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_Concat_StrStr_ReturnValue1) == 0x0000B8, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000C8, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_GetComponentByClass_ReturnValue1) == 0x0000D0, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_GetComponentByClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_GetComponentByClass_ReturnValue2) == 0x0000D8, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_GetComponentByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_HasTag_ReturnValue) == 0x0000E0, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_Not_PreBool_ReturnValue) == 0x0000E1, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_Conv_BoolToString_ReturnValue1) == 0x0000E8, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_Conv_BoolToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000F8, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_K2Play_ReturnValue) == 0x000108, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_K2Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_K2_EvaluateCondition_ReturnValue) == 0x000110, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_K2_EvaluateCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue) == 0x000111, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorSpawned, CallFunc_BooleanAND_ReturnValue1) == 0x000112, "Member 'SpawnDLCSCript_Cartels_C_OnActorSpawned::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function SpawnDLCSCript_Cartels.SpawnDLCSCript_Cartels_C.OnActorDied
// 0x0320 (0x0320 - 0x0000)
struct SpawnDLCSCript_Cartels_C_OnActorDied final
{
public:
	class USpawnerComponent*                      SpawnerComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpawnerComponent*                      InSpawnerComponent;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewSpawnPoint;                                     // 0x0018(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayTag_Cartel;                                // 0x0028(0x0020)(Edit, BlueprintVisible)
	class UGameplayTagContainerComponent*         TagComponent;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InActorDied;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_EvaluateCondition_ReturnValue;         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FGbxSpawnActorAsyncRequest             K2Node_MakeStruct_GbxSpawnActorAsyncRequest;       // 0x00A0(0x0230)(ContainsInstancedReference)
	int32                                         CallFunc_SpawnActorAsync_ReturnValue;              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  K2Node_MakeStruct_DataTableValueHandle;            // 0x02F0(0x0018)(NoDestructor)
	float                                         CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTagContainerComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpawnDLCSCript_Cartels_C_OnActorDied) == 0x000010, "Wrong alignment on SpawnDLCSCript_Cartels_C_OnActorDied");
static_assert(sizeof(SpawnDLCSCript_Cartels_C_OnActorDied) == 0x000320, "Wrong size on SpawnDLCSCript_Cartels_C_OnActorDied");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, SpawnerComponent) == 0x000000, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::SpawnerComponent' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, Actor) == 0x000008, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::Actor' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, InSpawnerComponent) == 0x000010, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::InSpawnerComponent' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, NewSpawnPoint) == 0x000018, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::NewSpawnPoint' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, GameplayTag_Cartel) == 0x000028, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::GameplayTag_Cartel' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, TagComponent) == 0x000048, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::TagComponent' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, InActorDied) == 0x000050, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::InActorDied' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, Temp_bool_Variable) == 0x000058, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, CallFunc_K2_EvaluateCondition_ReturnValue) == 0x000059, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::CallFunc_K2_EvaluateCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000070, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, K2Node_MakeStruct_GbxSpawnActorAsyncRequest) == 0x0000A0, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::K2Node_MakeStruct_GbxSpawnActorAsyncRequest' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, CallFunc_SpawnActorAsync_ReturnValue) == 0x0002D0, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::CallFunc_SpawnActorAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0002D8, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, K2Node_DynamicCast_bSuccess) == 0x0002E8, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0002E9, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, K2Node_MakeStruct_DataTableValueHandle) == 0x0002F0, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::K2Node_MakeStruct_DataTableValueHandle' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, CallFunc_GetDataTableValueFromHandle_ReturnValue) == 0x000308, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::CallFunc_GetDataTableValueFromHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, CallFunc_GetComponentByClass_ReturnValue) == 0x000310, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpawnDLCSCript_Cartels_C_OnActorDied, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000318, "Member 'SpawnDLCSCript_Cartels_C_OnActorDied::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

}

