#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StandIn_PhaseCast_Frontend

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"


namespace SDK::Params
{

// Function StandIn_PhaseCast_Frontend.StandIn_PhaseCast_Frontend_C.ExecuteUbergraph_StandIn_PhaseCast_Frontend
// 0x0038 (0x0038 - 0x0000)
struct StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0008(0x0018)()
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue1;              // 0x0020(0x0018)()
};
static_assert(alignof(StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend) == 0x000008, "Wrong alignment on StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend");
static_assert(sizeof(StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend) == 0x000038, "Wrong size on StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend");
static_assert(offsetof(StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend, EntryPoint) == 0x000000, "Member 'StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend::EntryPoint' has a wrong offset!");
static_assert(offsetof(StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend, CallFunc_PostWwiseEvent_ReturnValue) == 0x000008, "Member 'StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend, CallFunc_PostWwiseEvent_ReturnValue1) == 0x000020, "Member 'StandIn_PhaseCast_Frontend_C_ExecuteUbergraph_StandIn_PhaseCast_Frontend::CallFunc_PostWwiseEvent_ReturnValue1' has a wrong offset!");

}

