#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StandIn_PhaseCast

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass StandIn_PhaseCast.StandIn_PhaseCast_C
// 0x0028 (0x05A8 - 0x0580)
class AStandIn_PhaseCast_C final : public AStandInAuxiliaryActor_Siren
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(Transient, DuplicateTransient)
	class UWwiseAudioComponent*                   WwiseAudio;                                        // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              GhostArms;                                         // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              HeadMesh;                                          // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*              Mesh;                                              // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StandIn_PhaseCast(int32 EntryPoint);
	void BndEvt__CustomizationComponent_K2Node_ComponentBoundEvent_0_CharacterCustomizationApplied__DelegateSignature_StandIn_PhaseCast(class UGbxCustomizationData* Customization);
	void ReceiveBeginPlay();
	void SetGhostMaterials();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StandIn_PhaseCast_C">();
	}
	static class AStandIn_PhaseCast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStandIn_PhaseCast_C>();
	}
};
static_assert(alignof(AStandIn_PhaseCast_C) == 0x000008, "Wrong alignment on AStandIn_PhaseCast_C");
static_assert(sizeof(AStandIn_PhaseCast_C) == 0x0005A8, "Wrong size on AStandIn_PhaseCast_C");
static_assert(offsetof(AStandIn_PhaseCast_C, UberGraphFrame) == 0x000580, "Member 'AStandIn_PhaseCast_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AStandIn_PhaseCast_C, WwiseAudio) == 0x000588, "Member 'AStandIn_PhaseCast_C::WwiseAudio' has a wrong offset!");
static_assert(offsetof(AStandIn_PhaseCast_C, GhostArms) == 0x000590, "Member 'AStandIn_PhaseCast_C::GhostArms' has a wrong offset!");
static_assert(offsetof(AStandIn_PhaseCast_C, HeadMesh) == 0x000598, "Member 'AStandIn_PhaseCast_C::HeadMesh' has a wrong offset!");
static_assert(offsetof(AStandIn_PhaseCast_C, Mesh) == 0x0005A0, "Member 'AStandIn_PhaseCast_C::Mesh' has a wrong offset!");

}

