#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Artifact_Stats

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Artifact_Stats.Struct_Artifact_Stats
// 0x0048 (0x0048 - 0x0000)
struct FStruct_Artifact_Stats final
{
public:
	float                                         Value_Base_3_6007CA5C418B4F68A7493B9141BCAC47;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value_Max_9_2EEE7B5943AFA52606550BB02E17447D;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TeamValue_Base_13_8B321D8C436F3966DED414993874E3E3; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TeamValue_Max_14_7E2FB79644C18FC6487C86AEF1E07F22; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttributeInitializationData           ItemLevel_Scaler_19_8F6894FF46FBB6CF8B35AA98839DC99C; // 0x0010(0x0038)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FStruct_Artifact_Stats) == 0x000008, "Wrong alignment on FStruct_Artifact_Stats");
static_assert(sizeof(FStruct_Artifact_Stats) == 0x000048, "Wrong size on FStruct_Artifact_Stats");
static_assert(offsetof(FStruct_Artifact_Stats, Value_Base_3_6007CA5C418B4F68A7493B9141BCAC47) == 0x000000, "Member 'FStruct_Artifact_Stats::Value_Base_3_6007CA5C418B4F68A7493B9141BCAC47' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Stats, Value_Max_9_2EEE7B5943AFA52606550BB02E17447D) == 0x000004, "Member 'FStruct_Artifact_Stats::Value_Max_9_2EEE7B5943AFA52606550BB02E17447D' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Stats, TeamValue_Base_13_8B321D8C436F3966DED414993874E3E3) == 0x000008, "Member 'FStruct_Artifact_Stats::TeamValue_Base_13_8B321D8C436F3966DED414993874E3E3' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Stats, TeamValue_Max_14_7E2FB79644C18FC6487C86AEF1E07F22) == 0x00000C, "Member 'FStruct_Artifact_Stats::TeamValue_Max_14_7E2FB79644C18FC6487C86AEF1E07F22' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Stats, ItemLevel_Scaler_19_8F6894FF46FBB6CF8B35AA98839DC99C) == 0x000010, "Member 'FStruct_Artifact_Stats::ItemLevel_Scaler_19_8F6894FF46FBB6CF8B35AA98839DC99C' has a wrong offset!");

}

