#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_NPC_MissionDeco

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_NPC_MissionDeco.Struct_NPC_MissionDeco
// 0x0080 (0x0080 - 0x0000)
struct FStruct_NPC_MissionDeco final
{
public:
	class USkeletalMesh*                          SkeletalMesh_Male_29_CB6ABB054181E582914BFDB15B1B9154; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGestaltPartListData*                   Gestalt_Male_30_E0F941BC40AFA86D69D216B68BC314BB;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          SkeletalMesh_Female_35_5C3E7D034CFE5940705CFDA37B4DE607; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGestaltPartListData*                   Gestalt_Female_33_E2B43DEA40F18536969FDC8BD4E7DBAB; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Animation_8_CBE6307C46E0869A1371EF96527F06E9;      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Action_26_D8C570B9410564EBF63E3F818E43005C;        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SkeletalTransformOffset_14_972139024638F14672129797FA978AC2; // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UGbxUIName*                             UIName_17_001D7C2C46B1D1F5336A31BD81408272;        // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImpactData*                            FoleyFootstepImpact_23_9651459C49EBB5D59E6B929C255E543D; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                            FoleyFootstepWwiseEvent_22_EFCADAE5497047FB2524E4843419E827; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_NPC_MissionDeco) == 0x000010, "Wrong alignment on FStruct_NPC_MissionDeco");
static_assert(sizeof(FStruct_NPC_MissionDeco) == 0x000080, "Wrong size on FStruct_NPC_MissionDeco");
static_assert(offsetof(FStruct_NPC_MissionDeco, SkeletalMesh_Male_29_CB6ABB054181E582914BFDB15B1B9154) == 0x000000, "Member 'FStruct_NPC_MissionDeco::SkeletalMesh_Male_29_CB6ABB054181E582914BFDB15B1B9154' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_MissionDeco, Gestalt_Male_30_E0F941BC40AFA86D69D216B68BC314BB) == 0x000008, "Member 'FStruct_NPC_MissionDeco::Gestalt_Male_30_E0F941BC40AFA86D69D216B68BC314BB' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_MissionDeco, SkeletalMesh_Female_35_5C3E7D034CFE5940705CFDA37B4DE607) == 0x000010, "Member 'FStruct_NPC_MissionDeco::SkeletalMesh_Female_35_5C3E7D034CFE5940705CFDA37B4DE607' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_MissionDeco, Gestalt_Female_33_E2B43DEA40F18536969FDC8BD4E7DBAB) == 0x000018, "Member 'FStruct_NPC_MissionDeco::Gestalt_Female_33_E2B43DEA40F18536969FDC8BD4E7DBAB' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_MissionDeco, Animation_8_CBE6307C46E0869A1371EF96527F06E9) == 0x000020, "Member 'FStruct_NPC_MissionDeco::Animation_8_CBE6307C46E0869A1371EF96527F06E9' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_MissionDeco, Action_26_D8C570B9410564EBF63E3F818E43005C) == 0x000028, "Member 'FStruct_NPC_MissionDeco::Action_26_D8C570B9410564EBF63E3F818E43005C' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_MissionDeco, SkeletalTransformOffset_14_972139024638F14672129797FA978AC2) == 0x000030, "Member 'FStruct_NPC_MissionDeco::SkeletalTransformOffset_14_972139024638F14672129797FA978AC2' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_MissionDeco, UIName_17_001D7C2C46B1D1F5336A31BD81408272) == 0x000060, "Member 'FStruct_NPC_MissionDeco::UIName_17_001D7C2C46B1D1F5336A31BD81408272' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_MissionDeco, FoleyFootstepImpact_23_9651459C49EBB5D59E6B929C255E543D) == 0x000068, "Member 'FStruct_NPC_MissionDeco::FoleyFootstepImpact_23_9651459C49EBB5D59E6B929C255E543D' has a wrong offset!");
static_assert(offsetof(FStruct_NPC_MissionDeco, FoleyFootstepWwiseEvent_22_EFCADAE5497047FB2524E4843419E827) == 0x000070, "Member 'FStruct_NPC_MissionDeco::FoleyFootstepWwiseEvent_22_EFCADAE5497047FB2524E4843419E827' has a wrong offset!");

}

