#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_GlobalChallengeRewards

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_GlobalChallengeRewards.Struct_GlobalChallengeRewards
// 0x003C (0x003C - 0x0000)
struct FStruct_GlobalChallengeRewards final
{
public:
	float                                         T1MinusEridium_46_68E5AC5B49575831B936BC94DB3BBA46; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T1MinusCash_47_67A970A84C0A0A3EF4AEE49DEC5FAE27;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T1MinusXP_48_7E99CC1F47A105B32F7EF0AD509E95B7;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T2MinusEridium_49_514C960C40BFF7FE5E7836BB2B652C3F; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T2MinusCash_50_60EBA49B479F1ACA34B2C0A24FF10014;   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T2MinusXP_51_BCEB163942CCB111CBA7838BF35DCE69;     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T3MinusEridium_52_1BC29C564F17CAF506462895857906F5; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T3MinusCash_53_D2695B9C4C3ABD92CA5497B9E31E4BB9;   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T3MinusXP_54_5C6797D94EF53A2E11DB05953AD5BFE6;     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T4MinusEridium_55_42802AC443A9B903046EFE9A553E0522; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T4MinusCash_56_33AB21A0421B475A9F5BDEBB8FA8F032;   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T4MinusXP_57_0C2FC38943DEB9CA328D31B309C83FDE;     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T5MinusEridium_58_37CEC4854C95DD425D2BBF84C2234967; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T5MinusCash_59_3F9BD6FF4D8D7F8B1232F782389B23E1;   // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         T5MinusXP_60_0BB53E2D47463CC34E9787AA6AE7DBC5;     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_GlobalChallengeRewards) == 0x000004, "Wrong alignment on FStruct_GlobalChallengeRewards");
static_assert(sizeof(FStruct_GlobalChallengeRewards) == 0x00003C, "Wrong size on FStruct_GlobalChallengeRewards");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T1MinusEridium_46_68E5AC5B49575831B936BC94DB3BBA46) == 0x000000, "Member 'FStruct_GlobalChallengeRewards::T1MinusEridium_46_68E5AC5B49575831B936BC94DB3BBA46' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T1MinusCash_47_67A970A84C0A0A3EF4AEE49DEC5FAE27) == 0x000004, "Member 'FStruct_GlobalChallengeRewards::T1MinusCash_47_67A970A84C0A0A3EF4AEE49DEC5FAE27' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T1MinusXP_48_7E99CC1F47A105B32F7EF0AD509E95B7) == 0x000008, "Member 'FStruct_GlobalChallengeRewards::T1MinusXP_48_7E99CC1F47A105B32F7EF0AD509E95B7' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T2MinusEridium_49_514C960C40BFF7FE5E7836BB2B652C3F) == 0x00000C, "Member 'FStruct_GlobalChallengeRewards::T2MinusEridium_49_514C960C40BFF7FE5E7836BB2B652C3F' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T2MinusCash_50_60EBA49B479F1ACA34B2C0A24FF10014) == 0x000010, "Member 'FStruct_GlobalChallengeRewards::T2MinusCash_50_60EBA49B479F1ACA34B2C0A24FF10014' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T2MinusXP_51_BCEB163942CCB111CBA7838BF35DCE69) == 0x000014, "Member 'FStruct_GlobalChallengeRewards::T2MinusXP_51_BCEB163942CCB111CBA7838BF35DCE69' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T3MinusEridium_52_1BC29C564F17CAF506462895857906F5) == 0x000018, "Member 'FStruct_GlobalChallengeRewards::T3MinusEridium_52_1BC29C564F17CAF506462895857906F5' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T3MinusCash_53_D2695B9C4C3ABD92CA5497B9E31E4BB9) == 0x00001C, "Member 'FStruct_GlobalChallengeRewards::T3MinusCash_53_D2695B9C4C3ABD92CA5497B9E31E4BB9' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T3MinusXP_54_5C6797D94EF53A2E11DB05953AD5BFE6) == 0x000020, "Member 'FStruct_GlobalChallengeRewards::T3MinusXP_54_5C6797D94EF53A2E11DB05953AD5BFE6' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T4MinusEridium_55_42802AC443A9B903046EFE9A553E0522) == 0x000024, "Member 'FStruct_GlobalChallengeRewards::T4MinusEridium_55_42802AC443A9B903046EFE9A553E0522' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T4MinusCash_56_33AB21A0421B475A9F5BDEBB8FA8F032) == 0x000028, "Member 'FStruct_GlobalChallengeRewards::T4MinusCash_56_33AB21A0421B475A9F5BDEBB8FA8F032' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T4MinusXP_57_0C2FC38943DEB9CA328D31B309C83FDE) == 0x00002C, "Member 'FStruct_GlobalChallengeRewards::T4MinusXP_57_0C2FC38943DEB9CA328D31B309C83FDE' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T5MinusEridium_58_37CEC4854C95DD425D2BBF84C2234967) == 0x000030, "Member 'FStruct_GlobalChallengeRewards::T5MinusEridium_58_37CEC4854C95DD425D2BBF84C2234967' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T5MinusCash_59_3F9BD6FF4D8D7F8B1232F782389B23E1) == 0x000034, "Member 'FStruct_GlobalChallengeRewards::T5MinusCash_59_3F9BD6FF4D8D7F8B1232F782389B23E1' has a wrong offset!");
static_assert(offsetof(FStruct_GlobalChallengeRewards, T5MinusXP_60_0BB53E2D47463CC34E9787AA6AE7DBC5) == 0x000038, "Member 'FStruct_GlobalChallengeRewards::T5MinusXP_60_0BB53E2D47463CC34E9787AA6AE7DBC5' has a wrong offset!");

}

