#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SplineDecoratorParams

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SplineDecoratorParams.Struct_SplineDecoratorParams
// 0x00B0 (0x00B0 - 0x0000)
struct FStruct_SplineDecoratorParams final
{
public:
	class UStaticMesh*                            StaticMesh_16_491502804799839482EAA2B04F91EFA6;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialOverride_88_34B731D84DE76B3715EE4DB5E9009997; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible_62_09C34B6040C9EBBB7A66A0A163293C1E;       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TraceToSurface_51_8F227513457B6244E0040D861424919B; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TraceVector_55_654949684D4D51471FD3D699C619A2A4;   // 0x0014(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OrientToSurface_58_0F31CBF246665E81CD278B8DFF4CEB1E; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESplineMeshAxis                               MeshAlignmentAxis_65_5CD2C4774FB3AD692E6CC2A3F6EB0969; // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MeshSpacing_47_952ED3984DB99EEA203664A449A3FC89;   // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlacementOffset_42_860172EF4A45BED8365444A73D32805A; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pinch_40_3512884F4410E64EE5885CBCB904A121;         // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Bias_84_21CBDAC749B161B64190E9933F839828;          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlipBias_92_DBEC22354319A3CB07E8C9A7A7F92391;      // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OffsetWorldSpace_71_3EE72AA44564B4B1ED408CA1E460F92C; // 0x0038(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset_30_4E363F694767267A1BF87EB0FEA7C860;        // 0x0044(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandomOffset_32_1115A95C4EA7BBB9AC72B9BB6C6CB34F;  // 0x0050(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MinimumScale_2_97A575B542771D64A83C52B761DC9EC1;   // 0x005C(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MaximumScale_4_A01764944CAB78D594F94CBC70C60953;   // 0x0068(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TaperScale_82_A52F65844F6E8F1FCEB9C4B5B1AF913F;    // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlipTaper_90_CD6E658D44C50EBB6A782794B29E80C0;     // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OrientToSpline_36_11467B2B4CEDF079CCF44893768802F9; // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESplineMeshAxis                               SplineAlignmentAxis_67_3AA2AE6E4510FF59628CE1ADB283B5C0; // 0x007A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InitialRotation_7_C67FE2334DA98961CE6D45BB994961B3; // 0x007C(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FRotator                               RandomRotationMin_43_A78BB4D947C5BE2BAD0A088B0D1CBF3C; // 0x0088(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FRotator                               RandomRotationMax_46_81DE09714E7DC6051DF47D89ABEE581C; // 0x0094(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         CullDistanceStart_74_4B2C79B0409DFCC76A066C9E354AE21F; // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CullDistanceEnd_76_33C954394DBFFE43F3EA1FB65D58F959; // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomMask_79_BFD7F2064FC01E16CBD770994E6C4A59;    // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_SplineDecoratorParams) == 0x000008, "Wrong alignment on FStruct_SplineDecoratorParams");
static_assert(sizeof(FStruct_SplineDecoratorParams) == 0x0000B0, "Wrong size on FStruct_SplineDecoratorParams");
static_assert(offsetof(FStruct_SplineDecoratorParams, StaticMesh_16_491502804799839482EAA2B04F91EFA6) == 0x000000, "Member 'FStruct_SplineDecoratorParams::StaticMesh_16_491502804799839482EAA2B04F91EFA6' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, MaterialOverride_88_34B731D84DE76B3715EE4DB5E9009997) == 0x000008, "Member 'FStruct_SplineDecoratorParams::MaterialOverride_88_34B731D84DE76B3715EE4DB5E9009997' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, Visible_62_09C34B6040C9EBBB7A66A0A163293C1E) == 0x000010, "Member 'FStruct_SplineDecoratorParams::Visible_62_09C34B6040C9EBBB7A66A0A163293C1E' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, TraceToSurface_51_8F227513457B6244E0040D861424919B) == 0x000011, "Member 'FStruct_SplineDecoratorParams::TraceToSurface_51_8F227513457B6244E0040D861424919B' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, TraceVector_55_654949684D4D51471FD3D699C619A2A4) == 0x000014, "Member 'FStruct_SplineDecoratorParams::TraceVector_55_654949684D4D51471FD3D699C619A2A4' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, OrientToSurface_58_0F31CBF246665E81CD278B8DFF4CEB1E) == 0x000020, "Member 'FStruct_SplineDecoratorParams::OrientToSurface_58_0F31CBF246665E81CD278B8DFF4CEB1E' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, MeshAlignmentAxis_65_5CD2C4774FB3AD692E6CC2A3F6EB0969) == 0x000021, "Member 'FStruct_SplineDecoratorParams::MeshAlignmentAxis_65_5CD2C4774FB3AD692E6CC2A3F6EB0969' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, MeshSpacing_47_952ED3984DB99EEA203664A449A3FC89) == 0x000024, "Member 'FStruct_SplineDecoratorParams::MeshSpacing_47_952ED3984DB99EEA203664A449A3FC89' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, PlacementOffset_42_860172EF4A45BED8365444A73D32805A) == 0x000028, "Member 'FStruct_SplineDecoratorParams::PlacementOffset_42_860172EF4A45BED8365444A73D32805A' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, Pinch_40_3512884F4410E64EE5885CBCB904A121) == 0x00002C, "Member 'FStruct_SplineDecoratorParams::Pinch_40_3512884F4410E64EE5885CBCB904A121' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, Bias_84_21CBDAC749B161B64190E9933F839828) == 0x000030, "Member 'FStruct_SplineDecoratorParams::Bias_84_21CBDAC749B161B64190E9933F839828' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, FlipBias_92_DBEC22354319A3CB07E8C9A7A7F92391) == 0x000034, "Member 'FStruct_SplineDecoratorParams::FlipBias_92_DBEC22354319A3CB07E8C9A7A7F92391' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, OffsetWorldSpace_71_3EE72AA44564B4B1ED408CA1E460F92C) == 0x000038, "Member 'FStruct_SplineDecoratorParams::OffsetWorldSpace_71_3EE72AA44564B4B1ED408CA1E460F92C' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, Offset_30_4E363F694767267A1BF87EB0FEA7C860) == 0x000044, "Member 'FStruct_SplineDecoratorParams::Offset_30_4E363F694767267A1BF87EB0FEA7C860' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, RandomOffset_32_1115A95C4EA7BBB9AC72B9BB6C6CB34F) == 0x000050, "Member 'FStruct_SplineDecoratorParams::RandomOffset_32_1115A95C4EA7BBB9AC72B9BB6C6CB34F' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, MinimumScale_2_97A575B542771D64A83C52B761DC9EC1) == 0x00005C, "Member 'FStruct_SplineDecoratorParams::MinimumScale_2_97A575B542771D64A83C52B761DC9EC1' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, MaximumScale_4_A01764944CAB78D594F94CBC70C60953) == 0x000068, "Member 'FStruct_SplineDecoratorParams::MaximumScale_4_A01764944CAB78D594F94CBC70C60953' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, TaperScale_82_A52F65844F6E8F1FCEB9C4B5B1AF913F) == 0x000074, "Member 'FStruct_SplineDecoratorParams::TaperScale_82_A52F65844F6E8F1FCEB9C4B5B1AF913F' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, FlipTaper_90_CD6E658D44C50EBB6A782794B29E80C0) == 0x000078, "Member 'FStruct_SplineDecoratorParams::FlipTaper_90_CD6E658D44C50EBB6A782794B29E80C0' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, OrientToSpline_36_11467B2B4CEDF079CCF44893768802F9) == 0x000079, "Member 'FStruct_SplineDecoratorParams::OrientToSpline_36_11467B2B4CEDF079CCF44893768802F9' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, SplineAlignmentAxis_67_3AA2AE6E4510FF59628CE1ADB283B5C0) == 0x00007A, "Member 'FStruct_SplineDecoratorParams::SplineAlignmentAxis_67_3AA2AE6E4510FF59628CE1ADB283B5C0' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, InitialRotation_7_C67FE2334DA98961CE6D45BB994961B3) == 0x00007C, "Member 'FStruct_SplineDecoratorParams::InitialRotation_7_C67FE2334DA98961CE6D45BB994961B3' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, RandomRotationMin_43_A78BB4D947C5BE2BAD0A088B0D1CBF3C) == 0x000088, "Member 'FStruct_SplineDecoratorParams::RandomRotationMin_43_A78BB4D947C5BE2BAD0A088B0D1CBF3C' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, RandomRotationMax_46_81DE09714E7DC6051DF47D89ABEE581C) == 0x000094, "Member 'FStruct_SplineDecoratorParams::RandomRotationMax_46_81DE09714E7DC6051DF47D89ABEE581C' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, CullDistanceStart_74_4B2C79B0409DFCC76A066C9E354AE21F) == 0x0000A0, "Member 'FStruct_SplineDecoratorParams::CullDistanceStart_74_4B2C79B0409DFCC76A066C9E354AE21F' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, CullDistanceEnd_76_33C954394DBFFE43F3EA1FB65D58F959) == 0x0000A4, "Member 'FStruct_SplineDecoratorParams::CullDistanceEnd_76_33C954394DBFFE43F3EA1FB65D58F959' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorParams, RandomMask_79_BFD7F2064FC01E16CBD770994E6C4A59) == 0x0000A8, "Member 'FStruct_SplineDecoratorParams::RandomMask_79_BFD7F2064FC01E16CBD770994E6C4A59' has a wrong offset!");

}

