#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_DamageTypeColors

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_DamageTypeColors.Struct_DamageTypeColors
// 0x0060 (0x0060 - 0x0000)
struct FStruct_DamageTypeColors final
{
public:
	struct FLinearColor                           None_29_CAFD93A543EAA65C7AEA7A9EA12A6A1A;          // 0x0000(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Corrosive_30_ABD7C9C34C124EB6E160539406D1E433;     // 0x0010(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Cryo_31_99E9862542FA04DDCD6D7895B378B562;          // 0x0020(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Fire_32_AA02791A4FB068FA22AEB09F1F05C5DE;          // 0x0030(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Shock_33_B51C72BC4DFC38870751B69EBE16B0E7;         // 0x0040(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Radiation_34_578AAD754FD78B9C6F3A578A55E05E33;     // 0x0050(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_DamageTypeColors) == 0x000004, "Wrong alignment on FStruct_DamageTypeColors");
static_assert(sizeof(FStruct_DamageTypeColors) == 0x000060, "Wrong size on FStruct_DamageTypeColors");
static_assert(offsetof(FStruct_DamageTypeColors, None_29_CAFD93A543EAA65C7AEA7A9EA12A6A1A) == 0x000000, "Member 'FStruct_DamageTypeColors::None_29_CAFD93A543EAA65C7AEA7A9EA12A6A1A' has a wrong offset!");
static_assert(offsetof(FStruct_DamageTypeColors, Corrosive_30_ABD7C9C34C124EB6E160539406D1E433) == 0x000010, "Member 'FStruct_DamageTypeColors::Corrosive_30_ABD7C9C34C124EB6E160539406D1E433' has a wrong offset!");
static_assert(offsetof(FStruct_DamageTypeColors, Cryo_31_99E9862542FA04DDCD6D7895B378B562) == 0x000020, "Member 'FStruct_DamageTypeColors::Cryo_31_99E9862542FA04DDCD6D7895B378B562' has a wrong offset!");
static_assert(offsetof(FStruct_DamageTypeColors, Fire_32_AA02791A4FB068FA22AEB09F1F05C5DE) == 0x000030, "Member 'FStruct_DamageTypeColors::Fire_32_AA02791A4FB068FA22AEB09F1F05C5DE' has a wrong offset!");
static_assert(offsetof(FStruct_DamageTypeColors, Shock_33_B51C72BC4DFC38870751B69EBE16B0E7) == 0x000040, "Member 'FStruct_DamageTypeColors::Shock_33_B51C72BC4DFC38870751B69EBE16B0E7' has a wrong offset!");
static_assert(offsetof(FStruct_DamageTypeColors, Radiation_34_578AAD754FD78B9C6F3A578A55E05E33) == 0x000050, "Member 'FStruct_DamageTypeColors::Radiation_34_578AAD754FD78B9C6F3A578A55E05E33' has a wrong offset!");

}

