#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_NogBuff

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_NogBuff.Struct_NogBuff
// 0x0048 (0x0048 - 0x0000)
struct FStruct_NogBuff final
{
public:
	class UAITicketDataAsset*                     MaxToBuffTicket_31_CCB82ABB447206C062F3F1B2FED525F3; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxToBuffPerCast_8_25DB244B4EBFF77D5178878F9BA7DE9A; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQuery*                              BuffableTargetQuery_18_3A391B2B4713719127C33AAA2F79D36C; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CooldownForTargetRebuff_36_7C358DAF48FEE41E665E22956C1E274B; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Drone_21_5564DD4348754B44F9690F8B5425E3C9;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStatusEffectData*                      StatusEffectToApply_14_B1C5EDBE4148F20CC095F6BD57F9441F; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DroneColor_24_F43865D043007EDB0A5E68AA8D2D2DCD;    // 0x0030(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SelfBuffOverrideQuery_38_A4F99FAA475431FD58221FB6A8E9C67E; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FStruct_NogBuff) == 0x000008, "Wrong alignment on FStruct_NogBuff");
static_assert(sizeof(FStruct_NogBuff) == 0x000048, "Wrong size on FStruct_NogBuff");
static_assert(offsetof(FStruct_NogBuff, MaxToBuffTicket_31_CCB82ABB447206C062F3F1B2FED525F3) == 0x000000, "Member 'FStruct_NogBuff::MaxToBuffTicket_31_CCB82ABB447206C062F3F1B2FED525F3' has a wrong offset!");
static_assert(offsetof(FStruct_NogBuff, MaxToBuffPerCast_8_25DB244B4EBFF77D5178878F9BA7DE9A) == 0x000008, "Member 'FStruct_NogBuff::MaxToBuffPerCast_8_25DB244B4EBFF77D5178878F9BA7DE9A' has a wrong offset!");
static_assert(offsetof(FStruct_NogBuff, BuffableTargetQuery_18_3A391B2B4713719127C33AAA2F79D36C) == 0x000010, "Member 'FStruct_NogBuff::BuffableTargetQuery_18_3A391B2B4713719127C33AAA2F79D36C' has a wrong offset!");
static_assert(offsetof(FStruct_NogBuff, CooldownForTargetRebuff_36_7C358DAF48FEE41E665E22956C1E274B) == 0x000018, "Member 'FStruct_NogBuff::CooldownForTargetRebuff_36_7C358DAF48FEE41E665E22956C1E274B' has a wrong offset!");
static_assert(offsetof(FStruct_NogBuff, Drone_21_5564DD4348754B44F9690F8B5425E3C9) == 0x000020, "Member 'FStruct_NogBuff::Drone_21_5564DD4348754B44F9690F8B5425E3C9' has a wrong offset!");
static_assert(offsetof(FStruct_NogBuff, StatusEffectToApply_14_B1C5EDBE4148F20CC095F6BD57F9441F) == 0x000028, "Member 'FStruct_NogBuff::StatusEffectToApply_14_B1C5EDBE4148F20CC095F6BD57F9441F' has a wrong offset!");
static_assert(offsetof(FStruct_NogBuff, DroneColor_24_F43865D043007EDB0A5E68AA8D2D2DCD) == 0x000030, "Member 'FStruct_NogBuff::DroneColor_24_F43865D043007EDB0A5E68AA8D2D2DCD' has a wrong offset!");
static_assert(offsetof(FStruct_NogBuff, SelfBuffOverrideQuery_38_A4F99FAA475431FD58221FB6A8E9C67E) == 0x000040, "Member 'FStruct_NogBuff::SelfBuffOverrideQuery_38_A4F99FAA475431FD58221FB6A8E9C67E' has a wrong offset!");

}

