#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Weapon_Negative_Mod_Data

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Weapon_Negative_Mod_Data.Struct_Weapon_Negative_Mod_Data
// 0x0024 (0x0024 - 0x0000)
struct FStruct_Weapon_Negative_Mod_Data final
{
public:
	float                                         Damage_22_44C1C8784B7991DCCCF68DA3127A53C0;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxAccuracy_23_E3E5D4AC444B05A3881987A750E6591C;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spread_24_D7376BDD4BB47794C6ECD995F0B66F07;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impulse_25_9FC261094FED348DD0C9E79C658E222D;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireRate_26_10E7E12E4756B0EAD899BE8513F300AC;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Recoil_H_21_8103D6824ADA8A52845705B058FE195C;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Recoil_W_18_1C589C9B4F8B90A084B1DCBF6F6916CF;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sway_20_AF5DF01F436ED144460E58B45DB831C9;          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReloadSpeed_29_CDCCA08A46462EEF78E45F801BD40B8E;   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Weapon_Negative_Mod_Data) == 0x000004, "Wrong alignment on FStruct_Weapon_Negative_Mod_Data");
static_assert(sizeof(FStruct_Weapon_Negative_Mod_Data) == 0x000024, "Wrong size on FStruct_Weapon_Negative_Mod_Data");
static_assert(offsetof(FStruct_Weapon_Negative_Mod_Data, Damage_22_44C1C8784B7991DCCCF68DA3127A53C0) == 0x000000, "Member 'FStruct_Weapon_Negative_Mod_Data::Damage_22_44C1C8784B7991DCCCF68DA3127A53C0' has a wrong offset!");
static_assert(offsetof(FStruct_Weapon_Negative_Mod_Data, MaxAccuracy_23_E3E5D4AC444B05A3881987A750E6591C) == 0x000004, "Member 'FStruct_Weapon_Negative_Mod_Data::MaxAccuracy_23_E3E5D4AC444B05A3881987A750E6591C' has a wrong offset!");
static_assert(offsetof(FStruct_Weapon_Negative_Mod_Data, Spread_24_D7376BDD4BB47794C6ECD995F0B66F07) == 0x000008, "Member 'FStruct_Weapon_Negative_Mod_Data::Spread_24_D7376BDD4BB47794C6ECD995F0B66F07' has a wrong offset!");
static_assert(offsetof(FStruct_Weapon_Negative_Mod_Data, Impulse_25_9FC261094FED348DD0C9E79C658E222D) == 0x00000C, "Member 'FStruct_Weapon_Negative_Mod_Data::Impulse_25_9FC261094FED348DD0C9E79C658E222D' has a wrong offset!");
static_assert(offsetof(FStruct_Weapon_Negative_Mod_Data, FireRate_26_10E7E12E4756B0EAD899BE8513F300AC) == 0x000010, "Member 'FStruct_Weapon_Negative_Mod_Data::FireRate_26_10E7E12E4756B0EAD899BE8513F300AC' has a wrong offset!");
static_assert(offsetof(FStruct_Weapon_Negative_Mod_Data, Recoil_H_21_8103D6824ADA8A52845705B058FE195C) == 0x000014, "Member 'FStruct_Weapon_Negative_Mod_Data::Recoil_H_21_8103D6824ADA8A52845705B058FE195C' has a wrong offset!");
static_assert(offsetof(FStruct_Weapon_Negative_Mod_Data, Recoil_W_18_1C589C9B4F8B90A084B1DCBF6F6916CF) == 0x000018, "Member 'FStruct_Weapon_Negative_Mod_Data::Recoil_W_18_1C589C9B4F8B90A084B1DCBF6F6916CF' has a wrong offset!");
static_assert(offsetof(FStruct_Weapon_Negative_Mod_Data, Sway_20_AF5DF01F436ED144460E58B45DB831C9) == 0x00001C, "Member 'FStruct_Weapon_Negative_Mod_Data::Sway_20_AF5DF01F436ED144460E58B45DB831C9' has a wrong offset!");
static_assert(offsetof(FStruct_Weapon_Negative_Mod_Data, ReloadSpeed_29_CDCCA08A46462EEF78E45F801BD40B8E) == 0x000020, "Member 'FStruct_Weapon_Negative_Mod_Data::ReloadSpeed_29_CDCCA08A46462EEF78E45F801BD40B8E' has a wrong offset!");

}

