#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_EnemyDamage

#include "Basic.hpp"

#include "GbxGameSystemCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_EnemyDamage.Struct_EnemyDamage
// 0x0210 (0x0210 - 0x0000)
struct FStruct_EnemyDamage final
{
public:
	struct FGbxParam                              Multiplier_46_80DB035D40990764A852C490FCE2E692;    // 0x0000(0x0080)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference)
	struct FGbxParam                              Radius_38_28A9CA704BAF39A99F7404A1C43B8282;        // 0x0080(0x0080)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference)
	struct FGbxParam                              Angle_39_E43219F94F5760FC493909B1338CEA58;         // 0x0100(0x0080)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference)
	struct FGbxParam                              HalfHeight_44_562DF27A429800DA2E0D9EAB7746A76F;    // 0x0180(0x0080)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference)
	class FString                                 Comment_40_301AAA14458CCFCF171605A6833B274C;       // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_EnemyDamage) == 0x000008, "Wrong alignment on FStruct_EnemyDamage");
static_assert(sizeof(FStruct_EnemyDamage) == 0x000210, "Wrong size on FStruct_EnemyDamage");
static_assert(offsetof(FStruct_EnemyDamage, Multiplier_46_80DB035D40990764A852C490FCE2E692) == 0x000000, "Member 'FStruct_EnemyDamage::Multiplier_46_80DB035D40990764A852C490FCE2E692' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyDamage, Radius_38_28A9CA704BAF39A99F7404A1C43B8282) == 0x000080, "Member 'FStruct_EnemyDamage::Radius_38_28A9CA704BAF39A99F7404A1C43B8282' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyDamage, Angle_39_E43219F94F5760FC493909B1338CEA58) == 0x000100, "Member 'FStruct_EnemyDamage::Angle_39_E43219F94F5760FC493909B1338CEA58' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyDamage, HalfHeight_44_562DF27A429800DA2E0D9EAB7746A76F) == 0x000180, "Member 'FStruct_EnemyDamage::HalfHeight_44_562DF27A429800DA2E0D9EAB7746A76F' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyDamage, Comment_40_301AAA14458CCFCF171605A6833B274C) == 0x000200, "Member 'FStruct_EnemyDamage::Comment_40_301AAA14458CCFCF171605A6833B274C' has a wrong offset!");

}

