#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ChallengeRewards

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ChallengeRewards.Struct_ChallengeRewards
// 0x000C (0x000C - 0x0000)
struct FStruct_ChallengeRewards final
{
public:
	float                                         Experience_7_68E5AC5B49575831B936BC94DB3BBA46;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cash_8_67A970A84C0A0A3EF4AEE49DEC5FAE27;           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eridium_9_7E99CC1F47A105B32F7EF0AD509E95B7;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_ChallengeRewards) == 0x000004, "Wrong alignment on FStruct_ChallengeRewards");
static_assert(sizeof(FStruct_ChallengeRewards) == 0x00000C, "Wrong size on FStruct_ChallengeRewards");
static_assert(offsetof(FStruct_ChallengeRewards, Experience_7_68E5AC5B49575831B936BC94DB3BBA46) == 0x000000, "Member 'FStruct_ChallengeRewards::Experience_7_68E5AC5B49575831B936BC94DB3BBA46' has a wrong offset!");
static_assert(offsetof(FStruct_ChallengeRewards, Cash_8_67A970A84C0A0A3EF4AEE49DEC5FAE27) == 0x000004, "Member 'FStruct_ChallengeRewards::Cash_8_67A970A84C0A0A3EF4AEE49DEC5FAE27' has a wrong offset!");
static_assert(offsetof(FStruct_ChallengeRewards, Eridium_9_7E99CC1F47A105B32F7EF0AD509E95B7) == 0x000008, "Member 'FStruct_ChallengeRewards::Eridium_9_7E99CC1F47A105B32F7EF0AD509E95B7' has a wrong offset!");

}

