#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_MasterMaterial_BaseParams_Layer2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EColorScheme_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_MasterMaterial_BaseParams_Layer2.Struct_MasterMaterial_BaseParams_Layer2
// 0x0044 (0x0044 - 0x0000)
struct FStruct_MasterMaterial_BaseParams_Layer2 final
{
public:
	struct FLinearColor                           L2_BaseColor_Multiply_92_3C6B06D746B9EDBF6CCE07AD005F7AF2; // 0x0000(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           L2_BaseColor_Metal_Multiply_93_26CF590846898356508B92BE96BA789B; // 0x0010(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L2_BaseColor_Multiply_UseLevelColor_94_290B254F480B007D30DF5DAB6CF512FC; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L2_BaseColor_Metal_Multiply_UseLevelColor_95_42FB9CB54D73A8278984C5B903551CEB; // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EColorScheme                                  L2_BaseColor_Multiply_LevelColor_96_796BBE454A04A7AAFDCCC2BF69272359; // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         L2_BaseColor_Desaturate_97_F51638BA49180B6201691B85CF570D03; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L2_BaseColor_HueShift_98_7E972FF44C1254963B8A7F9F0E4E0B31; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L2_RoughnessMin_99_E02C30D248D2AADF0113B29E893103AF; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L2_RoughnessMax_100_1E4904D741D5A2ED7A90DDBC4E531BE3; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           L2_EmissiveColor_Multiply_101_4234211348BDBB59F88842B3EB65D1B9; // 0x0034(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_MasterMaterial_BaseParams_Layer2) == 0x000004, "Wrong alignment on FStruct_MasterMaterial_BaseParams_Layer2");
static_assert(sizeof(FStruct_MasterMaterial_BaseParams_Layer2) == 0x000044, "Wrong size on FStruct_MasterMaterial_BaseParams_Layer2");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_BaseColor_Multiply_92_3C6B06D746B9EDBF6CCE07AD005F7AF2) == 0x000000, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_BaseColor_Multiply_92_3C6B06D746B9EDBF6CCE07AD005F7AF2' has a wrong offset!");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_BaseColor_Metal_Multiply_93_26CF590846898356508B92BE96BA789B) == 0x000010, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_BaseColor_Metal_Multiply_93_26CF590846898356508B92BE96BA789B' has a wrong offset!");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_BaseColor_Multiply_UseLevelColor_94_290B254F480B007D30DF5DAB6CF512FC) == 0x000020, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_BaseColor_Multiply_UseLevelColor_94_290B254F480B007D30DF5DAB6CF512FC' has a wrong offset!");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_BaseColor_Metal_Multiply_UseLevelColor_95_42FB9CB54D73A8278984C5B903551CEB) == 0x000021, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_BaseColor_Metal_Multiply_UseLevelColor_95_42FB9CB54D73A8278984C5B903551CEB' has a wrong offset!");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_BaseColor_Multiply_LevelColor_96_796BBE454A04A7AAFDCCC2BF69272359) == 0x000022, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_BaseColor_Multiply_LevelColor_96_796BBE454A04A7AAFDCCC2BF69272359' has a wrong offset!");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_BaseColor_Desaturate_97_F51638BA49180B6201691B85CF570D03) == 0x000024, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_BaseColor_Desaturate_97_F51638BA49180B6201691B85CF570D03' has a wrong offset!");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_BaseColor_HueShift_98_7E972FF44C1254963B8A7F9F0E4E0B31) == 0x000028, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_BaseColor_HueShift_98_7E972FF44C1254963B8A7F9F0E4E0B31' has a wrong offset!");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_RoughnessMin_99_E02C30D248D2AADF0113B29E893103AF) == 0x00002C, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_RoughnessMin_99_E02C30D248D2AADF0113B29E893103AF' has a wrong offset!");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_RoughnessMax_100_1E4904D741D5A2ED7A90DDBC4E531BE3) == 0x000030, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_RoughnessMax_100_1E4904D741D5A2ED7A90DDBC4E531BE3' has a wrong offset!");
static_assert(offsetof(FStruct_MasterMaterial_BaseParams_Layer2, L2_EmissiveColor_Multiply_101_4234211348BDBB59F88842B3EB65D1B9) == 0x000034, "Member 'FStruct_MasterMaterial_BaseParams_Layer2::L2_EmissiveColor_Multiply_101_4234211348BDBB59F88842B3EB65D1B9' has a wrong offset!");

}

