#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Artifact_Abilities

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Artifact_Abilities.Struct_Artifact_Abilities
// 0x0038 (0x0038 - 0x0000)
struct FStruct_Artifact_Abilities final
{
public:
	class FText                                   Description_43_9E2B784A4ADF376134B3F99DDFEF0B9B;   // 0x0000(0x0018)(Edit, BlueprintVisible)
	float                                         Value1Base_44_6007CA5C418B4F68A7493B9141BCAC47;    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value1Max_45_2EEE7B5943AFA52606550BB02E17447D;     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ValueScalar_60_D29B9BBA465C135685CC8EA9E0A4CA2D;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RarityScaler_Common_30_3C55EE9A4939DE9FB4C6F69F476CAF36; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RarityScaler_Uncommon_32_2A7E73B548122F1E2092C89B09B6D7B0; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RarityScaler_Rare_34_3225B99F415ED9CF81215FAEE9E3D985; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RarityScaler_VeryRare_36_530AB05146FE4FE3DFE021BE7419CF71; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Artifact_Abilities) == 0x000008, "Wrong alignment on FStruct_Artifact_Abilities");
static_assert(sizeof(FStruct_Artifact_Abilities) == 0x000038, "Wrong size on FStruct_Artifact_Abilities");
static_assert(offsetof(FStruct_Artifact_Abilities, Description_43_9E2B784A4ADF376134B3F99DDFEF0B9B) == 0x000000, "Member 'FStruct_Artifact_Abilities::Description_43_9E2B784A4ADF376134B3F99DDFEF0B9B' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Abilities, Value1Base_44_6007CA5C418B4F68A7493B9141BCAC47) == 0x000018, "Member 'FStruct_Artifact_Abilities::Value1Base_44_6007CA5C418B4F68A7493B9141BCAC47' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Abilities, Value1Max_45_2EEE7B5943AFA52606550BB02E17447D) == 0x00001C, "Member 'FStruct_Artifact_Abilities::Value1Max_45_2EEE7B5943AFA52606550BB02E17447D' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Abilities, ValueScalar_60_D29B9BBA465C135685CC8EA9E0A4CA2D) == 0x000020, "Member 'FStruct_Artifact_Abilities::ValueScalar_60_D29B9BBA465C135685CC8EA9E0A4CA2D' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Abilities, RarityScaler_Common_30_3C55EE9A4939DE9FB4C6F69F476CAF36) == 0x000028, "Member 'FStruct_Artifact_Abilities::RarityScaler_Common_30_3C55EE9A4939DE9FB4C6F69F476CAF36' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Abilities, RarityScaler_Uncommon_32_2A7E73B548122F1E2092C89B09B6D7B0) == 0x00002C, "Member 'FStruct_Artifact_Abilities::RarityScaler_Uncommon_32_2A7E73B548122F1E2092C89B09B6D7B0' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Abilities, RarityScaler_Rare_34_3225B99F415ED9CF81215FAEE9E3D985) == 0x000030, "Member 'FStruct_Artifact_Abilities::RarityScaler_Rare_34_3225B99F415ED9CF81215FAEE9E3D985' has a wrong offset!");
static_assert(offsetof(FStruct_Artifact_Abilities, RarityScaler_VeryRare_36_530AB05146FE4FE3DFE021BE7419CF71) == 0x000034, "Member 'FStruct_Artifact_Abilities::RarityScaler_VeryRare_36_530AB05146FE4FE3DFE021BE7419CF71' has a wrong offset!");

}

