#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_IncomingDamagePresentation

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_IncomingDamagePresentation.Struct_IncomingDamagePresentation
// 0x000C (0x000C - 0x0000)
struct FStruct_IncomingDamagePresentation final
{
public:
	float                                         DamageThreshold_2_F5E8579A44C473129FDE6DBFA502FD4F; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageScore_4_38BE320F42C43E1E141EC3A7074A3370;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageScoreThreshold_6_7AF08B8D433CBFEB34DAF48187247FF6; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_IncomingDamagePresentation) == 0x000004, "Wrong alignment on FStruct_IncomingDamagePresentation");
static_assert(sizeof(FStruct_IncomingDamagePresentation) == 0x00000C, "Wrong size on FStruct_IncomingDamagePresentation");
static_assert(offsetof(FStruct_IncomingDamagePresentation, DamageThreshold_2_F5E8579A44C473129FDE6DBFA502FD4F) == 0x000000, "Member 'FStruct_IncomingDamagePresentation::DamageThreshold_2_F5E8579A44C473129FDE6DBFA502FD4F' has a wrong offset!");
static_assert(offsetof(FStruct_IncomingDamagePresentation, DamageScore_4_38BE320F42C43E1E141EC3A7074A3370) == 0x000004, "Member 'FStruct_IncomingDamagePresentation::DamageScore_4_38BE320F42C43E1E141EC3A7074A3370' has a wrong offset!");
static_assert(offsetof(FStruct_IncomingDamagePresentation, DamageScoreThreshold_6_7AF08B8D433CBFEB34DAF48187247FF6) == 0x000008, "Member 'FStruct_IncomingDamagePresentation::DamageScoreThreshold_6_7AF08B8D433CBFEB34DAF48187247FF6' has a wrong offset!");

}

