#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Saurian_Ranges

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Saurian_Ranges.Struct_Saurian_Ranges
// 0x0014 (0x0014 - 0x0000)
struct FStruct_Saurian_Ranges final
{
public:
	float                                         BiteRadius_2_CBD8B1944A8137049C5C35BF37D8E3E1;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClawRadius_4_8F7DA42E48AAB8B3B114B78238DE21A5;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KickRadius_6_471582F642AD0014FE282F88AEAFD194;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TailRadius_9_43F6E5E34E8F8C9C77500E9DA6C70D5A;     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargeStrike_12_BB3C0C5441C70694EE0A079E79E45DFF;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Saurian_Ranges) == 0x000004, "Wrong alignment on FStruct_Saurian_Ranges");
static_assert(sizeof(FStruct_Saurian_Ranges) == 0x000014, "Wrong size on FStruct_Saurian_Ranges");
static_assert(offsetof(FStruct_Saurian_Ranges, BiteRadius_2_CBD8B1944A8137049C5C35BF37D8E3E1) == 0x000000, "Member 'FStruct_Saurian_Ranges::BiteRadius_2_CBD8B1944A8137049C5C35BF37D8E3E1' has a wrong offset!");
static_assert(offsetof(FStruct_Saurian_Ranges, ClawRadius_4_8F7DA42E48AAB8B3B114B78238DE21A5) == 0x000004, "Member 'FStruct_Saurian_Ranges::ClawRadius_4_8F7DA42E48AAB8B3B114B78238DE21A5' has a wrong offset!");
static_assert(offsetof(FStruct_Saurian_Ranges, KickRadius_6_471582F642AD0014FE282F88AEAFD194) == 0x000008, "Member 'FStruct_Saurian_Ranges::KickRadius_6_471582F642AD0014FE282F88AEAFD194' has a wrong offset!");
static_assert(offsetof(FStruct_Saurian_Ranges, TailRadius_9_43F6E5E34E8F8C9C77500E9DA6C70D5A) == 0x00000C, "Member 'FStruct_Saurian_Ranges::TailRadius_9_43F6E5E34E8F8C9C77500E9DA6C70D5A' has a wrong offset!");
static_assert(offsetof(FStruct_Saurian_Ranges, ChargeStrike_12_BB3C0C5441C70694EE0A079E79E45DFF) == 0x000010, "Member 'FStruct_Saurian_Ranges::ChargeStrike_12_BB3C0C5441C70694EE0A079E79E45DFF' has a wrong offset!");

}

