#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_IO_SanctuaryRhysPlaylist

#include "Basic.hpp"

#include "GbxMission_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_IO_SanctuaryRhysPlaylist.Struct_IO_SanctuaryRhysPlaylist
// 0x0048 (0x0048 - 0x0000)
struct FStruct_IO_SanctuaryRhysPlaylist final
{
public:
	struct FMissionObjectiveReference             ObjectiveToPlay_6_6A2AF1C441E7452578C0579FA69701B3; // 0x0000(0x0030)(Edit, BlueprintVisible)
	class AGbxLevelSequenceActor*                 SequencerToPlay_5_593B4EC24730D8B2C0B5C6B155DFFD4D; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMissionEventReference                 MissionEventOnComplete_9_3471142A44136FEFD7393A8D045BF37A; // 0x0038(0x0010)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FStruct_IO_SanctuaryRhysPlaylist) == 0x000008, "Wrong alignment on FStruct_IO_SanctuaryRhysPlaylist");
static_assert(sizeof(FStruct_IO_SanctuaryRhysPlaylist) == 0x000048, "Wrong size on FStruct_IO_SanctuaryRhysPlaylist");
static_assert(offsetof(FStruct_IO_SanctuaryRhysPlaylist, ObjectiveToPlay_6_6A2AF1C441E7452578C0579FA69701B3) == 0x000000, "Member 'FStruct_IO_SanctuaryRhysPlaylist::ObjectiveToPlay_6_6A2AF1C441E7452578C0579FA69701B3' has a wrong offset!");
static_assert(offsetof(FStruct_IO_SanctuaryRhysPlaylist, SequencerToPlay_5_593B4EC24730D8B2C0B5C6B155DFFD4D) == 0x000030, "Member 'FStruct_IO_SanctuaryRhysPlaylist::SequencerToPlay_5_593B4EC24730D8B2C0B5C6B155DFFD4D' has a wrong offset!");
static_assert(offsetof(FStruct_IO_SanctuaryRhysPlaylist, MissionEventOnComplete_9_3471142A44136FEFD7393A8D045BF37A) == 0x000038, "Member 'FStruct_IO_SanctuaryRhysPlaylist::MissionEventOnComplete_9_3471142A44136FEFD7393A8D045BF37A' has a wrong offset!");

}

