#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SplineDecoratorPointOverride

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SplineDecoratorPointOverride.Struct_SplineDecoratorPointOverride
// 0x0020 (0x0020 - 0x0000)
struct FStruct_SplineDecoratorPointOverride final
{
public:
	int32                                         PointIndex_5_266D274140A7BD545E932AA05492C2B3;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            MeshOverride_9_A76B9FE4419F710C143AC3B08CAE27F7;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationOffset_12_BA5EE2BF4BB25155552ACA9C61EEEAE6; // 0x0010(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_SplineDecoratorPointOverride) == 0x000008, "Wrong alignment on FStruct_SplineDecoratorPointOverride");
static_assert(sizeof(FStruct_SplineDecoratorPointOverride) == 0x000020, "Wrong size on FStruct_SplineDecoratorPointOverride");
static_assert(offsetof(FStruct_SplineDecoratorPointOverride, PointIndex_5_266D274140A7BD545E932AA05492C2B3) == 0x000000, "Member 'FStruct_SplineDecoratorPointOverride::PointIndex_5_266D274140A7BD545E932AA05492C2B3' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorPointOverride, MeshOverride_9_A76B9FE4419F710C143AC3B08CAE27F7) == 0x000008, "Member 'FStruct_SplineDecoratorPointOverride::MeshOverride_9_A76B9FE4419F710C143AC3B08CAE27F7' has a wrong offset!");
static_assert(offsetof(FStruct_SplineDecoratorPointOverride, LocationOffset_12_BA5EE2BF4BB25155552ACA9C61EEEAE6) == 0x000010, "Member 'FStruct_SplineDecoratorPointOverride::LocationOffset_12_BA5EE2BF4BB25155552ACA9C61EEEAE6' has a wrong offset!");

}

