#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_EnemyBalanceProperties

#include "Basic.hpp"

#include "EEnemyExperienceType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_EnemyBalanceProperties.Struct_EnemyBalanceProperties
// 0x0030 (0x0030 - 0x0000)
struct FStruct_EnemyBalanceProperties final
{
public:
	EEnemyExperienceType                          ExperienceType_8_73D53DF14EC1787599308F9A13A91D97; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DamageMultiplier_LevelBased_23_3CAF34804D650A98AB8FAFAB37CB87FF; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthMultiplier_01_Primary_9_07801BE24749AFC87299AD91E1B82E12; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthMultiplier_02_Secondary_12_9204082C4992E4200D005C8CBA622E49; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthMultiplier_03_Tertiary_16_46D12ED24F464AF5278FAAA2927388E2; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthMultiplier_04_Quaternary_18_1B102342416A40A8DC163EA34FE48863; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthMultiplier_05_Quinary_20_EC017977469D43823CC907990EEF7113; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    LootRarityModifier_26_95E080A844632E94012641B3BA7B57DC; // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FStruct_EnemyBalanceProperties) == 0x000008, "Wrong alignment on FStruct_EnemyBalanceProperties");
static_assert(sizeof(FStruct_EnemyBalanceProperties) == 0x000030, "Wrong size on FStruct_EnemyBalanceProperties");
static_assert(offsetof(FStruct_EnemyBalanceProperties, ExperienceType_8_73D53DF14EC1787599308F9A13A91D97) == 0x000000, "Member 'FStruct_EnemyBalanceProperties::ExperienceType_8_73D53DF14EC1787599308F9A13A91D97' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyBalanceProperties, DamageMultiplier_LevelBased_23_3CAF34804D650A98AB8FAFAB37CB87FF) == 0x000004, "Member 'FStruct_EnemyBalanceProperties::DamageMultiplier_LevelBased_23_3CAF34804D650A98AB8FAFAB37CB87FF' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyBalanceProperties, HealthMultiplier_01_Primary_9_07801BE24749AFC87299AD91E1B82E12) == 0x000008, "Member 'FStruct_EnemyBalanceProperties::HealthMultiplier_01_Primary_9_07801BE24749AFC87299AD91E1B82E12' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyBalanceProperties, HealthMultiplier_02_Secondary_12_9204082C4992E4200D005C8CBA622E49) == 0x00000C, "Member 'FStruct_EnemyBalanceProperties::HealthMultiplier_02_Secondary_12_9204082C4992E4200D005C8CBA622E49' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyBalanceProperties, HealthMultiplier_03_Tertiary_16_46D12ED24F464AF5278FAAA2927388E2) == 0x000010, "Member 'FStruct_EnemyBalanceProperties::HealthMultiplier_03_Tertiary_16_46D12ED24F464AF5278FAAA2927388E2' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyBalanceProperties, HealthMultiplier_04_Quaternary_18_1B102342416A40A8DC163EA34FE48863) == 0x000014, "Member 'FStruct_EnemyBalanceProperties::HealthMultiplier_04_Quaternary_18_1B102342416A40A8DC163EA34FE48863' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyBalanceProperties, HealthMultiplier_05_Quinary_20_EC017977469D43823CC907990EEF7113) == 0x000018, "Member 'FStruct_EnemyBalanceProperties::HealthMultiplier_05_Quinary_20_EC017977469D43823CC907990EEF7113' has a wrong offset!");
static_assert(offsetof(FStruct_EnemyBalanceProperties, LootRarityModifier_26_95E080A844632E94012641B3BA7B57DC) == 0x000020, "Member 'FStruct_EnemyBalanceProperties::LootRarityModifier_26_95E080A844632E94012641B3BA7B57DC' has a wrong offset!");

}

