#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Hardpoint_FalconStrike

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxWeapon_structs.hpp"


namespace SDK::Params
{

// Function Weapon_Hardpoint_FalconStrike.Weapon_Hardpoint_FalconStrike_C.ExecuteUbergraph_Weapon_Hardpoint_FalconStrike
// 0x0088 (0x0088 - 0x0000)
struct Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetAttachmentMesh_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPAnim_IronBear_FalconStrike_C*        K2Node_DynamicCast_AsBPAnim_Iron_Bear_Falcon_Strike; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetAttachmentMesh_ReturnValue1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component1;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPAnim_IronBear_FalconStrike_C*        K2Node_CustomEvent_Anim;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue1;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPAnim_IronBear_FalconStrike_C*        K2Node_DynamicCast_AsBPAnim_Iron_Bear_Falcon_Strike1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue2;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPAnim_IronBear_FalconStrike_C*        K2Node_DynamicCast_AsBPAnim_Iron_Bear_Falcon_Strike2; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike) == 0x000008, "Wrong alignment on Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike");
static_assert(sizeof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike) == 0x000088, "Wrong size on Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, EntryPoint) == 0x000000, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::EntryPoint' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, CallFunc_GetAttachmentMesh_ReturnValue) == 0x000008, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::CallFunc_GetAttachmentMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000010, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_AsBPAnim_Iron_Bear_Falcon_Strike) == 0x000028, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_AsBPAnim_Iron_Bear_Falcon_Strike' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, CallFunc_GetAttachmentMesh_ReturnValue1) == 0x000038, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::CallFunc_GetAttachmentMesh_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_AsSkeletal_Mesh_Component1) == 0x000040, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_AsSkeletal_Mesh_Component1' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_CustomEvent_Anim) == 0x000050, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_CustomEvent_Anim' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, CallFunc_GetAnimInstance_ReturnValue1) == 0x000058, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::CallFunc_GetAnimInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_AsBPAnim_Iron_Bear_Falcon_Strike1) == 0x000060, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_AsBPAnim_Iron_Bear_Falcon_Strike1' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_bSuccess3) == 0x000068, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, CallFunc_GetAnimInstance_ReturnValue2) == 0x000070, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::CallFunc_GetAnimInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_AsBPAnim_Iron_Bear_Falcon_Strike2) == 0x000078, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_AsBPAnim_Iron_Bear_Falcon_Strike2' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike, K2Node_DynamicCast_bSuccess4) == 0x000080, "Member 'Weapon_Hardpoint_FalconStrike_C_ExecuteUbergraph_Weapon_Hardpoint_FalconStrike::K2Node_DynamicCast_bSuccess4' has a wrong offset!");

// Function Weapon_Hardpoint_FalconStrike.Weapon_Hardpoint_FalconStrike_C.InitAnimation
// 0x0008 (0x0008 - 0x0000)
struct Weapon_Hardpoint_FalconStrike_C_InitAnimation final
{
public:
	class UBPAnim_IronBear_FalconStrike_C*        Anim;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_Hardpoint_FalconStrike_C_InitAnimation) == 0x000008, "Wrong alignment on Weapon_Hardpoint_FalconStrike_C_InitAnimation");
static_assert(sizeof(Weapon_Hardpoint_FalconStrike_C_InitAnimation) == 0x000008, "Wrong size on Weapon_Hardpoint_FalconStrike_C_InitAnimation");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_InitAnimation, Anim) == 0x000000, "Member 'Weapon_Hardpoint_FalconStrike_C_InitAnimation::Anim' has a wrong offset!");

// Function Weapon_Hardpoint_FalconStrike.Weapon_Hardpoint_FalconStrike_C.TryPerformFeedback
// 0x0010 (0x0010 - 0x0000)
struct Weapon_Hardpoint_FalconStrike_C_TryPerformFeedback final
{
public:
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_Hardpoint_FalconStrike_C_TryPerformFeedback) == 0x000004, "Wrong alignment on Weapon_Hardpoint_FalconStrike_C_TryPerformFeedback");
static_assert(sizeof(Weapon_Hardpoint_FalconStrike_C_TryPerformFeedback) == 0x000010, "Wrong size on Weapon_Hardpoint_FalconStrike_C_TryPerformFeedback");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_TryPerformFeedback, CallFunc_IsLocallyControlled_ReturnValue) == 0x000000, "Member 'Weapon_Hardpoint_FalconStrike_C_TryPerformFeedback::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_TryPerformFeedback, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Weapon_Hardpoint_FalconStrike_C_TryPerformFeedback::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function Weapon_Hardpoint_FalconStrike.Weapon_Hardpoint_FalconStrike_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct Weapon_Hardpoint_FalconStrike_C_UserConstructionScript final
{
public:
	struct FWeaponRegisterAttachmentEffectData    K2Node_MakeStruct_WeaponRegisterAttachmentEffectData; // 0x0000(0x0060)(NoDestructor)
};
static_assert(alignof(Weapon_Hardpoint_FalconStrike_C_UserConstructionScript) == 0x000008, "Wrong alignment on Weapon_Hardpoint_FalconStrike_C_UserConstructionScript");
static_assert(sizeof(Weapon_Hardpoint_FalconStrike_C_UserConstructionScript) == 0x000060, "Wrong size on Weapon_Hardpoint_FalconStrike_C_UserConstructionScript");
static_assert(offsetof(Weapon_Hardpoint_FalconStrike_C_UserConstructionScript, K2Node_MakeStruct_WeaponRegisterAttachmentEffectData) == 0x000000, "Member 'Weapon_Hardpoint_FalconStrike_C_UserConstructionScript::K2Node_MakeStruct_WeaponRegisterAttachmentEffectData' has a wrong offset!");

}

