#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponType_Hardpoint_Railgun

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxGameSystemCore_structs.hpp"
#include "WeaponType_Hardpoints_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponType_Hardpoint_Railgun.WeaponType_Hardpoint_Railgun_C
// 0x0078 (0x0B00 - 0x0A88)
class AWeaponType_Hardpoint_Railgun_C : public AWeaponType_Hardpoints_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WeaponType_Hardpoint_Railgun_C;     // 0x0A88(0x0008)(Transient, DuplicateTransient)
	class UOakWeaponAudioProviderComponent*       OakWeaponAudioProvider;                            // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakDamageModifierComponent*            OakDamageModifier;                                 // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponFireProjectileComponent*         WeaponFireProjectile;                              // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         WeaponMesh_3rd;                                    // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         WeaponMesh_1st;                                    // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttributeEffectData                   AttEffect_Default_EffectChance;                    // 0x0AB8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_WeaponType_Hardpoint_Railgun(int32 EntryPoint);
	void ConfigureFX();
	void K2_InitializeMod();
	void ReceiveBeginPlay();
	void SetupMod1();
	void SetupMod2();
	void K2_Initialize();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponType_Hardpoint_Railgun_C">();
	}
	static class AWeaponType_Hardpoint_Railgun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponType_Hardpoint_Railgun_C>();
	}
};
static_assert(alignof(AWeaponType_Hardpoint_Railgun_C) == 0x000008, "Wrong alignment on AWeaponType_Hardpoint_Railgun_C");
static_assert(sizeof(AWeaponType_Hardpoint_Railgun_C) == 0x000B00, "Wrong size on AWeaponType_Hardpoint_Railgun_C");
static_assert(offsetof(AWeaponType_Hardpoint_Railgun_C, UberGraphFrame_WeaponType_Hardpoint_Railgun_C) == 0x000A88, "Member 'AWeaponType_Hardpoint_Railgun_C::UberGraphFrame_WeaponType_Hardpoint_Railgun_C' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoint_Railgun_C, OakWeaponAudioProvider) == 0x000A90, "Member 'AWeaponType_Hardpoint_Railgun_C::OakWeaponAudioProvider' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoint_Railgun_C, OakDamageModifier) == 0x000A98, "Member 'AWeaponType_Hardpoint_Railgun_C::OakDamageModifier' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoint_Railgun_C, WeaponFireProjectile) == 0x000AA0, "Member 'AWeaponType_Hardpoint_Railgun_C::WeaponFireProjectile' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoint_Railgun_C, WeaponMesh_3rd) == 0x000AA8, "Member 'AWeaponType_Hardpoint_Railgun_C::WeaponMesh_3rd' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoint_Railgun_C, WeaponMesh_1st) == 0x000AB0, "Member 'AWeaponType_Hardpoint_Railgun_C::WeaponMesh_1st' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoint_Railgun_C, AttEffect_Default_EffectChance) == 0x000AB8, "Member 'AWeaponType_Hardpoint_Railgun_C::AttEffect_Default_EffectChance' has a wrong offset!");

}

