#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_HardType_FalconStrike_Targeting

#include "Basic.hpp"

#include "WwiseAudio_structs.hpp"


namespace SDK::Params
{

// Function Weapon_HardType_FalconStrike_Targeting.Weapon_HardType_FalconStrike_Targeting_C.ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting
// 0x0040 (0x0040 - 0x0000)
struct Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                   CallFunc_GetDefaultWwiseComponent_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_Target;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWwisePlaybackInstance                 CallFunc_PostWwiseEvent_ReturnValue;               // 0x0020(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting) == 0x000008, "Wrong alignment on Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting");
static_assert(sizeof(Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting) == 0x000040, "Wrong size on Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting, EntryPoint) == 0x000000, "Member 'Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting::EntryPoint' has a wrong offset!");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting, CallFunc_GetDefaultWwiseComponent_ReturnValue) == 0x000010, "Member 'Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting::CallFunc_GetDefaultWwiseComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting, K2Node_ComponentBoundEvent_Target) == 0x000018, "Member 'Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting::K2Node_ComponentBoundEvent_Target' has a wrong offset!");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting, CallFunc_PostWwiseEvent_ReturnValue) == 0x000020, "Member 'Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting::CallFunc_PostWwiseEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00003C, "Member 'Weapon_HardType_FalconStrike_Targeting_C_ExecuteUbergraph_Weapon_HardType_FalconStrike_Targeting::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function Weapon_HardType_FalconStrike_Targeting.Weapon_HardType_FalconStrike_Targeting_C.BndEvt__FalconStrikeTargeting_K2Node_ComponentBoundEvent_0_TargetingUpdateSignature__DelegateSignature_Weapon_HardType_FalconStrike_Targeting
// 0x0008 (0x0008 - 0x0000)
struct Weapon_HardType_FalconStrike_Targeting_C_BndEvt__FalconStrikeTargeting_K2Node_ComponentBoundEvent_0_TargetingUpdateSignature__DelegateSignature_Weapon_HardType_FalconStrike_Targeting final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_HardType_FalconStrike_Targeting_C_BndEvt__FalconStrikeTargeting_K2Node_ComponentBoundEvent_0_TargetingUpdateSignature__DelegateSignature_Weapon_HardType_FalconStrike_Targeting) == 0x000008, "Wrong alignment on Weapon_HardType_FalconStrike_Targeting_C_BndEvt__FalconStrikeTargeting_K2Node_ComponentBoundEvent_0_TargetingUpdateSignature__DelegateSignature_Weapon_HardType_FalconStrike_Targeting");
static_assert(sizeof(Weapon_HardType_FalconStrike_Targeting_C_BndEvt__FalconStrikeTargeting_K2Node_ComponentBoundEvent_0_TargetingUpdateSignature__DelegateSignature_Weapon_HardType_FalconStrike_Targeting) == 0x000008, "Wrong size on Weapon_HardType_FalconStrike_Targeting_C_BndEvt__FalconStrikeTargeting_K2Node_ComponentBoundEvent_0_TargetingUpdateSignature__DelegateSignature_Weapon_HardType_FalconStrike_Targeting");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_BndEvt__FalconStrikeTargeting_K2Node_ComponentBoundEvent_0_TargetingUpdateSignature__DelegateSignature_Weapon_HardType_FalconStrike_Targeting, Target) == 0x000000, "Member 'Weapon_HardType_FalconStrike_Targeting_C_BndEvt__FalconStrikeTargeting_K2Node_ComponentBoundEvent_0_TargetingUpdateSignature__DelegateSignature_Weapon_HardType_FalconStrike_Targeting::Target' has a wrong offset!");

// Function Weapon_HardType_FalconStrike_Targeting.Weapon_HardType_FalconStrike_Targeting_C.PlayFeedback
// 0x0018 (0x0018 - 0x0000)
struct Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback) == 0x000008, "Wrong alignment on Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback");
static_assert(sizeof(Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback) == 0x000018, "Wrong size on Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback, CallFunc_GetAssociatedPlayerController_ReturnValue) == 0x000008, "Member 'Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback::CallFunc_GetAssociatedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Weapon_HardType_FalconStrike_Targeting_C_PlayFeedback::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Weapon_HardType_FalconStrike_Targeting.Weapon_HardType_FalconStrike_Targeting_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct Weapon_HardType_FalconStrike_Targeting_C_UserConstructionScript final
{
public:
	TArray<class UActorComponent*>                K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	uint8                                         CallFunc_AddUseMode_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_HardType_FalconStrike_Targeting_C_UserConstructionScript) == 0x000008, "Wrong alignment on Weapon_HardType_FalconStrike_Targeting_C_UserConstructionScript");
static_assert(sizeof(Weapon_HardType_FalconStrike_Targeting_C_UserConstructionScript) == 0x000018, "Wrong size on Weapon_HardType_FalconStrike_Targeting_C_UserConstructionScript");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'Weapon_HardType_FalconStrike_Targeting_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Weapon_HardType_FalconStrike_Targeting_C_UserConstructionScript, CallFunc_AddUseMode_ReturnValue) == 0x000010, "Member 'Weapon_HardType_FalconStrike_Targeting_C_UserConstructionScript::CallFunc_AddUseMode_ReturnValue' has a wrong offset!");

}

