#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponType_Hardpoints_Base

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponType_Hardpoints_Base.WeaponType_Hardpoints_Base_C
// 0x0048 (0x0A88 - 0x0A40)
class AWeaponType_Hardpoints_Base_C : public AOakWeapon_IronBearHardPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A40(0x0008)(Transient, DuplicateTransient)
	class UGbxSkeletalMeshComponent*              GbxSkeletalMesh;                                   // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponClipReloadComponent*             WeaponClipReload;                                  // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAmmoPoolComponent*               WeaponAmmoPool;                                    // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPAnim_IronBear_1st_C*                 AnimGraph_1st;                                     // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPAnim_IronBear_3rd_C*                 AnimGraph_3rd;                                     // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPEventHub_Gunner_C*                   EventHub;                                          // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIronCub;                                         // 0x0A78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A79[0x7];                                      // 0x0A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPAnim_IronCub_C*                      AnimGraph_IronCub;                                 // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WeaponType_Hardpoints_Base(int32 EntryPoint);
	void InitializeHardPointIronCub();
	void K2_Initialize();
	void EndHardPointAction();
	void BeginHardPointAction();
	void UserConstructionScript();
	void GetIronBearAnimBPs(class UBPAnim_IronBear_1st_C** AnimGraph_1st_0, class UBPAnim_IronBear_3rd_C** AnimGraph_3rd_0);
	void GetIronCubAnimBP(class UBPAnim_IronCub_C** AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponType_Hardpoints_Base_C">();
	}
	static class AWeaponType_Hardpoints_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponType_Hardpoints_Base_C>();
	}
};
static_assert(alignof(AWeaponType_Hardpoints_Base_C) == 0x000008, "Wrong alignment on AWeaponType_Hardpoints_Base_C");
static_assert(sizeof(AWeaponType_Hardpoints_Base_C) == 0x000A88, "Wrong size on AWeaponType_Hardpoints_Base_C");
static_assert(offsetof(AWeaponType_Hardpoints_Base_C, UberGraphFrame) == 0x000A40, "Member 'AWeaponType_Hardpoints_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoints_Base_C, GbxSkeletalMesh) == 0x000A48, "Member 'AWeaponType_Hardpoints_Base_C::GbxSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoints_Base_C, WeaponClipReload) == 0x000A50, "Member 'AWeaponType_Hardpoints_Base_C::WeaponClipReload' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoints_Base_C, WeaponAmmoPool) == 0x000A58, "Member 'AWeaponType_Hardpoints_Base_C::WeaponAmmoPool' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoints_Base_C, AnimGraph_1st) == 0x000A60, "Member 'AWeaponType_Hardpoints_Base_C::AnimGraph_1st' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoints_Base_C, AnimGraph_3rd) == 0x000A68, "Member 'AWeaponType_Hardpoints_Base_C::AnimGraph_3rd' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoints_Base_C, EventHub) == 0x000A70, "Member 'AWeaponType_Hardpoints_Base_C::EventHub' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoints_Base_C, IsIronCub) == 0x000A78, "Member 'AWeaponType_Hardpoints_Base_C::IsIronCub' has a wrong offset!");
static_assert(offsetof(AWeaponType_Hardpoints_Base_C, AnimGraph_IronCub) == 0x000A80, "Member 'AWeaponType_Hardpoints_Base_C::AnimGraph_IronCub' has a wrong offset!");

}

