#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotifyPlayCharaSE

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SS_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotifyPlayCharaSE.BP_AnimNotifyPlayCharaSE_C
// 0x0038 (0x0070 - 0x0038)
class UBP_AnimNotifyPlayCharaSE_C final : public UAnimNotify
{
public:
	int32                                         CueId;                                             // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseGeneralCueSheet;                              // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Volume;                                            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESSSoundGroupType                             SoundType;                                         // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachLocationName;                                // 0x004C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AttachLocation;                                    // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AnimNotifyPlayCharaSE_C">();
	}
	static class UBP_AnimNotifyPlayCharaSE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotifyPlayCharaSE_C>();
	}
};
static_assert(alignof(UBP_AnimNotifyPlayCharaSE_C) == 0x000008, "Wrong alignment on UBP_AnimNotifyPlayCharaSE_C");
static_assert(sizeof(UBP_AnimNotifyPlayCharaSE_C) == 0x000070, "Wrong size on UBP_AnimNotifyPlayCharaSE_C");
static_assert(offsetof(UBP_AnimNotifyPlayCharaSE_C, CueId) == 0x000038, "Member 'UBP_AnimNotifyPlayCharaSE_C::CueId' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotifyPlayCharaSE_C, IsUseGeneralCueSheet) == 0x00003C, "Member 'UBP_AnimNotifyPlayCharaSE_C::IsUseGeneralCueSheet' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotifyPlayCharaSE_C, Volume) == 0x000040, "Member 'UBP_AnimNotifyPlayCharaSE_C::Volume' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotifyPlayCharaSE_C, SoundType) == 0x000048, "Member 'UBP_AnimNotifyPlayCharaSE_C::SoundType' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotifyPlayCharaSE_C, AttachLocationName) == 0x00004C, "Member 'UBP_AnimNotifyPlayCharaSE_C::AttachLocationName' has a wrong offset!");
static_assert(offsetof(UBP_AnimNotifyPlayCharaSE_C, AttachLocation) == 0x000058, "Member 'UBP_AnimNotifyPlayCharaSE_C::AttachLocation' has a wrong offset!");

}

