#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlastImpactProcedure

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BlastImpactProcedure.BP_BlastImpactProcedure_C
// 0x0050 (0x04C0 - 0x0470)
class ABP_BlastImpactProcedure_C final : public ASSBlastImpactProcedure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CalcLocationFrameCount;                            // 0x0480(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndWithWarp;                                       // 0x0484(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _____Y_K;                                          // 0x0485(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          B_B_______s_W_K___;                                // 0x0486(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _______L___;                                       // 0x0487(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          __Y_________;                                      // 0x0488(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	bool CheckHaveEndEvent(class USSBattleImpactCharacterProxy* InCharacterProxy);
	void ConclusionAnimation(bool* HasFinishAnimation);
	void ExecuteUbergraph_BP_BlastImpactProcedure(int32 EntryPoint);
	void FinishAnimation();
	bool IsCharacterHaveEvent(class USSBattleImpactCharacterProxy* InCharacterProxy);
	void OnBattleImpactBreak();
	void OnBeginBattle();
	void OnBeginConclusion();
	void OnBeginFinish();
	void OnBeginGame();
	void OnBeginIntroduction();
	void OnChangedPhase(const EBattleImpactPhase InPhase);
	void OnChangePhase(EBattleImpactPhase NewParam);
	void OnEnd();
	void OnTickConclusion(float DeltaTime);
	void OnTickFinish(float DeltaTime);
	void OnTickGame(float DeltaTime);
	void OnTickIntroduction(float DeltaTime);
	void ReceivePostWarped(ESSBlastImpactPositionType Type);
	void SendDamageToLoser();
	void SetWarpCamera();

	void DebugDraw(float InDeltaT) const;
	EBattleImpactPhase GetNextPhase(EBattleImpactPhase InCurrentPhase) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BlastImpactProcedure_C">();
	}
	static class ABP_BlastImpactProcedure_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BlastImpactProcedure_C>();
	}
};
static_assert(alignof(ABP_BlastImpactProcedure_C) == 0x000010, "Wrong alignment on ABP_BlastImpactProcedure_C");
static_assert(sizeof(ABP_BlastImpactProcedure_C) == 0x0004C0, "Wrong size on ABP_BlastImpactProcedure_C");
static_assert(offsetof(ABP_BlastImpactProcedure_C, UberGraphFrame) == 0x000470, "Member 'ABP_BlastImpactProcedure_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BlastImpactProcedure_C, DefaultSceneRoot) == 0x000478, "Member 'ABP_BlastImpactProcedure_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BlastImpactProcedure_C, CalcLocationFrameCount) == 0x000480, "Member 'ABP_BlastImpactProcedure_C::CalcLocationFrameCount' has a wrong offset!");
static_assert(offsetof(ABP_BlastImpactProcedure_C, EndWithWarp) == 0x000484, "Member 'ABP_BlastImpactProcedure_C::EndWithWarp' has a wrong offset!");
static_assert(offsetof(ABP_BlastImpactProcedure_C, _____Y_K) == 0x000485, "Member 'ABP_BlastImpactProcedure_C::_____Y_K' has a wrong offset!");
static_assert(offsetof(ABP_BlastImpactProcedure_C, B_B_______s_W_K___) == 0x000486, "Member 'ABP_BlastImpactProcedure_C::B_B_______s_W_K___' has a wrong offset!");
static_assert(offsetof(ABP_BlastImpactProcedure_C, _______L___) == 0x000487, "Member 'ABP_BlastImpactProcedure_C::_______L___' has a wrong offset!");
static_assert(offsetof(ABP_BlastImpactProcedure_C, __Y_________) == 0x000488, "Member 'ABP_BlastImpactProcedure_C::__Y_________' has a wrong offset!");

}

