#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BattleBlowAwayCamera

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BattleBlowAwayCamera.BP_BattleBlowAwayCamera_C.ExecuteUbergraph_BP_BattleBlowAwayCamera
// 0x0038 (0x0038 - 0x0000)
struct BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharacterBase_C>  K2Node_DynamicCast_AsBPI_Character_Base;           // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetLocomotionComponent_ActorComponent;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UKoratCharacterLocomotionComponent*     K2Node_DynamicCast_AsKorat_Character_Locomotion_Component; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera) == 0x000008, "Wrong alignment on BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera");
static_assert(sizeof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera) == 0x000038, "Wrong size on BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera, EntryPoint) == 0x000000, "Member 'BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera, K2Node_DynamicCast_AsBPI_Character_Base) == 0x000008, "Member 'BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera::K2Node_DynamicCast_AsBPI_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera, CallFunc_GetLocomotionComponent_ActorComponent) == 0x000020, "Member 'BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera::CallFunc_GetLocomotionComponent_ActorComponent' has a wrong offset!");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera, K2Node_DynamicCast_AsKorat_Character_Locomotion_Component) == 0x000028, "Member 'BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera::K2Node_DynamicCast_AsKorat_Character_Locomotion_Component' has a wrong offset!");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'BP_BattleBlowAwayCamera_C_ExecuteUbergraph_BP_BattleBlowAwayCamera::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_BattleBlowAwayCamera.BP_BattleBlowAwayCamera_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BattleBlowAwayCamera_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BattleBlowAwayCamera_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BattleBlowAwayCamera_C_ReceiveTick");
static_assert(sizeof(BP_BattleBlowAwayCamera_C_ReceiveTick) == 0x000004, "Wrong size on BP_BattleBlowAwayCamera_C_ReceiveTick");
static_assert(offsetof(BP_BattleBlowAwayCamera_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BattleBlowAwayCamera_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

