#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterVoiceComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C
// 0x00E0 (0x02B0 - 0x01D0)
class UBP_CharacterVoiceComponent_C : public USSCharacterVoiceComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FKoratSoundPlayAtb                     PlayAtb;                                           // 0x01D8(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsPlaying;                                         // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CharaName;                                         // 0x0294(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKoratSoundDataAsset*                   SoundData;                                         // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PlayVolume;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckEqualPatternVoiceName(const struct FKoratPatternVoiceDataList& Check, bool* IsEqual);
	void ExecuteUbergraph_BP_CharacterVoiceComponent(int32 EntryPoint);
	void Get_Pattern_Voice(class FName* PlaySoundName);
	void GetSetPlayVoice(class FName* PlaySoundName);
	void Initialize();
	void OnPlayPatternVoiceEvent();
	void OnPlaySetVoiceEvent();
	void OnPlayVoiceByNameEvent();
	void OnPlayVoiceEvent();
	void OnSetSoundData(const struct FKoratCharacterDataList& InCharacterDataList);
	void PlayVoice(class FName PlaySoundName);
	void PlayVoiceByID();
	void PlayVoiceByName();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CharacterVoiceComponent_C">();
	}
	static class UBP_CharacterVoiceComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CharacterVoiceComponent_C>();
	}
};
static_assert(alignof(UBP_CharacterVoiceComponent_C) == 0x000008, "Wrong alignment on UBP_CharacterVoiceComponent_C");
static_assert(sizeof(UBP_CharacterVoiceComponent_C) == 0x0002B0, "Wrong size on UBP_CharacterVoiceComponent_C");
static_assert(offsetof(UBP_CharacterVoiceComponent_C, UberGraphFrame) == 0x0001D0, "Member 'UBP_CharacterVoiceComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CharacterVoiceComponent_C, PlayAtb) == 0x0001D8, "Member 'UBP_CharacterVoiceComponent_C::PlayAtb' has a wrong offset!");
static_assert(offsetof(UBP_CharacterVoiceComponent_C, IsPlaying) == 0x000290, "Member 'UBP_CharacterVoiceComponent_C::IsPlaying' has a wrong offset!");
static_assert(offsetof(UBP_CharacterVoiceComponent_C, CharaName) == 0x000294, "Member 'UBP_CharacterVoiceComponent_C::CharaName' has a wrong offset!");
static_assert(offsetof(UBP_CharacterVoiceComponent_C, SoundData) == 0x0002A0, "Member 'UBP_CharacterVoiceComponent_C::SoundData' has a wrong offset!");
static_assert(offsetof(UBP_CharacterVoiceComponent_C, PlayVolume) == 0x0002A8, "Member 'UBP_CharacterVoiceComponent_C::PlayVolume' has a wrong offset!");

}

