#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterVoiceComponent

#include "Basic.hpp"

#include "SS_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.CheckEqualPatternVoiceName
// 0x000C (0x000C - 0x0000)
struct BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName final
{
public:
	struct FKoratPatternVoiceDataList             Check;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEqual;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName) == 0x000004, "Wrong alignment on BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName");
static_assert(sizeof(BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName) == 0x00000C, "Wrong size on BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName");
static_assert(offsetof(BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName, Check) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName::Check' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName, IsEqual) == 0x000008, "Member 'BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName::IsEqual' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000009, "Member 'BP_CharacterVoiceComponent_C_CheckEqualPatternVoiceName::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.ExecuteUbergraph_BP_CharacterVoiceComponent
// 0x0D68 (0x0D68 - 0x0000)
struct BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratCharacterDataList                K2Node_Event_InCharacterDataList;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FKoratCharacterDataAssetRecord         CallFunc_GetKoratCharacterMasterData_OutCharacterData; // 0x0010(0x08E0)()
	EKoratBranch                                  CallFunc_GetKoratCharacterMasterData_OutResult;    // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x08F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F2[0x6];                                      // 0x08F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x08F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Get_Pattern_Voice_PlaySoundName;          // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           K2Node_DynamicCast_AsSSCharacter;                  // 0x0908(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_911[0x7];                                      // 0x0911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSoundPlayAtb                     K2Node_MakeStruct_KoratSoundPlayAtb;               // 0x0918(0x00B8)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x09D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           K2Node_DynamicCast_AsSSCharacter_1;                // 0x09D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x09E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E1[0x7];                                      // 0x09E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSoundPlayAtb                     K2Node_MakeStruct_KoratSoundPlayAtb_1;             // 0x09E8(0x00B8)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0AA0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0AB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB1[0x7];                                      // 0x0AB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0AB8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           K2Node_DynamicCast_AsSSCharacter_2;                // 0x0AC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0AC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC9[0x3];                                      // 0x0AC9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSetPlayVoice_PlaySoundName;            // 0x0ACC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD4[0x4];                                      // 0x0AD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSoundPlayAtb                     K2Node_MakeStruct_KoratSoundPlayAtb_2;             // 0x0AD8(0x00B8)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0B90(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0BA0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           K2Node_DynamicCast_AsSSCharacter_3;                // 0x0BA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0BB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB1[0x3];                                      // 0x0BB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0BB4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC4[0x4];                                      // 0x0BC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSoundPlayAtb                     K2Node_MakeStruct_KoratSoundPlayAtb_3;             // 0x0BC8(0x00B8)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0C80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           K2Node_DynamicCast_AsSSCharacter_4;                // 0x0C88(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0C90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C91[0x3];                                      // 0x0C91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0C94(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA4[0x4];                                      // 0x0CA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSoundPlayAtb                     K2Node_MakeStruct_KoratSoundPlayAtb_4;             // 0x0CA8(0x00B8)(ContainsInstancedReference)
	float                                         K2Node_SetFieldsInStruct_Volume_ImplicitCast;      // 0x0D60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent) == 0x000008, "Wrong alignment on BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent");
static_assert(sizeof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent) == 0x000D68, "Wrong size on BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, EntryPoint) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_Event_InCharacterDataList) == 0x000008, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_Event_InCharacterDataList' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_GetKoratCharacterMasterData_OutCharacterData) == 0x000010, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_GetKoratCharacterMasterData_OutCharacterData' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_GetKoratCharacterMasterData_OutResult) == 0x0008F0, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_GetKoratCharacterMasterData_OutResult' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_SwitchEnum_CmpSuccess) == 0x0008F1, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_GetOwner_ReturnValue) == 0x0008F8, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_Get_Pattern_Voice_PlaySoundName) == 0x000900, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_Get_Pattern_Voice_PlaySoundName' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_AsSSCharacter) == 0x000908, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_AsSSCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_bSuccess) == 0x000910, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_MakeStruct_KoratSoundPlayAtb) == 0x000918, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_MakeStruct_KoratSoundPlayAtb' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_GetOwner_ReturnValue_1) == 0x0009D0, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_AsSSCharacter_1) == 0x0009D8, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_AsSSCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_bSuccess_1) == 0x0009E0, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_MakeStruct_KoratSoundPlayAtb_1) == 0x0009E8, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_MakeStruct_KoratSoundPlayAtb_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000AA0, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000AB0, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_GetOwner_ReturnValue_2) == 0x000AB8, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_AsSSCharacter_2) == 0x000AC0, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_AsSSCharacter_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_bSuccess_2) == 0x000AC8, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_GetSetPlayVoice_PlaySoundName) == 0x000ACC, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_GetSetPlayVoice_PlaySoundName' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_MakeStruct_KoratSoundPlayAtb_2) == 0x000AD8, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_MakeStruct_KoratSoundPlayAtb_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000B90, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_GetOwner_ReturnValue_3) == 0x000BA0, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_AsSSCharacter_3) == 0x000BA8, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_AsSSCharacter_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_bSuccess_3) == 0x000BB0, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000BB4, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_MakeStruct_KoratSoundPlayAtb_3) == 0x000BC8, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_MakeStruct_KoratSoundPlayAtb_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, CallFunc_GetOwner_ReturnValue_4) == 0x000C80, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_AsSSCharacter_4) == 0x000C88, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_AsSSCharacter_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_DynamicCast_bSuccess_4) == 0x000C90, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000C94, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_MakeStruct_KoratSoundPlayAtb_4) == 0x000CA8, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_MakeStruct_KoratSoundPlayAtb_4' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent, K2Node_SetFieldsInStruct_Volume_ImplicitCast) == 0x000D60, "Member 'BP_CharacterVoiceComponent_C_ExecuteUbergraph_BP_CharacterVoiceComponent::K2Node_SetFieldsInStruct_Volume_ImplicitCast' has a wrong offset!");

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.Get Pattern Voice
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterVoiceComponent_C_Get_Pattern_Voice final
{
public:
	class FName                                   PlaySoundName;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPatternVoice_OutVoiceCueName;          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratBranch                                  CallFunc_GetPatternVoice_OutResult;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_Get_Pattern_Voice) == 0x000004, "Wrong alignment on BP_CharacterVoiceComponent_C_Get_Pattern_Voice");
static_assert(sizeof(BP_CharacterVoiceComponent_C_Get_Pattern_Voice) == 0x000018, "Wrong size on BP_CharacterVoiceComponent_C_Get_Pattern_Voice");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Get_Pattern_Voice, PlaySoundName) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_Get_Pattern_Voice::PlaySoundName' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Get_Pattern_Voice, Index_0) == 0x000008, "Member 'BP_CharacterVoiceComponent_C_Get_Pattern_Voice::Index_0' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Get_Pattern_Voice, CallFunc_GetPatternVoice_OutVoiceCueName) == 0x00000C, "Member 'BP_CharacterVoiceComponent_C_Get_Pattern_Voice::CallFunc_GetPatternVoice_OutVoiceCueName' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Get_Pattern_Voice, CallFunc_GetPatternVoice_OutResult) == 0x000014, "Member 'BP_CharacterVoiceComponent_C_Get_Pattern_Voice::CallFunc_GetPatternVoice_OutResult' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Get_Pattern_Voice, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'BP_CharacterVoiceComponent_C_Get_Pattern_Voice::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.GetSetPlayVoice
// 0x00C8 (0x00C8 - 0x0000)
struct BP_CharacterVoiceComponent_C_GetSetPlayVoice final
{
public:
	class FName                                   PlaySoundName;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndexSetData;                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomValue;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratSetPlayVoiceData                 SetPlayVoiceData;                                  // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         MaxProbability;                                    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratSetPlayVoiceDataRecord           CallFunc_Array_Get_Item;                           // 0x0040(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSetPlayVoiceDataRecord           CallFunc_Array_Get_Item_1;                         // 0x0070(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratSetPlayVoiceData                 CallFunc_Map_Find_Value_1;                         // 0x00B0(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_GetSetPlayVoice) == 0x000008, "Wrong alignment on BP_CharacterVoiceComponent_C_GetSetPlayVoice");
static_assert(sizeof(BP_CharacterVoiceComponent_C_GetSetPlayVoice) == 0x0000C8, "Wrong size on BP_CharacterVoiceComponent_C_GetSetPlayVoice");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, PlaySoundName) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::PlaySoundName' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CurrentIndexSetData) == 0x000008, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CurrentIndexSetData' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, RandomValue) == 0x00000C, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::RandomValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, SetPlayVoiceData) == 0x000010, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::SetPlayVoiceData' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, MaxProbability) == 0x000020, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::MaxProbability' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, Temp_bool_True_if_break_was_hit_Variable) == 0x000024, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000031, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Not_PreBool_ReturnValue_1) == 0x000038, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_BooleanAND_ReturnValue) == 0x000064, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000065, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_RandomInteger_ReturnValue) == 0x000090, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Less_IntInt_ReturnValue_1) == 0x000094, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Add_IntInt_ReturnValue_2) == 0x000098, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_BooleanAND_ReturnValue_1) == 0x00009C, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Map_Find_Value) == 0x0000A0, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Map_Find_ReturnValue) == 0x0000A4, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Map_Find_Value_1) == 0x0000B0, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_GetSetPlayVoice, CallFunc_Map_Find_ReturnValue_1) == 0x0000C0, "Member 'BP_CharacterVoiceComponent_C_GetSetPlayVoice::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.Initialize
// 0x09C8 (0x09C8 - 0x0000)
struct BP_CharacterVoiceComponent_C_Initialize final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           K2Node_DynamicCast_AsSSCharacter;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterDataList                CallFunc_GetCharacterDataList_ReturnValue;         // 0x0014(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterDataAssetRecord         CallFunc_GetKoratCharacterMasterData_OutCharacterData; // 0x0020(0x08E0)()
	EKoratBranch                                  CallFunc_GetKoratCharacterMasterData_OutResult;    // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_901[0x7];                                      // 0x0901(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSoundPlayAtb                     K2Node_MakeStruct_KoratSoundPlayAtb;               // 0x0908(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x09C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_Initialize) == 0x000008, "Wrong alignment on BP_CharacterVoiceComponent_C_Initialize");
static_assert(sizeof(BP_CharacterVoiceComponent_C_Initialize) == 0x0009C8, "Wrong size on BP_CharacterVoiceComponent_C_Initialize");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Initialize, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_Initialize::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Initialize, K2Node_DynamicCast_AsSSCharacter) == 0x000008, "Member 'BP_CharacterVoiceComponent_C_Initialize::K2Node_DynamicCast_AsSSCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_CharacterVoiceComponent_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Initialize, CallFunc_GetCharacterDataList_ReturnValue) == 0x000014, "Member 'BP_CharacterVoiceComponent_C_Initialize::CallFunc_GetCharacterDataList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Initialize, CallFunc_GetKoratCharacterMasterData_OutCharacterData) == 0x000020, "Member 'BP_CharacterVoiceComponent_C_Initialize::CallFunc_GetKoratCharacterMasterData_OutCharacterData' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Initialize, CallFunc_GetKoratCharacterMasterData_OutResult) == 0x000900, "Member 'BP_CharacterVoiceComponent_C_Initialize::CallFunc_GetKoratCharacterMasterData_OutResult' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Initialize, K2Node_MakeStruct_KoratSoundPlayAtb) == 0x000908, "Member 'BP_CharacterVoiceComponent_C_Initialize::K2Node_MakeStruct_KoratSoundPlayAtb' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_Initialize, K2Node_SwitchEnum_CmpSuccess) == 0x0009C0, "Member 'BP_CharacterVoiceComponent_C_Initialize::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.OnSetSoundData
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterVoiceComponent_C_OnSetSoundData final
{
public:
	struct FKoratCharacterDataList                InCharacterDataList;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_OnSetSoundData) == 0x000004, "Wrong alignment on BP_CharacterVoiceComponent_C_OnSetSoundData");
static_assert(sizeof(BP_CharacterVoiceComponent_C_OnSetSoundData) == 0x000008, "Wrong size on BP_CharacterVoiceComponent_C_OnSetSoundData");
static_assert(offsetof(BP_CharacterVoiceComponent_C_OnSetSoundData, InCharacterDataList) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_OnSetSoundData::InCharacterDataList' has a wrong offset!");

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.PlayVoice
// 0x0048 (0x0048 - 0x0000)
struct BP_CharacterVoiceComponent_C_PlayVoice final
{
public:
	class FName                                   PlaySoundName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Checker;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USSSoundManager*                        CallFunc_GetSoundPlayer_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FKoratCharacterCostumeDataList         CallFunc_GetCharacterCostumeDataList_ReturnValue;  // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetVoiceCueSheetName_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPatternVoiceDefaultCueID_ReturnValue;  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratSoundHandle                      CallFunc_PlaySound_ReturnValue;                    // 0x003C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_PlayVoice) == 0x000008, "Wrong alignment on BP_CharacterVoiceComponent_C_PlayVoice");
static_assert(sizeof(BP_CharacterVoiceComponent_C_PlayVoice) == 0x000048, "Wrong size on BP_CharacterVoiceComponent_C_PlayVoice");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoice, PlaySoundName) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_PlayVoice::PlaySoundName' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoice, Checker) == 0x000008, "Member 'BP_CharacterVoiceComponent_C_PlayVoice::Checker' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoice, CallFunc_GetSoundPlayer_ReturnValue) == 0x000010, "Member 'BP_CharacterVoiceComponent_C_PlayVoice::CallFunc_GetSoundPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoice, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BP_CharacterVoiceComponent_C_PlayVoice::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoice, CallFunc_GetCharacterCostumeDataList_ReturnValue) == 0x000028, "Member 'BP_CharacterVoiceComponent_C_PlayVoice::CallFunc_GetCharacterCostumeDataList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoice, CallFunc_GetVoiceCueSheetName_ReturnValue) == 0x000030, "Member 'BP_CharacterVoiceComponent_C_PlayVoice::CallFunc_GetVoiceCueSheetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoice, CallFunc_GetPatternVoiceDefaultCueID_ReturnValue) == 0x000038, "Member 'BP_CharacterVoiceComponent_C_PlayVoice::CallFunc_GetPatternVoiceDefaultCueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoice, CallFunc_PlaySound_ReturnValue) == 0x00003C, "Member 'BP_CharacterVoiceComponent_C_PlayVoice::CallFunc_PlaySound_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoice, CallFunc_NotEqual_NameName_ReturnValue) == 0x000040, "Member 'BP_CharacterVoiceComponent_C_PlayVoice::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.PlayVoiceByID
// 0x0020 (0x0020 - 0x0000)
struct BP_CharacterVoiceComponent_C_PlayVoiceByID final
{
public:
	struct FKoratCharacterCostumeDataList         CallFunc_GetCharacterCostumeDataList_ReturnValue;  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetVoiceCueSheetName_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USSSoundManager*                        CallFunc_GetSoundPlayer_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKoratSoundHandle                      CallFunc_PlaySoundByID_ReturnValue;                // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_PlayVoiceByID) == 0x000008, "Wrong alignment on BP_CharacterVoiceComponent_C_PlayVoiceByID");
static_assert(sizeof(BP_CharacterVoiceComponent_C_PlayVoiceByID) == 0x000020, "Wrong size on BP_CharacterVoiceComponent_C_PlayVoiceByID");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoiceByID, CallFunc_GetCharacterCostumeDataList_ReturnValue) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_PlayVoiceByID::CallFunc_GetCharacterCostumeDataList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoiceByID, CallFunc_GetVoiceCueSheetName_ReturnValue) == 0x000008, "Member 'BP_CharacterVoiceComponent_C_PlayVoiceByID::CallFunc_GetVoiceCueSheetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoiceByID, CallFunc_GetSoundPlayer_ReturnValue) == 0x000010, "Member 'BP_CharacterVoiceComponent_C_PlayVoiceByID::CallFunc_GetSoundPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoiceByID, CallFunc_PlaySoundByID_ReturnValue) == 0x000018, "Member 'BP_CharacterVoiceComponent_C_PlayVoiceByID::CallFunc_PlaySoundByID_ReturnValue' has a wrong offset!");

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.PlayVoiceByName
// 0x0020 (0x0020 - 0x0000)
struct BP_CharacterVoiceComponent_C_PlayVoiceByName final
{
public:
	struct FKoratCharacterCostumeDataList         CallFunc_GetCharacterCostumeDataList_ReturnValue;  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetVoiceCueSheetName_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USSSoundManager*                        CallFunc_GetSoundPlayer_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKoratSoundHandle                      CallFunc_PlaySound_ReturnValue;                    // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_PlayVoiceByName) == 0x000008, "Wrong alignment on BP_CharacterVoiceComponent_C_PlayVoiceByName");
static_assert(sizeof(BP_CharacterVoiceComponent_C_PlayVoiceByName) == 0x000020, "Wrong size on BP_CharacterVoiceComponent_C_PlayVoiceByName");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoiceByName, CallFunc_GetCharacterCostumeDataList_ReturnValue) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_PlayVoiceByName::CallFunc_GetCharacterCostumeDataList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoiceByName, CallFunc_GetVoiceCueSheetName_ReturnValue) == 0x000008, "Member 'BP_CharacterVoiceComponent_C_PlayVoiceByName::CallFunc_GetVoiceCueSheetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoiceByName, CallFunc_GetSoundPlayer_ReturnValue) == 0x000010, "Member 'BP_CharacterVoiceComponent_C_PlayVoiceByName::CallFunc_GetSoundPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterVoiceComponent_C_PlayVoiceByName, CallFunc_PlaySound_ReturnValue) == 0x000018, "Member 'BP_CharacterVoiceComponent_C_PlayVoiceByName::CallFunc_PlaySound_ReturnValue' has a wrong offset!");

// Function BP_CharacterVoiceComponent.BP_CharacterVoiceComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CharacterVoiceComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterVoiceComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CharacterVoiceComponent_C_ReceiveTick");
static_assert(sizeof(BP_CharacterVoiceComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_CharacterVoiceComponent_C_ReceiveTick");
static_assert(offsetof(BP_CharacterVoiceComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CharacterVoiceComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

