#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterLocomotionSubDashUpDown

#include "Basic.hpp"

#include "ECharacterLocomotionEventType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SS_structs.hpp"
#include "EBattleKey_structs.hpp"
#include "Engine_structs.hpp"
#include "EAnimStateMachineEventType_structs.hpp"
#include "FLocomotionRotationParameter_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterLocomotionSubDashUpDown.BP_CharacterLocomotionSubDashUpDown_C.Change Dash Up Down Status
// 0x0028 (0x0028 - 0x0000)
struct BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status final
{
public:
	EKoratDashUpDownState                         InDashUpDownStatus;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratCharacterActionFinishReason             InActionFinishReason;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDashUpDownStateMovementParameter_IsUseParameter; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownStateMovementParameter_MovementParameter; // 0x0008(0x0020)(NoDestructor)
};
static_assert(alignof(BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status) == 0x000008, "Wrong alignment on BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status");
static_assert(sizeof(BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status) == 0x000028, "Wrong size on BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status, InDashUpDownStatus) == 0x000000, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status::InDashUpDownStatus' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status, InActionFinishReason) == 0x000001, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status::InActionFinishReason' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status, CallFunc_GetDashUpDownStateMovementParameter_IsUseParameter) == 0x000002, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status::CallFunc_GetDashUpDownStateMovementParameter_IsUseParameter' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status, CallFunc_GetDashUpDownStateMovementParameter_MovementParameter) == 0x000008, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Change_Dash_Up_Down_Status::CallFunc_GetDashUpDownStateMovementParameter_MovementParameter' has a wrong offset!");

// Function BP_CharacterLocomotionSubDashUpDown.BP_CharacterLocomotionSubDashUpDown_C.Check
// 0x00C8 (0x00C8 - 0x0000)
struct BP_CharacterLocomotionSubDashUpDown_C_Check final
{
public:
	class UBP_CharacterLocomotionComponent_C*     InLocomotionComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CanStart;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterLocomotionComponent_C*     CallFunc_GetLocomotionComponent_LocomotionComponent; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetSSCharacter_SSCharacter;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInAir_IsInAir;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________IN;    // 0x0028(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________LP;    // 0x0048(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________OT;    // 0x0068(0x0020)(NoDestructor)
	double                                        CallFunc_GetDashUpDownTypeParameter_LP______;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_OT___________; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_Landing_______________; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_______IN;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_______LP;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSPCosumable_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterLocomotionComponent_C*     CallFunc_GetLocomotionComponent_LocomotionComponent_1; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDashUpDownInput_IsInputRequest;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_CanStart;                           // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CheckSPCosumable_InSpCost_ImplicitCast;   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterLocomotionSubDashUpDown_C_Check) == 0x000008, "Wrong alignment on BP_CharacterLocomotionSubDashUpDown_C_Check");
static_assert(sizeof(BP_CharacterLocomotionSubDashUpDown_C_Check) == 0x0000C8, "Wrong size on BP_CharacterLocomotionSubDashUpDown_C_Check");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, InLocomotionComponent) == 0x000000, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::InLocomotionComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CanStart) == 0x000008, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CanStart' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetLocomotionComponent_LocomotionComponent) == 0x000010, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetLocomotionComponent_LocomotionComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetSSCharacter_SSCharacter) == 0x000018, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetSSCharacter_SSCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetIsInAir_IsInAir) == 0x000020, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetIsInAir_IsInAir' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetDashUpDownTypeParameter_________IN) == 0x000028, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetDashUpDownTypeParameter_________IN' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetDashUpDownTypeParameter_________LP) == 0x000048, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetDashUpDownTypeParameter_________LP' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetDashUpDownTypeParameter_________OT) == 0x000068, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetDashUpDownTypeParameter_________OT' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetDashUpDownTypeParameter_LP______) == 0x000088, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetDashUpDownTypeParameter_LP______' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetDashUpDownTypeParameter_OT___________) == 0x000090, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetDashUpDownTypeParameter_OT___________' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetDashUpDownTypeParameter_Landing_______________) == 0x000098, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetDashUpDownTypeParameter_Landing_______________' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetDashUpDownTypeParameter_______IN) == 0x0000A0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetDashUpDownTypeParameter_______IN' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetDashUpDownTypeParameter_______LP) == 0x0000A8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetDashUpDownTypeParameter_______LP' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_CheckSPCosumable_ReturnValue) == 0x0000B0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_CheckSPCosumable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_GetLocomotionComponent_LocomotionComponent_1) == 0x0000B8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_GetLocomotionComponent_LocomotionComponent_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_CheckDashUpDownInput_IsInputRequest) == 0x0000C0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_CheckDashUpDownInput_IsInputRequest' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, K2Node_SwitchEnum_CmpSuccess) == 0x0000C1, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_Check_CanStart) == 0x0000C2, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_Check_CanStart' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_Check, CallFunc_CheckSPCosumable_InSpCost_ImplicitCast) == 0x0000C4, "Member 'BP_CharacterLocomotionSubDashUpDown_C_Check::CallFunc_CheckSPCosumable_InSpCost_ImplicitCast' has a wrong offset!");

// Function BP_CharacterLocomotionSubDashUpDown.BP_CharacterLocomotionSubDashUpDown_C.CheckAndStart
// 0x0020 (0x0020 - 0x0000)
struct BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart final
{
public:
	class UBP_CharacterLocomotionComponent_C*     InLocomotionComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          InInSkip;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStarted;                                         // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterLocomotionComponent_C*     CallFunc_GetLocomotionComponent_LocomotionComponent; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_CanStart;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Start_NewParam;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAndStart_IsStarted;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart) == 0x000008, "Wrong alignment on BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart");
static_assert(sizeof(BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart) == 0x000020, "Wrong size on BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart, InLocomotionComponent) == 0x000000, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart::InLocomotionComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart, InInSkip) == 0x000008, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart::InInSkip' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart, IsStarted) == 0x000009, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart::IsStarted' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart, CallFunc_GetLocomotionComponent_LocomotionComponent) == 0x000010, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart::CallFunc_GetLocomotionComponent_LocomotionComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart, CallFunc_Check_CanStart) == 0x000018, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart::CallFunc_Check_CanStart' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart, CallFunc_Start_NewParam) == 0x000019, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart::CallFunc_Start_NewParam' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart, CallFunc_CheckAndStart_IsStarted) == 0x00001A, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckAndStart::CallFunc_CheckAndStart_IsStarted' has a wrong offset!");

// Function BP_CharacterLocomotionSubDashUpDown.BP_CharacterLocomotionSubDashUpDown_C.CheckDashUpDownEnd
// 0x0148 (0x0148 - 0x0000)
struct BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd final
{
public:
	double                                        InDeltaSeconds;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnd;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RemainLength;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________IN;    // 0x0018(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________LP;    // 0x0038(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________OT;    // 0x0058(0x0020)(NoDestructor)
	double                                        CallFunc_GetDashUpDownTypeParameter_LP______;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_OT___________; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_Landing_______________; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_______IN;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_______LP;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterLocomotionComponent_C*     CallFunc_GetLocomotionComponent_LocomotionComponent; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________IN_1;  // 0x00A8(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________LP_1;  // 0x00C8(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________OT_1;  // 0x00E8(0x0020)(NoDestructor)
	double                                        CallFunc_GetDashUpDownTypeParameter_LP_______1;    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_OT____________1; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_Landing________________1; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_______IN_1;    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_______LP_1;    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSCharacter*                           CallFunc_GetSSCharacter_SSCharacter;               // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSPCosumable_ReturnValue;             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd) == 0x000008, "Wrong alignment on BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd");
static_assert(sizeof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd) == 0x000148, "Wrong size on BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, InDeltaSeconds) == 0x000000, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::InDeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, IsEnd) == 0x000008, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::IsEnd' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, RemainLength) == 0x000010, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::RemainLength' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_________IN) == 0x000018, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_________IN' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_________LP) == 0x000038, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_________LP' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_________OT) == 0x000058, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_________OT' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_LP______) == 0x000078, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_LP______' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_OT___________) == 0x000080, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_OT___________' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_Landing_______________) == 0x000088, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_Landing_______________' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_______IN) == 0x000090, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_______IN' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_______LP) == 0x000098, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_______LP' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetLocomotionComponent_LocomotionComponent) == 0x0000A0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetLocomotionComponent_LocomotionComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_________IN_1) == 0x0000A8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_________IN_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_________LP_1) == 0x0000C8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_________LP_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_________OT_1) == 0x0000E8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_________OT_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_LP_______1) == 0x000108, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_LP_______1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_OT____________1) == 0x000110, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_OT____________1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_Landing________________1) == 0x000118, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_Landing________________1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_______IN_1) == 0x000120, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_______IN_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetDashUpDownTypeParameter_______LP_1) == 0x000128, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetDashUpDownTypeParameter_______LP_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000130, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000131, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_GetSSCharacter_SSCharacter) == 0x000138, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_GetSSCharacter_SSCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_CheckSPCosumable_ReturnValue) == 0x000140, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_CheckSPCosumable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_Not_PreBool_ReturnValue) == 0x000141, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd, CallFunc_BooleanAND_ReturnValue) == 0x000142, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEnd::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_CharacterLocomotionSubDashUpDown.BP_CharacterLocomotionSubDashUpDown_C.CheckDashUpDownEndInput
// 0x0007 (0x0007 - 0x0000)
struct BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput final
{
public:
	EBattleKey                                    ReleasedBattleKey;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKeyReleased;                                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratDashUpDownType                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleKey                                    Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleKey                                    Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleKey                                    K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput) == 0x000001, "Wrong alignment on BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput");
static_assert(sizeof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput) == 0x000007, "Wrong size on BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput, ReleasedBattleKey) == 0x000000, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput::ReleasedBattleKey' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput, IsKeyReleased) == 0x000001, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput::IsKeyReleased' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput, Temp_byte_Variable) == 0x000002, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput, Temp_byte_Variable_1) == 0x000003, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput, Temp_byte_Variable_2) == 0x000004, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput, K2Node_Select_Default) == 0x000005, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownEndInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_CharacterLocomotionSubDashUpDown.BP_CharacterLocomotionSubDashUpDown_C.CheckDashUpDownInput
// 0x0028 (0x0028 - 0x0000)
struct BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput final
{
public:
	bool                                          IsInputRequest;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterLocomotionComponent_C*     CallFunc_GetLocomotionComponent_LocomotionComponent; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterLocomotionComponent_C*     CallFunc_GetLocomotionComponent_LocomotionComponent_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput) == 0x000008, "Wrong alignment on BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput");
static_assert(sizeof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput) == 0x000028, "Wrong size on BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput, IsInputRequest) == 0x000000, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput::IsInputRequest' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput, CallFunc_GetLocomotionComponent_LocomotionComponent) == 0x000008, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput::CallFunc_GetLocomotionComponent_LocomotionComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput, CallFunc_GetLocomotionComponent_LocomotionComponent_1) == 0x000018, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput::CallFunc_GetLocomotionComponent_LocomotionComponent_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000020, "Member 'BP_CharacterLocomotionSubDashUpDown_C_CheckDashUpDownInput::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_CharacterLocomotionSubDashUpDown.BP_CharacterLocomotionSubDashUpDown_C.GetDashUpDownStateMovementParameter
// 0x0168 (0x0168 - 0x0000)
struct BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter final
{
public:
	EKoratDashUpDownState                         InDashUpDownStatus;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseParameter;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterDataDragonDashMovementParameter MovementParameter;                                 // 0x0008(0x0020)(Parm, OutParm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterDataDragonDashMovementParameter Temp_struct_Variable;                              // 0x0030(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter Temp_struct_Variable_1;                            // 0x0050(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________IN;    // 0x0070(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________LP;    // 0x0090(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter CallFunc_GetDashUpDownTypeParameter_________OT;    // 0x00B0(0x0020)(NoDestructor)
	double                                        CallFunc_GetDashUpDownTypeParameter_LP______;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_OT___________; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_Landing_______________; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_______IN;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetDashUpDownTypeParameter_______LP;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratCharacterDataDragonDashMovementParameter Temp_struct_Variable_2;                            // 0x00F8(0x0020)(NoDestructor)
	EKoratDashUpDownState                         Temp_byte_Variable;                                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterDataDragonDashMovementParameter K2Node_Select_Default;                             // 0x0120(0x0020)(NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter K2Node_Select_Default_1;                           // 0x0140(0x0020)(NoDestructor)
	bool                                          K2Node_Select_Default_2;                           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter) == 0x000008, "Wrong alignment on BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter");
static_assert(sizeof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter) == 0x000168, "Wrong size on BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, InDashUpDownStatus) == 0x000000, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::InDashUpDownStatus' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, IsUseParameter) == 0x000001, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::IsUseParameter' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, MovementParameter) == 0x000008, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::MovementParameter' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, Temp_bool_Variable) == 0x000028, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000029, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00002A, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, Temp_bool_Variable_1) == 0x00002B, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_BooleanAND_ReturnValue) == 0x00002C, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, Temp_bool_Variable_2) == 0x00002D, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, Temp_struct_Variable) == 0x000030, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, Temp_struct_Variable_1) == 0x000050, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_GetDashUpDownTypeParameter_________IN) == 0x000070, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_GetDashUpDownTypeParameter_________IN' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_GetDashUpDownTypeParameter_________LP) == 0x000090, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_GetDashUpDownTypeParameter_________LP' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_GetDashUpDownTypeParameter_________OT) == 0x0000B0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_GetDashUpDownTypeParameter_________OT' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_GetDashUpDownTypeParameter_LP______) == 0x0000D0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_GetDashUpDownTypeParameter_LP______' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_GetDashUpDownTypeParameter_OT___________) == 0x0000D8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_GetDashUpDownTypeParameter_OT___________' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_GetDashUpDownTypeParameter_Landing_______________) == 0x0000E0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_GetDashUpDownTypeParameter_Landing_______________' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_GetDashUpDownTypeParameter_______IN) == 0x0000E8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_GetDashUpDownTypeParameter_______IN' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, CallFunc_GetDashUpDownTypeParameter_______LP) == 0x0000F0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::CallFunc_GetDashUpDownTypeParameter_______LP' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, Temp_struct_Variable_2) == 0x0000F8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, Temp_byte_Variable) == 0x000118, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, K2Node_Select_Default) == 0x000120, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, K2Node_Select_Default_1) == 0x000140, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter, K2Node_Select_Default_2) == 0x000160, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownStateMovementParameter::K2Node_Select_Default_2' has a wrong offset!");

// Function BP_CharacterLocomotionSubDashUpDown.BP_CharacterLocomotionSubDashUpDown_C.GetDashUpDownTypeParameter
// 0x00E8 (0x00E8 - 0x0000)
struct BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter final
{
public:
	struct FKoratCharacterDataDragonDashMovementParameter ________IN;                                        // 0x0000(0x0020)(Parm, OutParm, NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter ________LP;                                        // 0x0020(0x0020)(Parm, OutParm, NoDestructor)
	struct FKoratCharacterDataDragonDashMovementParameter ________OT;                                        // 0x0040(0x0020)(Parm, OutParm, NoDestructor)
	double                                        LP___LB_;                                          // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OT_____1___B_;                                     // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Landing__0______1___B_;                            // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ______IN;                                          // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ______LP;                                          // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterLocomotionComponent_C*     CallFunc_GetLocomotionComponent_LocomotionComponent; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_LP_______ImplicitCast;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_OT____________ImplicitCast;  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_Landing________________ImplicitCast; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_______IN_ImplicitCast;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_______LP_ImplicitCast;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_LP_______ImplicitCast_1;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_OT____________ImplicitCast_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_Landing________________ImplicitCast_1; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_______IN_ImplicitCast_1;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_______LP_ImplicitCast_1;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter) == 0x000008, "Wrong alignment on BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter");
static_assert(sizeof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter) == 0x0000E8, "Wrong size on BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, ________IN) == 0x000000, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::________IN' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, ________LP) == 0x000020, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::________LP' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, ________OT) == 0x000040, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::________OT' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, LP___LB_) == 0x000060, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::LP___LB_' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, OT_____1___B_) == 0x000068, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::OT_____1___B_' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, Landing__0______1___B_) == 0x000070, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::Landing__0______1___B_' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, ______IN) == 0x000078, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::______IN' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, ______LP) == 0x000080, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::______LP' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, CallFunc_GetLocomotionComponent_LocomotionComponent) == 0x000088, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::CallFunc_GetLocomotionComponent_LocomotionComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_SwitchEnum_CmpSuccess) == 0x000090, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_LP_______ImplicitCast) == 0x000098, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_LP_______ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_OT____________ImplicitCast) == 0x0000A0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_OT____________ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_Landing________________ImplicitCast) == 0x0000A8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_Landing________________ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_______IN_ImplicitCast) == 0x0000B0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_______IN_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_______LP_ImplicitCast) == 0x0000B8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_______LP_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_LP_______ImplicitCast_1) == 0x0000C0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_LP_______ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_OT____________ImplicitCast_1) == 0x0000C8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_OT____________ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_Landing________________ImplicitCast_1) == 0x0000D0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_Landing________________ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_______IN_ImplicitCast_1) == 0x0000D8, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_______IN_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter, K2Node_FunctionResult_______LP_ImplicitCast_1) == 0x0000E0, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetDashUpDownTypeParameter::K2Node_FunctionResult_______LP_ImplicitCast_1' has a wrong offset!");

// Function BP_CharacterLocomotionSubDashUpDown.BP_CharacterLocomotionSubDashUpDown_C.GetLocomotionDetailStatus
// 0x0008 (0x0008 - 0x0000)
struct BP_CharacterLocomotionSubDashUpDown_C_GetLocomotionDetailStatus final
{
public:
	EKoratCharacterLocomotionDetailStatus         LocomotionDetailStatus;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratDashUpDownState                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratCharacterLocomotionDetailStatus         Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratCharacterLocomotionDetailStatus         Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratCharacterLocomotionDetailStatus         Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratCharacterLocomotionDetailStatus         Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratCharacterLocomotionDetailStatus         Temp_byte_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratCharacterLocomotionDetailStatus         K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterLocomotionSubDashUpDown_C_GetLocomotionDetailStatus) == 0x000001, "Wrong alignment on BP_CharacterLocomotionSubDashUpDown_C_GetLocomotionDetailStatus");
static_assert(sizeof(BP_CharacterLocomotionSubDashUpDown_C_GetLocomotionDetailStatus) == 0x000008, "Wrong size on BP_CharacterLocomotionSubDashUpDown_C_GetLocomotionDetailStatus");
static_assert(offsetof(BP_CharacterLocomotionSubDashUpDown_C_GetLocomotionDetailStatus, LocomotionDetailStatus) == 0x000000, "Member 'BP_CharacterLocomotionSubDashUpDown_C_GetLocomotionDetailStatus::LocomotionDetailStatus' has a wrong offset!");
