#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterBattleAssistComponent

#include "Basic.hpp"

#include "SS_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterBattleAssistComponent.BP_CharacterBattleAssistComponent_C.IsPlayablePursuit
// 0x0038 (0x0038 - 0x0000)
struct BP_CharacterBattleAssistComponent_C_IsPlayablePursuit final
{
public:
	EKoratPursuitType                             InPursuitType;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayablePursuit_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterAction_C> CallFunc_IsPlayablePursuit_self_CastInput;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayablePursuit_IsPlayable;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit) == 0x000008, "Wrong alignment on BP_CharacterBattleAssistComponent_C_IsPlayablePursuit");
static_assert(sizeof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit) == 0x000038, "Wrong size on BP_CharacterBattleAssistComponent_C_IsPlayablePursuit");
static_assert(offsetof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit, InPursuitType) == 0x000000, "Member 'BP_CharacterBattleAssistComponent_C_IsPlayablePursuit::InPursuitType' has a wrong offset!");
static_assert(offsetof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit, ReturnValue) == 0x000001, "Member 'BP_CharacterBattleAssistComponent_C_IsPlayablePursuit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit, CallFunc_IsPlayablePursuit_ReturnValue) == 0x000002, "Member 'BP_CharacterBattleAssistComponent_C_IsPlayablePursuit::CallFunc_IsPlayablePursuit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CharacterBattleAssistComponent_C_IsPlayablePursuit::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit, K2Node_DynamicCast_AsBP_Character) == 0x000010, "Member 'BP_CharacterBattleAssistComponent_C_IsPlayablePursuit::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CharacterBattleAssistComponent_C_IsPlayablePursuit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit, CallFunc_IsPlayablePursuit_self_CastInput) == 0x000020, "Member 'BP_CharacterBattleAssistComponent_C_IsPlayablePursuit::CallFunc_IsPlayablePursuit_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_CharacterBattleAssistComponent_C_IsPlayablePursuit, CallFunc_IsPlayablePursuit_IsPlayable) == 0x000030, "Member 'BP_CharacterBattleAssistComponent_C_IsPlayablePursuit::CallFunc_IsPlayablePursuit_IsPlayable' has a wrong offset!");

}

