#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterThrowSafeMoveComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterThrowSafeMoveComponent.BP_CharacterThrowSafeMoveComponent_C.ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent
// 0x00A8 (0x00A8 - 0x0000)
struct BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_TransitionFlowBaseComponent_C*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CallFunc_____________________RetCollComp;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetSSCharacterCpp_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetTargetCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSBattleLevelScriptActor*              CallFunc_GetSSBattleLevelScriptActor_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_____________________OutNewOwnLocation;    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_____________________OutNewTgtLocation;    // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent) == 0x000008, "Wrong alignment on BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent");
static_assert(sizeof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent) == 0x0000A8, "Wrong size on BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, EntryPoint) == 0x000000, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_____________________RetCollComp) == 0x000018, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_____________________RetCollComp' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_GetSSCharacterCpp_ReturnValue) == 0x000020, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_GetSSCharacterCpp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_GetTargetCharacter_ReturnValue) == 0x000028, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_GetTargetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000048, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_GetSSBattleLevelScriptActor_ReturnValue) == 0x000060, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_GetSSBattleLevelScriptActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, K2Node_Event_DeltaSeconds) == 0x00006C, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_____________________OutNewOwnLocation) == 0x000070, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_____________________OutNewOwnLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_____________________OutNewTgtLocation) == 0x000088, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_____________________OutNewTgtLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'BP_CharacterThrowSafeMoveComponent_C_ExecuteUbergraph_BP_CharacterThrowSafeMoveComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_CharacterThrowSafeMoveComponent.BP_CharacterThrowSafeMoveComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CharacterThrowSafeMoveComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterThrowSafeMoveComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CharacterThrowSafeMoveComponent_C_ReceiveTick");
static_assert(sizeof(BP_CharacterThrowSafeMoveComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_CharacterThrowSafeMoveComponent_C_ReceiveTick");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CharacterThrowSafeMoveComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CharacterThrowSafeMoveComponent.BP_CharacterThrowSafeMoveComponent_C.•RH³ê¸çóœQþV_­ãéûÕ
// 0x0198 (0x0198 - 0x0000)
struct BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______ final
{
public:
	class ASSCharacter*                           InSSCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InWorldPos;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               InWorldRot;                                        // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InIsWarp;                                          // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKoratCharacterMovementComponent*       Loc_MovemntComp;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UKoratCharacterMovementComponent*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x00B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______) == 0x000008, "Wrong alignment on BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______");
static_assert(sizeof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______) == 0x000198, "Wrong size on BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, InSSCharacter) == 0x000000, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::InSSCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, InWorldPos) == 0x000008, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::InWorldPos' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, InWorldRot) == 0x000020, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::InWorldRot' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, InIsWarp) == 0x000038, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::InIsWarp' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, Loc_MovemntComp) == 0x000040, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::Loc_MovemntComp' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000068, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000098, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0000B0, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V______::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function BP_CharacterThrowSafeMoveComponent.BP_CharacterThrowSafeMoveComponent_C.•RH³ê¸çóœQþV³é¤ÀüJd
// 0x0020 (0x0020 - 0x0000)
struct BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd final
{
public:
	class UCapsuleComponent*                      InCollComp;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           InSSCharacter;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd) == 0x000008, "Wrong alignment on BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd");
static_assert(sizeof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd) == 0x000020, "Wrong size on BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd, InCollComp) == 0x000000, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd::InCollComp' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd, InSSCharacter) == 0x000008, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd::InSSCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd, K2Node_DynamicCast_AsBP_Character) == 0x000010, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_____Jd::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CharacterThrowSafeMoveComponent.BP_CharacterThrowSafeMoveComponent_C.•RH³ê¸çóœQþV³é¤Àüô°
// 0x0F28 (0x0F28 - 0x0000)
struct BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______ final
{
public:
	class ASSCharacter*                           InSSCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      InCapsuleColl;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InPrevOwnLocation;                                 // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InPrevTgtLocation;                                 // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutNewOwnLocation;                                 // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutNewTgtLocation;                                 // 0x0058(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc_TmpPentMoveSum;                                // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               Loc_constTraceChannel2_World;                      // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Loc_tmpTgtLocation;                                // 0x0090(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc_tmpOnwLocation;                                // 0x00A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc_tmpPullMove;                                   // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Loc_tmpSweepHit;                                   // 0x00D8(0x00E8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               Loc_TgtRotation;                                   // 0x01C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Loc_OwnRotation;                                   // 0x01D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Loc_TgtLocation;                                   // 0x01F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc_OwnLocation;                                   // 0x0208(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           Loc_TgtSSCharacter;                                // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x02B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0398(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x03A8(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array_2;                          // 0x03B8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleSize_OutRadius;           // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleSize_OutHalfHeight;       // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0410(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_CapsuleOverlapComponentsByProfile_OutComponents; // 0x0428(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleOverlapComponentsByProfile_ReturnValue; // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0440(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_PrimitiveComponentComputePenetration_OutMtdDirection; // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PrimitiveComponentComputePenetration_OutMtdDistance; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PrimitiveComponentComputePenetration_ReturnValue; // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSBulletActor*                         K2Node_DynamicCast_AsSSBullet_Actor;               // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSEffectActorBase*                     K2Node_DynamicCast_AsSSEffect_Actor_Base;          // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHitActorIgnore_ReturnValue;             // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntToVector_ReturnValue;             // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_502[0x2];                                      // 0x0502(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0578(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0580(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x05C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x05D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x05F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0610(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_________________OutAfterOwnPos;           // 0x0700(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_________________OutAfterTgtPos;           // 0x0718(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x3];                                      // 0x0731(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleByProfile_OutHit;        // 0x0738(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleByProfile_ReturnValue;   // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0828(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x0858(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0870(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0888(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_1;          // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x08A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleByProfile_OutHit_1;      // 0x08C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleByProfile_ReturnValue_1; // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x09A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x09AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x09AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x09AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x09B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B4[0x4];                                      // 0x09B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x09B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x09D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x09E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0A00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0A18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0A20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0A28(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0A40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0A44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0A48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4C[0x4];                                      // 0x0A4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0A50(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0A68(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0A80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_6;           // 0x0A98(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitLocation;        // 0x0AB0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_LineTraceComponent_HitNormal;          // 0x0AC8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_LineTraceComponent_BoneName;           // 0x0AE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_LineTraceComponent_OutHit;             // 0x0AE8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_LineTraceComponent_ReturnValue;        // 0x0BD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD1[0x7];                                      // 0x0BD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0BD8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_7;           // 0x0BF0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0C08(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0C20(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0D08(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0D20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0D38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D39[0x7];                                      // 0x0D39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0D40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0D58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0D59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5A[0x6];                                      // 0x0D5A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue_2;          // 0x0D60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0D68(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0D80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_8;           // 0x0D98(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x0DB0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0DC8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0DE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult_1; // 0x0DE8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0ED0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0ED8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0EE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0EE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetTargetCharacter_ReturnValue;           // 0x0F00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0F08(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCapsuleSize_InRadius_ImplicitCast;     // 0x0F20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCapsuleSize_InHalfHeight_ImplicitCast; // 0x0F24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______) == 0x000008, "Wrong alignment on BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______");
static_assert(sizeof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______) == 0x000F28, "Wrong size on BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, InSSCharacter) == 0x000000, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::InSSCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, InCapsuleColl) == 0x000008, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::InCapsuleColl' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, InPrevOwnLocation) == 0x000010, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::InPrevOwnLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, InPrevTgtLocation) == 0x000028, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::InPrevTgtLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, OutNewOwnLocation) == 0x000040, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::OutNewOwnLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, OutNewTgtLocation) == 0x000058, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::OutNewTgtLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_TmpPentMoveSum) == 0x000070, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_TmpPentMoveSum' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_constTraceChannel2_World) == 0x000088, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_constTraceChannel2_World' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_tmpTgtLocation) == 0x000090, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_tmpTgtLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_tmpOnwLocation) == 0x0000A8, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_tmpOnwLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_tmpPullMove) == 0x0000C0, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_tmpPullMove' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_tmpSweepHit) == 0x0000D8, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_tmpSweepHit' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_TgtRotation) == 0x0001C0, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_TgtRotation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_OwnRotation) == 0x0001D8, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_OwnRotation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_TgtLocation) == 0x0001F0, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_TgtLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_OwnLocation) == 0x000208, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_OwnLocation' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Loc_TgtSSCharacter) == 0x000220, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Loc_TgtSSCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Temp_int_Array_Index_Variable) == 0x000228, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000230, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_FindLookAtRotation_ReturnValue) == 0x000238, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000250, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_ComposeRotators_ReturnValue) == 0x000268, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_Add_VectorVector_ReturnValue) == 0x000280, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000298, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0002B0, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, K2Node_MakeArray_Array) == 0x000398, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, K2Node_MakeArray_Array_1) == 0x0003A8, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, K2Node_MakeArray_Array_2) == 0x0003B8, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0003C8, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, Temp_int_Variable) == 0x0003E0, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0003E8, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_Add_IntInt_ReturnValue) == 0x000400, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000404, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_GetScaledCapsuleSize_OutRadius) == 0x000408, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_GetScaledCapsuleSize_OutRadius' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_GetScaledCapsuleSize_OutHalfHeight) == 0x00040C, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_GetScaledCapsuleSize_OutHalfHeight' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000410, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_CapsuleOverlapComponentsByProfile_OutComponents) == 0x000428, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_CapsuleOverlapComponentsByProfile_OutComponents' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_CapsuleOverlapComponentsByProfile_ReturnValue) == 0x000438, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_CapsuleOverlapComponentsByProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_Array_Get_Item) == 0x000440, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_Array_Length_ReturnValue) == 0x000448, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_PrimitiveComponentComputePenetration_OutMtdDirection) == 0x000450, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_PrimitiveComponentComputePenetration_OutMtdDirection' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_PrimitiveComponentComputePenetration_OutMtdDistance) == 0x000468, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_PrimitiveComponentComputePenetration_OutMtdDistance' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_PrimitiveComponentComputePenetration_ReturnValue) == 0x00046C, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_PrimitiveComponentComputePenetration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_GetOwner_ReturnValue) == 0x000470, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000478, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, K2Node_DynamicCast_AsSSBullet_Actor) == 0x000490, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::K2Node_DynamicCast_AsSSBullet_Actor' has a wrong offset!");
static_assert(offsetof(BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______, K2Node_DynamicCast_bSuccess) == 0x000498, "Member 'BP_CharacterThrowSafeMoveComponent_C__RH______Q_V_______::K2Node_DynamicCast_bSuccess' has a wrong offset!");
