#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DebugBlowActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SS_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DebugBlowActor.BP_DebugBlowActor_C.ExecuteUbergraph_BP_DebugBlowActor
// 0x0728 (0x0728 - 0x0000)
struct BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterBase_C>  K2Node_DynamicCast_AsBPI_Character_Base;           // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetLocomotionComponent_ActorComponent;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CharacterLocomotion_C> K2Node_DynamicCast_AsBPI_Character_Locomotion;     // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratActionDataList                   CallFunc_GetDamageReactionActionDataList_ReturnValue; // 0x003C(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratHitBackMovementData              CallFunc_SetKoratHitBackMovementData_InHitBackMovement; // 0x0078(0x02E0)()
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character_1;               // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterBase_C>  K2Node_DynamicCast_AsBPI_Character_Base_1;         // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetLocomotionComponent_ActorComponent_1;  // 0x0390(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UKoratCharacterLocomotionComponent*     K2Node_DynamicCast_AsKorat_Character_Locomotion_Component; // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x03E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0530(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0548(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0598(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_3;        // 0x0688(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x06A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_4;        // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_RotatorRotator_ReturnValue;    // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_2;        // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_RotatorRotator_ReturnValue_1;  // 0x06E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E3[0x5];                                      // 0x06E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterBase_C>  K2Node_DynamicCast_AsBPI_Character_Base_2;         // 0x06E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_GetLocomotionComponent_ActorComponent_2;  // 0x0700(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70C[0x4];                                      // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKoratCharacterLocomotionComponent*     K2Node_DynamicCast_AsKorat_Character_Locomotion_Component_1; // 0x0710(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor) == 0x000008, "Wrong alignment on BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor");
static_assert(sizeof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor) == 0x000728, "Wrong size on BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, EntryPoint) == 0x000000, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_AsBPI_Character_Base) == 0x000008, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_AsBPI_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_GetLocomotionComponent_ActorComponent) == 0x000020, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_GetLocomotionComponent_ActorComponent' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_AsBPI_Character_Locomotion) == 0x000028, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_AsBPI_Character_Locomotion' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_GetDamageReactionActionDataList_ReturnValue) == 0x00003C, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_GetDamageReactionActionDataList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000048, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000060, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_SetKoratHitBackMovementData_InHitBackMovement) == 0x000078, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_SetKoratHitBackMovementData_InHitBackMovement' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_AsBP_Character) == 0x000358, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_bSuccess_2) == 0x000360, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_AsBP_Character_1) == 0x000368, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_AsBP_Character_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_bSuccess_3) == 0x000370, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_AsBPI_Character_Base_1) == 0x000378, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_AsBPI_Character_Base_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_bSuccess_4) == 0x000388, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_GetLocomotionComponent_ActorComponent_1) == 0x000390, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_GetLocomotionComponent_ActorComponent_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000398, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_AsKorat_Character_Locomotion_Component) == 0x0003B0, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_AsKorat_Character_Locomotion_Component' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_bSuccess_5) == 0x0003B8, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003C0, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0003D8, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0003E0, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0004C8, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0004C9, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_IsValid_ReturnValue) == 0x0004CA, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_IsValid_ReturnValue_1) == 0x0004CB, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0004D0, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0004E8, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_GetActorRotation_ReturnValue_2) == 0x000500, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_GetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000518, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_Normal_ReturnValue) == 0x000530, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_FindLookAtRotation_ReturnValue) == 0x000548, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000560, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_Add_VectorVector_ReturnValue) == 0x000578, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x000590, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000598, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000680, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_GetActorRotation_ReturnValue_3) == 0x000688, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_GetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_GreaterGreater_VectorRotator_ReturnValue_1) == 0x0006A0, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_GreaterGreater_VectorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_Dot_VectorVector_ReturnValue) == 0x0006B8, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0006C0, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_GetActorRotation_ReturnValue_4) == 0x0006C8, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_GetActorRotation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_EqualEqual_RotatorRotator_ReturnValue) == 0x0006E0, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_EqualEqual_RotatorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_K2_SetActorRotation_ReturnValue_2) == 0x0006E1, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_K2_SetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_EqualEqual_RotatorRotator_ReturnValue_1) == 0x0006E2, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_EqualEqual_RotatorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_AsBPI_Character_Base_2) == 0x0006E8, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_AsBPI_Character_Base_2' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_bSuccess_6) == 0x0006F8, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_GetLocomotionComponent_ActorComponent_2) == 0x000700, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_GetLocomotionComponent_ActorComponent_2' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_Event_DeltaSeconds) == 0x000708, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_AsKorat_Character_Locomotion_Component_1) == 0x000710, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_AsKorat_Character_Locomotion_Component_1' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, K2Node_DynamicCast_bSuccess_7) == 0x000718, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000720, "Member 'BP_DebugBlowActor_C_ExecuteUbergraph_BP_DebugBlowActor::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_DebugBlowActor.BP_DebugBlowActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DebugBlowActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DebugBlowActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DebugBlowActor_C_ReceiveTick");
static_assert(sizeof(BP_DebugBlowActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_DebugBlowActor_C_ReceiveTick");
static_assert(offsetof(BP_DebugBlowActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DebugBlowActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

