#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IW_Impulse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IW_Impulse.BP_IW_Impulse_C
// 0x0050 (0x02E0 - 0x0290)
class ABP_IW_Impulse_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWindSimFieldMotorComponent*            WindSimFieldMotor;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        ImpulseRadius;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        VelocityPower;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          KoratAttached;                                     // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AccSeconds;                                        // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KoratWindSpeed;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UseKoratWindSpeedParam;                            // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_IW_Impulse(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IW_Impulse_C">();
	}
	static class ABP_IW_Impulse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IW_Impulse_C>();
	}
};
static_assert(alignof(ABP_IW_Impulse_C) == 0x000008, "Wrong alignment on ABP_IW_Impulse_C");
static_assert(sizeof(ABP_IW_Impulse_C) == 0x0002E0, "Wrong size on ABP_IW_Impulse_C");
static_assert(offsetof(ABP_IW_Impulse_C, UberGraphFrame) == 0x000290, "Member 'ABP_IW_Impulse_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_IW_Impulse_C, WindSimFieldMotor) == 0x000298, "Member 'ABP_IW_Impulse_C::WindSimFieldMotor' has a wrong offset!");
static_assert(offsetof(ABP_IW_Impulse_C, Scene) == 0x0002A0, "Member 'ABP_IW_Impulse_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_IW_Impulse_C, ImpulseRadius) == 0x0002A8, "Member 'ABP_IW_Impulse_C::ImpulseRadius' has a wrong offset!");
static_assert(offsetof(ABP_IW_Impulse_C, VelocityPower) == 0x0002B0, "Member 'ABP_IW_Impulse_C::VelocityPower' has a wrong offset!");
static_assert(offsetof(ABP_IW_Impulse_C, Duration) == 0x0002B8, "Member 'ABP_IW_Impulse_C::Duration' has a wrong offset!");
static_assert(offsetof(ABP_IW_Impulse_C, KoratAttached) == 0x0002C0, "Member 'ABP_IW_Impulse_C::KoratAttached' has a wrong offset!");
static_assert(offsetof(ABP_IW_Impulse_C, AccSeconds) == 0x0002C8, "Member 'ABP_IW_Impulse_C::AccSeconds' has a wrong offset!");
static_assert(offsetof(ABP_IW_Impulse_C, KoratWindSpeed) == 0x0002D0, "Member 'ABP_IW_Impulse_C::KoratWindSpeed' has a wrong offset!");
static_assert(offsetof(ABP_IW_Impulse_C, UseKoratWindSpeedParam) == 0x0002D8, "Member 'ABP_IW_Impulse_C::UseKoratWindSpeedParam' has a wrong offset!");

}

