#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KoratNiagaraSkeletalMeshActor

#include "Basic.hpp"

#include "EInteractTypeByNiagara_structs.hpp"


namespace SDK::Params
{

// Function BP_KoratNiagaraSkeletalMeshActor.BP_KoratNiagaraSkeletalMeshActor_C.SetNiagaraType
// 0x000C (0x000C - 0x0000)
struct BP_KoratNiagaraSkeletalMeshActor_C_SetNiagaraType final
{
public:
	EInteractTypeByNiagara                        InNiagaraType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KoratNiagaraSkeletalMeshActor_C_SetNiagaraType) == 0x000004, "Wrong alignment on BP_KoratNiagaraSkeletalMeshActor_C_SetNiagaraType");
static_assert(sizeof(BP_KoratNiagaraSkeletalMeshActor_C_SetNiagaraType) == 0x00000C, "Wrong size on BP_KoratNiagaraSkeletalMeshActor_C_SetNiagaraType");
static_assert(offsetof(BP_KoratNiagaraSkeletalMeshActor_C_SetNiagaraType, InNiagaraType) == 0x000000, "Member 'BP_KoratNiagaraSkeletalMeshActor_C_SetNiagaraType::InNiagaraType' has a wrong offset!");
static_assert(offsetof(BP_KoratNiagaraSkeletalMeshActor_C_SetNiagaraType, CallFunc_GetEnumeratorName_ReturnValue) == 0x000004, "Member 'BP_KoratNiagaraSkeletalMeshActor_C_SetNiagaraType::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");

// Function BP_KoratNiagaraSkeletalMeshActor.BP_KoratNiagaraSkeletalMeshActor_C.ExecuteUbergraph_BP_KoratNiagaraSkeletalMeshActor
// 0x0004 (0x0004 - 0x0000)
struct BP_KoratNiagaraSkeletalMeshActor_C_ExecuteUbergraph_BP_KoratNiagaraSkeletalMeshActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KoratNiagaraSkeletalMeshActor_C_ExecuteUbergraph_BP_KoratNiagaraSkeletalMeshActor) == 0x000004, "Wrong alignment on BP_KoratNiagaraSkeletalMeshActor_C_ExecuteUbergraph_BP_KoratNiagaraSkeletalMeshActor");
static_assert(sizeof(BP_KoratNiagaraSkeletalMeshActor_C_ExecuteUbergraph_BP_KoratNiagaraSkeletalMeshActor) == 0x000004, "Wrong size on BP_KoratNiagaraSkeletalMeshActor_C_ExecuteUbergraph_BP_KoratNiagaraSkeletalMeshActor");
static_assert(offsetof(BP_KoratNiagaraSkeletalMeshActor_C_ExecuteUbergraph_BP_KoratNiagaraSkeletalMeshActor, EntryPoint) == 0x000000, "Member 'BP_KoratNiagaraSkeletalMeshActor_C_ExecuteUbergraph_BP_KoratNiagaraSkeletalMeshActor::EntryPoint' has a wrong offset!");

}

