#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KoratEffectMultipleColorComponent

#include "Basic.hpp"

#include "EKoratCharacterEffectColorReplaceType_structs.hpp"
#include "SS_structs.hpp"


namespace SDK::Params
{

// Function BP_KoratEffectMultipleColorComponent.BP_KoratEffectMultipleColorComponent_C.DebugOutput
// 0x0014 (0x0014 - 0x0000)
struct BP_KoratEffectMultipleColorComponent_C_DebugOutput final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KoratEffectMultipleColorComponent_C_DebugOutput) == 0x000004, "Wrong alignment on BP_KoratEffectMultipleColorComponent_C_DebugOutput");
static_assert(sizeof(BP_KoratEffectMultipleColorComponent_C_DebugOutput) == 0x000014, "Wrong size on BP_KoratEffectMultipleColorComponent_C_DebugOutput");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_DebugOutput, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_KoratEffectMultipleColorComponent_C_DebugOutput::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_DebugOutput, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_KoratEffectMultipleColorComponent_C_DebugOutput::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_DebugOutput, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_KoratEffectMultipleColorComponent_C_DebugOutput::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_DebugOutput, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_KoratEffectMultipleColorComponent_C_DebugOutput::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_DebugOutput, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'BP_KoratEffectMultipleColorComponent_C_DebugOutput::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_KoratEffectMultipleColorComponent.BP_KoratEffectMultipleColorComponent_C.SetReplaceSettingImp
// 0x000C (0x000C - 0x0000)
struct BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp final
{
public:
	EKoratCharacterEffectColorReplaceType         NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratCharacterEffectColorReplaceType         OutParam;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InIndex;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratCharacterEffectColorReplaceType         CallFunc_Array_Get_Item;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp) == 0x000004, "Wrong alignment on BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp");
static_assert(sizeof(BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp) == 0x00000C, "Wrong size on BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp, NewParam) == 0x000000, "Member 'BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp::NewParam' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp, OutParam) == 0x000001, "Member 'BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp::OutParam' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp, InIndex) == 0x000004, "Member 'BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp::InIndex' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp, Result) == 0x000008, "Member 'BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp::Result' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp, CallFunc_Array_Get_Item) == 0x000009, "Member 'BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'BP_KoratEffectMultipleColorComponent_C_SetReplaceSettingImp::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_KoratEffectMultipleColorComponent.BP_KoratEffectMultipleColorComponent_C.Set¿¤×nÛ-š_0
// 0x0040 (0x0040 - 0x0000)
struct BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0 final
{
public:
	EKoratCharacterEffectColorReplaceType         NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetReplaceSettingImp_Result;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterEffectColorReplaceTypeDataList K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList; // 0x0028(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0) == 0x000008, "Wrong alignment on BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0");
static_assert(sizeof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0) == 0x000040, "Wrong size on BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0, NewParam) == 0x000000, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0::NewParam' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0, Index_0) == 0x000004, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0::Index_0' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0, CallFunc_SetReplaceSettingImp_Result) == 0x000020, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0::CallFunc_SetReplaceSettingImp_Result' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0, K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList) == 0x000028, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__0::K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList' has a wrong offset!");

// Function BP_KoratEffectMultipleColorComponent.BP_KoratEffectMultipleColorComponent_C.Set¿¤×nÛ-š_1
// 0x0040 (0x0040 - 0x0000)
struct BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1 final
{
public:
	EKoratCharacterEffectColorReplaceType         NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetReplaceSettingImp_Result;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterEffectColorReplaceTypeDataList K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList; // 0x0028(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1) == 0x000008, "Wrong alignment on BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1");
static_assert(sizeof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1) == 0x000040, "Wrong size on BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1, NewParam) == 0x000000, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1::NewParam' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1, Index_0) == 0x000004, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1::Index_0' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1, CallFunc_SetReplaceSettingImp_Result) == 0x000020, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1::CallFunc_SetReplaceSettingImp_Result' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1, K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList) == 0x000028, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__1::K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList' has a wrong offset!");

// Function BP_KoratEffectMultipleColorComponent.BP_KoratEffectMultipleColorComponent_C.Set¿¤×nÛ-š_2
// 0x0040 (0x0040 - 0x0000)
struct BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2 final
{
public:
	EKoratCharacterEffectColorReplaceType         NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetReplaceSettingImp_Result;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterEffectColorReplaceTypeDataList K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList; // 0x0028(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2) == 0x000008, "Wrong alignment on BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2");
static_assert(sizeof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2) == 0x000040, "Wrong size on BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2, NewParam) == 0x000000, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2::NewParam' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2, Index_0) == 0x000004, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2::Index_0' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2, CallFunc_SetReplaceSettingImp_Result) == 0x000020, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2::CallFunc_SetReplaceSettingImp_Result' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2, K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList) == 0x000028, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__2::K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList' has a wrong offset!");

// Function BP_KoratEffectMultipleColorComponent.BP_KoratEffectMultipleColorComponent_C.Set¿¤×nÛ-š_3
// 0x0040 (0x0040 - 0x0000)
struct BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3 final
{
public:
	EKoratCharacterEffectColorReplaceType         NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetReplaceSettingImp_Result;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratCharacterEffectColorReplaceTypeDataList K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList; // 0x0028(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3) == 0x000008, "Wrong alignment on BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3");
static_assert(sizeof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3) == 0x000040, "Wrong size on BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3, NewParam) == 0x000000, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3::NewParam' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3, Index_0) == 0x000004, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3::Index_0' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3, CallFunc_SetReplaceSettingImp_Result) == 0x000020, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3::CallFunc_SetReplaceSettingImp_Result' has a wrong offset!");
static_assert(offsetof(BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3, K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList) == 0x000028, "Member 'BP_KoratEffectMultipleColorComponent_C_Set___n_Minus__3::K2Node_MakeStruct_KoratCharacterEffectColorReplaceTypeDataList' has a wrong offset!");

}

