#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KoratFreeTimelineActor_Collider_OnSeq

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_structs.hpp"
#include "BP_KoratFreeTimelineActor_Collider_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_KoratFreeTimelineActor_Collider_OnSeq.BP_KoratFreeTimelineActor_Collider_OnSeq_C
// 0x0070 (0x0FD0 - 0x0F60)
class ABP_KoratFreeTimelineActor_Collider_OnSeq_C : public ABP_KoratFreeTimelineActor_Collider_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_KoratFreeTimelineActor_Collider_OnSeq_C; // 0x0F60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UKoratInteractiveAssetGetComp*          KoratInteractiveAssetGetComp;                      // 0x0F68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FKoratSequenceLabelParametersArray> SequncerLabelInfo_0;                               // 0x0F70(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UShapeComponent*                        ShapeComponentSetting;                             // 0x0FC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugDrawCollision;                                // 0x0FC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CanPlay();
	void Debug_Draw_Collition(bool DrawCollition);
	void ExecuteUbergraph_BP_KoratFreeTimelineActor_Collider_OnSeq(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetCollider(class UShapeComponent* InShapeComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_KoratFreeTimelineActor_Collider_OnSeq_C">();
	}
	static class ABP_KoratFreeTimelineActor_Collider_OnSeq_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_KoratFreeTimelineActor_Collider_OnSeq_C>();
	}
};
static_assert(alignof(ABP_KoratFreeTimelineActor_Collider_OnSeq_C) == 0x000010, "Wrong alignment on ABP_KoratFreeTimelineActor_Collider_OnSeq_C");
static_assert(sizeof(ABP_KoratFreeTimelineActor_Collider_OnSeq_C) == 0x000FD0, "Wrong size on ABP_KoratFreeTimelineActor_Collider_OnSeq_C");
static_assert(offsetof(ABP_KoratFreeTimelineActor_Collider_OnSeq_C, UberGraphFrame_BP_KoratFreeTimelineActor_Collider_OnSeq_C) == 0x000F60, "Member 'ABP_KoratFreeTimelineActor_Collider_OnSeq_C::UberGraphFrame_BP_KoratFreeTimelineActor_Collider_OnSeq_C' has a wrong offset!");
static_assert(offsetof(ABP_KoratFreeTimelineActor_Collider_OnSeq_C, KoratInteractiveAssetGetComp) == 0x000F68, "Member 'ABP_KoratFreeTimelineActor_Collider_OnSeq_C::KoratInteractiveAssetGetComp' has a wrong offset!");
static_assert(offsetof(ABP_KoratFreeTimelineActor_Collider_OnSeq_C, SequncerLabelInfo_0) == 0x000F70, "Member 'ABP_KoratFreeTimelineActor_Collider_OnSeq_C::SequncerLabelInfo_0' has a wrong offset!");
static_assert(offsetof(ABP_KoratFreeTimelineActor_Collider_OnSeq_C, ShapeComponentSetting) == 0x000FC0, "Member 'ABP_KoratFreeTimelineActor_Collider_OnSeq_C::ShapeComponentSetting' has a wrong offset!");
static_assert(offsetof(ABP_KoratFreeTimelineActor_Collider_OnSeq_C, DebugDrawCollision) == 0x000FC8, "Member 'ABP_KoratFreeTimelineActor_Collider_OnSeq_C::DebugDrawCollision' has a wrong offset!");

}

