#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PowerImpactProcedure

#include "Basic.hpp"

#include "SS_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.ExecuteUbergraph_BP_PowerImpactProcedure
// 0x02A0 (0x02A0 - 0x0000)
struct BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattleImpactLevelSequenceParams       K2Node_MakeStruct_BattleImpactLevelSequenceParams; // 0x0008(0x0020)(NoDestructor)
	struct FBattleImpactLevelSequenceParams       K2Node_MakeStruct_BattleImpactLevelSequenceParams_1; // 0x0028(0x0020)(NoDestructor)
	struct FBattleImpactLevelSequenceParams       K2Node_MakeStruct_BattleImpactLevelSequenceParams_2; // 0x0048(0x0020)(NoDestructor)
	TDelegate<void(float DeltaTime)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaTime)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBattleImpactLevelSequenceParams       K2Node_MakeStruct_BattleImpactLevelSequenceParams_3; // 0x00A0(0x0020)(NoDestructor)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaTime_2;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_1;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaTime)>              K2Node_CreateDelegate_OutputDelegate_3;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            K2Node_Event_InPhase;                              // 0x00E8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSBattleGameStateBase*                 K2Node_DynamicCast_AsSSBattle_Game_State_Base;     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsImpactGvsG_ReturnValue;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USSBattleImpactCharacterProxy*          CallFunc_GetWinner_ReturnValue;                    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_2;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USSBattleImpactCharacterProxy*          CallFunc_GetWinner_ReturnValue_1;                  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InNextRound;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESSPowerImpactLevelSequenceType               K2Node_Event_InSequenceType;                       // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TransitAction_ReturnValue_1;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ULevelSequence>          CallFunc_GetLevelSequenceByType_OutLevelSequence;  // 0x0128(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_CreateLevelSequence_ReturnValue;          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSLevelSequenceActor*                  CallFunc_LoopLevelSequence_OutSequenceActor;       // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USSBattleImpactCharacterProxy*          CallFunc_GetLoser_ReturnValue;                     // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_2;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratBranch                                  CallFunc_IsPowerImpactSequencePlayMode_OutResult;  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ULevelSequence>          CallFunc_GetLevelSequenceByType_OutLevelSequence_1; // 0x0178(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CreateLevelSequence_ReturnValue_1;        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          CallFunc_GetLevelSequenceByType_OutLevelSequence_2; // 0x01B0(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_3;           // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CreateLevelSequence_ReturnValue_2;        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          CallFunc_GetLevelSequenceByType_OutLevelSequence_3; // 0x01E8(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_CreateLevelSequence_ReturnValue_3;        // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_3;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_4;              // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue;                       // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_1;                     // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_2;                     // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_3;                     // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USSBattleImpactCharacterProxy*          CallFunc_GetWinner_ReturnValue_2;                  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_IsMontagePlayingBySelf_OutSection;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMontagePlayingBySelf_ReturnValue;       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TransitAction_ReturnValue_5;              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_6;              // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_7;              // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_8;              // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_9;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaTime_1;                    // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_4;           // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaTime;                      // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_4;                     // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_5;                     // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetTimer_InTime_ImplicitCast;             // 0x0290(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RequestCharacterMove_TravelTime_ImplicitCast; // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MoveTime_ImplicitCast;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure) == 0x000008, "Wrong alignment on BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure");
static_assert(sizeof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure) == 0x0002A0, "Wrong size on BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, EntryPoint) == 0x000000, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_MakeStruct_BattleImpactLevelSequenceParams) == 0x000008, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_MakeStruct_BattleImpactLevelSequenceParams' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_MakeStruct_BattleImpactLevelSequenceParams_1) == 0x000028, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_MakeStruct_BattleImpactLevelSequenceParams_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_MakeStruct_BattleImpactLevelSequenceParams_2) == 0x000048, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_MakeStruct_BattleImpactLevelSequenceParams_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_MakeStruct_BattleImpactLevelSequenceParams_3) == 0x0000A0, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_MakeStruct_BattleImpactLevelSequenceParams_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_SetNextPhaseTime_ReturnValue) == 0x0000C0, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_SetNextPhaseTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_CustomEvent_DeltaTime_2) == 0x0000C4, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_CustomEvent_DeltaTime_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_SetNextPhaseTime_ReturnValue_1) == 0x0000C8, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_SetNextPhaseTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000CC, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetGameState_ReturnValue) == 0x0000E0, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_Event_InPhase) == 0x0000E8, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_Event_InPhase' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_DynamicCast_AsSSBattle_Game_State_Base) == 0x0000F0, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_DynamicCast_AsSSBattle_Game_State_Base' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_IsImpactGvsG_ReturnValue) == 0x0000F9, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_IsImpactGvsG_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetWinner_ReturnValue) == 0x000100, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetWinner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue) == 0x000108, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_SetNextPhaseTime_ReturnValue_2) == 0x00010C, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_SetNextPhaseTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetWinner_ReturnValue_1) == 0x000110, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetWinner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_Event_InNextRound) == 0x000118, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_Event_InNextRound' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_Event_InSequenceType) == 0x00011C, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_Event_InSequenceType' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue_1) == 0x000120, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetLevelSequenceByType_OutLevelSequence) == 0x000128, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetLevelSequenceByType_OutLevelSequence' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_CreateLevelSequence_ReturnValue) == 0x000158, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_CreateLevelSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_LoopLevelSequence_OutSequenceActor) == 0x000160, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_LoopLevelSequence_OutSequenceActor' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetLoser_ReturnValue) == 0x000168, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetLoser_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue_2) == 0x000170, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_IsPowerImpactSequencePlayMode_OutResult) == 0x000174, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_IsPowerImpactSequencePlayMode_OutResult' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetLevelSequenceByType_OutLevelSequence_1) == 0x000178, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetLevelSequenceByType_OutLevelSequence_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_SwitchEnum_CmpSuccess) == 0x0001A8, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_CreateLevelSequence_ReturnValue_1) == 0x0001AC, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_CreateLevelSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetLevelSequenceByType_OutLevelSequence_2) == 0x0001B0, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetLevelSequenceByType_OutLevelSequence_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_SetNextPhaseTime_ReturnValue_3) == 0x0001E0, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_SetNextPhaseTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_CreateLevelSequence_ReturnValue_2) == 0x0001E4, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_CreateLevelSequence_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetLevelSequenceByType_OutLevelSequence_3) == 0x0001E8, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetLevelSequenceByType_OutLevelSequence_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_CreateLevelSequence_ReturnValue_3) == 0x000218, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_CreateLevelSequence_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue_3) == 0x00021C, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue_4) == 0x000220, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetPtr_ReturnValue) == 0x000228, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetPtr_ReturnValue_1) == 0x000230, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetPtr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetPtr_ReturnValue_2) == 0x000238, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetPtr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetPtr_ReturnValue_3) == 0x000240, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetPtr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetWinner_ReturnValue_2) == 0x000248, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetWinner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_IsMontagePlayingBySelf_OutSection) == 0x000250, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_IsMontagePlayingBySelf_OutSection' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_IsMontagePlayingBySelf_ReturnValue) == 0x000258, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_IsMontagePlayingBySelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue_5) == 0x00025C, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue_6) == 0x000260, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue_7) == 0x000264, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue_8) == 0x000268, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_TransitAction_ReturnValue_9) == 0x00026C, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_TransitAction_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_CustomEvent_DeltaTime_1) == 0x000270, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_CustomEvent_DeltaTime_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_Event_DeltaSeconds) == 0x000274, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_SetNextPhaseTime_ReturnValue_4) == 0x000278, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_SetNextPhaseTime_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_CustomEvent_DeltaTime) == 0x00027C, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_CustomEvent_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetPtr_ReturnValue_4) == 0x000280, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetPtr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_GetPtr_ReturnValue_5) == 0x000288, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_GetPtr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_SetTimer_InTime_ImplicitCast) == 0x000290, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_SetTimer_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, CallFunc_RequestCharacterMove_TravelTime_ImplicitCast) == 0x000294, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::CallFunc_RequestCharacterMove_TravelTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure, K2Node_VariableSet_MoveTime_ImplicitCast) == 0x000298, "Member 'BP_PowerImpactProcedure_C_ExecuteUbergraph_BP_PowerImpactProcedure::K2Node_VariableSet_MoveTime_ImplicitCast' has a wrong offset!");

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.OnChangedPhase
// 0x0001 (0x0001 - 0x0000)
struct BP_PowerImpactProcedure_C_OnChangedPhase final
{
public:
	EBattleImpactPhase                            InPhase;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_OnChangedPhase) == 0x000001, "Wrong alignment on BP_PowerImpactProcedure_C_OnChangedPhase");
static_assert(sizeof(BP_PowerImpactProcedure_C_OnChangedPhase) == 0x000001, "Wrong size on BP_PowerImpactProcedure_C_OnChangedPhase");
static_assert(offsetof(BP_PowerImpactProcedure_C_OnChangedPhase, InPhase) == 0x000000, "Member 'BP_PowerImpactProcedure_C_OnChangedPhase::InPhase' has a wrong offset!");

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.OnChangePhase
// 0x0002 (0x0002 - 0x0000)
struct BP_PowerImpactProcedure_C_OnChangePhase final
{
public:
	EBattleImpactPhase                            NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_OnChangePhase) == 0x000001, "Wrong alignment on BP_PowerImpactProcedure_C_OnChangePhase");
static_assert(sizeof(BP_PowerImpactProcedure_C_OnChangePhase) == 0x000002, "Wrong size on BP_PowerImpactProcedure_C_OnChangePhase");
static_assert(offsetof(BP_PowerImpactProcedure_C_OnChangePhase, NewParam) == 0x000000, "Member 'BP_PowerImpactProcedure_C_OnChangePhase::NewParam' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_OnChangePhase, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_PowerImpactProcedure_C_OnChangePhase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.OnChangePowerImpactRound
// 0x0008 (0x0008 - 0x0000)
struct BP_PowerImpactProcedure_C_OnChangePowerImpactRound final
{
public:
	int32                                         InNextRound;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESSPowerImpactLevelSequenceType               InSequenceType;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_OnChangePowerImpactRound) == 0x000004, "Wrong alignment on BP_PowerImpactProcedure_C_OnChangePowerImpactRound");
static_assert(sizeof(BP_PowerImpactProcedure_C_OnChangePowerImpactRound) == 0x000008, "Wrong size on BP_PowerImpactProcedure_C_OnChangePowerImpactRound");
static_assert(offsetof(BP_PowerImpactProcedure_C_OnChangePowerImpactRound, InNextRound) == 0x000000, "Member 'BP_PowerImpactProcedure_C_OnChangePowerImpactRound::InNextRound' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_OnChangePowerImpactRound, InSequenceType) == 0x000004, "Member 'BP_PowerImpactProcedure_C_OnChangePowerImpactRound::InSequenceType' has a wrong offset!");

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.OnTickConclusion
// 0x0004 (0x0004 - 0x0000)
struct BP_PowerImpactProcedure_C_OnTickConclusion final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_OnTickConclusion) == 0x000004, "Wrong alignment on BP_PowerImpactProcedure_C_OnTickConclusion");
static_assert(sizeof(BP_PowerImpactProcedure_C_OnTickConclusion) == 0x000004, "Wrong size on BP_PowerImpactProcedure_C_OnTickConclusion");
static_assert(offsetof(BP_PowerImpactProcedure_C_OnTickConclusion, DeltaTime) == 0x000000, "Member 'BP_PowerImpactProcedure_C_OnTickConclusion::DeltaTime' has a wrong offset!");

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.OnTickGame
// 0x0004 (0x0004 - 0x0000)
struct BP_PowerImpactProcedure_C_OnTickGame final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_OnTickGame) == 0x000004, "Wrong alignment on BP_PowerImpactProcedure_C_OnTickGame");
static_assert(sizeof(BP_PowerImpactProcedure_C_OnTickGame) == 0x000004, "Wrong size on BP_PowerImpactProcedure_C_OnTickGame");
static_assert(offsetof(BP_PowerImpactProcedure_C_OnTickGame, DeltaTime) == 0x000000, "Member 'BP_PowerImpactProcedure_C_OnTickGame::DeltaTime' has a wrong offset!");

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.OnTickIntroduction
// 0x0004 (0x0004 - 0x0000)
struct BP_PowerImpactProcedure_C_OnTickIntroduction final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_OnTickIntroduction) == 0x000004, "Wrong alignment on BP_PowerImpactProcedure_C_OnTickIntroduction");
static_assert(sizeof(BP_PowerImpactProcedure_C_OnTickIntroduction) == 0x000004, "Wrong size on BP_PowerImpactProcedure_C_OnTickIntroduction");
static_assert(offsetof(BP_PowerImpactProcedure_C_OnTickIntroduction, DeltaTime) == 0x000000, "Member 'BP_PowerImpactProcedure_C_OnTickIntroduction::DeltaTime' has a wrong offset!");

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PowerImpactProcedure_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PowerImpactProcedure_C_ReceiveTick");
static_assert(sizeof(BP_PowerImpactProcedure_C_ReceiveTick) == 0x000004, "Wrong size on BP_PowerImpactProcedure_C_ReceiveTick");
static_assert(offsetof(BP_PowerImpactProcedure_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PowerImpactProcedure_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.DebugDraw
// 0x0038 (0x0038 - 0x0000)
struct BP_PowerImpactProcedure_C_DebugDraw final
{
public:
	float                                         InDeltaT;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_DebugDraw) == 0x000008, "Wrong alignment on BP_PowerImpactProcedure_C_DebugDraw");
static_assert(sizeof(BP_PowerImpactProcedure_C_DebugDraw) == 0x000038, "Wrong size on BP_PowerImpactProcedure_C_DebugDraw");
static_assert(offsetof(BP_PowerImpactProcedure_C_DebugDraw, InDeltaT) == 0x000000, "Member 'BP_PowerImpactProcedure_C_DebugDraw::InDeltaT' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_DebugDraw, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_PowerImpactProcedure_C_DebugDraw::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_DebugDraw, CallFunc_MakeVector_ReturnValue_1) == 0x000020, "Member 'BP_PowerImpactProcedure_C_DebugDraw::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function BP_PowerImpactProcedure.BP_PowerImpactProcedure_C.GetNextPhase
// 0x0003 (0x0003 - 0x0000)
struct BP_PowerImpactProcedure_C_GetNextPhase final
{
public:
	EBattleImpactPhase                            InCurrentPhase;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactProcedure_C_GetNextPhase) == 0x000001, "Wrong alignment on BP_PowerImpactProcedure_C_GetNextPhase");
static_assert(sizeof(BP_PowerImpactProcedure_C_GetNextPhase) == 0x000003, "Wrong size on BP_PowerImpactProcedure_C_GetNextPhase");
static_assert(offsetof(BP_PowerImpactProcedure_C_GetNextPhase, InCurrentPhase) == 0x000000, "Member 'BP_PowerImpactProcedure_C_GetNextPhase::InCurrentPhase' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_GetNextPhase, ReturnValue) == 0x000001, "Member 'BP_PowerImpactProcedure_C_GetNextPhase::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactProcedure_C_GetNextPhase, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BP_PowerImpactProcedure_C_GetNextPhase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

