#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PowerImpactGToGProcedure

#include "Basic.hpp"

#include "SS_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.ExecuteUbergraph_BP_PowerImpactGToGProcedure
// 0x02F0 (0x02F0 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattleImpactLevelSequenceParams       K2Node_MakeStruct_BattleImpactLevelSequenceParams; // 0x0008(0x0020)(NoDestructor)
	struct FBattleImpactLevelSequenceParams       K2Node_MakeStruct_BattleImpactLevelSequenceParams_1; // 0x0028(0x0020)(NoDestructor)
	struct FBattleImpactLevelSequenceParams       K2Node_MakeStruct_BattleImpactLevelSequenceParams_2; // 0x0048(0x0020)(NoDestructor)
	struct FBattleImpactLevelSequenceParams       K2Node_MakeStruct_BattleImpactLevelSequenceParams_3; // 0x0068(0x0020)(NoDestructor)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaTime_2;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_1;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaTime)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_2;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaTime_1;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaTime)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSBattleGameStateBase*                 K2Node_DynamicCast_AsSSBattle_Game_State_Base;     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMyPlayerSide_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaTime;                      // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            K2Node_Event_InPhase;                              // 0x00F4(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USSBattleImpactCharacterProxy*          CallFunc_GetWinner_ReturnValue;                    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue;                       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerSide_ReturnValue;                // 0x010C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USSBattleImpactCharacterProxy*          CallFunc_GetWinner_ReturnValue_1;                  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USSBattleImpactCharacterProxy*          CallFunc_GetLoser_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_1;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_2;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaTime)>              K2Node_CreateDelegate_OutputDelegate_3;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USSBattleImpactCharacterProxy*          CallFunc_GetLoser_ReturnValue_1;                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USSBattleImpactCharacterProxy*          CallFunc_GetWinner_ReturnValue_2;                  // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_3;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_4;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_3;           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InNextRound;                          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESSPowerImpactLevelSequenceType               K2Node_Event_InSequenceType;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USSBattleImpactCharacterProxy*          CallFunc_GetWinner_ReturnValue_3;                  // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          CallFunc_GetLevelSequenceByType_OutLevelSequence;  // 0x0178(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class FName                                   CallFunc_IsMontagePlayingBySelf_OutSection;        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMontagePlayingBySelf_ReturnValue;       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSLevelSequenceActor*                  CallFunc_LoopLevelSequence_OutSequenceActor;       // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateLevelSequence_ReturnValue;          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_1;                     // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_5;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerSide_ReturnValue_1;              // 0x01D4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratBranch                                  CallFunc_IsPowerImpactSequencePlayMode_OutResult;  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB[0x5];                                      // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ULevelSequence>          CallFunc_GetLevelSequenceByType_OutLevelSequence_1; // 0x01E0(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          CallFunc_GetLevelSequenceByType_OutLevelSequence_2; // 0x0210(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_CreateLevelSequence_ReturnValue_1;        // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateLevelSequence_ReturnValue_2;        // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_4;           // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ULevelSequence>          CallFunc_GetLevelSequenceByType_OutLevelSequence_3; // 0x0250(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_CreateLevelSequence_ReturnValue_3;        // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_6;              // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_7;              // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_2;                     // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_3;                     // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_8;              // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_9;              // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_4;                     // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_5;                     // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_10;             // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_11;             // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_6;                     // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_7;                     // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_8;                     // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_9;                     // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RequestCharacterMove_TravelTime_ImplicitCast; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetTimer_InTime_ImplicitCast;             // 0x02E4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MoveTime_ImplicitCast;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure) == 0x000008, "Wrong alignment on BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure) == 0x0002F0, "Wrong size on BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, EntryPoint) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_MakeStruct_BattleImpactLevelSequenceParams) == 0x000008, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_MakeStruct_BattleImpactLevelSequenceParams' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_MakeStruct_BattleImpactLevelSequenceParams_1) == 0x000028, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_MakeStruct_BattleImpactLevelSequenceParams_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_MakeStruct_BattleImpactLevelSequenceParams_2) == 0x000048, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_MakeStruct_BattleImpactLevelSequenceParams_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_MakeStruct_BattleImpactLevelSequenceParams_3) == 0x000068, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_MakeStruct_BattleImpactLevelSequenceParams_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_SetNextPhaseTime_ReturnValue) == 0x000088, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_SetNextPhaseTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_CustomEvent_DeltaTime_2) == 0x00009C, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_CustomEvent_DeltaTime_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_SetNextPhaseTime_ReturnValue_1) == 0x0000A0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_SetNextPhaseTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A4, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_SetNextPhaseTime_ReturnValue_2) == 0x0000B4, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_SetNextPhaseTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_CustomEvent_DeltaTime_1) == 0x0000B8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_CustomEvent_DeltaTime_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetGameState_ReturnValue) == 0x0000C0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_DynamicCast_AsSSBattle_Game_State_Base) == 0x0000D8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_DynamicCast_AsSSBattle_Game_State_Base' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetMyPlayerSide_ReturnValue) == 0x0000E4, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetMyPlayerSide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_CustomEvent_DeltaTime) == 0x0000E8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_CustomEvent_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000EC, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_Event_DeltaSeconds) == 0x0000F0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_Event_InPhase) == 0x0000F4, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_Event_InPhase' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetWinner_ReturnValue) == 0x0000F8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetWinner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue) == 0x000100, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue) == 0x000108, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPlayerSide_ReturnValue) == 0x00010C, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPlayerSide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000110, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetWinner_ReturnValue_1) == 0x000118, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetWinner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetLoser_ReturnValue) == 0x000120, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetLoser_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_1) == 0x000128, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_2) == 0x00012C, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000130, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_CreateDelegate_OutputDelegate_3) == 0x000138, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetLoser_ReturnValue_1) == 0x000148, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetLoser_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetWinner_ReturnValue_2) == 0x000150, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetWinner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_3) == 0x000158, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_4) == 0x00015C, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_SetNextPhaseTime_ReturnValue_3) == 0x000160, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_SetNextPhaseTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_Event_InNextRound) == 0x000164, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_Event_InNextRound' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_Event_InSequenceType) == 0x000168, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_Event_InSequenceType' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetWinner_ReturnValue_3) == 0x000170, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetWinner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetLevelSequenceByType_OutLevelSequence) == 0x000178, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetLevelSequenceByType_OutLevelSequence' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_IsMontagePlayingBySelf_OutSection) == 0x0001A8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_IsMontagePlayingBySelf_OutSection' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_IsMontagePlayingBySelf_ReturnValue) == 0x0001B0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_IsMontagePlayingBySelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_LoopLevelSequence_OutSequenceActor) == 0x0001B8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_LoopLevelSequence_OutSequenceActor' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_CreateLevelSequence_ReturnValue) == 0x0001C0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_CreateLevelSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue_1) == 0x0001C8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_5) == 0x0001D0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPlayerSide_ReturnValue_1) == 0x0001D4, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPlayerSide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_IsPowerImpactSequencePlayMode_OutResult) == 0x0001D8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_IsPowerImpactSequencePlayMode_OutResult' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0001D9, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_SwitchEnum_CmpSuccess) == 0x0001DA, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetLevelSequenceByType_OutLevelSequence_1) == 0x0001E0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetLevelSequenceByType_OutLevelSequence_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetLevelSequenceByType_OutLevelSequence_2) == 0x000210, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetLevelSequenceByType_OutLevelSequence_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_CreateLevelSequence_ReturnValue_1) == 0x000240, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_CreateLevelSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_CreateLevelSequence_ReturnValue_2) == 0x000244, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_CreateLevelSequence_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_SetNextPhaseTime_ReturnValue_4) == 0x000248, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_SetNextPhaseTime_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetLevelSequenceByType_OutLevelSequence_3) == 0x000250, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetLevelSequenceByType_OutLevelSequence_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_CreateLevelSequence_ReturnValue_3) == 0x000280, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_CreateLevelSequence_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_6) == 0x000284, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_7) == 0x000288, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue_2) == 0x000290, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue_3) == 0x000298, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_8) == 0x0002A0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_9) == 0x0002A4, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue_4) == 0x0002A8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue_5) == 0x0002B0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_10) == 0x0002B8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_TransitAction_ReturnValue_11) == 0x0002BC, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_TransitAction_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue_6) == 0x0002C0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue_7) == 0x0002C8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue_8) == 0x0002D0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_GetPtr_ReturnValue_9) == 0x0002D8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_GetPtr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_RequestCharacterMove_TravelTime_ImplicitCast) == 0x0002E0, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_RequestCharacterMove_TravelTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, CallFunc_SetTimer_InTime_ImplicitCast) == 0x0002E4, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::CallFunc_SetTimer_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure, K2Node_VariableSet_MoveTime_ImplicitCast) == 0x0002E8, "Member 'BP_PowerImpactGToGProcedure_C_ExecuteUbergraph_BP_PowerImpactGToGProcedure::K2Node_VariableSet_MoveTime_ImplicitCast' has a wrong offset!");

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.OnChangedPhase
// 0x0001 (0x0001 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_OnChangedPhase final
{
public:
	EBattleImpactPhase                            InPhase;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_OnChangedPhase) == 0x000001, "Wrong alignment on BP_PowerImpactGToGProcedure_C_OnChangedPhase");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_OnChangedPhase) == 0x000001, "Wrong size on BP_PowerImpactGToGProcedure_C_OnChangedPhase");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_OnChangedPhase, InPhase) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_OnChangedPhase::InPhase' has a wrong offset!");

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.OnChangePhase
// 0x0002 (0x0002 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_OnChangePhase final
{
public:
	EBattleImpactPhase                            NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_OnChangePhase) == 0x000001, "Wrong alignment on BP_PowerImpactGToGProcedure_C_OnChangePhase");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_OnChangePhase) == 0x000002, "Wrong size on BP_PowerImpactGToGProcedure_C_OnChangePhase");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_OnChangePhase, NewParam) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_OnChangePhase::NewParam' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_OnChangePhase, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_PowerImpactGToGProcedure_C_OnChangePhase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.OnChangePowerImpactRound
// 0x0008 (0x0008 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_OnChangePowerImpactRound final
{
public:
	int32                                         InNextRound;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESSPowerImpactLevelSequenceType               InSequenceType;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_OnChangePowerImpactRound) == 0x000004, "Wrong alignment on BP_PowerImpactGToGProcedure_C_OnChangePowerImpactRound");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_OnChangePowerImpactRound) == 0x000008, "Wrong size on BP_PowerImpactGToGProcedure_C_OnChangePowerImpactRound");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_OnChangePowerImpactRound, InNextRound) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_OnChangePowerImpactRound::InNextRound' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_OnChangePowerImpactRound, InSequenceType) == 0x000004, "Member 'BP_PowerImpactGToGProcedure_C_OnChangePowerImpactRound::InSequenceType' has a wrong offset!");

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.OnTickConclusion
// 0x0004 (0x0004 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_OnTickConclusion final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_OnTickConclusion) == 0x000004, "Wrong alignment on BP_PowerImpactGToGProcedure_C_OnTickConclusion");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_OnTickConclusion) == 0x000004, "Wrong size on BP_PowerImpactGToGProcedure_C_OnTickConclusion");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_OnTickConclusion, DeltaTime) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_OnTickConclusion::DeltaTime' has a wrong offset!");

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.OnTickGame
// 0x0004 (0x0004 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_OnTickGame final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_OnTickGame) == 0x000004, "Wrong alignment on BP_PowerImpactGToGProcedure_C_OnTickGame");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_OnTickGame) == 0x000004, "Wrong size on BP_PowerImpactGToGProcedure_C_OnTickGame");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_OnTickGame, DeltaTime) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_OnTickGame::DeltaTime' has a wrong offset!");

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.OnTickIntroduction
// 0x0004 (0x0004 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_OnTickIntroduction final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_OnTickIntroduction) == 0x000004, "Wrong alignment on BP_PowerImpactGToGProcedure_C_OnTickIntroduction");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_OnTickIntroduction) == 0x000004, "Wrong size on BP_PowerImpactGToGProcedure_C_OnTickIntroduction");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_OnTickIntroduction, DeltaTime) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_OnTickIntroduction::DeltaTime' has a wrong offset!");

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PowerImpactGToGProcedure_C_ReceiveTick");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_ReceiveTick) == 0x000004, "Wrong size on BP_PowerImpactGToGProcedure_C_ReceiveTick");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.DebugDraw
// 0x0038 (0x0038 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_DebugDraw final
{
public:
	float                                         InDeltaT;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_DebugDraw) == 0x000008, "Wrong alignment on BP_PowerImpactGToGProcedure_C_DebugDraw");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_DebugDraw) == 0x000038, "Wrong size on BP_PowerImpactGToGProcedure_C_DebugDraw");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_DebugDraw, InDeltaT) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_DebugDraw::InDeltaT' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_DebugDraw, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_PowerImpactGToGProcedure_C_DebugDraw::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_DebugDraw, CallFunc_MakeVector_ReturnValue_1) == 0x000020, "Member 'BP_PowerImpactGToGProcedure_C_DebugDraw::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function BP_PowerImpactGToGProcedure.BP_PowerImpactGToGProcedure_C.GetNextPhase
// 0x0003 (0x0003 - 0x0000)
struct BP_PowerImpactGToGProcedure_C_GetNextPhase final
{
public:
	EBattleImpactPhase                            InCurrentPhase;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PowerImpactGToGProcedure_C_GetNextPhase) == 0x000001, "Wrong alignment on BP_PowerImpactGToGProcedure_C_GetNextPhase");
static_assert(sizeof(BP_PowerImpactGToGProcedure_C_GetNextPhase) == 0x000003, "Wrong size on BP_PowerImpactGToGProcedure_C_GetNextPhase");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_GetNextPhase, InCurrentPhase) == 0x000000, "Member 'BP_PowerImpactGToGProcedure_C_GetNextPhase::InCurrentPhase' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_GetNextPhase, ReturnValue) == 0x000001, "Member 'BP_PowerImpactGToGProcedure_C_GetNextPhase::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PowerImpactGToGProcedure_C_GetNextPhase, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BP_PowerImpactGToGProcedure_C_GetNextPhase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

