#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Space_Extra

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Space_Extra.BP_Space_Extra_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_Space_Extra_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Background_Image;                                  // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Brightness;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Color_Hue;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Background_Size;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Auto_Random;                                       // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BP_Space_Extra(int32 EntryPoint);
	void Randomize();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Space_Extra_C">();
	}
	static class ABP_Space_Extra_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Space_Extra_C>();
	}
};
static_assert(alignof(ABP_Space_Extra_C) == 0x000008, "Wrong alignment on ABP_Space_Extra_C");
static_assert(sizeof(ABP_Space_Extra_C) == 0x0002C8, "Wrong size on ABP_Space_Extra_C");
static_assert(offsetof(ABP_Space_Extra_C, UberGraphFrame) == 0x000290, "Member 'ABP_Space_Extra_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Space_Extra_C, StaticMeshComponent0) == 0x000298, "Member 'ABP_Space_Extra_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Space_Extra_C, Background_Image) == 0x0002A0, "Member 'ABP_Space_Extra_C::Background_Image' has a wrong offset!");
static_assert(offsetof(ABP_Space_Extra_C, Brightness) == 0x0002A8, "Member 'ABP_Space_Extra_C::Brightness' has a wrong offset!");
static_assert(offsetof(ABP_Space_Extra_C, Color_Hue) == 0x0002B0, "Member 'ABP_Space_Extra_C::Color_Hue' has a wrong offset!");
static_assert(offsetof(ABP_Space_Extra_C, Background_Size) == 0x0002B8, "Member 'ABP_Space_Extra_C::Background_Size' has a wrong offset!");
static_assert(offsetof(ABP_Space_Extra_C, Auto_Random) == 0x0002C0, "Member 'ABP_Space_Extra_C::Auto_Random' has a wrong offset!");

}

