#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SSCharacterDitherComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SSCharacterDitherComponent.BP_SSCharacterDitherComponent_C.DitherParts
// 0x0018 (0x0018 - 0x0000)
struct BP_SSCharacterDitherComponent_C_DitherParts final
{
public:
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_B_ImplicitCast;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SSCharacterDitherComponent_C_DitherParts) == 0x000008, "Wrong alignment on BP_SSCharacterDitherComponent_C_DitherParts");
static_assert(sizeof(BP_SSCharacterDitherComponent_C_DitherParts) == 0x000018, "Wrong size on BP_SSCharacterDitherComponent_C_DitherParts");
static_assert(offsetof(BP_SSCharacterDitherComponent_C_DitherParts, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000000, "Member 'BP_SSCharacterDitherComponent_C_DitherParts::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SSCharacterDitherComponent_C_DitherParts, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_SSCharacterDitherComponent_C_DitherParts::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SSCharacterDitherComponent_C_DitherParts, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000005, "Member 'BP_SSCharacterDitherComponent_C_DitherParts::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SSCharacterDitherComponent_C_DitherParts, CallFunc_NotEqual_DoubleDouble_B_ImplicitCast) == 0x000008, "Member 'BP_SSCharacterDitherComponent_C_DitherParts::CallFunc_NotEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SSCharacterDitherComponent_C_DitherParts, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'BP_SSCharacterDitherComponent_C_DitherParts::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_SSCharacterDitherComponent.BP_SSCharacterDitherComponent_C.ExecuteUbergraph_BP_SSCharacterDitherComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_SSCharacterDitherComponent_C_ExecuteUbergraph_BP_SSCharacterDitherComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SSCharacterDitherComponent_C_ExecuteUbergraph_BP_SSCharacterDitherComponent) == 0x000004, "Wrong alignment on BP_SSCharacterDitherComponent_C_ExecuteUbergraph_BP_SSCharacterDitherComponent");
static_assert(sizeof(BP_SSCharacterDitherComponent_C_ExecuteUbergraph_BP_SSCharacterDitherComponent) == 0x000008, "Wrong size on BP_SSCharacterDitherComponent_C_ExecuteUbergraph_BP_SSCharacterDitherComponent");
static_assert(offsetof(BP_SSCharacterDitherComponent_C_ExecuteUbergraph_BP_SSCharacterDitherComponent, EntryPoint) == 0x000000, "Member 'BP_SSCharacterDitherComponent_C_ExecuteUbergraph_BP_SSCharacterDitherComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SSCharacterDitherComponent_C_ExecuteUbergraph_BP_SSCharacterDitherComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_SSCharacterDitherComponent_C_ExecuteUbergraph_BP_SSCharacterDitherComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_SSCharacterDitherComponent.BP_SSCharacterDitherComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SSCharacterDitherComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SSCharacterDitherComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SSCharacterDitherComponent_C_ReceiveTick");
static_assert(sizeof(BP_SSCharacterDitherComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_SSCharacterDitherComponent_C_ReceiveTick");
static_assert(offsetof(BP_SSCharacterDitherComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SSCharacterDitherComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

