#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpeedImpactProcedure

#include "Basic.hpp"

#include "SS_structs.hpp"


namespace SDK::Params
{

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.ExecuteUbergraph_BP_SpeedImpactProcedure
// 0x00E0 (0x00E0 - 0x0000)
struct BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaTime;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaTime)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaTime)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_1;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_1;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateLevelSequence_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateLevelSequence_ReturnValue_1;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_2;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_3;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCutCameraDirector*                   CallFunc_GetCutCameraDirector_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCutCameraDirector*                   CallFunc_GetCutCameraDirector_ReturnValue_1;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCutCameraActor*                      CallFunc_GetManualCamera_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue_4;                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCutCameraDirector*                   CallFunc_GetCutCameraDirector_ReturnValue_2;       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_1;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            K2Node_Event_InPhase;                              // 0x0091(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSecond;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelSequencePlaying_ReturnValue;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_2;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Time;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactTriggerEventOpt                  K2Node_Event_Option;                               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattleImpactLevelSequenceParams       K2Node_MakeStruct_BattleImpactLevelSequenceParams; // 0x00A8(0x0020)(NoDestructor)
	EBattleImpactPhase                            CallFunc_SetNextPhaseTime_ReturnValue_3;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CreateLevelSequence_ReturnValue_2;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaTime_1;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_2;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_3;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure) == 0x000008, "Wrong alignment on BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure");
static_assert(sizeof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure) == 0x0000E0, "Wrong size on BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, EntryPoint) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_CustomEvent_DeltaTime) == 0x000004, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_CustomEvent_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_SetNextPhaseTime_ReturnValue) == 0x000028, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_SetNextPhaseTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_GetPtr_ReturnValue) == 0x000030, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_GetPtr_ReturnValue_1) == 0x000038, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_GetPtr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_TransitAction_ReturnValue) == 0x000040, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_TransitAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_TransitAction_ReturnValue_1) == 0x000044, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_TransitAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_CreateLevelSequence_ReturnValue) == 0x000048, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_CreateLevelSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_CreateLevelSequence_ReturnValue_1) == 0x00004C, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_CreateLevelSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_GetPtr_ReturnValue_2) == 0x000050, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_GetPtr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_GetPtr_ReturnValue_3) == 0x000058, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_GetPtr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_GetCutCameraDirector_ReturnValue) == 0x000060, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_GetCutCameraDirector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_GetCutCameraDirector_ReturnValue_1) == 0x000068, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_GetCutCameraDirector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_GetManualCamera_ReturnValue) == 0x000070, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_GetManualCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_Event_DeltaSeconds) == 0x000078, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_GetPtr_ReturnValue_4) == 0x000080, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_GetPtr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_GetCutCameraDirector_ReturnValue_2) == 0x000088, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_GetCutCameraDirector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_SetNextPhaseTime_ReturnValue_1) == 0x000090, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_SetNextPhaseTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_Event_InPhase) == 0x000091, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_Event_InPhase' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_Event_DeltaSecond) == 0x000094, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_Event_DeltaSecond' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_IsLevelSequencePlaying_ReturnValue) == 0x000098, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_IsLevelSequencePlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_SetNextPhaseTime_ReturnValue_2) == 0x000099, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_SetNextPhaseTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_Event_Time) == 0x00009C, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_Event_Time' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_Event_Option) == 0x0000A0, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_Event_Option' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_MakeStruct_BattleImpactLevelSequenceParams) == 0x0000A8, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_MakeStruct_BattleImpactLevelSequenceParams' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_SetNextPhaseTime_ReturnValue_3) == 0x0000C8, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_SetNextPhaseTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_CreateLevelSequence_ReturnValue_2) == 0x0000CC, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_CreateLevelSequence_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, K2Node_CustomEvent_DeltaTime_1) == 0x0000D0, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::K2Node_CustomEvent_DeltaTime_1' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_TransitAction_ReturnValue_2) == 0x0000D4, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_TransitAction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure, CallFunc_TransitAction_ReturnValue_3) == 0x0000D8, "Member 'BP_SpeedImpactProcedure_C_ExecuteUbergraph_BP_SpeedImpactProcedure::CallFunc_TransitAction_ReturnValue_3' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.FinishAnimation
// 0x0020 (0x0020 - 0x0000)
struct BP_SpeedImpactProcedure_C_FinishAnimation final
{
public:
	double                                        WonAnimeTime;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_2;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TransitAction_ReturnValue_3;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWinner_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_FinishAnimation) == 0x000008, "Wrong alignment on BP_SpeedImpactProcedure_C_FinishAnimation");
static_assert(sizeof(BP_SpeedImpactProcedure_C_FinishAnimation) == 0x000020, "Wrong size on BP_SpeedImpactProcedure_C_FinishAnimation");
static_assert(offsetof(BP_SpeedImpactProcedure_C_FinishAnimation, WonAnimeTime) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_FinishAnimation::WonAnimeTime' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_FinishAnimation, CallFunc_TransitAction_ReturnValue) == 0x000008, "Member 'BP_SpeedImpactProcedure_C_FinishAnimation::CallFunc_TransitAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_FinishAnimation, CallFunc_TransitAction_ReturnValue_1) == 0x00000C, "Member 'BP_SpeedImpactProcedure_C_FinishAnimation::CallFunc_TransitAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_FinishAnimation, CallFunc_TransitAction_ReturnValue_2) == 0x000010, "Member 'BP_SpeedImpactProcedure_C_FinishAnimation::CallFunc_TransitAction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_FinishAnimation, CallFunc_TransitAction_ReturnValue_3) == 0x000014, "Member 'BP_SpeedImpactProcedure_C_FinishAnimation::CallFunc_TransitAction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_FinishAnimation, CallFunc_IsWinner_ReturnValue) == 0x000018, "Member 'BP_SpeedImpactProcedure_C_FinishAnimation::CallFunc_IsWinner_ReturnValue' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.OnChangedPhase
// 0x0001 (0x0001 - 0x0000)
struct BP_SpeedImpactProcedure_C_OnChangedPhase final
{
public:
	EBattleImpactPhase                            InPhase;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_OnChangedPhase) == 0x000001, "Wrong alignment on BP_SpeedImpactProcedure_C_OnChangedPhase");
static_assert(sizeof(BP_SpeedImpactProcedure_C_OnChangedPhase) == 0x000001, "Wrong size on BP_SpeedImpactProcedure_C_OnChangedPhase");
static_assert(offsetof(BP_SpeedImpactProcedure_C_OnChangedPhase, InPhase) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_OnChangedPhase::InPhase' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.OnChangePhase
// 0x0002 (0x0002 - 0x0000)
struct BP_SpeedImpactProcedure_C_OnChangePhase final
{
public:
	EBattleImpactPhase                            Phase;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_OnChangePhase) == 0x000001, "Wrong alignment on BP_SpeedImpactProcedure_C_OnChangePhase");
static_assert(sizeof(BP_SpeedImpactProcedure_C_OnChangePhase) == 0x000002, "Wrong size on BP_SpeedImpactProcedure_C_OnChangePhase");
static_assert(offsetof(BP_SpeedImpactProcedure_C_OnChangePhase, Phase) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_OnChangePhase::Phase' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_OnChangePhase, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_SpeedImpactProcedure_C_OnChangePhase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.OnTickGame
// 0x0004 (0x0004 - 0x0000)
struct BP_SpeedImpactProcedure_C_OnTickGame final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_OnTickGame) == 0x000004, "Wrong alignment on BP_SpeedImpactProcedure_C_OnTickGame");
static_assert(sizeof(BP_SpeedImpactProcedure_C_OnTickGame) == 0x000004, "Wrong size on BP_SpeedImpactProcedure_C_OnTickGame");
static_assert(offsetof(BP_SpeedImpactProcedure_C_OnTickGame, DeltaTime) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_OnTickGame::DeltaTime' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.OnTickIntroduction
// 0x0004 (0x0004 - 0x0000)
struct BP_SpeedImpactProcedure_C_OnTickIntroduction final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_OnTickIntroduction) == 0x000004, "Wrong alignment on BP_SpeedImpactProcedure_C_OnTickIntroduction");
static_assert(sizeof(BP_SpeedImpactProcedure_C_OnTickIntroduction) == 0x000004, "Wrong size on BP_SpeedImpactProcedure_C_OnTickIntroduction");
static_assert(offsetof(BP_SpeedImpactProcedure_C_OnTickIntroduction, DeltaTime) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_OnTickIntroduction::DeltaTime' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.OnUpdateGameCharacter
// 0x0004 (0x0004 - 0x0000)
struct BP_SpeedImpactProcedure_C_OnUpdateGameCharacter final
{
public:
	float                                         DeltaSecond;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_OnUpdateGameCharacter) == 0x000004, "Wrong alignment on BP_SpeedImpactProcedure_C_OnUpdateGameCharacter");
static_assert(sizeof(BP_SpeedImpactProcedure_C_OnUpdateGameCharacter) == 0x000004, "Wrong size on BP_SpeedImpactProcedure_C_OnUpdateGameCharacter");
static_assert(offsetof(BP_SpeedImpactProcedure_C_OnUpdateGameCharacter, DeltaSecond) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_OnUpdateGameCharacter::DeltaSecond' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.ReceiveOnTriggerEventMatchTransform
// 0x0008 (0x0008 - 0x0000)
struct BP_SpeedImpactProcedure_C_ReceiveOnTriggerEventMatchTransform final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactTriggerEventOpt                  Option;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_ReceiveOnTriggerEventMatchTransform) == 0x000004, "Wrong alignment on BP_SpeedImpactProcedure_C_ReceiveOnTriggerEventMatchTransform");
static_assert(sizeof(BP_SpeedImpactProcedure_C_ReceiveOnTriggerEventMatchTransform) == 0x000008, "Wrong size on BP_SpeedImpactProcedure_C_ReceiveOnTriggerEventMatchTransform");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ReceiveOnTriggerEventMatchTransform, Time) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_ReceiveOnTriggerEventMatchTransform::Time' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ReceiveOnTriggerEventMatchTransform, Option) == 0x000004, "Member 'BP_SpeedImpactProcedure_C_ReceiveOnTriggerEventMatchTransform::Option' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SpeedImpactProcedure_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SpeedImpactProcedure_C_ReceiveTick");
static_assert(sizeof(BP_SpeedImpactProcedure_C_ReceiveTick) == 0x000004, "Wrong size on BP_SpeedImpactProcedure_C_ReceiveTick");
static_assert(offsetof(BP_SpeedImpactProcedure_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.Íª√»¢Ø∑ÁÛ
// 0x0020 (0x0020 - 0x0000)
struct BP_SpeedImpactProcedure_C__________ final
{
public:
	class USSBattleImpactCharacterProxy*          CharacterProxy;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C__________) == 0x000008, "Wrong alignment on BP_SpeedImpactProcedure_C__________");
static_assert(sizeof(BP_SpeedImpactProcedure_C__________) == 0x000020, "Wrong size on BP_SpeedImpactProcedure_C__________");
static_assert(offsetof(BP_SpeedImpactProcedure_C__________, CharacterProxy) == 0x000000, "Member 'BP_SpeedImpactProcedure_C__________::CharacterProxy' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C__________, CallFunc_GetPtr_ReturnValue) == 0x000008, "Member 'BP_SpeedImpactProcedure_C__________::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C__________, K2Node_DynamicCast_AsBP_Character) == 0x000010, "Member 'BP_SpeedImpactProcedure_C__________::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C__________, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SpeedImpactProcedure_C__________::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.Íª√»‡¸÷
// 0x0020 (0x0020 - 0x0000)
struct BP_SpeedImpactProcedure_C________ final
{
public:
	class USSBattleImpactCharacterProxy*          CharacterProxy;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           CallFunc_GetPtr_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C________) == 0x000008, "Wrong alignment on BP_SpeedImpactProcedure_C________");
static_assert(sizeof(BP_SpeedImpactProcedure_C________) == 0x000020, "Wrong size on BP_SpeedImpactProcedure_C________");
static_assert(offsetof(BP_SpeedImpactProcedure_C________, CharacterProxy) == 0x000000, "Member 'BP_SpeedImpactProcedure_C________::CharacterProxy' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C________, CallFunc_GetPtr_ReturnValue) == 0x000008, "Member 'BP_SpeedImpactProcedure_C________::CallFunc_GetPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C________, K2Node_DynamicCast_AsBP_Character) == 0x000010, "Member 'BP_SpeedImpactProcedure_C________::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C________, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_SpeedImpactProcedure_C________::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.DebugDraw
// 0x0004 (0x0004 - 0x0000)
struct BP_SpeedImpactProcedure_C_DebugDraw final
{
public:
	float                                         InDeltaT;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_DebugDraw) == 0x000004, "Wrong alignment on BP_SpeedImpactProcedure_C_DebugDraw");
static_assert(sizeof(BP_SpeedImpactProcedure_C_DebugDraw) == 0x000004, "Wrong size on BP_SpeedImpactProcedure_C_DebugDraw");
static_assert(offsetof(BP_SpeedImpactProcedure_C_DebugDraw, InDeltaT) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_DebugDraw::InDeltaT' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.GetCameraRootActor
// 0x0008 (0x0008 - 0x0000)
struct BP_SpeedImpactProcedure_C_GetCameraRootActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_GetCameraRootActor) == 0x000008, "Wrong alignment on BP_SpeedImpactProcedure_C_GetCameraRootActor");
static_assert(sizeof(BP_SpeedImpactProcedure_C_GetCameraRootActor) == 0x000008, "Wrong size on BP_SpeedImpactProcedure_C_GetCameraRootActor");
static_assert(offsetof(BP_SpeedImpactProcedure_C_GetCameraRootActor, ReturnValue) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_GetCameraRootActor::ReturnValue' has a wrong offset!");

// Function BP_SpeedImpactProcedure.BP_SpeedImpactProcedure_C.GetNextPhase
// 0x0003 (0x0003 - 0x0000)
struct BP_SpeedImpactProcedure_C_GetNextPhase final
{
public:
	EBattleImpactPhase                            InCurrentPhase;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleImpactPhase                            ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpeedImpactProcedure_C_GetNextPhase) == 0x000001, "Wrong alignment on BP_SpeedImpactProcedure_C_GetNextPhase");
static_assert(sizeof(BP_SpeedImpactProcedure_C_GetNextPhase) == 0x000003, "Wrong size on BP_SpeedImpactProcedure_C_GetNextPhase");
static_assert(offsetof(BP_SpeedImpactProcedure_C_GetNextPhase, InCurrentPhase) == 0x000000, "Member 'BP_SpeedImpactProcedure_C_GetNextPhase::InCurrentPhase' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_GetNextPhase, ReturnValue) == 0x000001, "Member 'BP_SpeedImpactProcedure_C_GetNextPhase::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpeedImpactProcedure_C_GetNextPhase, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'BP_SpeedImpactProcedure_C_GetNextPhase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

