#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Space_Extra

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Space_Extra.BP_Space_Extra_C.Construct
// 0x0030 (0x0030 - 0x0000)
struct BP_Space_Extra_C_Construct final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_FloatToVector_InFloat_ImplicitCast;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Space_Extra_C_Construct) == 0x000008, "Wrong alignment on BP_Space_Extra_C_Construct");
static_assert(sizeof(BP_Space_Extra_C_Construct) == 0x000030, "Wrong size on BP_Space_Extra_C_Construct");
static_assert(offsetof(BP_Space_Extra_C_Construct, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Space_Extra_C_Construct::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Space_Extra_C_Construct, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000008, "Member 'BP_Space_Extra_C_Construct::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Space_Extra_C_Construct, CallFunc_Conv_FloatToVector_InFloat_ImplicitCast) == 0x000020, "Member 'BP_Space_Extra_C_Construct::CallFunc_Conv_FloatToVector_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Space_Extra_C_Construct, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000024, "Member 'BP_Space_Extra_C_Construct::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Space_Extra_C_Construct, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000028, "Member 'BP_Space_Extra_C_Construct::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_Space_Extra.BP_Space_Extra_C.ExecuteUbergraph_BP_Space_Extra
// 0x0018 (0x0018 - 0x0000)
struct BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra) == 0x000008, "Wrong alignment on BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra");
static_assert(sizeof(BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra) == 0x000018, "Wrong size on BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra");
static_assert(offsetof(BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra, EntryPoint) == 0x000000, "Member 'BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000010, "Member 'BP_Space_Extra_C_ExecuteUbergraph_BP_Space_Extra::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");

}

