#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Star_Anomaly_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Star_Anomaly_1.BP_Star_Anomaly_1_C.ExecuteUbergraph_BP_Star_Anomaly_1
// 0x0200 (0x0200 - 0x0000)
struct BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0058(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1;  // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1) == 0x000008, "Wrong alignment on BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1");
static_assert(sizeof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1) == 0x000200, "Wrong size on BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, EntryPoint) == 0x000000, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, Temp_object_Variable) == 0x000008, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000020, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000040, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000058, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000140, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000150, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000158, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_GetPlayerController_ReturnValue) == 0x000170, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_GetMaterial_ReturnValue) == 0x000178, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x000180, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x000190, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000198, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_BreakVector2D_X) == 0x0001A8, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_BreakVector2D_Y) == 0x0001B0, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_GetMaterial_ReturnValue_1) == 0x0001C0, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0001C8, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1) == 0x0001D0, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::K2Node_DynamicCast_AsMaterial_Instance_Dynamic_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_FClamp_ReturnValue) == 0x0001E0, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_FClamp_ReturnValue_1) == 0x0001E8, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0001F0, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0001F4, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0001F8, "Member 'BP_Star_Anomaly_1_C_ExecuteUbergraph_BP_Star_Anomaly_1::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");

// Function BP_Star_Anomaly_1.BP_Star_Anomaly_1_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Star_Anomaly_1_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Star_Anomaly_1_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Star_Anomaly_1_C_ReceiveTick");
static_assert(sizeof(BP_Star_Anomaly_1_C_ReceiveTick) == 0x000004, "Wrong size on BP_Star_Anomaly_1_C_ReceiveTick");
static_assert(offsetof(BP_Star_Anomaly_1_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Star_Anomaly_1_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Star_Anomaly_1.BP_Star_Anomaly_1_C.UserConstructionScript
// 0x0098 (0x0098 - 0x0000)
struct BP_Star_Anomaly_1_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_2;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_3;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_10; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_11; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_12; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_13; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_14; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_15; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_16; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_17; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_18; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_19; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_20; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_21; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Star_Anomaly_1_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Star_Anomaly_1_C_UserConstructionScript");
static_assert(sizeof(BP_Star_Anomaly_1_C_UserConstructionScript) == 0x000098, "Wrong size on BP_Star_Anomaly_1_C_UserConstructionScript");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue_1) == 0x000010, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue_2) == 0x000018, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000020, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000028, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue_3) == 0x000030, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000038, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000040, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000044, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000048, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x00004C, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x000050, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000054, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x000058, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x00005C, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x000060, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x000064, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_10) == 0x000068, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_11) == 0x00006C, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_11' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_12) == 0x000070, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_12' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_13) == 0x000074, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_13' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_14) == 0x000078, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_14' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_15) == 0x00007C, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_15' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_16) == 0x000080, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_16' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_17) == 0x000084, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_17' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_18) == 0x000088, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_18' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_19) == 0x00008C, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_19' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_20) == 0x000090, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_20' has a wrong offset!");
static_assert(offsetof(BP_Star_Anomaly_1_C_UserConstructionScript, CallFunc_SetScalarParameterValue_Value_ImplicitCast_21) == 0x000094, "Member 'BP_Star_Anomaly_1_C_UserConstructionScript::CallFunc_SetScalarParameterValue_Value_ImplicitCast_21' has a wrong offset!");

}

