#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCHR_0000_40_00

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPCHR_0000_40_00.BPCHR_0000_40_00_C.ExecuteUbergraph_BPCHR_0000_40_00
// 0x0008 (0x0008 - 0x0000)
struct BPCHR_0000_40_00_C_ExecuteUbergraph_BPCHR_0000_40_00 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCHR_0000_40_00_C_ExecuteUbergraph_BPCHR_0000_40_00) == 0x000004, "Wrong alignment on BPCHR_0000_40_00_C_ExecuteUbergraph_BPCHR_0000_40_00");
static_assert(sizeof(BPCHR_0000_40_00_C_ExecuteUbergraph_BPCHR_0000_40_00) == 0x000008, "Wrong size on BPCHR_0000_40_00_C_ExecuteUbergraph_BPCHR_0000_40_00");
static_assert(offsetof(BPCHR_0000_40_00_C_ExecuteUbergraph_BPCHR_0000_40_00, EntryPoint) == 0x000000, "Member 'BPCHR_0000_40_00_C_ExecuteUbergraph_BPCHR_0000_40_00::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPCHR_0000_40_00_C_ExecuteUbergraph_BPCHR_0000_40_00, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BPCHR_0000_40_00_C_ExecuteUbergraph_BPCHR_0000_40_00::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BPCHR_0000_40_00.BPCHR_0000_40_00_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPCHR_0000_40_00_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCHR_0000_40_00_C_ReceiveTick) == 0x000004, "Wrong alignment on BPCHR_0000_40_00_C_ReceiveTick");
static_assert(sizeof(BPCHR_0000_40_00_C_ReceiveTick) == 0x000004, "Wrong size on BPCHR_0000_40_00_C_ReceiveTick");
static_assert(offsetof(BPCHR_0000_40_00_C_ReceiveTick, DeltaSeconds_0) == 0x000000, "Member 'BPCHR_0000_40_00_C_ReceiveTick::DeltaSeconds_0' has a wrong offset!");

}

