#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_AnimAction

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_AnimAction.BPI_AnimAction_C.SetActionBlendAlpha
// 0x0008 (0x0008 - 0x0000)
struct BPI_AnimAction_C_SetActionBlendAlpha final
{
public:
	double                                        ActionBlendAlpha;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_AnimAction_C_SetActionBlendAlpha) == 0x000008, "Wrong alignment on BPI_AnimAction_C_SetActionBlendAlpha");
static_assert(sizeof(BPI_AnimAction_C_SetActionBlendAlpha) == 0x000008, "Wrong size on BPI_AnimAction_C_SetActionBlendAlpha");
static_assert(offsetof(BPI_AnimAction_C_SetActionBlendAlpha, ActionBlendAlpha) == 0x000000, "Member 'BPI_AnimAction_C_SetActionBlendAlpha::ActionBlendAlpha' has a wrong offset!");

// Function BPI_AnimAction.BPI_AnimAction_C.SetMovingActionBlendAlpha
// 0x0008 (0x0008 - 0x0000)
struct BPI_AnimAction_C_SetMovingActionBlendAlpha final
{
public:
	double                                        MovingActionBlendAlpha;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_AnimAction_C_SetMovingActionBlendAlpha) == 0x000008, "Wrong alignment on BPI_AnimAction_C_SetMovingActionBlendAlpha");
static_assert(sizeof(BPI_AnimAction_C_SetMovingActionBlendAlpha) == 0x000008, "Wrong size on BPI_AnimAction_C_SetMovingActionBlendAlpha");
static_assert(offsetof(BPI_AnimAction_C_SetMovingActionBlendAlpha, MovingActionBlendAlpha) == 0x000000, "Member 'BPI_AnimAction_C_SetMovingActionBlendAlpha::MovingActionBlendAlpha' has a wrong offset!");

}

