#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_CharacterLocomotion

#include "Basic.hpp"

#include "SS_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EAnimStateMachineEventType_structs.hpp"
#include "Engine_structs.hpp"
#include "ECharacterNumbReactionState_structs.hpp"
#include "ECharacterMoveStandUpDirection_structs.hpp"
#include "ECharacterMoveStandUpState_structs.hpp"


namespace SDK::Params
{

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.AddCharacterMovementXInput
// 0x0020 (0x0020 - 0x0000)
struct BPI_CharacterLocomotion_C_AddCharacterMovementXInput final
{
public:
	struct FVector                                WorldDirection;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_AddCharacterMovementXInput) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_AddCharacterMovementXInput");
static_assert(sizeof(BPI_CharacterLocomotion_C_AddCharacterMovementXInput) == 0x000020, "Wrong size on BPI_CharacterLocomotion_C_AddCharacterMovementXInput");
static_assert(offsetof(BPI_CharacterLocomotion_C_AddCharacterMovementXInput, WorldDirection) == 0x000000, "Member 'BPI_CharacterLocomotion_C_AddCharacterMovementXInput::WorldDirection' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_AddCharacterMovementXInput, Value) == 0x000018, "Member 'BPI_CharacterLocomotion_C_AddCharacterMovementXInput::Value' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.AddCharacterMovementXYInput
// 0x0010 (0x0010 - 0x0000)
struct BPI_CharacterLocomotion_C_AddCharacterMovementXYInput final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_AddCharacterMovementXYInput) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_AddCharacterMovementXYInput");
static_assert(sizeof(BPI_CharacterLocomotion_C_AddCharacterMovementXYInput) == 0x000010, "Wrong size on BPI_CharacterLocomotion_C_AddCharacterMovementXYInput");
static_assert(offsetof(BPI_CharacterLocomotion_C_AddCharacterMovementXYInput, Value) == 0x000000, "Member 'BPI_CharacterLocomotion_C_AddCharacterMovementXYInput::Value' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.AddCharacterMovementYInput
// 0x0020 (0x0020 - 0x0000)
struct BPI_CharacterLocomotion_C_AddCharacterMovementYInput final
{
public:
	struct FVector                                WorldDirection;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_AddCharacterMovementYInput) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_AddCharacterMovementYInput");
static_assert(sizeof(BPI_CharacterLocomotion_C_AddCharacterMovementYInput) == 0x000020, "Wrong size on BPI_CharacterLocomotion_C_AddCharacterMovementYInput");
static_assert(offsetof(BPI_CharacterLocomotion_C_AddCharacterMovementYInput, WorldDirection) == 0x000000, "Member 'BPI_CharacterLocomotion_C_AddCharacterMovementYInput::WorldDirection' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_AddCharacterMovementYInput, Value) == 0x000018, "Member 'BPI_CharacterLocomotion_C_AddCharacterMovementYInput::Value' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.AddCharacterMovementZInputLast
// 0x0008 (0x0008 - 0x0000)
struct BPI_CharacterLocomotion_C_AddCharacterMovementZInputLast final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_AddCharacterMovementZInputLast) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_AddCharacterMovementZInputLast");
static_assert(sizeof(BPI_CharacterLocomotion_C_AddCharacterMovementZInputLast) == 0x000008, "Wrong size on BPI_CharacterLocomotion_C_AddCharacterMovementZInputLast");
static_assert(offsetof(BPI_CharacterLocomotion_C_AddCharacterMovementZInputLast, Value) == 0x000000, "Member 'BPI_CharacterLocomotion_C_AddCharacterMovementZInputLast::Value' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.GetLocomotionDetailStatus
// 0x0001 (0x0001 - 0x0000)
struct BPI_CharacterLocomotion_C_GetLocomotionDetailStatus final
{
public:
	EKoratCharacterLocomotionDetailStatus         OutLocomotionDetailStatus;                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_GetLocomotionDetailStatus) == 0x000001, "Wrong alignment on BPI_CharacterLocomotion_C_GetLocomotionDetailStatus");
static_assert(sizeof(BPI_CharacterLocomotion_C_GetLocomotionDetailStatus) == 0x000001, "Wrong size on BPI_CharacterLocomotion_C_GetLocomotionDetailStatus");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionDetailStatus, OutLocomotionDetailStatus) == 0x000000, "Member 'BPI_CharacterLocomotion_C_GetLocomotionDetailStatus::OutLocomotionDetailStatus' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.GetLocomotionNumbReaction
// 0x0002 (0x0002 - 0x0000)
struct BPI_CharacterLocomotion_C_GetLocomotionNumbReaction final
{
public:
	ECharacterNumbReactionState                   State;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Front;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_GetLocomotionNumbReaction) == 0x000001, "Wrong alignment on BPI_CharacterLocomotion_C_GetLocomotionNumbReaction");
static_assert(sizeof(BPI_CharacterLocomotion_C_GetLocomotionNumbReaction) == 0x000002, "Wrong size on BPI_CharacterLocomotion_C_GetLocomotionNumbReaction");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionNumbReaction, State) == 0x000000, "Member 'BPI_CharacterLocomotion_C_GetLocomotionNumbReaction::State' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionNumbReaction, Front) == 0x000001, "Member 'BPI_CharacterLocomotion_C_GetLocomotionNumbReaction::Front' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.GetLocomotionParameterForAction
// 0x0098 (0x0098 - 0x0000)
struct BPI_CharacterLocomotion_C_GetLocomotionParameterForAction final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        XYSpeed;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZSpeed;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LastVelocityRot;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CharacterRot;                                      // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               ToTargetRotation;                                  // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        DirectionY;                                        // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionZ;                                        // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NearMoveAlpha;                                     // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BattleMoveAlpha;                                   // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNearMode;                                        // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInAir;                                           // 0x0081(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxSpeed;                                          // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NearModeSpeed;                                     // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_GetLocomotionParameterForAction");
static_assert(sizeof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction) == 0x000098, "Wrong size on BPI_CharacterLocomotion_C_GetLocomotionParameterForAction");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, Speed) == 0x000000, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::Speed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, XYSpeed) == 0x000008, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::XYSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, ZSpeed) == 0x000010, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::ZSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, LastVelocityRot) == 0x000018, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::LastVelocityRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, CharacterRot) == 0x000030, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::CharacterRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, ToTargetRotation) == 0x000048, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::ToTargetRotation' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, DirectionY) == 0x000060, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::DirectionY' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, DirectionZ) == 0x000068, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::DirectionZ' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, NearMoveAlpha) == 0x000070, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::NearMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, BattleMoveAlpha) == 0x000078, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::BattleMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, IsNearMode) == 0x000080, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::IsNearMode' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, IsInAir) == 0x000081, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::IsInAir' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, MaxSpeed) == 0x000088, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::MaxSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForAction, NearModeSpeed) == 0x000090, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForAction::NearModeSpeed' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.GetLocomotionParameterForBurstDash
// 0x00A0 (0x00A0 - 0x0000)
struct BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        XYSpeed;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZSpeed;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LastVelocityRot;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CharacterRot;                                      // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               ToTargetRotation;                                  // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        DirectionY;                                        // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionZ;                                        // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NearMoveAlpha;                                     // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BattleMoveAlpha;                                   // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInAir;                                           // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         LocomotionStatus;                                  // 0x0081(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratZBurstDashState                         ZBurstDashStatus;                                  // 0x0082(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterSplineComponent_C*         SplineComponent;                                   // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        SplineNowDistance;                                 // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRequestResetStateMachine;                        // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         ResetStateMachineStatus;                           // 0x0099(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash");
static_assert(sizeof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash) == 0x0000A0, "Wrong size on BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, Speed) == 0x000000, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::Speed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, XYSpeed) == 0x000008, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::XYSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, ZSpeed) == 0x000010, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::ZSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, LastVelocityRot) == 0x000018, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::LastVelocityRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, CharacterRot) == 0x000030, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::CharacterRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, ToTargetRotation) == 0x000048, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::ToTargetRotation' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, DirectionY) == 0x000060, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::DirectionY' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, DirectionZ) == 0x000068, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::DirectionZ' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, NearMoveAlpha) == 0x000070, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::NearMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, BattleMoveAlpha) == 0x000078, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::BattleMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, IsInAir) == 0x000080, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::IsInAir' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, LocomotionStatus) == 0x000081, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::LocomotionStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, ZBurstDashStatus) == 0x000082, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::ZBurstDashStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, SplineComponent) == 0x000088, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::SplineComponent' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, SplineNowDistance) == 0x000090, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::SplineNowDistance' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, IsRequestResetStateMachine) == 0x000098, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::IsRequestResetStateMachine' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash, ResetStateMachineStatus) == 0x000099, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstDash::ResetStateMachineStatus' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.GetLocomotionParameterForBurstSmash
// 0x00A0 (0x00A0 - 0x0000)
struct BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        XYSpeed;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZSpeed;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LastVelocityRot;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CharacterRot;                                      // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               ToTargetRotation;                                  // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        DirectionY;                                        // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionZ;                                        // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NearMoveAlpha;                                     // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BattleMoveAlpha;                                   // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInAir;                                           // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         LocomotionStatus;                                  // 0x0081(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratZBurstDashState                         ZBurstDashStatus;                                  // 0x0082(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterSplineComponent_C*         SplineComponent;                                   // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        SplineNowDistance;                                 // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRequestResetStateMachine;                        // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         ResetStateMachineStatus;                           // 0x0099(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash");
static_assert(sizeof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash) == 0x0000A0, "Wrong size on BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, Speed) == 0x000000, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::Speed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, XYSpeed) == 0x000008, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::XYSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, ZSpeed) == 0x000010, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::ZSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, LastVelocityRot) == 0x000018, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::LastVelocityRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, CharacterRot) == 0x000030, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::CharacterRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, ToTargetRotation) == 0x000048, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::ToTargetRotation' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, DirectionY) == 0x000060, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::DirectionY' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, DirectionZ) == 0x000068, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::DirectionZ' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, NearMoveAlpha) == 0x000070, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::NearMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, BattleMoveAlpha) == 0x000078, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::BattleMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, IsInAir) == 0x000080, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::IsInAir' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, LocomotionStatus) == 0x000081, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::LocomotionStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, ZBurstDashStatus) == 0x000082, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::ZBurstDashStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, SplineComponent) == 0x000088, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::SplineComponent' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, SplineNowDistance) == 0x000090, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::SplineNowDistance' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, IsRequestResetStateMachine) == 0x000098, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::IsRequestResetStateMachine' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash, ResetStateMachineStatus) == 0x000099, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForBurstSmash::ResetStateMachineStatus' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.GetLocomotionParameterForDashUkemi
// 0x0138 (0x0138 - 0x0000)
struct BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        XYSpeed;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZSpeed;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LastVelocityRot;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CharacterRot;                                      // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               ToTargetRotation;                                  // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        DirectionY;                                        // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionZ;                                        // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NearMoveAlpha;                                     // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BattleMoveAlpha;                                   // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInAir;                                           // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Velocity;                                          // 0x0088(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VelocityZ;                                         // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSpeed;                                          // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InputVector;                                       // 0x00B0(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InputZ;                                            // 0x00C0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         LocomotionStatus;                                  // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratDragonDashState                         DragonDashStatus;                                  // 0x00C9(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               DragonDashRotation;                                // 0x00D0(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EKoratDashUkemiState                          DashUkemiStatus;                                   // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratDashUkemiType                           DashUkemiType;                                     // 0x00E9(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsForecastBlowHit;                                 // 0x00EA(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ForecastBlowHitLocation;                           // 0x00F0(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForecastBlowHitTime;                               // 0x0108(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratMapAttributeDataList             ForecastBlowHitMapAttribute;                       // 0x0110(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ForecastBlowHitNormal;                             // 0x0118(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRequestResetStateMachine;                        // 0x0130(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         ResetStateMachineStatus;                           // 0x0131(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi");
static_assert(sizeof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi) == 0x000138, "Wrong size on BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, Speed) == 0x000000, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::Speed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, XYSpeed) == 0x000008, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::XYSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, ZSpeed) == 0x000010, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::ZSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, LastVelocityRot) == 0x000018, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::LastVelocityRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, CharacterRot) == 0x000030, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::CharacterRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, ToTargetRotation) == 0x000048, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::ToTargetRotation' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, DirectionY) == 0x000060, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::DirectionY' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, DirectionZ) == 0x000068, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::DirectionZ' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, NearMoveAlpha) == 0x000070, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::NearMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, BattleMoveAlpha) == 0x000078, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::BattleMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, IsInAir) == 0x000080, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::IsInAir' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, Velocity) == 0x000088, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::Velocity' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, VelocityZ) == 0x0000A0, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::VelocityZ' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, MaxSpeed) == 0x0000A8, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::MaxSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, InputVector) == 0x0000B0, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::InputVector' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, InputZ) == 0x0000C0, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::InputZ' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, LocomotionStatus) == 0x0000C8, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::LocomotionStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, DragonDashStatus) == 0x0000C9, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::DragonDashStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, DragonDashRotation) == 0x0000D0, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::DragonDashRotation' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, DashUkemiStatus) == 0x0000E8, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::DashUkemiStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, DashUkemiType) == 0x0000E9, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::DashUkemiType' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, IsForecastBlowHit) == 0x0000EA, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::IsForecastBlowHit' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, ForecastBlowHitLocation) == 0x0000F0, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::ForecastBlowHitLocation' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, ForecastBlowHitTime) == 0x000108, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::ForecastBlowHitTime' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, ForecastBlowHitMapAttribute) == 0x000110, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::ForecastBlowHitMapAttribute' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, ForecastBlowHitNormal) == 0x000118, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::ForecastBlowHitNormal' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, IsRequestResetStateMachine) == 0x000130, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::IsRequestResetStateMachine' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi, ResetStateMachineStatus) == 0x000131, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUkemi::ResetStateMachineStatus' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.GetLocomotionParameterForDashUpDown
// 0x0088 (0x0088 - 0x0000)
struct BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        XYSpeed;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZSpeed;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LastVelocityRot;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CharacterRot;                                      // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               ToTargetRotation;                                  // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        DirectionY;                                        // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionZ;                                        // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NearMoveAlpha;                                     // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BattleMoveAlpha;                                   // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInAir;                                           // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         LocomotionStatus;                                  // 0x0081(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratDashUpDownState                         DashUpDownStatus;                                  // 0x0082(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratDashUpDownType                          DashUpDownType;                                    // 0x0083(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRequestResetStateMachine;                        // 0x0084(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         ResetStateMachineStatus;                           // 0x0085(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown");
static_assert(sizeof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown) == 0x000088, "Wrong size on BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, Speed) == 0x000000, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::Speed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, XYSpeed) == 0x000008, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::XYSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, ZSpeed) == 0x000010, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::ZSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, LastVelocityRot) == 0x000018, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::LastVelocityRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, CharacterRot) == 0x000030, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::CharacterRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, ToTargetRotation) == 0x000048, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::ToTargetRotation' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, DirectionY) == 0x000060, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::DirectionY' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, DirectionZ) == 0x000068, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::DirectionZ' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, NearMoveAlpha) == 0x000070, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::NearMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, BattleMoveAlpha) == 0x000078, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::BattleMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, IsInAir) == 0x000080, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::IsInAir' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, LocomotionStatus) == 0x000081, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::LocomotionStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, DashUpDownStatus) == 0x000082, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::DashUpDownStatus' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, DashUpDownType) == 0x000083, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::DashUpDownType' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, IsRequestResetStateMachine) == 0x000084, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::IsRequestResetStateMachine' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown, ResetStateMachineStatus) == 0x000085, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForDashUpDown::ResetStateMachineStatus' has a wrong offset!");

// Function BPI_CharacterLocomotion.BPI_CharacterLocomotion_C.GetLocomotionParameterForHighSpeedMove
// 0x0108 (0x0108 - 0x0000)
struct BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        XYSpeed;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZSpeed;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LastVelocityRot;                                   // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CharacterRot;                                      // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               ToTargetRotation;                                  // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        TargetDistance;                                    // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionY;                                        // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirectionZ;                                        // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NearMoveAlpha;                                     // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BattleMoveAlpha;                                   // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNearMode;                                        // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLockOn;                                          // 0x0089(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInAir;                                           // 0x008A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Velocity;                                          // 0x0090(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VelocityZ;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSpeed;                                          // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NearModeSpeed;                                     // 0x00B8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InputVector;                                       // 0x00C0(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InputZ;                                            // 0x00D0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         LocomotionStatus;                                  // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratShortDashState                          ShortDashStatus;                                   // 0x00D9(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ShortDashAdditionalMaxSpeed;                       // 0x00E0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShortDashAdditionalSpeed;                          // 0x00E8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            ShortDashAdditionalSpeedCurve;                     // 0x00F0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ShortDashMoveTimer;                                // 0x00F8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratHighSpeedMoveState                      HighSpeedMoveStatus;                               // 0x0100(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRequestResetStateMachine;                        // 0x0101(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKoratLocomotionState                         ResetStateMachineStatus;                           // 0x0102(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove) == 0x000008, "Wrong alignment on BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove");
static_assert(sizeof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove) == 0x000108, "Wrong size on BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, Speed) == 0x000000, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::Speed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, XYSpeed) == 0x000008, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::XYSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, ZSpeed) == 0x000010, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::ZSpeed' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, LastVelocityRot) == 0x000018, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::LastVelocityRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, CharacterRot) == 0x000030, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::CharacterRot' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, ToTargetRotation) == 0x000048, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::ToTargetRotation' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, TargetDistance) == 0x000060, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::TargetDistance' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, DirectionY) == 0x000068, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::DirectionY' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, DirectionZ) == 0x000070, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::DirectionZ' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, NearMoveAlpha) == 0x000078, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::NearMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, BattleMoveAlpha) == 0x000080, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::BattleMoveAlpha' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, IsNearMode) == 0x000088, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::IsNearMode' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, IsLockOn) == 0x000089, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::IsLockOn' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, IsInAir) == 0x00008A, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::IsInAir' has a wrong offset!");
static_assert(offsetof(BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove, Velocity) == 0x000090, "Member 'BPI_CharacterLocomotion_C_GetLocomotionParameterForHighSpeedMove::Velocity' has a wrong offset!");
