#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_AnimRequestMontage

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_AnimRequestMontage.BPI_AnimRequestMontage_C.AnimNotifyMontageSetReleseSection
// 0x0030 (0x0030 - 0x0000)
struct BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection final
{
public:
	class UAnimSequenceBase*                      AnimSequence;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 NextSection;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NextSectionSparking;                               // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ChargeLevel;                                       // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChargeLevelSparking;                               // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection) == 0x000008, "Wrong alignment on BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection");
static_assert(sizeof(BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection) == 0x000030, "Wrong size on BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection");
static_assert(offsetof(BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection, AnimSequence) == 0x000000, "Member 'BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection::AnimSequence' has a wrong offset!");
static_assert(offsetof(BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection, NextSection) == 0x000008, "Member 'BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection::NextSection' has a wrong offset!");
static_assert(offsetof(BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection, NextSectionSparking) == 0x000018, "Member 'BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection::NextSectionSparking' has a wrong offset!");
static_assert(offsetof(BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection, ChargeLevel) == 0x000028, "Member 'BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection::ChargeLevel' has a wrong offset!");
static_assert(offsetof(BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection, ChargeLevelSparking) == 0x00002C, "Member 'BPI_AnimRequestMontage_C_AnimNotifyMontageSetReleseSection::ChargeLevelSparking' has a wrong offset!");

// Function BPI_AnimRequestMontage.BPI_AnimRequestMontage_C.AnimNotifySetActionCancel
// 0x0001 (0x0001 - 0x0000)
struct BPI_AnimRequestMontage_C_AnimNotifySetActionCancel final
{
public:
	bool                                          AnimNotifySetActionCancel_0;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_AnimRequestMontage_C_AnimNotifySetActionCancel) == 0x000001, "Wrong alignment on BPI_AnimRequestMontage_C_AnimNotifySetActionCancel");
static_assert(sizeof(BPI_AnimRequestMontage_C_AnimNotifySetActionCancel) == 0x000001, "Wrong size on BPI_AnimRequestMontage_C_AnimNotifySetActionCancel");
static_assert(offsetof(BPI_AnimRequestMontage_C_AnimNotifySetActionCancel, AnimNotifySetActionCancel_0) == 0x000000, "Member 'BPI_AnimRequestMontage_C_AnimNotifySetActionCancel::AnimNotifySetActionCancel_0' has a wrong offset!");

// Function BPI_AnimRequestMontage.BPI_AnimRequestMontage_C.GetABPSubRequestMontage
// 0x0008 (0x0008 - 0x0000)
struct BPI_AnimRequestMontage_C_GetABPSubRequestMontage final
{
public:
	class UABP_Sub_RequestMontage_C*              ABPSubRequestMontage;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_AnimRequestMontage_C_GetABPSubRequestMontage) == 0x000008, "Wrong alignment on BPI_AnimRequestMontage_C_GetABPSubRequestMontage");
static_assert(sizeof(BPI_AnimRequestMontage_C_GetABPSubRequestMontage) == 0x000008, "Wrong size on BPI_AnimRequestMontage_C_GetABPSubRequestMontage");
static_assert(offsetof(BPI_AnimRequestMontage_C_GetABPSubRequestMontage, ABPSubRequestMontage) == 0x000000, "Member 'BPI_AnimRequestMontage_C_GetABPSubRequestMontage::ABPSubRequestMontage' has a wrong offset!");

}

