#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPVF_EF_Res_SmokeDeth000

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPVF_EF_Res_SmokeDeth000.BPVF_EF_Res_SmokeDeth000_C.ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000
// 0x0148 (0x0148 - 0x0000)
struct BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0050(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000) == 0x000008, "Wrong alignment on BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000");
static_assert(sizeof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000) == 0x000148, "Wrong size on BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, EntryPoint) == 0x000000, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, CallFunc_MakeRotator_ReturnValue_1) == 0x000038, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000050, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000138, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000140, "Member 'BPVF_EF_Res_SmokeDeth000_C_ExecuteUbergraph_BPVF_EF_Res_SmokeDeth000::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

// Function BPVF_EF_Res_SmokeDeth000.BPVF_EF_Res_SmokeDeth000_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPVF_EF_Res_SmokeDeth000_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPVF_EF_Res_SmokeDeth000_C_ReceiveTick) == 0x000004, "Wrong alignment on BPVF_EF_Res_SmokeDeth000_C_ReceiveTick");
static_assert(sizeof(BPVF_EF_Res_SmokeDeth000_C_ReceiveTick) == 0x000004, "Wrong size on BPVF_EF_Res_SmokeDeth000_C_ReceiveTick");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPVF_EF_Res_SmokeDeth000_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BPVF_EF_Res_SmokeDeth000.BPVF_EF_Res_SmokeDeth000_C.UserConstructionScript
// 0x0138 (0x0138 - 0x0000)
struct BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript final
{
public:
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript) == 0x000008, "Wrong alignment on BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript");
static_assert(sizeof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript) == 0x000138, "Wrong size on BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000008, "Member 'BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000048, "Member 'BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000130, "Member 'BPVF_EF_Res_SmokeDeth000_C_UserConstructionScript::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

}

