#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_IsDerivativeAction

#include "Basic.hpp"

#include "SS_structs.hpp"
#include "BTD_Base_classes.hpp"
#include "EAiDerivedActionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTD_IsDerivativeAction.BTD_IsDerivativeAction_C
// 0x0060 (0x0160 - 0x0100)
class UBTD_IsDerivativeAction_C final : public UBTD_Base_C
{
public:
	EAiDerivedActionType                          ____________;                                      // 0x00F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FKoratActionDataList, EAiDerivedActionType> _____;                                             // 0x0100(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FKoratReplaceTransitionActionDataList  __________;                                        // 0x0150(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	EAiRushDerivedActionType                      ___________0;                                      // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool PerformConditionCheck(class AActor* OwnerActor);
	bool PublicPerformConditionCheck(class AActor* InOwnerActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTD_IsDerivativeAction_C">();
	}
	static class UBTD_IsDerivativeAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_IsDerivativeAction_C>();
	}
};
static_assert(alignof(UBTD_IsDerivativeAction_C) == 0x000008, "Wrong alignment on UBTD_IsDerivativeAction_C");
static_assert(sizeof(UBTD_IsDerivativeAction_C) == 0x000160, "Wrong size on UBTD_IsDerivativeAction_C");
static_assert(offsetof(UBTD_IsDerivativeAction_C, ____________) == 0x0000F9, "Member 'UBTD_IsDerivativeAction_C::____________' has a wrong offset!");
static_assert(offsetof(UBTD_IsDerivativeAction_C, _____) == 0x000100, "Member 'UBTD_IsDerivativeAction_C::_____' has a wrong offset!");
static_assert(offsetof(UBTD_IsDerivativeAction_C, __________) == 0x000150, "Member 'UBTD_IsDerivativeAction_C::__________' has a wrong offset!");
static_assert(offsetof(UBTD_IsDerivativeAction_C, ___________0) == 0x000158, "Member 'UBTD_IsDerivativeAction_C::___________0' has a wrong offset!");

}

