#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_IsGroundDistance

#include "Basic.hpp"

#include "BTD_Base_classes.hpp"
#include "SS_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTD_IsGroundDistance.BTD_IsGroundDistance_C
// 0x0010 (0x0110 - 0x0100)
class UBTD_IsGroundDistance_C final : public UBTD_Base_C
{
public:
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ZerobK_n_U;                                        // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __W__U__K;                                         // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___W;                                              // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool PerformConditionCheck(class AActor* OwnerActor);
	bool PublicPerformConditionCheck(class AActor* InOwnerActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTD_IsGroundDistance_C">();
	}
	static class UBTD_IsGroundDistance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_IsGroundDistance_C>();
	}
};
static_assert(alignof(UBTD_IsGroundDistance_C) == 0x000008, "Wrong alignment on UBTD_IsGroundDistance_C");
static_assert(sizeof(UBTD_IsGroundDistance_C) == 0x000110, "Wrong size on UBTD_IsGroundDistance_C");
static_assert(offsetof(UBTD_IsGroundDistance_C, ZerobK_n_U) == 0x000100, "Member 'UBTD_IsGroundDistance_C::ZerobK_n_U' has a wrong offset!");
static_assert(offsetof(UBTD_IsGroundDistance_C, __W__U__K) == 0x000108, "Member 'UBTD_IsGroundDistance_C::__W__U__K' has a wrong offset!");
static_assert(offsetof(UBTD_IsGroundDistance_C, ___W) == 0x000109, "Member 'UBTD_IsGroundDistance_C::___W' has a wrong offset!");

}

