#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_IsSectionName

#include "Basic.hpp"

#include "BTD_Base_classes.hpp"
#include "SS_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTD_IsSectionName.BTD_IsSectionName_C
// 0x0020 (0x0120 - 0x0100)
class UBTD_IsSectionName_C final : public UBTD_Base_C
{
public:
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ______;                                            // 0x00FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           _________;                                         // 0x0108(0x0010)(Edit, BlueprintVisible)
	bool                                          __n_____K;                                         // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool PerformConditionCheck(class AActor* OwnerActor);
	bool PublicPerformConditionCheck(class AActor* InOwnerActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTD_IsSectionName_C">();
	}
	static class UBTD_IsSectionName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_IsSectionName_C>();
	}
};
static_assert(alignof(UBTD_IsSectionName_C) == 0x000008, "Wrong alignment on UBTD_IsSectionName_C");
static_assert(sizeof(UBTD_IsSectionName_C) == 0x000120, "Wrong size on UBTD_IsSectionName_C");
static_assert(offsetof(UBTD_IsSectionName_C, ______) == 0x0000FC, "Member 'UBTD_IsSectionName_C::______' has a wrong offset!");
static_assert(offsetof(UBTD_IsSectionName_C, _________) == 0x000108, "Member 'UBTD_IsSectionName_C::_________' has a wrong offset!");
static_assert(offsetof(UBTD_IsSectionName_C, __n_____K) == 0x000118, "Member 'UBTD_IsSectionName_C::__n_____K' has a wrong offset!");

}

