#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_BlastImpact

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EAiBlastImpactProcess_structs.hpp"
#include "BTT_ActionCommand_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_BlastImpact.BTT_BlastImpact_C
// 0x0018 (0x0108 - 0x00F0)
class UBTT_BlastImpact_C final : public UBTT_ActionCommand_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BTT_BlastImpact_C;                  // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EAiBlastImpactProcess                         Process;                                           // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimingPartTarget;                                  // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_BlastImpact(int32 EntryPoint);
	void GetTargetMashCount(double* OutTargetMashCount);
	void ReceiveExecuteAI(class AAIController* OwnerController_0, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController_0, class APawn* ControlledPawn, float DeltaSeconds);
	void UpdateBlastImpact(double InDeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_BlastImpact_C">();
	}
	static class UBTT_BlastImpact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_BlastImpact_C>();
	}
};
static_assert(alignof(UBTT_BlastImpact_C) == 0x000008, "Wrong alignment on UBTT_BlastImpact_C");
static_assert(sizeof(UBTT_BlastImpact_C) == 0x000108, "Wrong size on UBTT_BlastImpact_C");
static_assert(offsetof(UBTT_BlastImpact_C, UberGraphFrame_BTT_BlastImpact_C) == 0x0000F0, "Member 'UBTT_BlastImpact_C::UberGraphFrame_BTT_BlastImpact_C' has a wrong offset!");
static_assert(offsetof(UBTT_BlastImpact_C, Process) == 0x0000F8, "Member 'UBTT_BlastImpact_C::Process' has a wrong offset!");
static_assert(offsetof(UBTT_BlastImpact_C, TimingPartTarget) == 0x000100, "Member 'UBTT_BlastImpact_C::TimingPartTarget' has a wrong offset!");

}

