#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_FormChange

#include "Basic.hpp"

#include "SS_structs.hpp"


namespace SDK::Params
{

// Function BTT_FormChange.BTT_FormChange_C.ExecuteUbergraph_BTT_FormChange
// 0x0038 (0x0038 - 0x0000)
struct BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Setup_OutResult;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange) == 0x000008, "Wrong alignment on BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange");
static_assert(sizeof(BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange) == 0x000038, "Wrong size on BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange");
static_assert(offsetof(BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange, EntryPoint) == 0x000000, "Member 'BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange, K2Node_Event_OwnerController_1) == 0x000008, "Member 'BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange, K2Node_Event_ControlledPawn_1) == 0x000010, "Member 'BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange, K2Node_Event_OwnerController) == 0x000020, "Member 'BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange, K2Node_Event_ControlledPawn) == 0x000028, "Member 'BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange, CallFunc_Setup_OutResult) == 0x000030, "Member 'BTT_FormChange_C_ExecuteUbergraph_BTT_FormChange::CallFunc_Setup_OutResult' has a wrong offset!");

// Function BTT_FormChange.BTT_FormChange_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_FormChange_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_FormChange_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_FormChange_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_FormChange_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_FormChange_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_FormChange_C_ReceiveExecuteAI, OwnerController_0) == 0x000000, "Member 'BTT_FormChange_C_ReceiveExecuteAI::OwnerController_0' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_FormChange_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_FormChange.BTT_FormChange_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_FormChange_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_FormChange_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_FormChange_C_ReceiveTickAI");
static_assert(sizeof(BTT_FormChange_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_FormChange_C_ReceiveTickAI");
static_assert(offsetof(BTT_FormChange_C_ReceiveTickAI, OwnerController_0) == 0x000000, "Member 'BTT_FormChange_C_ReceiveTickAI::OwnerController_0' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_FormChange_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_FormChange_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTT_FormChange.BTT_FormChange_C.SetupStartIndex
// 0x0018 (0x0018 - 0x0000)
struct BTT_FormChange_C_SetupStartIndex final
{
public:
	class USSAiPadGenerationComponent*            CallFunc_GetPadGenerationComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESSAiFormChangeType                           CallFunc_GetFormChangeType_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_FormChange_C_SetupStartIndex) == 0x000008, "Wrong alignment on BTT_FormChange_C_SetupStartIndex");
static_assert(sizeof(BTT_FormChange_C_SetupStartIndex) == 0x000018, "Wrong size on BTT_FormChange_C_SetupStartIndex");
static_assert(offsetof(BTT_FormChange_C_SetupStartIndex, CallFunc_GetPadGenerationComponent_ReturnValue) == 0x000000, "Member 'BTT_FormChange_C_SetupStartIndex::CallFunc_GetPadGenerationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_SetupStartIndex, CallFunc_GetFormChangeType_ReturnValue) == 0x000008, "Member 'BTT_FormChange_C_SetupStartIndex::CallFunc_GetFormChangeType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_SetupStartIndex, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'BTT_FormChange_C_SetupStartIndex::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_SetupStartIndex, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BTT_FormChange_C_SetupStartIndex::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FormChange_C_SetupStartIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'BTT_FormChange_C_SetupStartIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

}

