#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ActionCommand

#include "Basic.hpp"

#include "SS_structs.hpp"


namespace SDK::Params
{

// Function BTT_ActionCommand.BTT_ActionCommand_C.ExecuteUbergraph_BTT_ActionCommand
// 0x0080 (0x0080 - 0x0000)
struct BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSBattleAIController*                  K2Node_DynamicCast_AsSSBattle_AIController;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USSAiPadGenerationComponent*            CallFunc_GetPadGenerationComponent_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAiRun_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Setup_OutResult;                          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InputCommand_OutSuccess;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand) == 0x000008, "Wrong alignment on BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand");
static_assert(sizeof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand) == 0x000080, "Wrong size on BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, EntryPoint) == 0x000000, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, K2Node_Event_OwnerController_1) == 0x000008, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, K2Node_Event_ControlledPawn_1) == 0x000010, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, CallFunc_MakeLiteralName_ReturnValue) == 0x00001C, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, K2Node_DynamicCast_AsSSBattle_AIController) == 0x000028, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::K2Node_DynamicCast_AsSSBattle_AIController' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, CallFunc_GetPadGenerationComponent_ReturnValue) == 0x000038, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::CallFunc_GetPadGenerationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, CallFunc_CanAiRun_ReturnValue) == 0x000040, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::CallFunc_CanAiRun_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, K2Node_Event_OwnerController) == 0x000048, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, K2Node_Event_ControlledPawn) == 0x000050, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, CallFunc_Setup_OutResult) == 0x000058, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::CallFunc_Setup_OutResult' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, CallFunc_InputCommand_OutSuccess) == 0x000059, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::CallFunc_InputCommand_OutSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, CallFunc_GetBlackboard_ReturnValue) == 0x000060, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, CallFunc_GetBlackboard_ReturnValue_1) == 0x000068, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, CallFunc_Not_PreBool_ReturnValue) == 0x000070, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000074, "Member 'BTT_ActionCommand_C_ExecuteUbergraph_BTT_ActionCommand::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");

// Function BTT_ActionCommand.BTT_ActionCommand_C.GetRandom
// 0x0008 (0x0008 - 0x0000)
struct BTT_ActionCommand_C_GetRandom final
{
public:
	class USSRandom*                              Random;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ActionCommand_C_GetRandom) == 0x000008, "Wrong alignment on BTT_ActionCommand_C_GetRandom");
static_assert(sizeof(BTT_ActionCommand_C_GetRandom) == 0x000008, "Wrong size on BTT_ActionCommand_C_GetRandom");
static_assert(offsetof(BTT_ActionCommand_C_GetRandom, Random) == 0x000000, "Member 'BTT_ActionCommand_C_GetRandom::Random' has a wrong offset!");

// Function BTT_ActionCommand.BTT_ActionCommand_C.InputCommand
// 0x0020 (0x0020 - 0x0000)
struct BTT_ActionCommand_C_InputCommand final
{
public:
	class FName                                   InCommandId;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutSuccess;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InputIndex;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USSAiPadGenerationComponent*            CallFunc_GetPadGenerationComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InputCommand_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ActionCommand_C_InputCommand) == 0x000008, "Wrong alignment on BTT_ActionCommand_C_InputCommand");
static_assert(sizeof(BTT_ActionCommand_C_InputCommand) == 0x000020, "Wrong size on BTT_ActionCommand_C_InputCommand");
static_assert(offsetof(BTT_ActionCommand_C_InputCommand, InCommandId) == 0x000000, "Member 'BTT_ActionCommand_C_InputCommand::InCommandId' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_InputCommand, OutSuccess) == 0x000008, "Member 'BTT_ActionCommand_C_InputCommand::OutSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_InputCommand, InputIndex) == 0x00000C, "Member 'BTT_ActionCommand_C_InputCommand::InputIndex' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_InputCommand, CallFunc_GetPadGenerationComponent_ReturnValue) == 0x000010, "Member 'BTT_ActionCommand_C_InputCommand::CallFunc_GetPadGenerationComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_InputCommand, CallFunc_InputCommand_ReturnValue) == 0x000018, "Member 'BTT_ActionCommand_C_InputCommand::CallFunc_InputCommand_ReturnValue' has a wrong offset!");

// Function BTT_ActionCommand.BTT_ActionCommand_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ActionCommand_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ActionCommand_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_ActionCommand_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_ActionCommand_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_ActionCommand_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_ActionCommand_C_ReceiveExecuteAI, OwnerController_0) == 0x000000, "Member 'BTT_ActionCommand_C_ReceiveExecuteAI::OwnerController_0' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_ActionCommand_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTT_ActionCommand.BTT_ActionCommand_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTT_ActionCommand_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ActionCommand_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTT_ActionCommand_C_ReceiveTickAI");
static_assert(sizeof(BTT_ActionCommand_C_ReceiveTickAI) == 0x000018, "Wrong size on BTT_ActionCommand_C_ReceiveTickAI");
static_assert(offsetof(BTT_ActionCommand_C_ReceiveTickAI, OwnerController_0) == 0x000000, "Member 'BTT_ActionCommand_C_ReceiveTickAI::OwnerController_0' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTT_ActionCommand_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTT_ActionCommand_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTT_ActionCommand.BTT_ActionCommand_C.Setup
// 0x0050 (0x0050 - 0x0000)
struct BTT_ActionCommand_C_Setup final
{
public:
	class AAIController*                          InOwnerController;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  InControlled_Pawn;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSCharacter*                           K2Node_DynamicCast_AsSSCharacter;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSBattleAIController*                  K2Node_DynamicCast_AsSSBattle_AIController;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USSAiBTDecoratorUtilityComponent*       CallFunc_GetDecoratorUtilityComponent_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_AiBTDecoratorUtilityComponent_C*    K2Node_DynamicCast_AsBP_Ai_BTDecorator_Utility_Component; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ActionCommand_C_Setup) == 0x000008, "Wrong alignment on BTT_ActionCommand_C_Setup");
static_assert(sizeof(BTT_ActionCommand_C_Setup) == 0x000050, "Wrong size on BTT_ActionCommand_C_Setup");
static_assert(offsetof(BTT_ActionCommand_C_Setup, InOwnerController) == 0x000000, "Member 'BTT_ActionCommand_C_Setup::InOwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_Setup, InControlled_Pawn) == 0x000008, "Member 'BTT_ActionCommand_C_Setup::InControlled_Pawn' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_Setup, OutResult) == 0x000010, "Member 'BTT_ActionCommand_C_Setup::OutResult' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_Setup, K2Node_DynamicCast_AsSSCharacter) == 0x000018, "Member 'BTT_ActionCommand_C_Setup::K2Node_DynamicCast_AsSSCharacter' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_Setup, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_ActionCommand_C_Setup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_Setup, K2Node_DynamicCast_AsSSBattle_AIController) == 0x000028, "Member 'BTT_ActionCommand_C_Setup::K2Node_DynamicCast_AsSSBattle_AIController' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_Setup, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BTT_ActionCommand_C_Setup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_Setup, CallFunc_GetDecoratorUtilityComponent_ReturnValue) == 0x000038, "Member 'BTT_ActionCommand_C_Setup::CallFunc_GetDecoratorUtilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_Setup, K2Node_DynamicCast_AsBP_Ai_BTDecorator_Utility_Component) == 0x000040, "Member 'BTT_ActionCommand_C_Setup::K2Node_DynamicCast_AsBP_Ai_BTDecorator_Utility_Component' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_Setup, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'BTT_ActionCommand_C_Setup::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BTT_ActionCommand.BTT_ActionCommand_C.UpdateCommand
// 0x0028 (0x0028 - 0x0000)
struct BTT_ActionCommand_C_UpdateCommand final
{
public:
	class USSAiPadGenerationComponent*            InAiPadGenerationComponent;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESSAiPadGenerationProcess                     CallFunc_GetProcess_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ActionCommand_C_UpdateCommand) == 0x000008, "Wrong alignment on BTT_ActionCommand_C_UpdateCommand");
static_assert(sizeof(BTT_ActionCommand_C_UpdateCommand) == 0x000028, "Wrong size on BTT_ActionCommand_C_UpdateCommand");
static_assert(offsetof(BTT_ActionCommand_C_UpdateCommand, InAiPadGenerationComponent) == 0x000000, "Member 'BTT_ActionCommand_C_UpdateCommand::InAiPadGenerationComponent' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_UpdateCommand, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BTT_ActionCommand_C_UpdateCommand::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_UpdateCommand, CallFunc_GetBlackboard_ReturnValue) == 0x000010, "Member 'BTT_ActionCommand_C_UpdateCommand::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_UpdateCommand, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'BTT_ActionCommand_C_UpdateCommand::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_UpdateCommand, CallFunc_GetProcess_ReturnValue) == 0x000020, "Member 'BTT_ActionCommand_C_UpdateCommand::CallFunc_GetProcess_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActionCommand_C_UpdateCommand, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'BTT_ActionCommand_C_UpdateCommand::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

