#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRBP_FacialRig

#include "Basic.hpp"

#include "CriWareAdxLipSync_structs.hpp"
#include "KoratControlRigExtension_classes.hpp"
#include "RigVM_classes.hpp"
#include "ControlRig_structs.hpp"
#include "SS_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CRBP_FacialRig.CRBP_FacialRig_C
// 0x0148 (0x06B0 - 0x0568)
class UCRBP_FacialRig_C final : public UKoratFacialControlRig
{
public:
	double                                        Disable_lipsync_curve;                             // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        Clench1_Shout1;                                    // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Shout1_Clench1;                                    // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CloseVertical;                                     // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OpenVertical;                                      // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Smile1_Smile2;                                     // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Smile2_Smile1;                                     // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Normal_Smile2;                                     // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        E_Anger1;                                          // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        E_Calm1;                                           // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        E_CloseBothEyes1;                                  // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        E_CloseLeftEye1;                                   // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        E_CloseRightEye1;                                  // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        E_Sad1;                                            // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        E_Surprise1;                                       // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCriLipsMouthInfo                      LipMouthInfo;                                      // 0x05E0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	bool                                          IsPlaying;                                         // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Volume;                                            // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeltaFloat;                                        // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_float;                                        // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FaceMeshValue;                                     // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCriLipsMorphTargetBlendAmountAsJapanese LipAMount;                                         // 0x0614(0x0014)(Edit, BlueprintVisible, NoDestructor)
	double                                        LogVolume;                                         // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_lipsync_bool;                              // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Sum_control_value;                                 // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width;                                             // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Previous_force_vertical;                           // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Previous_vertical;                                 // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Default_vertical_alpha;                            // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Volume_vertical_alpha;                             // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Open_vertical_alpha;                               // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Eye_movement_angle;                                // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Eye_movement_length;                               // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Eye_movement_offset_x;                             // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Eye_movement_offset_y;                             // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Eye_movement_radius;                               // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width_vertical_alpha;                              // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnalyzerStatus;                                    // 0x06A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldAnalyzerStatus;                                 // 0x06A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMaxOpen;                                         // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CRBP_FacialRig_C">();
	}
	static class UCRBP_FacialRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCRBP_FacialRig_C>();
	}
};
static_assert(alignof(UCRBP_FacialRig_C) == 0x000008, "Wrong alignment on UCRBP_FacialRig_C");
static_assert(sizeof(UCRBP_FacialRig_C) == 0x0006B0, "Wrong size on UCRBP_FacialRig_C");
static_assert(offsetof(UCRBP_FacialRig_C, Disable_lipsync_curve) == 0x000568, "Member 'UCRBP_FacialRig_C::Disable_lipsync_curve' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Clench1_Shout1) == 0x000570, "Member 'UCRBP_FacialRig_C::Clench1_Shout1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Shout1_Clench1) == 0x000578, "Member 'UCRBP_FacialRig_C::Shout1_Clench1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, CloseVertical) == 0x000580, "Member 'UCRBP_FacialRig_C::CloseVertical' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, OpenVertical) == 0x000588, "Member 'UCRBP_FacialRig_C::OpenVertical' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Smile1_Smile2) == 0x000590, "Member 'UCRBP_FacialRig_C::Smile1_Smile2' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Smile2_Smile1) == 0x000598, "Member 'UCRBP_FacialRig_C::Smile2_Smile1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Normal_Smile2) == 0x0005A0, "Member 'UCRBP_FacialRig_C::Normal_Smile2' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, E_Anger1) == 0x0005A8, "Member 'UCRBP_FacialRig_C::E_Anger1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, E_Calm1) == 0x0005B0, "Member 'UCRBP_FacialRig_C::E_Calm1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, E_CloseBothEyes1) == 0x0005B8, "Member 'UCRBP_FacialRig_C::E_CloseBothEyes1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, E_CloseLeftEye1) == 0x0005C0, "Member 'UCRBP_FacialRig_C::E_CloseLeftEye1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, E_CloseRightEye1) == 0x0005C8, "Member 'UCRBP_FacialRig_C::E_CloseRightEye1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, E_Sad1) == 0x0005D0, "Member 'UCRBP_FacialRig_C::E_Sad1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, E_Surprise1) == 0x0005D8, "Member 'UCRBP_FacialRig_C::E_Surprise1' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, LipMouthInfo) == 0x0005E0, "Member 'UCRBP_FacialRig_C::LipMouthInfo' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, IsPlaying) == 0x0005F0, "Member 'UCRBP_FacialRig_C::IsPlaying' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Volume) == 0x0005F8, "Member 'UCRBP_FacialRig_C::Volume' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, DeltaFloat) == 0x000600, "Member 'UCRBP_FacialRig_C::DeltaFloat' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Temp_float) == 0x000608, "Member 'UCRBP_FacialRig_C::Temp_float' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, FaceMeshValue) == 0x000610, "Member 'UCRBP_FacialRig_C::FaceMeshValue' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, LipAMount) == 0x000614, "Member 'UCRBP_FacialRig_C::LipAMount' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, LogVolume) == 0x000628, "Member 'UCRBP_FacialRig_C::LogVolume' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Disable_lipsync_bool) == 0x000630, "Member 'UCRBP_FacialRig_C::Disable_lipsync_bool' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Sum_control_value) == 0x000638, "Member 'UCRBP_FacialRig_C::Sum_control_value' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Width) == 0x000640, "Member 'UCRBP_FacialRig_C::Width' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Previous_force_vertical) == 0x000648, "Member 'UCRBP_FacialRig_C::Previous_force_vertical' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Previous_vertical) == 0x000650, "Member 'UCRBP_FacialRig_C::Previous_vertical' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Default_vertical_alpha) == 0x000658, "Member 'UCRBP_FacialRig_C::Default_vertical_alpha' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Volume_vertical_alpha) == 0x000660, "Member 'UCRBP_FacialRig_C::Volume_vertical_alpha' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Open_vertical_alpha) == 0x000668, "Member 'UCRBP_FacialRig_C::Open_vertical_alpha' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Eye_movement_angle) == 0x000670, "Member 'UCRBP_FacialRig_C::Eye_movement_angle' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Eye_movement_length) == 0x000678, "Member 'UCRBP_FacialRig_C::Eye_movement_length' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Eye_movement_offset_x) == 0x000680, "Member 'UCRBP_FacialRig_C::Eye_movement_offset_x' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Eye_movement_offset_y) == 0x000688, "Member 'UCRBP_FacialRig_C::Eye_movement_offset_y' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Eye_movement_radius) == 0x000690, "Member 'UCRBP_FacialRig_C::Eye_movement_radius' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, Width_vertical_alpha) == 0x000698, "Member 'UCRBP_FacialRig_C::Width_vertical_alpha' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, AnalyzerStatus) == 0x0006A0, "Member 'UCRBP_FacialRig_C::AnalyzerStatus' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, OldAnalyzerStatus) == 0x0006A4, "Member 'UCRBP_FacialRig_C::OldAnalyzerStatus' has a wrong offset!");
static_assert(offsetof(UCRBP_FacialRig_C, IsMaxOpen) == 0x0006A8, "Member 'UCRBP_FacialRig_C::IsMaxOpen' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass CRBP_FacialRig.RigVMMemory_Literal
// 0x0188 (0x01B0 - 0x0028)
class CRBP_FacialRig::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	float                                         RigVMModel___MathFloatMul_5_1_1_1_B__Const;        // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatGreaterEqual_1_B__Const;     // 0x002C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatLessEqual_1_1_B__Const;      // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___VariableNode_14_Value__Const : 1;     // 0x0034(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_34_1 : 7;                                   // 0x0034(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         RigVMModel___VariableNode_14_1_Value__Const : 1;   // 0x0035(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatClamp_4_5_Maximum__Const;    // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetControlFloat_Control__Const;       // 0x003C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigUnit_GetControlBool_1_1_2_Control__Const; // 0x0044(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___MathVectorSub_1_A__Const;             // 0x0050(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_15_Curve__Const;        // 0x0068(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_1_Control__Const; // 0x0070(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigUnit_GetControlVector2D_2_Control__Const; // 0x0078(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_15_1_1_1_Curve__Const;  // 0x0080(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorMirror_Normal__Const;       // 0x0088(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_15_1_1_2_Curve__Const;  // 0x00A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigUnit_GetControlVector2D_2_1_Control__Const; // 0x00A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_15_1_1_1_1_2_1_Curve__Const; // 0x00B0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___If_6_True__Const;                     // 0x00B8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_15_1_1_1_1_1_1_Curve__Const; // 0x00BC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_5_Curve__Const;         // 0x00C4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigUnit_GetControlVector2D_Control__Const; // 0x00CC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_6_Curve__Const;         // 0x00D4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetControlFloat_3_Control__Const;     // 0x00DC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___VariableNode_11_Value__Const;         // 0x00E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___CollectionChildren_Parent__Const;     // 0x00F0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigElementType                               RigVMModel___CollectionChildren_TypeToSearch__Const; // 0x00FC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___VariableNode_9_Value__Const;          // 0x0100(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetCurveValue_Curve__Const;           // 0x0108(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetTransform_1_Item__Const;           // 0x0110(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigVMModel___SetTransform_1_Space__Const;          // 0x011C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___ProjectTransformToNewParent_1_NewParent__Const; // 0x0120(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetControlOffset_3_Control__Const;    // 0x012C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0xC];                                      // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___SetControlOffset_3_Offset__Const;     // 0x0140(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_Item__Const;   // 0x01A0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass CRBP_FacialRig.RigVMMemory_Literal", true>();
	}
	static class CRBP_FacialRig::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<CRBP_FacialRig::URigVMMemory_Literal>();
	}
};
static_assert(alignof(CRBP_FacialRig::URigVMMemory_Literal) == 0x000010, "Wrong alignment on CRBP_FacialRig::URigVMMemory_Literal");
static_assert(sizeof(CRBP_FacialRig::URigVMMemory_Literal) == 0x0001B0, "Wrong size on CRBP_FacialRig::URigVMMemory_Literal");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___MathFloatMul_5_1_1_1_B__Const) == 0x000028, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___MathFloatMul_5_1_1_1_B__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___MathFloatGreaterEqual_1_B__Const) == 0x00002C, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___MathFloatGreaterEqual_1_B__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___MathFloatLessEqual_1_1_B__Const) == 0x000030, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___MathFloatLessEqual_1_1_B__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___MathFloatClamp_4_5_Maximum__Const) == 0x000038, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___MathFloatClamp_4_5_Maximum__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetControlFloat_Control__Const) == 0x00003C, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetControlFloat_Control__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___RigUnit_GetControlBool_1_1_2_Control__Const) == 0x000044, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___RigUnit_GetControlBool_1_1_2_Control__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___MathVectorSub_1_A__Const) == 0x000050, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___MathVectorSub_1_A__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetCurveValue_15_Curve__Const) == 0x000068, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetCurveValue_15_Curve__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_1_Control__Const) == 0x000070, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_1_Control__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___RigUnit_GetControlVector2D_2_Control__Const) == 0x000078, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___RigUnit_GetControlVector2D_2_Control__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetCurveValue_15_1_1_1_Curve__Const) == 0x000080, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetCurveValue_15_1_1_1_Curve__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___MathVectorMirror_Normal__Const) == 0x000088, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___MathVectorMirror_Normal__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetCurveValue_15_1_1_2_Curve__Const) == 0x0000A0, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetCurveValue_15_1_1_2_Curve__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___RigUnit_GetControlVector2D_2_1_Control__Const) == 0x0000A8, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___RigUnit_GetControlVector2D_2_1_Control__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetCurveValue_15_1_1_1_1_2_1_Curve__Const) == 0x0000B0, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetCurveValue_15_1_1_1_1_2_1_Curve__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___If_6_True__Const) == 0x0000B8, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___If_6_True__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetCurveValue_15_1_1_1_1_1_1_Curve__Const) == 0x0000BC, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetCurveValue_15_1_1_1_1_1_1_Curve__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetCurveValue_5_Curve__Const) == 0x0000C4, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetCurveValue_5_Curve__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___RigUnit_GetControlVector2D_Control__Const) == 0x0000CC, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___RigUnit_GetControlVector2D_Control__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetCurveValue_6_Curve__Const) == 0x0000D4, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetCurveValue_6_Curve__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___GetControlFloat_3_Control__Const) == 0x0000DC, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___GetControlFloat_3_Control__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___VariableNode_11_Value__Const) == 0x0000E8, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___VariableNode_11_Value__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___CollectionChildren_Parent__Const) == 0x0000F0, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___CollectionChildren_Parent__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___CollectionChildren_TypeToSearch__Const) == 0x0000FC, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___CollectionChildren_TypeToSearch__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___VariableNode_9_Value__Const) == 0x000100, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___VariableNode_9_Value__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetCurveValue_Curve__Const) == 0x000108, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetCurveValue_Curve__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetTransform_1_Item__Const) == 0x000110, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetTransform_1_Space__Const) == 0x00011C, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetTransform_1_Space__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___ProjectTransformToNewParent_1_NewParent__Const) == 0x000120, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___ProjectTransformToNewParent_1_NewParent__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetControlOffset_3_Control__Const) == 0x00012C, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetControlOffset_3_Control__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___SetControlOffset_3_Offset__Const) == 0x000140, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___SetControlOffset_3_Offset__Const' has a wrong offset!");
static_assert(offsetof(CRBP_FacialRig::URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_1_Item__Const) == 0x0001A0, "Member 'CRBP_FacialRig::URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_1_Item__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass CRBP_FacialRig.RigVMMemory_Work
// 0x0ED8 (0x0F00 - 0x0028)
class CRBP_FacialRig::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0028(0x0038)(Edit, EditConst, NonTransactional)
	uint8                                         RigVMModel___MathBoolNot_2_Result : 1;             // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatAdd_2_3_Result;              // 0x0064(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatAdd_2_3_A;                   // 0x0068(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_5_1_1_1_Result;          // 0x006C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetDeltaTime_1_1_1_1_Result;          // 0x0070(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_1_Result;                // 0x0074(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_1_A;                     // 0x0078(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_5_1_1_1_1_Result;        // 0x007C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetDeltaTime_1_1_1_1_1_Result;        // 0x0080(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_1_1_Result;              // 0x0084(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_1_1_A;                   // 0x0088(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_5_1_1_1_1_1_Result;      // 0x008C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetDeltaTime_1_1_1_1_1_1_Result;      // 0x0090(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___MathBoolOr_1_Result : 1;              // 0x0094(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_94_1 : 7;                                   // 0x0094(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         RigVMModel___MathFloatGreaterEqual_1_Result : 1;   // 0x0095(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatGreaterEqual_1_A;            // 0x0098(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___MathFloatLessEqual_1_1_Result : 1;    // 0x009C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatLessEqual_1_1_A;             // 0x00A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_2_2_Result;              // 0x00A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_2_2_A;                   // 0x00A8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_5_1_1_1_2_Result;        // 0x00AC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetDeltaTime_1_1_1_1_2_Result;        // 0x00B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatAdd_5_Result;                // 0x00B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatAdd_5_A;                     // 0x00B8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_5_1_1_1_1_2_Result;      // 0x00BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetDeltaTime_1_1_1_1_1_2_Result;      // 0x00C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_1_1_1_Result;            // 0x00C4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_1_1_1_A;                 // 0x00C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_5_1_1_1_1_1_1_Result;    // 0x00CC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetDeltaTime_1_1_1_1_1_1_1_Result;    // 0x00D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMStructNode_0_Result;             // 0x00D4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMStructNode_0_A;                  // 0x00D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_5_1_1_1_2_1_Result;      // 0x00DC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetDeltaTime_1_1_1_1_2_1_Result;      // 0x00E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_2_1_2_Result;            // 0x00E4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSub_2_1_2_A;                 // 0x00E8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_5_1_1_1_1_2_1_Result;    // 0x00EC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetDeltaTime_1_1_1_1_1_2_1_Result;    // 0x00F0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatAdd_5_1_Result;              // 0x00F4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatAdd_5_1_A;                   // 0x00F8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_5_1_1_1_1_1_1_1_Result;  // 0x00FC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetDeltaTime_1_1_1_1_1_1_1_1_Result;  // 0x0100(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_4_5_Result;            // 0x0104(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_4_5_Value;             // 0x0108(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_4_1_5_Result;          // 0x010C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_4_1_5_Value;           // 0x0110(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_4_2_1_Result;          // 0x0114(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_4_2_1_Value;           // 0x0118(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___If_7_Result;                          // 0x011C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___If_7_Condition : 1;                   // 0x0120(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___If_7_True;                            // 0x0124(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetControlFloat_5_FloatValue;         // 0x0128(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetControlFloat_5_Minimum;            // 0x012C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetControlFloat_5_Maximum;            // 0x0130(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___GetControlFloat_5_CachedControlIndex; // 0x0138(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___SetControlFloat_CachedControlIndex;   // 0x0148(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___MathFloatAdd_3_Result;                // 0x0158(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_6_Result;                // 0x015C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRemap_1_Result;              // 0x0160(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRemap_1_Value;               // 0x0164(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_6_B;                     // 0x0168(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_6_1_1_Result;            // 0x016C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_6_1_1_A;                 // 0x0170(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRemap_3_Result;              // 0x0174(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatClamp_Result;                // 0x0178(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_GetControlFloat_36_1_1_1_1_1_1_FloatValue; // 0x017C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_GetControlFloat_36_1_1_1_1_1_1_Minimum; // 0x0180(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_GetControlFloat_36_1_1_1_1_1_1_Maximum; // 0x0184(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetControlFloat_36_1_1_1_1_1_1_CachedControlIndex; // 0x0188(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___MathFloatAdd_3_1_Result;              // 0x0198(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_6_2_Result;              // 0x019C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_6_2_A;                   // 0x01A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_6_2_B;                   // 0x01A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_6_1_Result;              // 0x01A8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMul_6_1_A;                   // 0x01AC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___RigUnit_GetControlBool_1_1_2_BoolValue : 1; // 0x01B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetControlBool_1_1_2_CachedControlIndex; // 0x01B8(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___MathVectorUnit_4_Result;              // 0x01C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatCos_2_1_Result;              // 0x01E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRad_Result;                  // 0x01E4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRad_Value;                   // 0x01E8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatSin_4_1_1_Result;            // 0x01EC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorUnit_4_Value__IO;           // 0x01F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorAdd_4_Result;               // 0x0208(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorAdd_Result;                 // 0x0220(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorScale_1_Result;             // 0x0238(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorUnit_1_Result;              // 0x0250(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorSub_1_Result;               // 0x0268(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_1_Vector; // 0x0280(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_1_Minimum; // 0x0290(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_1_Maximum; // 0x02A0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_1_CachedControlIndex; // 0x02B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___MathVectorSub_1_A__IO;                // 0x02C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___If_9_Result;                          // 0x02D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___MathFloatLess_3_Result : 1;           // 0x02F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathVectorDot_1_Result;               // 0x02F4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorSub_Result;                 // 0x02F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_2_Vector; // 0x0310(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_2_Minimum; // 0x0320(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_2_Maximum; // 0x0330(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_2_CachedControlIndex; // 0x0340(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___MathVectorSub_A__IO;                  // 0x0350(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorSub_B__IO;                  // 0x0368(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___If_9_True__IO;                        // 0x0380(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___If_9_1_Result;                        // 0x0398(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___MathFloatGreater_Result : 1;          // 0x03B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathVectorDot_1_1_Result;             // 0x03B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorSub_2_Result;               // 0x03B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_2_1_Vector; // 0x03D0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_2_1_Minimum; // 0x03E0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_2_1_Maximum; // 0x03F0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetControlVector2D_1_1_1_1_1_2_1_CachedControlIndex; // 0x0400(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___MathVectorSub_2_A__IO;                // 0x0410(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorAdd_1_Result;               // 0x0428(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathVectorScale_3_Result;             // 0x0440(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
