#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FRequestAnimData

#include "Basic.hpp"

#include "EAnimEventType_structs.hpp"


namespace SDK
{

// UserDefinedStruct FRequestAnimData.FRequestAnimData
// 0x0038 (0x0038 - 0x0000)
struct FFRequestAnimData final
{
public:
	class UAnimSequenceBase*                      ________4_8961C4364EB752B8E0484F9CA62F63BA;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           _______18_25EBD7EC451899E7A435989F664B9C0A;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ____10_520E64114661852FEB84C6AEB8527691;           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ______27_D889F7A141992BB2AF279DBFBEDBA76D;         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EAnimEventType                                ___n___25_22D218064A724BF6B685FCB1F1CC4E55;        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         _________32_0554E0244A15B9348B3AC79BBE248BD9;      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFRequestAnimData) == 0x000008, "Wrong alignment on FFRequestAnimData");
static_assert(sizeof(FFRequestAnimData) == 0x000038, "Wrong size on FFRequestAnimData");
static_assert(offsetof(FFRequestAnimData, ________4_8961C4364EB752B8E0484F9CA62F63BA) == 0x000000, "Member 'FFRequestAnimData::________4_8961C4364EB752B8E0484F9CA62F63BA' has a wrong offset!");
static_assert(offsetof(FFRequestAnimData, _______18_25EBD7EC451899E7A435989F664B9C0A) == 0x000008, "Member 'FFRequestAnimData::_______18_25EBD7EC451899E7A435989F664B9C0A' has a wrong offset!");
static_assert(offsetof(FFRequestAnimData, ____10_520E64114661852FEB84C6AEB8527691) == 0x000010, "Member 'FFRequestAnimData::____10_520E64114661852FEB84C6AEB8527691' has a wrong offset!");
static_assert(offsetof(FFRequestAnimData, ______27_D889F7A141992BB2AF279DBFBEDBA76D) == 0x000018, "Member 'FFRequestAnimData::______27_D889F7A141992BB2AF279DBFBEDBA76D' has a wrong offset!");
static_assert(offsetof(FFRequestAnimData, ___n___25_22D218064A724BF6B685FCB1F1CC4E55) == 0x000028, "Member 'FFRequestAnimData::___n___25_22D218064A724BF6B685FCB1F1CC4E55' has a wrong offset!");
static_assert(offsetof(FFRequestAnimData, _________32_0554E0244A15B9348B3AC79BBE248BD9) == 0x000030, "Member 'FFRequestAnimData::_________32_0554E0244A15B9348B3AC79BBE248BD9' has a wrong offset!");

}

