#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KoratUDS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "KoratUDS_structs.hpp"


namespace SDK::Params
{

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.AbsentDirectionalLightsBrightness
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_AbsentDirectionalLightsBrightness final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_AbsentDirectionalLightsBrightness) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_AbsentDirectionalLightsBrightness");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_AbsentDirectionalLightsBrightness) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_AbsentDirectionalLightsBrightness");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_AbsentDirectionalLightsBrightness, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_AbsentDirectionalLightsBrightness::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.AdjustColorForNightBrightness
// 0x0020 (0x0020 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_AdjustColorForNightBrightness final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_AdjustColorForNightBrightness) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_AdjustColorForNightBrightness");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_AdjustColorForNightBrightness) == 0x000020, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_AdjustColorForNightBrightness");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_AdjustColorForNightBrightness, InColor) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_AdjustColorForNightBrightness::InColor' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_AdjustColorForNightBrightness, ReturnValue) == 0x000010, "Member 'KoratUDS_Ultra_Dynamic_Sky_AdjustColorForNightBrightness::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.AdjustedExposureRange
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_AdjustedExposureRange final
{
public:
	double                                        OutMin;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutMax;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_AdjustedExposureRange) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_AdjustedExposureRange");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_AdjustedExposureRange) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_AdjustedExposureRange");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_AdjustedExposureRange, OutMin) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_AdjustedExposureRange::OutMin' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_AdjustedExposureRange, OutMax) == 0x000008, "Member 'KoratUDS_Ultra_Dynamic_Sky_AdjustedExposureRange::OutMax' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.AllVolumetricCloudMIDs
// 0x0018 (0x0018 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_AllVolumetricCloudMIDs final
{
public:
	bool                                          Shadows;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_AllVolumetricCloudMIDs) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_AllVolumetricCloudMIDs");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_AllVolumetricCloudMIDs) == 0x000018, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_AllVolumetricCloudMIDs");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_AllVolumetricCloudMIDs, Shadows) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_AllVolumetricCloudMIDs::Shadows' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_AllVolumetricCloudMIDs, ReturnValue) == 0x000008, "Member 'KoratUDS_Ultra_Dynamic_Sky_AllVolumetricCloudMIDs::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.ApplyConsoleVariableWithCheck
// 0x0020 (0x0020 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck final
{
public:
	class FString                                 Cvar;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Setting;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck) == 0x000020, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck, Cvar) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck::Cvar' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck, Setting) == 0x000010, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck::Setting' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck, Type) == 0x000018, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApplyConsoleVariableWithCheck::Type' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.ApplyVolumetricMode
// 0x0001 (0x0001 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_ApplyVolumetricMode final
{
public:
	EKoratUDS_UDS_VolRT_Mode                      Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_ApplyVolumetricMode) == 0x000001, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_ApplyVolumetricMode");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_ApplyVolumetricMode) == 0x000001, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_ApplyVolumetricMode");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApplyVolumetricMode, Mode) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApplyVolumetricMode::Mode' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.ApproximateRealSunMoonAndStars
// 0x0090 (0x0090 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars final
{
public:
	int32                                         Month_;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Day_;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Year_;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeOfDay_;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TimeZone_;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyCalculateSun;                                  // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutSunVector;                                      // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutMoonVector;                                     // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutRealPhase;                                      // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutPhaseAlignment;                                 // 0x0060(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutCelestialOrbit;                                 // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutCelestialYaw;                                   // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars) == 0x000090, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, Month_) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::Month_' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, Day_) == 0x000004, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::Day_' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, Year_) == 0x000008, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::Year_' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, TimeOfDay_) == 0x000010, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::TimeOfDay_' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, TimeZone_) == 0x000018, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::TimeZone_' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, OnlyCalculateSun) == 0x000020, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::OnlyCalculateSun' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, OutSunVector) == 0x000028, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::OutSunVector' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, OutMoonVector) == 0x000040, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::OutMoonVector' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, OutRealPhase) == 0x000058, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::OutRealPhase' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, OutPhaseAlignment) == 0x000060, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::OutPhaseAlignment' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, OutCelestialOrbit) == 0x000078, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::OutCelestialOrbit' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars, OutCelestialYaw) == 0x000080, "Member 'KoratUDS_Ultra_Dynamic_Sky_ApproximateRealSunMoonAndStars::OutCelestialYaw' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CalculateNightBrightness
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CalculateNightBrightness final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CalculateNightBrightness) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CalculateNightBrightness");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CalculateNightBrightness) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CalculateNightBrightness");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CalculateNightBrightness, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CalculateNightBrightness::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CancelShadowsValue
// 0x0020 (0x0020 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CancelShadowsValue final
{
public:
	struct FVector                                LightVector;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CancelShadowsValue) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CancelShadowsValue");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CancelShadowsValue) == 0x000020, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CancelShadowsValue");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CancelShadowsValue, LightVector) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CancelShadowsValue::LightVector' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CancelShadowsValue, ReturnValue) == 0x000018, "Member 'KoratUDS_Ultra_Dynamic_Sky_CancelShadowsValue::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CloudCoverageHasChanged
// 0x0001 (0x0001 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CloudCoverageHasChanged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CloudCoverageHasChanged) == 0x000001, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CloudCoverageHasChanged");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CloudCoverageHasChanged) == 0x000001, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CloudCoverageHasChanged");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CloudCoverageHasChanged, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CloudCoverageHasChanged::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CloudDarkening
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CloudDarkening final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CloudDarkening) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CloudDarkening");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CloudDarkening) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CloudDarkening");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CloudDarkening, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CloudDarkening::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CloudShadowsCloudDensity
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CloudShadowsCloudDensity final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsCloudDensity) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CloudShadowsCloudDensity");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsCloudDensity) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CloudShadowsCloudDensity");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsCloudDensity, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CloudShadowsCloudDensity::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CloudShadowsLightVectorProcess
// 0x0028 (0x0028 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CloudShadowsLightVectorProcess final
{
public:
	struct FVector                                Vector;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsLightVectorProcess) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CloudShadowsLightVectorProcess");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsLightVectorProcess) == 0x000028, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CloudShadowsLightVectorProcess");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsLightVectorProcess, Vector) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CloudShadowsLightVectorProcess::Vector' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsLightVectorProcess, ReturnValue) == 0x000018, "Member 'KoratUDS_Ultra_Dynamic_Sky_CloudShadowsLightVectorProcess::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CloudShadowsParentMaterial
// 0x0030 (0x0030 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CloudShadowsParentMaterial final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsParentMaterial) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CloudShadowsParentMaterial");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsParentMaterial) == 0x000030, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CloudShadowsParentMaterial");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CloudShadowsParentMaterial, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CloudShadowsParentMaterial::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CloudsTimeOfDayFactor
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CloudsTimeOfDayFactor final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CloudsTimeOfDayFactor) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CloudsTimeOfDayFactor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CloudsTimeOfDayFactor) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CloudsTimeOfDayFactor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CloudsTimeOfDayFactor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CloudsTimeOfDayFactor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CloudTextureVelocity
// 0x0018 (0x0018 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CloudTextureVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CloudTextureVelocity) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CloudTextureVelocity");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CloudTextureVelocity) == 0x000018, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CloudTextureVelocity");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CloudTextureVelocity, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CloudTextureVelocity::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.ConstructionScriptFunction
// 0x0002 (0x0002 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_ConstructionScriptFunction final
{
public:
	bool                                          RunByCounterpart;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveStaticLights;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_ConstructionScriptFunction) == 0x000001, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_ConstructionScriptFunction");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_ConstructionScriptFunction) == 0x000002, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_ConstructionScriptFunction");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ConstructionScriptFunction, RunByCounterpart) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_ConstructionScriptFunction::RunByCounterpart' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ConstructionScriptFunction, MoveStaticLights) == 0x000001, "Member 'KoratUDS_Ultra_Dynamic_Sky_ConstructionScriptFunction::MoveStaticLights' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.ConvertTimeOfDayToTimeCode
// 0x0020 (0x0020 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_ConvertTimeOfDayToTimeCode final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimecode                              ReturnValue;                                       // 0x0008(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_ConvertTimeOfDayToTimeCode) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_ConvertTimeOfDayToTimeCode");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_ConvertTimeOfDayToTimeCode) == 0x000020, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_ConvertTimeOfDayToTimeCode");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ConvertTimeOfDayToTimeCode, Time) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_ConvertTimeOfDayToTimeCode::Time' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_ConvertTimeOfDayToTimeCode, ReturnValue) == 0x000008, "Member 'KoratUDS_Ultra_Dynamic_Sky_ConvertTimeOfDayToTimeCode::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.Current2DCloudTint
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_Current2DCloudTint final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_Current2DCloudTint) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_Current2DCloudTint");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_Current2DCloudTint) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_Current2DCloudTint");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_Current2DCloudTint, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_Current2DCloudTint::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentAppliedCloudTopAndBottom
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentAppliedCloudTopAndBottom final
{
public:
	double                                        OutBottom;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutTop;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentAppliedCloudTopAndBottom) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentAppliedCloudTopAndBottom");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentAppliedCloudTopAndBottom) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentAppliedCloudTopAndBottom");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentAppliedCloudTopAndBottom, OutBottom) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentAppliedCloudTopAndBottom::OutBottom' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentAppliedCloudTopAndBottom, OutTop) == 0x000008, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentAppliedCloudTopAndBottom::OutTop' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentBaseCloudsScale
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentBaseCloudsScale final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentBaseCloudsScale) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentBaseCloudsScale");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentBaseCloudsScale) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentBaseCloudsScale");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentBaseCloudsScale, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentBaseCloudsScale::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentFogDensity
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentFogDensity final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentFogDensity) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentFogDensity");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentFogDensity) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentFogDensity");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentFogDensity, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentFogDensity::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentFogDirectionalInscatteringColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentFogDirectionalInscatteringColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentFogDirectionalInscatteringColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentFogDirectionalInscatteringColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentFogDirectionalInscatteringColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentFogDirectionalInscatteringColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentFogDirectionalInscatteringColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentFogDirectionalInscatteringColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentFogInscatteringColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentFogInscatteringColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentFogInscatteringColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentFogInscatteringColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentFogInscatteringColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentFogInscatteringColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentFogInscatteringColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentFogInscatteringColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentLensFlareColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentLensFlareColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentLensFlareColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentLensFlareColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentLensFlareColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentLensFlareColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentLensFlareColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentLensFlareColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentLerpToSimplifiedClouds
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentLerpToSimplifiedClouds final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentLerpToSimplifiedClouds) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentLerpToSimplifiedClouds");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentLerpToSimplifiedClouds) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentLerpToSimplifiedClouds");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentLerpToSimplifiedClouds, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentLerpToSimplifiedClouds::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentLightPollution
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentLightPollution final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentLightPollution) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentLightPollution");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentLightPollution) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentLightPollution");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentLightPollution, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentLightPollution::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentLitIntensity
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentLitIntensity final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentLitIntensity) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentLitIntensity");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentLitIntensity) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentLitIntensity");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentLitIntensity, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentLitIntensity::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMaxTraceDistance
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMaxTraceDistance final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMaxTraceDistance) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMaxTraceDistance");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMaxTraceDistance) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMaxTraceDistance");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMaxTraceDistance, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMaxTraceDistance::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMieAnisotropy
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMieAnisotropy final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMieAnisotropy) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMieAnisotropy");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMieAnisotropy) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMieAnisotropy");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMieAnisotropy, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMieAnisotropy::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMieScatteringScale
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMieScatteringScale final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMieScatteringScale) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMieScatteringScale");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMieScatteringScale) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMieScatteringScale");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMieScatteringScale, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMieScatteringScale::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMoonLightColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMoonLightMaterialColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightMaterialColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightMaterialColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightMaterialColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightMaterialColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightMaterialColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightMaterialColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLightMaterialColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMoonLitPercent
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLitPercent final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLitPercent) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLitPercent");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLitPercent) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLitPercent");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLitPercent, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMoonLitPercent::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMoonMaterialIntensity
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMoonMaterialIntensity final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonMaterialIntensity) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonMaterialIntensity");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonMaterialIntensity) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonMaterialIntensity");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonMaterialIntensity, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMoonMaterialIntensity::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMoonPhaseAngle
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMoonPhaseAngle final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonPhaseAngle) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonPhaseAngle");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonPhaseAngle) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonPhaseAngle");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonPhaseAngle, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMoonPhaseAngle::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMoonScaleAndCutoutValue
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMoonScaleAndCutoutValue final
{
public:
	double                                        OutScale;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutCutout;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonScaleAndCutoutValue) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonScaleAndCutoutValue");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonScaleAndCutoutValue) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonScaleAndCutoutValue");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonScaleAndCutoutValue, OutScale) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMoonScaleAndCutoutValue::OutScale' has a wrong offset!");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonScaleAndCutoutValue, OutCutout) == 0x000008, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMoonScaleAndCutoutValue::OutCutout' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentMoonSourceAngle
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentMoonSourceAngle final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonSourceAngle) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonSourceAngle");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonSourceAngle) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentMoonSourceAngle");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentMoonSourceAngle, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentMoonSourceAngle::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentNightSkyGlow
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentNightSkyGlow final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentNightSkyGlow) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentNightSkyGlow");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentNightSkyGlow) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentNightSkyGlow");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentNightSkyGlow, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentNightSkyGlow::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentOverallIntensity
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentOverallIntensity final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentOverallIntensity) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentOverallIntensity");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentOverallIntensity) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentOverallIntensity");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentOverallIntensity, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentOverallIntensity::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentOvercastSwirl
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentOvercastSwirl final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentOvercastSwirl) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentOvercastSwirl");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentOvercastSwirl) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentOvercastSwirl");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentOvercastSwirl, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentOvercastSwirl::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentRayleighScatteringColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentRayleighScatteringColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentRayleighScatteringColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentRayleighScatteringColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentRayleighScatteringColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentRayleighScatteringColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentRayleighScatteringColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentRayleighScatteringColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSaturation
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSaturation final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentSaturation) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentSaturation");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentSaturation) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentSaturation");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentSaturation, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentSaturation::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSkyAmbientColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSkyAmbientColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentSkyAmbientColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentSkyAmbientColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentSkyAmbientColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentSkyAmbientColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentSkyAmbientColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentSkyAmbientColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSkyLightLowerHemisphereColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSkyLightLowerHemisphereColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentSkyLightLowerHemisphereColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentSkyLightLowerHemisphereColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentSkyLightLowerHemisphereColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentSkyLightLowerHemisphereColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentSkyLightLowerHemisphereColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentSkyLightLowerHemisphereColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentStarsColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentStarsColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentStarsColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentStarsColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentStarsColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentStarsColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentStarsColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentStarsColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSunDiskColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSunDiskIntensity
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskIntensity final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskIntensity) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskIntensity");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskIntensity) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskIntensity");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskIntensity, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentSunDiskIntensity::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSunLightColor
// 0x0010 (0x0010 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightColor) == 0x000004, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightColor");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightColor) == 0x000010, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightColor");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightColor, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightColor::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSunLightIntensity
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightIntensity final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightIntensity) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightIntensity");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightIntensity) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightIntensity");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightIntensity, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentSunLightIntensity::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSunRadius
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSunRadius final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunRadius) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentSunRadius");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunRadius) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentSunRadius");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunRadius, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentSunRadius::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSunriseEventTime
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSunriseEventTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunriseEventTime) == 0x000008, "Wrong alignment on KoratUDS_Ultra_Dynamic_Sky_CurrentSunriseEventTime");
static_assert(sizeof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunriseEventTime) == 0x000008, "Wrong size on KoratUDS_Ultra_Dynamic_Sky_CurrentSunriseEventTime");
static_assert(offsetof(KoratUDS_Ultra_Dynamic_Sky_CurrentSunriseEventTime, ReturnValue) == 0x000000, "Member 'KoratUDS_Ultra_Dynamic_Sky_CurrentSunriseEventTime::ReturnValue' has a wrong offset!");

// Function KoratUDS.KoratUDS_Ultra_Dynamic_Sky.CurrentSunsetEventTime
// 0x0008 (0x0008 - 0x0000)
struct KoratUDS_Ultra_Dynamic_Sky_CurrentSunsetEventTime final
{
public:
