#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostABP_0000_40_00_CLT_00

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_SOLimit_structs.hpp"
#include "SS_structs.hpp"
#include "SS_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ST_SleeveCorrection_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PostABP_0000_40_00_CLT_00.PostABP_0000_40_00_CLT_00_C
// 0x1480 (0x17F0 - 0x0370)
class UPostABP_0000_40_00_CLT_00_C final : public USSAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x03A8(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x0580(0x0470)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x09F0(0x0470)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0E60(0x0470)()
	struct FST_SOLimit                            __CustomProperty_SOLimit_TROUSERS_NORMAL_E273461344349650FC957FA90D7A20F7; // 0x12D0(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_SOLimit                            __CustomProperty_SOLimit_SLEEVE_SHOULDER_E273461344349650FC957FA90D7A20F7; // 0x1350(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_SOLimit                            __CustomProperty_SOLimit_SHIRTS_NORMAL_E273461344349650FC957FA90D7A20F7; // 0x13D0(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_SOLimit                            __CustomProperty_SOLimit_SHIRTS_INNER_E273461344349650FC957FA90D7A20F7; // 0x1450(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratSOSpeeds                         __CustomProperty_SOSpeeds_E273461344349650FC957FA90D7A20F7; // 0x14D0(0x0020)(NoDestructor)
	TArray<struct FRigElementKey>                 __CustomProperty_InitializationTransformBones_B0A9434E4FF89271603F42B8440DC533; // 0x14F0(0x0010)()
	struct FST_SleeveCorrection                   __CustomProperty_CommonSleeveInputParameter_B0A9434E4FF89271603F42B8440DC533; // 0x1500(0x0070)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratKawaiiPhysicsParameters          In_Out;                                            // 0x1570(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UAnimInstance*                          AnimInstance;                                      // 0x15A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        XMinusSpeed;                                       // 0x15A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        YMinusSpeed;                                       // 0x15B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZMinusSpeed;                                       // 0x15B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force_to_Wind;                                     // 0x15C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C1[0x7];                                     // 0x15C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Wind_Amp;                                          // 0x15C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wind_Freq;                                         // 0x15D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wind_Amp_Z;                                        // 0x15D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wind_Weight_Z;                                     // 0x15E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_SOLimit                            SOLimit_ShirtsNormal;                              // 0x15E8(0x0080)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_SOLimit                            SOLimit_TrousersNormal;                            // 0x1668(0x0080)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_SOLimit                            SOLimitSleeveShoulder;                             // 0x16E8(0x0080)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_SleeveCorrection                   Common_Sleeve_Input_Parameter;                     // 0x1768(0x0070)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 Initialization_Transform_Bones;                    // 0x17D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PostABP_0000_40_00_CLT_00_AnimGraphNode_ControlRig_5BF434EB4331115C0E08AB932DD23576();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PostABP_0000_40_00_CLT_00_AnimGraphNode_ControlRig_B0A9434E4FF89271603F42B8440DC533();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PostABP_0000_40_00_CLT_00_AnimGraphNode_ControlRig_E273461344349650FC957FA90D7A20F7();
	void ExecuteUbergraph_PostABP_0000_40_00_CLT_00(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PostABP_0000_40_00_CLT_00_C">();
	}
	static class UPostABP_0000_40_00_CLT_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPostABP_0000_40_00_CLT_00_C>();
	}
};
static_assert(alignof(UPostABP_0000_40_00_CLT_00_C) == 0x000010, "Wrong alignment on UPostABP_0000_40_00_CLT_00_C");
static_assert(sizeof(UPostABP_0000_40_00_CLT_00_C) == 0x0017F0, "Wrong size on UPostABP_0000_40_00_CLT_00_C");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, UberGraphFrame) == 0x000370, "Member 'UPostABP_0000_40_00_CLT_00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UPostABP_0000_40_00_CLT_00_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UPostABP_0000_40_00_CLT_00_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, AnimGraphNode_Root) == 0x000388, "Member 'UPostABP_0000_40_00_CLT_00_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, AnimGraphNode_CopyPoseFromMesh) == 0x0003A8, "Member 'UPostABP_0000_40_00_CLT_00_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, AnimGraphNode_ControlRig_2) == 0x000580, "Member 'UPostABP_0000_40_00_CLT_00_C::AnimGraphNode_ControlRig_2' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, AnimGraphNode_ControlRig_1) == 0x0009F0, "Member 'UPostABP_0000_40_00_CLT_00_C::AnimGraphNode_ControlRig_1' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, AnimGraphNode_ControlRig) == 0x000E60, "Member 'UPostABP_0000_40_00_CLT_00_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, __CustomProperty_SOLimit_TROUSERS_NORMAL_E273461344349650FC957FA90D7A20F7) == 0x0012D0, "Member 'UPostABP_0000_40_00_CLT_00_C::__CustomProperty_SOLimit_TROUSERS_NORMAL_E273461344349650FC957FA90D7A20F7' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, __CustomProperty_SOLimit_SLEEVE_SHOULDER_E273461344349650FC957FA90D7A20F7) == 0x001350, "Member 'UPostABP_0000_40_00_CLT_00_C::__CustomProperty_SOLimit_SLEEVE_SHOULDER_E273461344349650FC957FA90D7A20F7' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, __CustomProperty_SOLimit_SHIRTS_NORMAL_E273461344349650FC957FA90D7A20F7) == 0x0013D0, "Member 'UPostABP_0000_40_00_CLT_00_C::__CustomProperty_SOLimit_SHIRTS_NORMAL_E273461344349650FC957FA90D7A20F7' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, __CustomProperty_SOLimit_SHIRTS_INNER_E273461344349650FC957FA90D7A20F7) == 0x001450, "Member 'UPostABP_0000_40_00_CLT_00_C::__CustomProperty_SOLimit_SHIRTS_INNER_E273461344349650FC957FA90D7A20F7' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, __CustomProperty_SOSpeeds_E273461344349650FC957FA90D7A20F7) == 0x0014D0, "Member 'UPostABP_0000_40_00_CLT_00_C::__CustomProperty_SOSpeeds_E273461344349650FC957FA90D7A20F7' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, __CustomProperty_InitializationTransformBones_B0A9434E4FF89271603F42B8440DC533) == 0x0014F0, "Member 'UPostABP_0000_40_00_CLT_00_C::__CustomProperty_InitializationTransformBones_B0A9434E4FF89271603F42B8440DC533' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, __CustomProperty_CommonSleeveInputParameter_B0A9434E4FF89271603F42B8440DC533) == 0x001500, "Member 'UPostABP_0000_40_00_CLT_00_C::__CustomProperty_CommonSleeveInputParameter_B0A9434E4FF89271603F42B8440DC533' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, In_Out) == 0x001570, "Member 'UPostABP_0000_40_00_CLT_00_C::In_Out' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, AnimInstance) == 0x0015A0, "Member 'UPostABP_0000_40_00_CLT_00_C::AnimInstance' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, XMinusSpeed) == 0x0015A8, "Member 'UPostABP_0000_40_00_CLT_00_C::XMinusSpeed' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, YMinusSpeed) == 0x0015B0, "Member 'UPostABP_0000_40_00_CLT_00_C::YMinusSpeed' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, ZMinusSpeed) == 0x0015B8, "Member 'UPostABP_0000_40_00_CLT_00_C::ZMinusSpeed' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, Force_to_Wind) == 0x0015C0, "Member 'UPostABP_0000_40_00_CLT_00_C::Force_to_Wind' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, Wind_Amp) == 0x0015C8, "Member 'UPostABP_0000_40_00_CLT_00_C::Wind_Amp' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, Wind_Freq) == 0x0015D0, "Member 'UPostABP_0000_40_00_CLT_00_C::Wind_Freq' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, Wind_Amp_Z) == 0x0015D8, "Member 'UPostABP_0000_40_00_CLT_00_C::Wind_Amp_Z' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, Wind_Weight_Z) == 0x0015E0, "Member 'UPostABP_0000_40_00_CLT_00_C::Wind_Weight_Z' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, SOLimit_ShirtsNormal) == 0x0015E8, "Member 'UPostABP_0000_40_00_CLT_00_C::SOLimit_ShirtsNormal' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, SOLimit_TrousersNormal) == 0x001668, "Member 'UPostABP_0000_40_00_CLT_00_C::SOLimit_TrousersNormal' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, SOLimitSleeveShoulder) == 0x0016E8, "Member 'UPostABP_0000_40_00_CLT_00_C::SOLimitSleeveShoulder' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, Common_Sleeve_Input_Parameter) == 0x001768, "Member 'UPostABP_0000_40_00_CLT_00_C::Common_Sleeve_Input_Parameter' has a wrong offset!");
static_assert(offsetof(UPostABP_0000_40_00_CLT_00_C, Initialization_Transform_Bones) == 0x0017D8, "Member 'UPostABP_0000_40_00_CLT_00_C::Initialization_Transform_Bones' has a wrong offset!");

}

