#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PostABP_0000_40_00_CLT_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_SOLimit_structs.hpp"
#include "SS_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PostABP_0000_40_00_CLT_00.PostABP_0000_40_00_CLT_00_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PostABP_0000_40_00_CLT_00_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PostABP_0000_40_00_CLT_00_C_AnimGraph) == 0x000008, "Wrong alignment on PostABP_0000_40_00_CLT_00_C_AnimGraph");
static_assert(sizeof(PostABP_0000_40_00_CLT_00_C_AnimGraph) == 0x000010, "Wrong size on PostABP_0000_40_00_CLT_00_C_AnimGraph");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PostABP_0000_40_00_CLT_00_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function PostABP_0000_40_00_CLT_00.PostABP_0000_40_00_CLT_00_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct PostABP_0000_40_00_CLT_00_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostABP_0000_40_00_CLT_00_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on PostABP_0000_40_00_CLT_00_C_BlueprintUpdateAnimation");
static_assert(sizeof(PostABP_0000_40_00_CLT_00_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on PostABP_0000_40_00_CLT_00_C_BlueprintUpdateAnimation");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'PostABP_0000_40_00_CLT_00_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function PostABP_0000_40_00_CLT_00.PostABP_0000_40_00_CLT_00_C.ExecuteUbergraph_PostABP_0000_40_00_CLT_00
// 0x0318 (0x0318 - 0x0000)
struct PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_SOLimit                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_SOLimit                            CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0090(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_SOLimit                            CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0118(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_SOLimit                            CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x01A0(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSOSpeeds                         CallFunc_GetSOSpeedsFrom_ReturnValue;              // 0x0224(0x0020)(NoDestructor)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_2;              // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetKawaiiPhysicsComponentParameters_ReturnValue; // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BFL_GetLocomotionParameterVelocity_Velocity; // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKoratSOSpeeds                         CallFunc_BFL_SetSOSpeeds_KoratSOSpeeds;            // 0x02D0(0x0020)(NoDestructor)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_B_ImplicitCast;                      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast_1;       // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00) == 0x000008, "Wrong alignment on PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00");
static_assert(sizeof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00) == 0x000318, "Wrong size on PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, EntryPoint) == 0x000000, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::EntryPoint' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000088, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000090, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000110, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000118, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000198, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x0001A0, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x000220, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetSOSpeedsFrom_ReturnValue) == 0x000224, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetSOSpeedsFrom_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetCurveValue_ReturnValue) == 0x000244, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetCurveValue_ReturnValue_1) == 0x000248, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetCurveValue_ReturnValue_2) == 0x00024C, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetCurveValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000250, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_FMax_ReturnValue) == 0x000258, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_Abs_ReturnValue) == 0x000260, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000268, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000270, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000278, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, K2Node_Event_DeltaTimeX) == 0x000280, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000288, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, K2Node_DynamicCast_AsCharacter) == 0x000290, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, K2Node_DynamicCast_bSuccess) == 0x000298, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetKawaiiPhysicsComponentParameters_ReturnValue) == 0x000299, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetKawaiiPhysicsComponentParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_GetAnimInstance_ReturnValue) == 0x0002A0, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_IsValid_ReturnValue) == 0x0002A8, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x0002B0, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_BFL_GetLocomotionParameterVelocity_Velocity) == 0x0002B8, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_BFL_GetLocomotionParameterVelocity_Velocity' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_BFL_SetSOSpeeds_KoratSOSpeeds) == 0x0002D0, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_BFL_SetSOSpeeds_KoratSOSpeeds' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_FMax_A_ImplicitCast) == 0x0002F0, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0002F8, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000300, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, CallFunc_FMax_B_ImplicitCast) == 0x000308, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::CallFunc_FMax_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, K2Node_StructMemberSet_Alpha_ImplicitCast) == 0x000310, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::K2Node_StructMemberSet_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00, K2Node_StructMemberSet_Alpha_ImplicitCast_1) == 0x000314, "Member 'PostABP_0000_40_00_CLT_00_C_ExecuteUbergraph_PostABP_0000_40_00_CLT_00::K2Node_StructMemberSet_Alpha_ImplicitCast_1' has a wrong offset!");

}

