#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RMAFoliageTools

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum RMAFoliageTools.ERMAFoliageToolsIncludeMode
// NumValues: 0x0003
enum class ERMAFoliageToolsIncludeMode : uint8
{
	RMAIM_All                                = 0,
	RMAIM_Selection                          = 1,
	RMAIM_MAX                                = 2,
};

// ScriptStruct RMAFoliageTools.RMAFoliageToolsBuffer
// 0x0050 (0x0050 - 0x0000)
struct FRMAFoliageToolsBuffer final
{
public:
	TArray<struct FTransform>                     Transforms;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Assets;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     Transform;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UStaticMesh*>                    Mesh;                                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UObject>>            Class;                                             // 0x0040(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FRMAFoliageToolsBuffer) == 0x000008, "Wrong alignment on FRMAFoliageToolsBuffer");
static_assert(sizeof(FRMAFoliageToolsBuffer) == 0x000050, "Wrong size on FRMAFoliageToolsBuffer");
static_assert(offsetof(FRMAFoliageToolsBuffer, Transforms) == 0x000000, "Member 'FRMAFoliageToolsBuffer::Transforms' has a wrong offset!");
static_assert(offsetof(FRMAFoliageToolsBuffer, Assets) == 0x000010, "Member 'FRMAFoliageToolsBuffer::Assets' has a wrong offset!");
static_assert(offsetof(FRMAFoliageToolsBuffer, Transform) == 0x000020, "Member 'FRMAFoliageToolsBuffer::Transform' has a wrong offset!");
static_assert(offsetof(FRMAFoliageToolsBuffer, Mesh) == 0x000030, "Member 'FRMAFoliageToolsBuffer::Mesh' has a wrong offset!");
static_assert(offsetof(FRMAFoliageToolsBuffer, Class) == 0x000040, "Member 'FRMAFoliageToolsBuffer::Class' has a wrong offset!");

}

