#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Rep_TeamSet_P2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Rep_TeamSet_P2.WBP_Rep_TeamSet_P2_C
// 0x0098 (0x0488 - 0x03F0)
class UWBP_Rep_TeamSet_P2_C final : public USSChangePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SE_PanelOpen;                                      // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_HIde;                                          // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_AtoDisable;                                    // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Active;                                        // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Disable;                                       // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_DtoActive;                                     // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OBJ_StyleGuideButton_C*            GuideButton_00;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_StyleGuideButton_C*            GuideButton_01;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_StyleGuideButton_C*            GuideButton_02;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_StyleGuideButton_C*            GuideButton_03;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base01;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base_EF_00;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Icon;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Shadow_00;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_TeamPanel_P2_3_C*              StyleIcon_00;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_TeamPanel_P2_0_C*              StyleIcon_01;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_TeamPanel_P2_1_C*              StyleIcon_02;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_TeamPanel_P2_2_C*              StyleIcon_03;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Rep_TeamSet_P2(int32 EntryPoint);
	void OnChangeActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Rep_TeamSet_P2_C">();
	}
	static class UWBP_Rep_TeamSet_P2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Rep_TeamSet_P2_C>();
	}
};
static_assert(alignof(UWBP_Rep_TeamSet_P2_C) == 0x000008, "Wrong alignment on UWBP_Rep_TeamSet_P2_C");
static_assert(sizeof(UWBP_Rep_TeamSet_P2_C) == 0x000488, "Wrong size on UWBP_Rep_TeamSet_P2_C");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, UberGraphFrame) == 0x0003F0, "Member 'UWBP_Rep_TeamSet_P2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, SE_PanelOpen) == 0x0003F8, "Member 'UWBP_Rep_TeamSet_P2_C::SE_PanelOpen' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, ANI_HIde) == 0x000400, "Member 'UWBP_Rep_TeamSet_P2_C::ANI_HIde' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, ANI_AtoDisable) == 0x000408, "Member 'UWBP_Rep_TeamSet_P2_C::ANI_AtoDisable' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, ANI_Active) == 0x000410, "Member 'UWBP_Rep_TeamSet_P2_C::ANI_Active' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, ANI_Disable) == 0x000418, "Member 'UWBP_Rep_TeamSet_P2_C::ANI_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, ANI_DtoActive) == 0x000420, "Member 'UWBP_Rep_TeamSet_P2_C::ANI_DtoActive' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, GuideButton_00) == 0x000428, "Member 'UWBP_Rep_TeamSet_P2_C::GuideButton_00' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, GuideButton_01) == 0x000430, "Member 'UWBP_Rep_TeamSet_P2_C::GuideButton_01' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, GuideButton_02) == 0x000438, "Member 'UWBP_Rep_TeamSet_P2_C::GuideButton_02' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, GuideButton_03) == 0x000440, "Member 'UWBP_Rep_TeamSet_P2_C::GuideButton_03' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, IMG_Base01) == 0x000448, "Member 'UWBP_Rep_TeamSet_P2_C::IMG_Base01' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, IMG_Base_EF_00) == 0x000450, "Member 'UWBP_Rep_TeamSet_P2_C::IMG_Base_EF_00' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, IMG_Icon) == 0x000458, "Member 'UWBP_Rep_TeamSet_P2_C::IMG_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, IMG_Shadow_00) == 0x000460, "Member 'UWBP_Rep_TeamSet_P2_C::IMG_Shadow_00' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, StyleIcon_00) == 0x000468, "Member 'UWBP_Rep_TeamSet_P2_C::StyleIcon_00' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, StyleIcon_01) == 0x000470, "Member 'UWBP_Rep_TeamSet_P2_C::StyleIcon_01' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, StyleIcon_02) == 0x000478, "Member 'UWBP_Rep_TeamSet_P2_C::StyleIcon_02' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_TeamSet_P2_C, StyleIcon_03) == 0x000480, "Member 'UWBP_Rep_TeamSet_P2_C::StyleIcon_03' has a wrong offset!");

}

