#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_OptionContent_TextArrowSet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_OptionContent_TextArrowSet.WBP_OBJ_OptionContent_TextArrowSet_C
// 0x0040 (0x0680 - 0x0640)
class UWBP_OBJ_OptionContent_TextArrowSet_C final : public USSMenuButtonText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANI_Disable;                                       // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SE_Arrow_Decide;                                   // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Select;                                        // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Normal;                                        // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_CHIP_Arrow_C*                      Arrow_L;                                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CHIP_Arrow_C*                      Arrow_R;                                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base;                                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_OBJ_OptionContent_TextArrowSet_Arrow_L_K2Node_ComponentBoundEvent_1_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void BndEvt__WBP_OBJ_OptionContent_TextArrowSet_Arrow_R_K2Node_ComponentBoundEvent_0_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_OBJ_OptionContent_TextArrowSet(int32 EntryPoint);
	void OnChangeDecide();
	void OnChangeNormal();
	void OnChangeSelect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_OptionContent_TextArrowSet_C">();
	}
	static class UWBP_OBJ_OptionContent_TextArrowSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_OptionContent_TextArrowSet_C>();
	}
};
static_assert(alignof(UWBP_OBJ_OptionContent_TextArrowSet_C) == 0x000008, "Wrong alignment on UWBP_OBJ_OptionContent_TextArrowSet_C");
static_assert(sizeof(UWBP_OBJ_OptionContent_TextArrowSet_C) == 0x000680, "Wrong size on UWBP_OBJ_OptionContent_TextArrowSet_C");
static_assert(offsetof(UWBP_OBJ_OptionContent_TextArrowSet_C, UberGraphFrame) == 0x000640, "Member 'UWBP_OBJ_OptionContent_TextArrowSet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_OptionContent_TextArrowSet_C, ANI_Disable) == 0x000648, "Member 'UWBP_OBJ_OptionContent_TextArrowSet_C::ANI_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_OptionContent_TextArrowSet_C, SE_Arrow_Decide) == 0x000650, "Member 'UWBP_OBJ_OptionContent_TextArrowSet_C::SE_Arrow_Decide' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_OptionContent_TextArrowSet_C, ANI_Select) == 0x000658, "Member 'UWBP_OBJ_OptionContent_TextArrowSet_C::ANI_Select' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_OptionContent_TextArrowSet_C, ANI_Normal) == 0x000660, "Member 'UWBP_OBJ_OptionContent_TextArrowSet_C::ANI_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_OptionContent_TextArrowSet_C, Arrow_L) == 0x000668, "Member 'UWBP_OBJ_OptionContent_TextArrowSet_C::Arrow_L' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_OptionContent_TextArrowSet_C, Arrow_R) == 0x000670, "Member 'UWBP_OBJ_OptionContent_TextArrowSet_C::Arrow_R' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_OptionContent_TextArrowSet_C, IMG_Base) == 0x000678, "Member 'UWBP_OBJ_OptionContent_TextArrowSet_C::IMG_Base' has a wrong offset!");

}

