#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title_InfoGuide

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Title_InfoGuide.WBP_Title_InfoGuide_C.ExecuteUbergraph_WBP_Title_InfoGuide
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_1;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_2;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_3;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_4;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_5;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0070(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide) == 0x000008, "Wrong alignment on WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide");
static_assert(sizeof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide) == 0x0000B8, "Wrong size on WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, EntryPoint) == 0x000000, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, Temp_object_Variable) == 0x000008, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, Temp_object_Variable_1) == 0x000018, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, Temp_object_Variable_2) == 0x000028, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, Temp_object_Variable_3) == 0x000038, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, Temp_object_Variable_4) == 0x000048, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, Temp_object_Variable_5) == 0x000058, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, K2Node_Event_IsDesignTime) == 0x000068, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, K2Node_Event_MyGeometry) == 0x000070, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide, K2Node_Event_InDeltaTime) == 0x0000B0, "Member 'WBP_Title_InfoGuide_C_ExecuteUbergraph_WBP_Title_InfoGuide::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WBP_Title_InfoGuide.WBP_Title_InfoGuide_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Title_InfoGuide_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_InfoGuide_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Title_InfoGuide_C_PreConstruct");
static_assert(sizeof(WBP_Title_InfoGuide_C_PreConstruct) == 0x000001, "Wrong size on WBP_Title_InfoGuide_C_PreConstruct");
static_assert(offsetof(WBP_Title_InfoGuide_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Title_InfoGuide_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Title_InfoGuide.WBP_Title_InfoGuide_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct WBP_Title_InfoGuide_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Title_InfoGuide_C_Tick) == 0x000008, "Wrong alignment on WBP_Title_InfoGuide_C_Tick");
static_assert(sizeof(WBP_Title_InfoGuide_C_Tick) == 0x000048, "Wrong size on WBP_Title_InfoGuide_C_Tick");
static_assert(offsetof(WBP_Title_InfoGuide_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Title_InfoGuide_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Title_InfoGuide_C_Tick, InDeltaTime) == 0x000040, "Member 'WBP_Title_InfoGuide_C_Tick::InDeltaTime' has a wrong offset!");

}

