#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_PowerGauge_P2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_PowerGauge_P2.WBP_OBJ_PowerGauge_P2_C
// 0x0130 (0x0540 - 0x0410)
class UWBP_OBJ_PowerGauge_P2_C final : public USSPowerGauge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_NormalWaitLoop;                                // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Miss_Out;                                      // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Miss;                                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Success_Out;                                   // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Success;                                       // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_NormalLoop;                                    // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_In;                                            // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Danger;                                        // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Warning;                                       // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Guage_Alart_Red;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guage_Base_00;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guage_Base_01;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guage_Frame;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guage_memori;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BOOST01;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BOOST02;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BOOST03;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Effect_10;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Effect_11;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Effect_12;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Effect_01;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Effect_02;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Effect_02_1;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Effect_09;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Effect_09_1;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_GenkaiB01;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_GenkaiB02;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_GenkaiB03;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Lay_Effect_08;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Max_0;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Max_1;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Max_2;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Max_3;                                         // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_MissEff_01;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_BoostButton_C*                 WBP_OBJ_BoostButton;                               // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_PowerGauge_P2(int32 EntryPoint);
	void OnChangeGaugeDanger();
	void OnChangeGaugeNormal();
	void OnChangeGaugeWarning();
	void OnChangeInputWait();
	void OnHideStarted();
	void OnPowerImpactResult();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_PowerGauge_P2_C">();
	}
	static class UWBP_OBJ_PowerGauge_P2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_PowerGauge_P2_C>();
	}
};
static_assert(alignof(UWBP_OBJ_PowerGauge_P2_C) == 0x000008, "Wrong alignment on UWBP_OBJ_PowerGauge_P2_C");
static_assert(sizeof(UWBP_OBJ_PowerGauge_P2_C) == 0x000540, "Wrong size on UWBP_OBJ_PowerGauge_P2_C");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, UberGraphFrame) == 0x000410, "Member 'UWBP_OBJ_PowerGauge_P2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_NormalWaitLoop) == 0x000418, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_NormalWaitLoop' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_OUT) == 0x000420, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_Miss_Out) == 0x000428, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_Miss_Out' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_Miss) == 0x000430, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_Miss' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_Success_Out) == 0x000438, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_Success_Out' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_Success) == 0x000440, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_Success' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_NormalLoop) == 0x000448, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_NormalLoop' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_In) == 0x000450, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_In' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_Danger) == 0x000458, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_Danger' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_Warning) == 0x000460, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_Warning' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, ANM_Normal) == 0x000468, "Member 'UWBP_OBJ_PowerGauge_P2_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, Guage_Alart_Red) == 0x000470, "Member 'UWBP_OBJ_PowerGauge_P2_C::Guage_Alart_Red' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, Guage_Base_00) == 0x000478, "Member 'UWBP_OBJ_PowerGauge_P2_C::Guage_Base_00' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, Guage_Base_01) == 0x000480, "Member 'UWBP_OBJ_PowerGauge_P2_C::Guage_Base_01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, Guage_Frame) == 0x000488, "Member 'UWBP_OBJ_PowerGauge_P2_C::Guage_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, Guage_memori) == 0x000490, "Member 'UWBP_OBJ_PowerGauge_P2_C::Guage_memori' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_BOOST01) == 0x000498, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_BOOST01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_BOOST02) == 0x0004A0, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_BOOST02' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_BOOST03) == 0x0004A8, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_BOOST03' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Effect_10) == 0x0004B0, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Effect_10' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Effect_11) == 0x0004B8, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Effect_11' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Effect_12) == 0x0004C0, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Effect_12' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Effect_01) == 0x0004C8, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Effect_01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Effect_02) == 0x0004D0, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Effect_02' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Effect_02_1) == 0x0004D8, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Effect_02_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Effect_09) == 0x0004E0, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Effect_09' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Effect_09_1) == 0x0004E8, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Effect_09_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_GenkaiB01) == 0x0004F0, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_GenkaiB01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_GenkaiB02) == 0x0004F8, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_GenkaiB02' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_GenkaiB03) == 0x000500, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_GenkaiB03' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Lay_Effect_08) == 0x000508, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Lay_Effect_08' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Max_0) == 0x000510, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Max_0' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Max_1) == 0x000518, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Max_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Max_2) == 0x000520, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Max_2' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_Max_3) == 0x000528, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_Max_3' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, IMG_MissEff_01) == 0x000530, "Member 'UWBP_OBJ_PowerGauge_P2_C::IMG_MissEff_01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_PowerGauge_P2_C, WBP_OBJ_BoostButton) == 0x000538, "Member 'UWBP_OBJ_PowerGauge_P2_C::WBP_OBJ_BoostButton' has a wrong offset!");

}

