#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_DB_Direction_GuideText

#include "Basic.hpp"

#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_DB_Direction_GuideText.WBP_OBJ_DB_Direction_GuideText_C
// 0x0020 (0x03C0 - 0x03A0)
class UWBP_OBJ_DB_Direction_GuideText_C final : public USSUiWidget
{
public:
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_Base;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_DB_Direction_GuideText_C">();
	}
	static class UWBP_OBJ_DB_Direction_GuideText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_DB_Direction_GuideText_C>();
	}
};
static_assert(alignof(UWBP_OBJ_DB_Direction_GuideText_C) == 0x000008, "Wrong alignment on UWBP_OBJ_DB_Direction_GuideText_C");
static_assert(sizeof(UWBP_OBJ_DB_Direction_GuideText_C) == 0x0003C0, "Wrong size on UWBP_OBJ_DB_Direction_GuideText_C");
static_assert(offsetof(UWBP_OBJ_DB_Direction_GuideText_C, ANM_OUT) == 0x0003A0, "Member 'UWBP_OBJ_DB_Direction_GuideText_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_GuideText_C, ANM_Normal) == 0x0003A8, "Member 'UWBP_OBJ_DB_Direction_GuideText_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_GuideText_C, ANM_ShowIn) == 0x0003B0, "Member 'UWBP_OBJ_DB_Direction_GuideText_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_GuideText_C, IMG_Base) == 0x0003B8, "Member 'UWBP_OBJ_DB_Direction_GuideText_C::IMG_Base' has a wrong offset!");

}

