#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_TTR_HUD_HelpWin_P2

#include "Basic.hpp"

#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_TTR_HUD_HelpWin_P2.WBP_OBJ_TTR_HUD_HelpWin_P2_C
// 0x0038 (0x04B0 - 0x0478)
class UWBP_OBJ_TTR_HUD_HelpWin_P2_C final : public USSBattleTutorialHelpManager
{
public:
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_BG;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_1;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_2;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_Point;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_TTR_HUD_HelpWin_P2_C">();
	}
	static class UWBP_OBJ_TTR_HUD_HelpWin_P2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_TTR_HUD_HelpWin_P2_C>();
	}
};
static_assert(alignof(UWBP_OBJ_TTR_HUD_HelpWin_P2_C) == 0x000008, "Wrong alignment on UWBP_OBJ_TTR_HUD_HelpWin_P2_C");
static_assert(sizeof(UWBP_OBJ_TTR_HUD_HelpWin_P2_C) == 0x0004B0, "Wrong size on UWBP_OBJ_TTR_HUD_HelpWin_P2_C");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_HelpWin_P2_C, ANM_OUT) == 0x000478, "Member 'UWBP_OBJ_TTR_HUD_HelpWin_P2_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_HelpWin_P2_C, ANM_Normal) == 0x000480, "Member 'UWBP_OBJ_TTR_HUD_HelpWin_P2_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_HelpWin_P2_C, ANM_ShowIn) == 0x000488, "Member 'UWBP_OBJ_TTR_HUD_HelpWin_P2_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_HelpWin_P2_C, IMG_BG) == 0x000490, "Member 'UWBP_OBJ_TTR_HUD_HelpWin_P2_C::IMG_BG' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_HelpWin_P2_C, IMG_BG_1) == 0x000498, "Member 'UWBP_OBJ_TTR_HUD_HelpWin_P2_C::IMG_BG_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_HelpWin_P2_C, IMG_BG_2) == 0x0004A0, "Member 'UWBP_OBJ_TTR_HUD_HelpWin_P2_C::IMG_BG_2' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_HelpWin_P2_C, IMG_BG_Point) == 0x0004A8, "Member 'UWBP_OBJ_TTR_HUD_HelpWin_P2_C::IMG_BG_Point' has a wrong offset!");

}

