#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_DB_Direction_List_Special

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_DB_Direction_List_Special.WBP_OBJ_DB_Direction_List_Special_C
// 0x0060 (0x0520 - 0x04C0)
class UWBP_OBJ_DB_Direction_List_Special_C final : public USSDramaticSpcialEndSettingUi
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SE_Window_Slied_In;                                // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_DotLine;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Scene_BTN_C*      WBP_OBJ_DB_Direction_Scene_BTN;                    // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Scene_BTN_C*      WBP_OBJ_DB_Direction_Scene_BTN_0;                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Telop_BTN_C*      WBP_OBJ_DB_Direction_Telop_BTN;                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Telop_BTN_C*      WBP_OBJ_DB_Direction_Telop_BTN_1;                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Trigger1_C*       WBP_OBJ_DB_Direction_Trigger1_lose;                // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Trigger1_C*       WBP_OBJ_DB_Direction_Trigger1_win;                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_DB_Direction_List_Special(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_DB_Direction_List_Special_C">();
	}
	static class UWBP_OBJ_DB_Direction_List_Special_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_DB_Direction_List_Special_C>();
	}
};
static_assert(alignof(UWBP_OBJ_DB_Direction_List_Special_C) == 0x000008, "Wrong alignment on UWBP_OBJ_DB_Direction_List_Special_C");
static_assert(sizeof(UWBP_OBJ_DB_Direction_List_Special_C) == 0x000520, "Wrong size on UWBP_OBJ_DB_Direction_List_Special_C");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, UberGraphFrame) == 0x0004C0, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, SE_Window_Slied_In) == 0x0004C8, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::SE_Window_Slied_In' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, ANM_OUT) == 0x0004D0, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, ANM_Normal) == 0x0004D8, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, ANM_ShowIn) == 0x0004E0, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, IMG_DotLine) == 0x0004E8, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::IMG_DotLine' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, WBP_OBJ_DB_Direction_Scene_BTN) == 0x0004F0, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::WBP_OBJ_DB_Direction_Scene_BTN' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, WBP_OBJ_DB_Direction_Scene_BTN_0) == 0x0004F8, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::WBP_OBJ_DB_Direction_Scene_BTN_0' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, WBP_OBJ_DB_Direction_Telop_BTN) == 0x000500, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::WBP_OBJ_DB_Direction_Telop_BTN' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, WBP_OBJ_DB_Direction_Telop_BTN_1) == 0x000508, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::WBP_OBJ_DB_Direction_Telop_BTN_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, WBP_OBJ_DB_Direction_Trigger1_lose) == 0x000510, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::WBP_OBJ_DB_Direction_Trigger1_lose' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_Special_C, WBP_OBJ_DB_Direction_Trigger1_win) == 0x000518, "Member 'UWBP_OBJ_DB_Direction_List_Special_C::WBP_OBJ_DB_Direction_Trigger1_win' has a wrong offset!");

}

