#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_Option_List_013_Lang

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_Option_List_013_Lang.WBP_OBJ_Option_List_013_Lang_C
// 0x0058 (0x06A8 - 0x0650)
class UWBP_OBJ_Option_List_013_Lang_C final : public USSMenuButtonImage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANI_Disable;                                       // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Select;                                        // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_OnChangeNormal;                                // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_ON;                                            // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_OnChangeSelect;                                // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Normal;                                        // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_CHIP_Arrow_C*                      Arrow_L;                                           // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CHIP_Arrow_C*                      Arrow_R;                                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BGBlack;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Lang;                                          // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_Option_List_013_Lang(int32 EntryPoint);
	void OnChangeDecide();
	void OnChangeDisable();
	void OnChangeNormal();
	void OnChangeSelect();
	void OnChangeSelectToNormal();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_Option_List_013_Lang_C">();
	}
	static class UWBP_OBJ_Option_List_013_Lang_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_Option_List_013_Lang_C>();
	}
};
static_assert(alignof(UWBP_OBJ_Option_List_013_Lang_C) == 0x000008, "Wrong alignment on UWBP_OBJ_Option_List_013_Lang_C");
static_assert(sizeof(UWBP_OBJ_Option_List_013_Lang_C) == 0x0006A8, "Wrong size on UWBP_OBJ_Option_List_013_Lang_C");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, UberGraphFrame) == 0x000650, "Member 'UWBP_OBJ_Option_List_013_Lang_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, ANI_Disable) == 0x000658, "Member 'UWBP_OBJ_Option_List_013_Lang_C::ANI_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, ANI_Select) == 0x000660, "Member 'UWBP_OBJ_Option_List_013_Lang_C::ANI_Select' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, ANI_OnChangeNormal) == 0x000668, "Member 'UWBP_OBJ_Option_List_013_Lang_C::ANI_OnChangeNormal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, ANI_ON) == 0x000670, "Member 'UWBP_OBJ_Option_List_013_Lang_C::ANI_ON' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, ANI_OnChangeSelect) == 0x000678, "Member 'UWBP_OBJ_Option_List_013_Lang_C::ANI_OnChangeSelect' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, ANI_Normal) == 0x000680, "Member 'UWBP_OBJ_Option_List_013_Lang_C::ANI_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, Arrow_L) == 0x000688, "Member 'UWBP_OBJ_Option_List_013_Lang_C::Arrow_L' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, Arrow_R) == 0x000690, "Member 'UWBP_OBJ_Option_List_013_Lang_C::Arrow_R' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, IMG_BGBlack) == 0x000698, "Member 'UWBP_OBJ_Option_List_013_Lang_C::IMG_BGBlack' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_Option_List_013_Lang_C, IMG_Lang) == 0x0006A0, "Member 'UWBP_OBJ_Option_List_013_Lang_C::IMG_Lang' has a wrong offset!");

}

