#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Rep_HpStock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Rep_HpStock.WBP_Rep_HpStock_C
// 0x0018 (0x0448 - 0x0430)
class UWBP_Rep_HpStock_C final : public USSHPStock
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANI_Break;                                         // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_StockState;                               // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Rep_HpStock(int32 EntryPoint);
	void OnBreakFinish();
	void OnBreakStart();
	void OnChangeBlank();
	void OnChangeNormal();
	void OnChangeOver();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Rep_HpStock_C">();
	}
	static class UWBP_Rep_HpStock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Rep_HpStock_C>();
	}
};
static_assert(alignof(UWBP_Rep_HpStock_C) == 0x000008, "Wrong alignment on UWBP_Rep_HpStock_C");
static_assert(sizeof(UWBP_Rep_HpStock_C) == 0x000448, "Wrong size on UWBP_Rep_HpStock_C");
static_assert(offsetof(UWBP_Rep_HpStock_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Rep_HpStock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStock_C, ANI_Break) == 0x000438, "Member 'UWBP_Rep_HpStock_C::ANI_Break' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStock_C, Switcher_StockState) == 0x000440, "Member 'UWBP_Rep_HpStock_C::Switcher_StockState' has a wrong offset!");

}

