#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_DBEvTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_DBEvTrigger.WBP_OBJ_DBEvTrigger_C
// 0x00B0 (0x0470 - 0x03C0)
class UWBP_OBJ_DBEvTrigger_C final : public USSDBEvTriggerUi
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_MIssOut;                                       // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Hide;                                          // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal_Alert;                                  // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_On;                                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_00_00;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_00_01;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_01;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_03;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_Alart_00;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect_Alart_01;                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base00;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base01Add;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base02;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Btnbase;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_GaugeBase;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Item00;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Item01;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DBButton_C*                    WBP_OBJ_DBButton;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_DBEvTrigger(int32 EntryPoint);
	void OnHideFinished();
	void OnHideStarted();
	void OnMissHide();
	void OnPressButton();
	void OnShowFinished();
	void OnShowStarted();
	void OnTimeAlert();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_DBEvTrigger_C">();
	}
	static class UWBP_OBJ_DBEvTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_DBEvTrigger_C>();
	}
};
static_assert(alignof(UWBP_OBJ_DBEvTrigger_C) == 0x000008, "Wrong alignment on UWBP_OBJ_DBEvTrigger_C");
static_assert(sizeof(UWBP_OBJ_DBEvTrigger_C) == 0x000470, "Wrong size on UWBP_OBJ_DBEvTrigger_C");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, UberGraphFrame) == 0x0003C0, "Member 'UWBP_OBJ_DBEvTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, ANM_MIssOut) == 0x0003C8, "Member 'UWBP_OBJ_DBEvTrigger_C::ANM_MIssOut' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, ANM_Hide) == 0x0003D0, "Member 'UWBP_OBJ_DBEvTrigger_C::ANM_Hide' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, ANM_OUT) == 0x0003D8, "Member 'UWBP_OBJ_DBEvTrigger_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, ANM_Normal_Alert) == 0x0003E0, "Member 'UWBP_OBJ_DBEvTrigger_C::ANM_Normal_Alert' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, ANM_On) == 0x0003E8, "Member 'UWBP_OBJ_DBEvTrigger_C::ANM_On' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, ANM_Normal) == 0x0003F0, "Member 'UWBP_OBJ_DBEvTrigger_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, ANM_ShowIn) == 0x0003F8, "Member 'UWBP_OBJ_DBEvTrigger_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, Image_Effect_00_00) == 0x000400, "Member 'UWBP_OBJ_DBEvTrigger_C::Image_Effect_00_00' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, Image_Effect_00_01) == 0x000408, "Member 'UWBP_OBJ_DBEvTrigger_C::Image_Effect_00_01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, Image_Effect_01) == 0x000410, "Member 'UWBP_OBJ_DBEvTrigger_C::Image_Effect_01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, Image_Effect_03) == 0x000418, "Member 'UWBP_OBJ_DBEvTrigger_C::Image_Effect_03' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, Image_Effect_Alart_00) == 0x000420, "Member 'UWBP_OBJ_DBEvTrigger_C::Image_Effect_Alart_00' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, Image_Effect_Alart_01) == 0x000428, "Member 'UWBP_OBJ_DBEvTrigger_C::Image_Effect_Alart_01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, IMG_Base00) == 0x000430, "Member 'UWBP_OBJ_DBEvTrigger_C::IMG_Base00' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, IMG_Base01Add) == 0x000438, "Member 'UWBP_OBJ_DBEvTrigger_C::IMG_Base01Add' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, IMG_Base02) == 0x000440, "Member 'UWBP_OBJ_DBEvTrigger_C::IMG_Base02' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, IMG_Btnbase) == 0x000448, "Member 'UWBP_OBJ_DBEvTrigger_C::IMG_Btnbase' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, IMG_GaugeBase) == 0x000450, "Member 'UWBP_OBJ_DBEvTrigger_C::IMG_GaugeBase' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, IMG_Item00) == 0x000458, "Member 'UWBP_OBJ_DBEvTrigger_C::IMG_Item00' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, IMG_Item01) == 0x000460, "Member 'UWBP_OBJ_DBEvTrigger_C::IMG_Item01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DBEvTrigger_C, WBP_OBJ_DBButton) == 0x000468, "Member 'UWBP_OBJ_DBEvTrigger_C::WBP_OBJ_DBButton' has a wrong offset!");

}

