#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialog_000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Dialog_000.WBP_Dialog_000_C
// 0x00C0 (0x05C0 - 0x0500)
class alignas(0x10) UWBP_Dialog_000_C final : public USSMenuGeneralDialog
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SE_Active_In_se_Kill;                              // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_HIde;                                          // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Wait;                                          // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Show;                                          // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OBJ_Dialog_Button_C*               CenterButton;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GRP_ButtonBox;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Body_1;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Body_BG;                                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Body_L0;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Body_L1;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Footer_L1;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Header;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Header_L0;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_HeaderPattern;                                 // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Mark_L;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Mark_R;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Ver_Line_0;                                    // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Ver_Line_1;                                    // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Dialog_Button_C*               LeftButton;                                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Dialog_Button_C*               RightButton;                                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Header;                                       // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_Main_0;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Dialog_000_CenterButton_K2Node_ComponentBoundEvent_1_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void BndEvt__WBP_Dialog_000_LeftButton_K2Node_ComponentBoundEvent_0_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void BndEvt__WBP_Dialog_000_RightButton_K2Node_ComponentBoundEvent_2_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Dialog_000(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Dialog_000_C">();
	}
	static class UWBP_Dialog_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Dialog_000_C>();
	}
};
static_assert(alignof(UWBP_Dialog_000_C) == 0x000010, "Wrong alignment on UWBP_Dialog_000_C");
static_assert(sizeof(UWBP_Dialog_000_C) == 0x0005C0, "Wrong size on UWBP_Dialog_000_C");
static_assert(offsetof(UWBP_Dialog_000_C, UberGraphFrame) == 0x000500, "Member 'UWBP_Dialog_000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, SE_Active_In_se_Kill) == 0x000508, "Member 'UWBP_Dialog_000_C::SE_Active_In_se_Kill' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, ANI_HIde) == 0x000510, "Member 'UWBP_Dialog_000_C::ANI_HIde' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, ANI_Wait) == 0x000518, "Member 'UWBP_Dialog_000_C::ANI_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, ANI_Show) == 0x000520, "Member 'UWBP_Dialog_000_C::ANI_Show' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, CenterButton) == 0x000528, "Member 'UWBP_Dialog_000_C::CenterButton' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, GRP_ButtonBox) == 0x000530, "Member 'UWBP_Dialog_000_C::GRP_ButtonBox' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Body_1) == 0x000538, "Member 'UWBP_Dialog_000_C::IMG_Body_1' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Body_BG) == 0x000540, "Member 'UWBP_Dialog_000_C::IMG_Body_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Body_L0) == 0x000548, "Member 'UWBP_Dialog_000_C::IMG_Body_L0' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Body_L1) == 0x000550, "Member 'UWBP_Dialog_000_C::IMG_Body_L1' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Footer_L1) == 0x000558, "Member 'UWBP_Dialog_000_C::IMG_Footer_L1' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Header) == 0x000560, "Member 'UWBP_Dialog_000_C::IMG_Header' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Header_L0) == 0x000568, "Member 'UWBP_Dialog_000_C::IMG_Header_L0' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_HeaderPattern) == 0x000570, "Member 'UWBP_Dialog_000_C::IMG_HeaderPattern' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Mark_L) == 0x000578, "Member 'UWBP_Dialog_000_C::IMG_Mark_L' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Mark_R) == 0x000580, "Member 'UWBP_Dialog_000_C::IMG_Mark_R' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Ver_Line_0) == 0x000588, "Member 'UWBP_Dialog_000_C::IMG_Ver_Line_0' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, IMG_Ver_Line_1) == 0x000590, "Member 'UWBP_Dialog_000_C::IMG_Ver_Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, LeftButton) == 0x000598, "Member 'UWBP_Dialog_000_C::LeftButton' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, RightButton) == 0x0005A0, "Member 'UWBP_Dialog_000_C::RightButton' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, TEXT_Header) == 0x0005A8, "Member 'UWBP_Dialog_000_C::TEXT_Header' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_000_C, Text_Main_0) == 0x0005B0, "Member 'UWBP_Dialog_000_C::Text_Main_0' has a wrong offset!");

}

