#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_WM_StampSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_WM_StampSelect.WBP_OBJ_WM_StampSelect_C
// 0x0090 (0x0488 - 0x03F8)
class UWBP_OBJ_WM_StampSelect_C final : public USSWmStampSelectManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OBJ_WM_ArrowBtn_C*                 Arrow_L;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_ArrowBtn_C*                 Arrow_R;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         GuideText_BTN_L;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         GuideText_BTN_R;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_Stamp_Select_Icon_C*        WBP_StanpSelect_0;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_Stamp_Select_Icon_C*        WBP_StanpSelect_1;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_Stamp_Select_Icon_C*        WBP_StanpSelect_2;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_Stamp_Select_Icon_C*        WBP_StanpSelect_3;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_Stamp_Select_Icon_C*        WBP_StanpSelect_4;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_Stamp_Select_Icon_C*        WBP_StanpSelect_5;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_Stamp_Select_Icon_C*        WBP_StanpSelect_6;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_Stamp_Select_Icon_C*        WBP_StanpSelect_7;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_WM_Stamp_Select_Icon_C*        WBP_StanpSelect_8;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void CustomEvent_1();
	void ExecuteUbergraph_WBP_OBJ_WM_StampSelect(int32 EntryPoint);
	void OnChangeActive();
	void OnChangeDisabled();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_WM_StampSelect_C">();
	}
	static class UWBP_OBJ_WM_StampSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_WM_StampSelect_C>();
	}
};
static_assert(alignof(UWBP_OBJ_WM_StampSelect_C) == 0x000008, "Wrong alignment on UWBP_OBJ_WM_StampSelect_C");
static_assert(sizeof(UWBP_OBJ_WM_StampSelect_C) == 0x000488, "Wrong size on UWBP_OBJ_WM_StampSelect_C");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, UberGraphFrame) == 0x0003F8, "Member 'UWBP_OBJ_WM_StampSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, ANM_OUT) == 0x000400, "Member 'UWBP_OBJ_WM_StampSelect_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, ANM_Normal) == 0x000408, "Member 'UWBP_OBJ_WM_StampSelect_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, ANM_ShowIn) == 0x000410, "Member 'UWBP_OBJ_WM_StampSelect_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, Arrow_L) == 0x000418, "Member 'UWBP_OBJ_WM_StampSelect_C::Arrow_L' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, Arrow_R) == 0x000420, "Member 'UWBP_OBJ_WM_StampSelect_C::Arrow_R' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, GuideText_BTN_L) == 0x000428, "Member 'UWBP_OBJ_WM_StampSelect_C::GuideText_BTN_L' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, GuideText_BTN_R) == 0x000430, "Member 'UWBP_OBJ_WM_StampSelect_C::GuideText_BTN_R' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, RetainerBox_0) == 0x000438, "Member 'UWBP_OBJ_WM_StampSelect_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, WBP_StanpSelect_0) == 0x000440, "Member 'UWBP_OBJ_WM_StampSelect_C::WBP_StanpSelect_0' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, WBP_StanpSelect_1) == 0x000448, "Member 'UWBP_OBJ_WM_StampSelect_C::WBP_StanpSelect_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, WBP_StanpSelect_2) == 0x000450, "Member 'UWBP_OBJ_WM_StampSelect_C::WBP_StanpSelect_2' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, WBP_StanpSelect_3) == 0x000458, "Member 'UWBP_OBJ_WM_StampSelect_C::WBP_StanpSelect_3' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, WBP_StanpSelect_4) == 0x000460, "Member 'UWBP_OBJ_WM_StampSelect_C::WBP_StanpSelect_4' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, WBP_StanpSelect_5) == 0x000468, "Member 'UWBP_OBJ_WM_StampSelect_C::WBP_StanpSelect_5' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, WBP_StanpSelect_6) == 0x000470, "Member 'UWBP_OBJ_WM_StampSelect_C::WBP_StanpSelect_6' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, WBP_StanpSelect_7) == 0x000478, "Member 'UWBP_OBJ_WM_StampSelect_C::WBP_StanpSelect_7' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_WM_StampSelect_C, WBP_StanpSelect_8) == 0x000480, "Member 'UWBP_OBJ_WM_StampSelect_C::WBP_StanpSelect_8' has a wrong offset!");

}

