#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Option_Title

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Option_Title.WBP_Option_Title_C
// 0x00E8 (0x0578 - 0x0490)
class UWBP_Option_Title_C final : public USSOptionTitleManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANI_toOption;                                      // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_HIde;                                          // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Wait;                                          // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Show;                                          // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_004_C*             BNIDButton;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_004_C*             BrightnessButton;                                  // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_004_C*             ControlButton;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_004_C*             Credit;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_0;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_1;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_Gear_0;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_Gear_1;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_Gear_2;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_Gear_4;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_Gear_5;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_MainLine;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_MainLine_EF;                                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_StarEF_0;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_StarEF_1;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_StarEF_2;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_StarEF_3;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_StarEF_aa;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_TxtBase_0;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_004_C*             KeyControlButton;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_004_C*             LanguageButton;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_004_C*             OtherButton;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_004_C*             SoundButton;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_004_C*             VideoButton;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Option_Title(int32 EntryPoint);
	void OnChange_ToOption();
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Option_Title_C">();
	}
	static class UWBP_Option_Title_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Option_Title_C>();
	}
};
static_assert(alignof(UWBP_Option_Title_C) == 0x000008, "Wrong alignment on UWBP_Option_Title_C");
static_assert(sizeof(UWBP_Option_Title_C) == 0x000578, "Wrong size on UWBP_Option_Title_C");
static_assert(offsetof(UWBP_Option_Title_C, UberGraphFrame) == 0x000490, "Member 'UWBP_Option_Title_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, ANI_toOption) == 0x000498, "Member 'UWBP_Option_Title_C::ANI_toOption' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, ANI_HIde) == 0x0004A0, "Member 'UWBP_Option_Title_C::ANI_HIde' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, ANI_Wait) == 0x0004A8, "Member 'UWBP_Option_Title_C::ANI_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, ANI_Show) == 0x0004B0, "Member 'UWBP_Option_Title_C::ANI_Show' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, BNIDButton) == 0x0004B8, "Member 'UWBP_Option_Title_C::BNIDButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, BrightnessButton) == 0x0004C0, "Member 'UWBP_Option_Title_C::BrightnessButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, ControlButton) == 0x0004C8, "Member 'UWBP_Option_Title_C::ControlButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, Credit) == 0x0004D0, "Member 'UWBP_Option_Title_C::Credit' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_BG_0) == 0x0004D8, "Member 'UWBP_Option_Title_C::IMG_BG_0' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_BG_1) == 0x0004E0, "Member 'UWBP_Option_Title_C::IMG_BG_1' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_BG_Gear_0) == 0x0004E8, "Member 'UWBP_Option_Title_C::IMG_BG_Gear_0' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_BG_Gear_1) == 0x0004F0, "Member 'UWBP_Option_Title_C::IMG_BG_Gear_1' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_BG_Gear_2) == 0x0004F8, "Member 'UWBP_Option_Title_C::IMG_BG_Gear_2' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_BG_Gear_4) == 0x000500, "Member 'UWBP_Option_Title_C::IMG_BG_Gear_4' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_BG_Gear_5) == 0x000508, "Member 'UWBP_Option_Title_C::IMG_BG_Gear_5' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_MainLine) == 0x000510, "Member 'UWBP_Option_Title_C::IMG_MainLine' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_MainLine_EF) == 0x000518, "Member 'UWBP_Option_Title_C::IMG_MainLine_EF' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_StarEF_0) == 0x000520, "Member 'UWBP_Option_Title_C::IMG_StarEF_0' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_StarEF_1) == 0x000528, "Member 'UWBP_Option_Title_C::IMG_StarEF_1' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_StarEF_2) == 0x000530, "Member 'UWBP_Option_Title_C::IMG_StarEF_2' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_StarEF_3) == 0x000538, "Member 'UWBP_Option_Title_C::IMG_StarEF_3' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_StarEF_aa) == 0x000540, "Member 'UWBP_Option_Title_C::IMG_StarEF_aa' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, IMG_TxtBase_0) == 0x000548, "Member 'UWBP_Option_Title_C::IMG_TxtBase_0' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, KeyControlButton) == 0x000550, "Member 'UWBP_Option_Title_C::KeyControlButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, LanguageButton) == 0x000558, "Member 'UWBP_Option_Title_C::LanguageButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, OtherButton) == 0x000560, "Member 'UWBP_Option_Title_C::OtherButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, SoundButton) == 0x000568, "Member 'UWBP_Option_Title_C::SoundButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_Title_C, VideoButton) == 0x000570, "Member 'UWBP_Option_Title_C::VideoButton' has a wrong offset!");

}

