#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Rep_SkillGuide_TypeC_P2

#include "Basic.hpp"

#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Rep_SkillGuide_TypeC_P2.WBP_Rep_SkillGuide_TypeC_P2_C
// 0x0040 (0x0440 - 0x0400)
class UWBP_Rep_SkillGuide_TypeC_P2_C final : public USSSkillGuideTypeC_Ultimate
{
public:
	class URichTextBlock*                         GuideButton;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BaseEF;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_MEF_10;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_MEF_00;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_MEF_01;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpUIParticle*                          PAR_EF_Base;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Rep_SkillGuide_TypeC_P2_C">();
	}
	static class UWBP_Rep_SkillGuide_TypeC_P2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Rep_SkillGuide_TypeC_P2_C>();
	}
};
static_assert(alignof(UWBP_Rep_SkillGuide_TypeC_P2_C) == 0x000008, "Wrong alignment on UWBP_Rep_SkillGuide_TypeC_P2_C");
static_assert(sizeof(UWBP_Rep_SkillGuide_TypeC_P2_C) == 0x000440, "Wrong size on UWBP_Rep_SkillGuide_TypeC_P2_C");
static_assert(offsetof(UWBP_Rep_SkillGuide_TypeC_P2_C, GuideButton) == 0x000400, "Member 'UWBP_Rep_SkillGuide_TypeC_P2_C::GuideButton' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_SkillGuide_TypeC_P2_C, IMG_Base) == 0x000408, "Member 'UWBP_Rep_SkillGuide_TypeC_P2_C::IMG_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_SkillGuide_TypeC_P2_C, IMG_BaseEF) == 0x000410, "Member 'UWBP_Rep_SkillGuide_TypeC_P2_C::IMG_BaseEF' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_SkillGuide_TypeC_P2_C, IMG_MEF_10) == 0x000418, "Member 'UWBP_Rep_SkillGuide_TypeC_P2_C::IMG_MEF_10' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_SkillGuide_TypeC_P2_C, IMG_MEF_00) == 0x000420, "Member 'UWBP_Rep_SkillGuide_TypeC_P2_C::IMG_MEF_00' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_SkillGuide_TypeC_P2_C, IMG_MEF_01) == 0x000428, "Member 'UWBP_Rep_SkillGuide_TypeC_P2_C::IMG_MEF_01' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_SkillGuide_TypeC_P2_C, PAR_EF_Base) == 0x000430, "Member 'UWBP_Rep_SkillGuide_TypeC_P2_C::PAR_EF_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_SkillGuide_TypeC_P2_C, WidgetSwitcher) == 0x000438, "Member 'UWBP_Rep_SkillGuide_TypeC_P2_C::WidgetSwitcher' has a wrong offset!");

}

