#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_TTR_HUD_Story_Guide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_TTR_HUD_Story_Guide.WBP_OBJ_TTR_HUD_Story_Guide_C
// 0x0048 (0x04C0 - 0x0478)
class UWBP_OBJ_TTR_HUD_Story_Guide_C final : public USSBattleTutorialHelpManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_BG;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_1;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_Point;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TextUnderLine;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TextUnderPar;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_TTR_HUD_Story_Guide(int32 EntryPoint);
	void OnHideStarted();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_TTR_HUD_Story_Guide_C">();
	}
	static class UWBP_OBJ_TTR_HUD_Story_Guide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_TTR_HUD_Story_Guide_C>();
	}
};
static_assert(alignof(UWBP_OBJ_TTR_HUD_Story_Guide_C) == 0x000008, "Wrong alignment on UWBP_OBJ_TTR_HUD_Story_Guide_C");
static_assert(sizeof(UWBP_OBJ_TTR_HUD_Story_Guide_C) == 0x0004C0, "Wrong size on UWBP_OBJ_TTR_HUD_Story_Guide_C");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_Story_Guide_C, UberGraphFrame) == 0x000478, "Member 'UWBP_OBJ_TTR_HUD_Story_Guide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_Story_Guide_C, ANM_OUT) == 0x000480, "Member 'UWBP_OBJ_TTR_HUD_Story_Guide_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_Story_Guide_C, ANM_Normal) == 0x000488, "Member 'UWBP_OBJ_TTR_HUD_Story_Guide_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_Story_Guide_C, ANM_ShowIn) == 0x000490, "Member 'UWBP_OBJ_TTR_HUD_Story_Guide_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_Story_Guide_C, IMG_BG) == 0x000498, "Member 'UWBP_OBJ_TTR_HUD_Story_Guide_C::IMG_BG' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_Story_Guide_C, IMG_BG_1) == 0x0004A0, "Member 'UWBP_OBJ_TTR_HUD_Story_Guide_C::IMG_BG_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_Story_Guide_C, IMG_BG_Point) == 0x0004A8, "Member 'UWBP_OBJ_TTR_HUD_Story_Guide_C::IMG_BG_Point' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_Story_Guide_C, Img_TextUnderLine) == 0x0004B0, "Member 'UWBP_OBJ_TTR_HUD_Story_Guide_C::Img_TextUnderLine' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_TTR_HUD_Story_Guide_C, Img_TextUnderPar) == 0x0004B8, "Member 'UWBP_OBJ_TTR_HUD_Story_Guide_C::Img_TextUnderPar' has a wrong offset!");

}

