#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_BuGauge_Ef

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_BuGauge_Ef.WBP_OBJ_BuGauge_Ef_C
// 0x0018 (0x03B8 - 0x03A0)
class UWBP_OBJ_BuGauge_Ef_C final : public USSUiWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANI_Loop2;                                         // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_Set;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_BuGauge_Ef(int32 EntryPoint);
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_BuGauge_Ef_C">();
	}
	static class UWBP_OBJ_BuGauge_Ef_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_BuGauge_Ef_C>();
	}
};
static_assert(alignof(UWBP_OBJ_BuGauge_Ef_C) == 0x000008, "Wrong alignment on UWBP_OBJ_BuGauge_Ef_C");
static_assert(sizeof(UWBP_OBJ_BuGauge_Ef_C) == 0x0003B8, "Wrong size on UWBP_OBJ_BuGauge_Ef_C");
static_assert(offsetof(UWBP_OBJ_BuGauge_Ef_C, UberGraphFrame) == 0x0003A0, "Member 'UWBP_OBJ_BuGauge_Ef_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_BuGauge_Ef_C, ANI_Loop2) == 0x0003A8, "Member 'UWBP_OBJ_BuGauge_Ef_C::ANI_Loop2' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_BuGauge_Ef_C, IMG_Set) == 0x0003B0, "Member 'UWBP_OBJ_BuGauge_Ef_C::IMG_Set' has a wrong offset!");

}

