#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_MainMenu_Notification_gift_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_MainMenu_Notification_gift_Item.WBP_OBJ_MainMenu_Notification_gift_Item_C
// 0x0080 (0x0580 - 0x0500)
class UWBP_OBJ_MainMenu_Notification_gift_Item_C final : public USSUiItemNotificationElement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_CharaThumbnail;                                // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Icon;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Add;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Add_1;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Keep;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_ItemIcon;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TextTitlePlate;                                // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Kind;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Header;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ItemName;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TXT_Num;                                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_MainMenu_Notification_gift_Item(int32 EntryPoint);
	void OnHideFinished();
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_MainMenu_Notification_gift_Item_C">();
	}
	static class UWBP_OBJ_MainMenu_Notification_gift_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_MainMenu_Notification_gift_Item_C>();
	}
};
static_assert(alignof(UWBP_OBJ_MainMenu_Notification_gift_Item_C) == 0x000008, "Wrong alignment on UWBP_OBJ_MainMenu_Notification_gift_Item_C");
static_assert(sizeof(UWBP_OBJ_MainMenu_Notification_gift_Item_C) == 0x000580, "Wrong size on UWBP_OBJ_MainMenu_Notification_gift_Item_C");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, UberGraphFrame) == 0x000500, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, ANM_OUT) == 0x000508, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, ANM_Normal) == 0x000510, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, ANM_ShowIn) == 0x000518, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, Img_CharaThumbnail) == 0x000520, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::Img_CharaThumbnail' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, IMG_Icon) == 0x000528, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::IMG_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, Img_Icon_Add) == 0x000530, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::Img_Icon_Add' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, Img_Icon_Add_1) == 0x000538, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::Img_Icon_Add_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, Img_Icon_Keep) == 0x000540, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::Img_Icon_Keep' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, IMG_ItemIcon) == 0x000548, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::IMG_ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, Img_TextTitlePlate) == 0x000550, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::Img_TextTitlePlate' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, Switcher_Kind) == 0x000558, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::Switcher_Kind' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, Txt_Header) == 0x000560, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::Txt_Header' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, Txt_ItemName) == 0x000568, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::Txt_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, TXT_Num) == 0x000570, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::TXT_Num' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_gift_Item_C, WidgetSwitcher_0) == 0x000578, "Member 'UWBP_OBJ_MainMenu_Notification_gift_Item_C::WidgetSwitcher_0' has a wrong offset!");

}

