#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_MainMenu_Notification_Message_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_MainMenu_Notification_Message_Item.WBP_OBJ_MainMenu_Notification_Message_Item_C
// 0x0040 (0x0578 - 0x0538)
class UWBP_OBJ_MainMenu_Notification_Message_Item_C final : public USSUiCommonNotificationElement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_Icon;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Add;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Add_1;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Add_Keep;                                 // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_MainMenu_Notification_Message_Item(int32 EntryPoint);
	void OnHideFinished();
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_MainMenu_Notification_Message_Item_C">();
	}
	static class UWBP_OBJ_MainMenu_Notification_Message_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_MainMenu_Notification_Message_Item_C>();
	}
};
static_assert(alignof(UWBP_OBJ_MainMenu_Notification_Message_Item_C) == 0x000008, "Wrong alignment on UWBP_OBJ_MainMenu_Notification_Message_Item_C");
static_assert(sizeof(UWBP_OBJ_MainMenu_Notification_Message_Item_C) == 0x000578, "Wrong size on UWBP_OBJ_MainMenu_Notification_Message_Item_C");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Message_Item_C, UberGraphFrame) == 0x000538, "Member 'UWBP_OBJ_MainMenu_Notification_Message_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Message_Item_C, ANM_OUT) == 0x000540, "Member 'UWBP_OBJ_MainMenu_Notification_Message_Item_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Message_Item_C, ANM_Normal) == 0x000548, "Member 'UWBP_OBJ_MainMenu_Notification_Message_Item_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Message_Item_C, ANM_ShowIn) == 0x000550, "Member 'UWBP_OBJ_MainMenu_Notification_Message_Item_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Message_Item_C, IMG_Icon) == 0x000558, "Member 'UWBP_OBJ_MainMenu_Notification_Message_Item_C::IMG_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Message_Item_C, Img_Icon_Add) == 0x000560, "Member 'UWBP_OBJ_MainMenu_Notification_Message_Item_C::Img_Icon_Add' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Message_Item_C, Img_Icon_Add_1) == 0x000568, "Member 'UWBP_OBJ_MainMenu_Notification_Message_Item_C::Img_Icon_Add_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Message_Item_C, Img_Icon_Add_Keep) == 0x000570, "Member 'UWBP_OBJ_MainMenu_Notification_Message_Item_C::Img_Icon_Add_Keep' has a wrong offset!");

}

