#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Option_List_Video

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Option_List_Video.WBP_Option_List_Video_C
// 0x00D0 (0x05B0 - 0x04E0)
class UWBP_Option_List_Video_C final : public USSOptionListVideoManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SE_Button_Active_In;                               // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Out_R;                                         // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Out_L;                                         // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_IN_R;                                          // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_IN_L;                                          // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_HIde;                                          // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Wait;                                          // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Show;                                          // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        AntiAliasButton;                                   // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        BattleTypeButton;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        ChaosButton;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        DofButton;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        EffectButton;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        FoliageButton;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        HandyCameraShakeButton;                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        LodButton;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        MotionBlurButton;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        PostProcessButton;                                 // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        ResolutionButton;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_011_Gauge_C*       ResolutionScaleButton;                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        ScreenNoButton;                                    // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        ShadowButton;                                      // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        TextureButton;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        VsyncButton;                                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_010_Text_C*        WindowModeButton;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Option_List_Video_BattleTypeButton_K2Node_ComponentBoundEvent_0_OnSSMenuButtonFocusedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Option_List_Video(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Option_List_Video_C">();
	}
	static class UWBP_Option_List_Video_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Option_List_Video_C>();
	}
};
static_assert(alignof(UWBP_Option_List_Video_C) == 0x000008, "Wrong alignment on UWBP_Option_List_Video_C");
static_assert(sizeof(UWBP_Option_List_Video_C) == 0x0005B0, "Wrong size on UWBP_Option_List_Video_C");
static_assert(offsetof(UWBP_Option_List_Video_C, UberGraphFrame) == 0x0004E0, "Member 'UWBP_Option_List_Video_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, SE_Button_Active_In) == 0x0004E8, "Member 'UWBP_Option_List_Video_C::SE_Button_Active_In' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ANI_Out_R) == 0x0004F0, "Member 'UWBP_Option_List_Video_C::ANI_Out_R' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ANI_Out_L) == 0x0004F8, "Member 'UWBP_Option_List_Video_C::ANI_Out_L' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ANI_IN_R) == 0x000500, "Member 'UWBP_Option_List_Video_C::ANI_IN_R' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ANI_IN_L) == 0x000508, "Member 'UWBP_Option_List_Video_C::ANI_IN_L' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ANI_HIde) == 0x000510, "Member 'UWBP_Option_List_Video_C::ANI_HIde' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ANI_Wait) == 0x000518, "Member 'UWBP_Option_List_Video_C::ANI_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ANI_Show) == 0x000520, "Member 'UWBP_Option_List_Video_C::ANI_Show' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, AntiAliasButton) == 0x000528, "Member 'UWBP_Option_List_Video_C::AntiAliasButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, BattleTypeButton) == 0x000530, "Member 'UWBP_Option_List_Video_C::BattleTypeButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ChaosButton) == 0x000538, "Member 'UWBP_Option_List_Video_C::ChaosButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, DofButton) == 0x000540, "Member 'UWBP_Option_List_Video_C::DofButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, EffectButton) == 0x000548, "Member 'UWBP_Option_List_Video_C::EffectButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, FoliageButton) == 0x000550, "Member 'UWBP_Option_List_Video_C::FoliageButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, HandyCameraShakeButton) == 0x000558, "Member 'UWBP_Option_List_Video_C::HandyCameraShakeButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, LodButton) == 0x000560, "Member 'UWBP_Option_List_Video_C::LodButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, MotionBlurButton) == 0x000568, "Member 'UWBP_Option_List_Video_C::MotionBlurButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, PostProcessButton) == 0x000570, "Member 'UWBP_Option_List_Video_C::PostProcessButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ResolutionButton) == 0x000578, "Member 'UWBP_Option_List_Video_C::ResolutionButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ResolutionScaleButton) == 0x000580, "Member 'UWBP_Option_List_Video_C::ResolutionScaleButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ScreenNoButton) == 0x000588, "Member 'UWBP_Option_List_Video_C::ScreenNoButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, ShadowButton) == 0x000590, "Member 'UWBP_Option_List_Video_C::ShadowButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, TextureButton) == 0x000598, "Member 'UWBP_Option_List_Video_C::TextureButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, VsyncButton) == 0x0005A0, "Member 'UWBP_Option_List_Video_C::VsyncButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Video_C, WindowModeButton) == 0x0005A8, "Member 'UWBP_Option_List_Video_C::WindowModeButton' has a wrong offset!");

}

