#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Rep_HpStockSet_P2

#include "Basic.hpp"

#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Rep_HpStockSet_P2.WBP_Rep_HpStockSet_P2_C
// 0x0048 (0x0400 - 0x03B8)
class UWBP_Rep_HpStockSet_P2_C final : public USSHPStockSet
{
public:
	class UWidgetAnimation*                       ANI_HIde;                                          // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Show;                                          // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Rep_HpStock_C*                     HpStock_01;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Rep_HpStock_C*                     HpStock_02;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Rep_HpStock_C*                     HpStock_03;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Rep_HpStock_C*                     HpStock_04;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Rep_HpStock_C*                     HpStock_05;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Rep_HpStock_C*                     HpStock_06;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Rep_HpStock_C*                     HpStock_07;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Rep_HpStockSet_P2_C">();
	}
	static class UWBP_Rep_HpStockSet_P2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Rep_HpStockSet_P2_C>();
	}
};
static_assert(alignof(UWBP_Rep_HpStockSet_P2_C) == 0x000008, "Wrong alignment on UWBP_Rep_HpStockSet_P2_C");
static_assert(sizeof(UWBP_Rep_HpStockSet_P2_C) == 0x000400, "Wrong size on UWBP_Rep_HpStockSet_P2_C");
static_assert(offsetof(UWBP_Rep_HpStockSet_P2_C, ANI_HIde) == 0x0003B8, "Member 'UWBP_Rep_HpStockSet_P2_C::ANI_HIde' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStockSet_P2_C, ANI_Show) == 0x0003C0, "Member 'UWBP_Rep_HpStockSet_P2_C::ANI_Show' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStockSet_P2_C, HpStock_01) == 0x0003C8, "Member 'UWBP_Rep_HpStockSet_P2_C::HpStock_01' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStockSet_P2_C, HpStock_02) == 0x0003D0, "Member 'UWBP_Rep_HpStockSet_P2_C::HpStock_02' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStockSet_P2_C, HpStock_03) == 0x0003D8, "Member 'UWBP_Rep_HpStockSet_P2_C::HpStock_03' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStockSet_P2_C, HpStock_04) == 0x0003E0, "Member 'UWBP_Rep_HpStockSet_P2_C::HpStock_04' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStockSet_P2_C, HpStock_05) == 0x0003E8, "Member 'UWBP_Rep_HpStockSet_P2_C::HpStock_05' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStockSet_P2_C, HpStock_06) == 0x0003F0, "Member 'UWBP_Rep_HpStockSet_P2_C::HpStock_06' has a wrong offset!");
static_assert(offsetof(UWBP_Rep_HpStockSet_P2_C, HpStock_07) == 0x0003F8, "Member 'UWBP_Rep_HpStockSet_P2_C::HpStock_07' has a wrong offset!");

}

