#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_DB_Direction_Setting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_DB_Direction_Setting.WBP_OBJ_DB_Direction_Setting_C
// 0x00A8 (0x05A8 - 0x0500)
class UWBP_OBJ_DB_Direction_Setting_C final : public USSMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_On;                                            // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_OnChangeNormal;                                // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Select;                                        // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_OnChangeSelect;                                // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_Base_Blank;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base_Com;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base_Other;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base_Player;                                   // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Caution;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_CheckDelete;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Detail_01_C*      WBP_OBJ_DB_Direction_Detail_01;                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_DetailIcon_C*     WBP_OBJ_DB_Direction_DetailIcon;                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Base;                               // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Disable;                            // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ones;                               // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ones_1;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_tens;                               // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_tens_1;                             // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_DB_Direction_Setting(int32 EntryPoint);
	void OnChangeDecide();
	void OnChangeDisable();
	void OnChangeNormal();
	void OnChangeSelect();
	void OnChangeSelectToNormal();
	void OnExchangePanel();
	void OnNotExchangePanel();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_DB_Direction_Setting_C">();
	}
	static class UWBP_OBJ_DB_Direction_Setting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_DB_Direction_Setting_C>();
	}
};
static_assert(alignof(UWBP_OBJ_DB_Direction_Setting_C) == 0x000008, "Wrong alignment on UWBP_OBJ_DB_Direction_Setting_C");
static_assert(sizeof(UWBP_OBJ_DB_Direction_Setting_C) == 0x0005A8, "Wrong size on UWBP_OBJ_DB_Direction_Setting_C");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, UberGraphFrame) == 0x000500, "Member 'UWBP_OBJ_DB_Direction_Setting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, ANM_On) == 0x000508, "Member 'UWBP_OBJ_DB_Direction_Setting_C::ANM_On' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, ANM_OnChangeNormal) == 0x000510, "Member 'UWBP_OBJ_DB_Direction_Setting_C::ANM_OnChangeNormal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, ANM_Select) == 0x000518, "Member 'UWBP_OBJ_DB_Direction_Setting_C::ANM_Select' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, ANM_OnChangeSelect) == 0x000520, "Member 'UWBP_OBJ_DB_Direction_Setting_C::ANM_OnChangeSelect' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, ANM_Normal) == 0x000528, "Member 'UWBP_OBJ_DB_Direction_Setting_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, IMG_Base_Blank) == 0x000530, "Member 'UWBP_OBJ_DB_Direction_Setting_C::IMG_Base_Blank' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, IMG_Base_Com) == 0x000538, "Member 'UWBP_OBJ_DB_Direction_Setting_C::IMG_Base_Com' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, IMG_Base_Other) == 0x000540, "Member 'UWBP_OBJ_DB_Direction_Setting_C::IMG_Base_Other' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, IMG_Base_Player) == 0x000548, "Member 'UWBP_OBJ_DB_Direction_Setting_C::IMG_Base_Player' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, IMG_Caution) == 0x000550, "Member 'UWBP_OBJ_DB_Direction_Setting_C::IMG_Caution' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, IMG_CheckDelete) == 0x000558, "Member 'UWBP_OBJ_DB_Direction_Setting_C::IMG_CheckDelete' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, WBP_OBJ_DB_Direction_Detail_01) == 0x000560, "Member 'UWBP_OBJ_DB_Direction_Setting_C::WBP_OBJ_DB_Direction_Detail_01' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, WBP_OBJ_DB_Direction_DetailIcon) == 0x000568, "Member 'UWBP_OBJ_DB_Direction_Setting_C::WBP_OBJ_DB_Direction_DetailIcon' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, WidgetSwitcher_0) == 0x000570, "Member 'UWBP_OBJ_DB_Direction_Setting_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, WidgetSwitcher_Base) == 0x000578, "Member 'UWBP_OBJ_DB_Direction_Setting_C::WidgetSwitcher_Base' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, WidgetSwitcher_Disable) == 0x000580, "Member 'UWBP_OBJ_DB_Direction_Setting_C::WidgetSwitcher_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, WidgetSwitcher_ones) == 0x000588, "Member 'UWBP_OBJ_DB_Direction_Setting_C::WidgetSwitcher_ones' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, WidgetSwitcher_ones_1) == 0x000590, "Member 'UWBP_OBJ_DB_Direction_Setting_C::WidgetSwitcher_ones_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, WidgetSwitcher_tens) == 0x000598, "Member 'UWBP_OBJ_DB_Direction_Setting_C::WidgetSwitcher_tens' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_Setting_C, WidgetSwitcher_tens_1) == 0x0005A0, "Member 'UWBP_OBJ_DB_Direction_Setting_C::WidgetSwitcher_tens_1' has a wrong offset!");

}

