#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Option

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Option.WBP_Option_C
// 0x00A8 (0x0588 - 0x04E0)
class UWBP_Option_C final : public USSOptionManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SE_Close;                                          // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SE_Decide;                                         // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Change_Normal;                                 // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Brightness_Wait;                               // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Change_Brightness;                             // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_HIde;                                          // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Wait;                                          // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Show;                                          // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_BTN_Option_Tab_C*                  BrightnessButton;                                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BTN_Option_Tab_C*                  ControlButton;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BackGround;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BlackBaseFoot;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BlackBaseHed;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BTN_Option_Tab_C*                  KeyControlButton;                                  // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BTN_Option_Tab_C*                  LanguageButton;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BTN_Option_Tab_C*                  OtherButton;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BTN_Option_Tab_C*                  SoundButton;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BTN_Option_Tab_C*                  VideoButton;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Com_BTN_Category_L_C*          WBP_OBJ_Com_BTN_Category_L;                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Com_BTN_Category_R_C*          WBP_OBJ_Com_BTN_Category_R;                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Option_BrightnessButton_K2Node_ComponentBoundEvent_3_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void BndEvt__WBP_Option_ControlButton_K2Node_ComponentBoundEvent_0_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void BndEvt__WBP_Option_ControlButton_K2Node_ComponentBoundEvent_7_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void BndEvt__WBP_Option_KeyControlButton_K2Node_ComponentBoundEvent_5_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void BndEvt__WBP_Option_LanguageButton_K2Node_ComponentBoundEvent_2_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void BndEvt__WBP_Option_OtherButton_K2Node_ComponentBoundEvent_6_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void BndEvt__WBP_Option_SoundButton_K2Node_ComponentBoundEvent_1_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void BndEvt__WBP_Option_VideoButton_K2Node_ComponentBoundEvent_4_OnSSMenuButtonDecidedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Option(int32 EntryPoint);
	void OnChange_Brightness();
	void OnChange_Normal();
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Option_C">();
	}
	static class UWBP_Option_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Option_C>();
	}
};
static_assert(alignof(UWBP_Option_C) == 0x000008, "Wrong alignment on UWBP_Option_C");
static_assert(sizeof(UWBP_Option_C) == 0x000588, "Wrong size on UWBP_Option_C");
static_assert(offsetof(UWBP_Option_C, UberGraphFrame) == 0x0004E0, "Member 'UWBP_Option_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, SE_Close) == 0x0004E8, "Member 'UWBP_Option_C::SE_Close' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, SE_Decide) == 0x0004F0, "Member 'UWBP_Option_C::SE_Decide' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, ANI_Change_Normal) == 0x0004F8, "Member 'UWBP_Option_C::ANI_Change_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, ANI_Brightness_Wait) == 0x000500, "Member 'UWBP_Option_C::ANI_Brightness_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, ANI_Change_Brightness) == 0x000508, "Member 'UWBP_Option_C::ANI_Change_Brightness' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, ANI_HIde) == 0x000510, "Member 'UWBP_Option_C::ANI_HIde' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, ANI_Wait) == 0x000518, "Member 'UWBP_Option_C::ANI_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, ANI_Show) == 0x000520, "Member 'UWBP_Option_C::ANI_Show' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, BrightnessButton) == 0x000528, "Member 'UWBP_Option_C::BrightnessButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, ControlButton) == 0x000530, "Member 'UWBP_Option_C::ControlButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, IMG_BackGround) == 0x000538, "Member 'UWBP_Option_C::IMG_BackGround' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, IMG_BlackBaseFoot) == 0x000540, "Member 'UWBP_Option_C::IMG_BlackBaseFoot' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, IMG_BlackBaseHed) == 0x000548, "Member 'UWBP_Option_C::IMG_BlackBaseHed' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, KeyControlButton) == 0x000550, "Member 'UWBP_Option_C::KeyControlButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, LanguageButton) == 0x000558, "Member 'UWBP_Option_C::LanguageButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, OtherButton) == 0x000560, "Member 'UWBP_Option_C::OtherButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, SoundButton) == 0x000568, "Member 'UWBP_Option_C::SoundButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, VideoButton) == 0x000570, "Member 'UWBP_Option_C::VideoButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, WBP_OBJ_Com_BTN_Category_L) == 0x000578, "Member 'UWBP_Option_C::WBP_OBJ_Com_BTN_Category_L' has a wrong offset!");
static_assert(offsetof(UWBP_Option_C, WBP_OBJ_Com_BTN_Category_R) == 0x000580, "Member 'UWBP_Option_C::WBP_OBJ_Com_BTN_Category_R' has a wrong offset!");

}

