#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugPlayVoice

#include "Basic.hpp"

#include "CriWareRuntime_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SS_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_Change2DCam_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_Change2DCam_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_Change2DCam_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_Change2DCam_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_Change2DCam_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_Change2DCam_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_Change2DCam_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_Change2DCam_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_ChangeFixCam_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_ChangeFixCam_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_ChangeFixCam_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_ChangeFixCam_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_ChangeFixCam_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_ChangeFixCam_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_ChangeFixCam_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_ChangeFixCam_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P1_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P1_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P1_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P1_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P1_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P1_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P1_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P1_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P2_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P2_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P2_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P2_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P2_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P2_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P2_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_enableCamera_P2_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_IsChartDraw_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsChartDraw_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsChartDraw_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsChartDraw_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsChartDraw_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsChartDraw_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsChartDraw_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsChartDraw_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_IsHeight_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsHeight_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsHeight_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsHeight_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsHeight_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsHeight_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsHeight_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsHeight_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_IsLogVolume_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsLogVolume_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsLogVolume_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsLogVolume_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsLogVolume_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsLogVolume_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsLogVolume_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsLogVolume_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_IsPosition_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsPosition_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsPosition_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsPosition_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsPosition_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsPosition_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsPosition_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsPosition_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableA_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableA_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableA_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableA_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableA_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableA_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableA_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableA_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableB_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableB_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableB_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableB_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableB_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableB_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableB_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsVariableB_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_CheckBox_IsWidth_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsWidth_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsWidth_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsWidth_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsWidth_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsWidth_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsWidth_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_CheckBox_IsWidth_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_ChartTime_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_DebugPlayVoice_C_BndEvt__WBP_DebugPlayVoice_EditableTextBox_SetReadoutOffset_K2Node_ComponentBoundEvent_9_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_DebugPlayVoice.WBP_DebugPlayVoice_C.ExecuteUbergraph_WBP_DebugPlayVoice
// 0x0840 (0x0840 - 0x0000)
struct WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_10;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0058(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_9;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_8;           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_7;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_6;           // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_5;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_4;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0118(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_1;         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0148(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0180(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue_1;               // 0x01C0(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_3;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RebindCamera_ReturnValue;                 // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSequencePlayDescription          K2Node_MakeStruct_KoratSequencePlayDescription;    // 0x01F0(0x0018)()
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlaySequence_ReturnValue;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSequencePlayerPlaying_ReturnValue;      // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSequencePlayDescription          K2Node_MakeStruct_KoratSequencePlayDescription_1;  // 0x0218(0x0018)()
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_1;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSequencePlayerPlaying_ReturnValue_1;    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           K2Node_DynamicCast_AsSSCharacter;                  // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_2;            // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_3;            // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RebindCamera_ReturnValue_1;               // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25E[0x2];                                      // 0x025E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRotatedNull_OutTransform;              // 0x0260(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRotatedNull_ReturnValue;               // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlaySequence_ReturnValue_1;               // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0xE];                                      // 0x02C2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSequenceCameraDescription        K2Node_MakeStruct_KoratSequenceCameraDescription;  // 0x02D0(0x00A0)()
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSCharacter*                           K2Node_DynamicCast_AsSSCharacter_1;                // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_382[0xE];                                      // 0x0382(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRotatedNull_OutTransform_1;            // 0x0390(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRotatedNull_ReturnValue_1;             // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0xF];                                      // 0x03F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSequenceCameraDescription        K2Node_MakeStruct_KoratSequenceCameraDescription_1; // 0x0400(0x00A0)()
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_4;            // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x04A8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_5;            // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x04F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_RebindCamera_ReturnValue_2;               // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSequencePlayDescription          K2Node_MakeStruct_KoratSequencePlayDescription_2;  // 0x0530(0x0018)()
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlaySequence_ReturnValue_2;               // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSequencePlayerPlaying_ReturnValue_2;    // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0552(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0553(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_6;            // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0555(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_556[0xA];                                      // 0x0556(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRotatedNull_OutTransform_2;            // 0x0560(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRotatedNull_ReturnValue_2;             // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0xF];                                      // 0x05C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKoratSequenceCameraDescription        K2Node_MakeStruct_KoratSequenceCameraDescription_2; // 0x05D0(0x00A0)()
	class ASSRootCameraDirector*                  CallFunc_GetRootCameraDirector_ReturnValue;        // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0678(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RebindCamera_ReturnValue_3;               // 0x06BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BD[0x3];                                      // 0x06BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSLevelSequenceActor*                  CallFunc_SpawnLevelSequenceActorFromParams_ReturnValue; // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKoratSequencePlayDescription          K2Node_MakeStruct_KoratSequencePlayDescription_3;  // 0x06C8(0x0018)()
	bool                                          CallFunc_PlaySequence_ReturnValue_3;               // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_3;          // 0x06E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSequencePlayerPlaying_ReturnValue_3;    // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x06F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_7;            // 0x06F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x06F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F5[0xB];                                      // 0x06F5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRotatedNull_OutTransform_3;            // 0x0700(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRotatedNull_ReturnValue_3;             // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSRootCameraDirector*                  CallFunc_GetRootCameraDirector_ReturnValue_1;      // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKoratSequenceCameraDescription        K2Node_MakeStruct_KoratSequenceCameraDescription_3; // 0x0770(0x00A0)()
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_812[0x6];                                      // 0x0812(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASSRootCameraDirector*                  CallFunc_GetRootCameraDirector_ReturnValue_2;      // 0x0818(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSRootCameraDirector*                  CallFunc_GetRootCameraDirector_ReturnValue_3;      // 0x0820(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSLevelSequenceActor*                  CallFunc_SpawnLevelSequenceActorFromParams_ReturnValue_1; // 0x0828(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSLevelSequenceActor*                  CallFunc_SpawnLevelSequenceActorFromParams_ReturnValue_2; // 0x0830(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASSLevelSequenceActor*                  CallFunc_SpawnLevelSequenceActorFromParams_ReturnValue_3; // 0x0838(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice) == 0x000010, "Wrong alignment on WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice");
static_assert(sizeof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice) == 0x000840, "Wrong size on WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, EntryPoint) == 0x000000, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_GetCheckedState_ReturnValue) == 0x000020, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_GetCheckedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_bIsChecked_10) == 0x000050, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_bIsChecked_10' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_GetText_ReturnValue_1) == 0x000058, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000070, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000080, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000090, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_bIsChecked_9) == 0x0000A0, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_bIsChecked_9' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_bIsChecked_8) == 0x0000A1, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_bIsChecked_8' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000A8, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000B8, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_bIsChecked_7) == 0x0000C8, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_bIsChecked_7' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_bIsChecked_6) == 0x0000C9, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_bIsChecked_6' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000D0, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000E0, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_bIsChecked_5) == 0x0000F0, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_bIsChecked_5' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_bIsChecked_4) == 0x0000F1, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_bIsChecked_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0000F8, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000108, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_Text_1) == 0x000118, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_CommitMethod_1) == 0x000130, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_CommitMethod_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000138, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_GetEmptyText_ReturnValue) == 0x000148, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000160, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000170, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_Text) == 0x000180, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_CommitMethod) == 0x000198, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0001A0, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_11) == 0x0001B0, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_GetEmptyText_ReturnValue_1) == 0x0001C0, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_GetEmptyText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_Concat_StrStr_ReturnValue_12) == 0x0001D8, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_bIsChecked_3) == 0x0001E8, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_bIsChecked_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_RebindCamera_ReturnValue) == 0x0001E9, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_RebindCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_MakeStruct_KoratSequencePlayDescription) == 0x0001F0, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_MakeStruct_KoratSequencePlayDescription' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_GetSequencePlayer_ReturnValue) == 0x000208, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_PlaySequence_ReturnValue) == 0x000210, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_PlaySequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_IsSequencePlayerPlaying_ReturnValue) == 0x000211, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_IsSequencePlayerPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_IsValid_ReturnValue) == 0x000212, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, K2Node_ComponentBoundEvent_bIsChecked_2) == 0x000213, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::K2Node_ComponentBoundEvent_bIsChecked_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice, CallFunc_IsValid_ReturnValue_1) == 0x000214, "Member 'WBP_DebugPlayVoice_C_ExecuteUbergraph_WBP_DebugPlayVoice::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
