#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Pause_Requirement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Pause_Requirement.WBP_Pause_Requirement_C
// 0x0060 (0x04F8 - 0x0498)
class UWBP_Pause_Requirement_C final : public USSPauseRequirementManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SE_BGM_SE_VOICE_END;                               // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SE_ResumeSound;                                    // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Out;                                           // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Wait;                                          // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_In;                                            // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_BGBlack;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BGBlack_1;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BGBlack_2;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Com_BTN_Category_L_C*          WBP_OBJ_Com_BTN_Category_L;                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Com_BTN_Category_R_C*          WBP_OBJ_Com_BTN_Category_R;                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_One_Shot_Animation;                             // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Pause_Requirement(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Pause_Requirement_C">();
	}
	static class UWBP_Pause_Requirement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Pause_Requirement_C>();
	}
};
static_assert(alignof(UWBP_Pause_Requirement_C) == 0x000008, "Wrong alignment on UWBP_Pause_Requirement_C");
static_assert(sizeof(UWBP_Pause_Requirement_C) == 0x0004F8, "Wrong size on UWBP_Pause_Requirement_C");
static_assert(offsetof(UWBP_Pause_Requirement_C, UberGraphFrame) == 0x000498, "Member 'UWBP_Pause_Requirement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, SE_BGM_SE_VOICE_END) == 0x0004A0, "Member 'UWBP_Pause_Requirement_C::SE_BGM_SE_VOICE_END' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, SE_ResumeSound) == 0x0004A8, "Member 'UWBP_Pause_Requirement_C::SE_ResumeSound' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, ANI_Out) == 0x0004B0, "Member 'UWBP_Pause_Requirement_C::ANI_Out' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, ANI_Wait) == 0x0004B8, "Member 'UWBP_Pause_Requirement_C::ANI_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, ANI_In) == 0x0004C0, "Member 'UWBP_Pause_Requirement_C::ANI_In' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, IMG_BGBlack) == 0x0004C8, "Member 'UWBP_Pause_Requirement_C::IMG_BGBlack' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, IMG_BGBlack_1) == 0x0004D0, "Member 'UWBP_Pause_Requirement_C::IMG_BGBlack_1' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, IMG_BGBlack_2) == 0x0004D8, "Member 'UWBP_Pause_Requirement_C::IMG_BGBlack_2' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, WBP_OBJ_Com_BTN_Category_L) == 0x0004E0, "Member 'UWBP_Pause_Requirement_C::WBP_OBJ_Com_BTN_Category_L' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, WBP_OBJ_Com_BTN_Category_R) == 0x0004E8, "Member 'UWBP_Pause_Requirement_C::WBP_OBJ_Com_BTN_Category_R' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_Requirement_C, In_One_Shot_Animation) == 0x0004F0, "Member 'UWBP_Pause_Requirement_C::In_One_Shot_Animation' has a wrong offset!");

}

