#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GRP_MainMenu_Notification_gift

#include "Basic.hpp"

#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GRP_MainMenu_Notification_gift.WBP_GRP_MainMenu_Notification_gift_C
// 0x0018 (0x0438 - 0x0420)
class UWBP_GRP_MainMenu_Notification_gift_C final : public USSUiItemNotifications
{
public:
	class UWBP_OBJ_MainMenu_Notification_gift_Item_C* WBP_OBJ_MainMenu_Notification_gift_Item_0;         // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_MainMenu_Notification_gift_Item_C* WBP_OBJ_MainMenu_Notification_gift_Item_1;         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_MainMenu_Notification_gift_Item_C* WBP_OBJ_MainMenu_Notification_gift_Item_2;         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GRP_MainMenu_Notification_gift_C">();
	}
	static class UWBP_GRP_MainMenu_Notification_gift_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GRP_MainMenu_Notification_gift_C>();
	}
};
static_assert(alignof(UWBP_GRP_MainMenu_Notification_gift_C) == 0x000008, "Wrong alignment on UWBP_GRP_MainMenu_Notification_gift_C");
static_assert(sizeof(UWBP_GRP_MainMenu_Notification_gift_C) == 0x000438, "Wrong size on UWBP_GRP_MainMenu_Notification_gift_C");
static_assert(offsetof(UWBP_GRP_MainMenu_Notification_gift_C, WBP_OBJ_MainMenu_Notification_gift_Item_0) == 0x000420, "Member 'UWBP_GRP_MainMenu_Notification_gift_C::WBP_OBJ_MainMenu_Notification_gift_Item_0' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_MainMenu_Notification_gift_C, WBP_OBJ_MainMenu_Notification_gift_Item_1) == 0x000428, "Member 'UWBP_GRP_MainMenu_Notification_gift_C::WBP_OBJ_MainMenu_Notification_gift_Item_1' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_MainMenu_Notification_gift_C, WBP_OBJ_MainMenu_Notification_gift_Item_2) == 0x000430, "Member 'UWBP_GRP_MainMenu_Notification_gift_C::WBP_OBJ_MainMenu_Notification_gift_Item_2' has a wrong offset!");

}

