#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_DB_Direction_List_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_DB_Direction_List_1.WBP_OBJ_DB_Direction_List_1_C
// 0x0080 (0x06B0 - 0x0630)
class UWBP_OBJ_DB_Direction_List_1_C final : public USSDramaticDirectionEditUi
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SE_Window_Slied_In;                                // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_LabelBase;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_PreviewBase;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CMN_ScrollBox_C*                   WBP_CMN_ScrollBox;                                 // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Detail_02_C*      WBP_OBJ_DB_Direction_Detail_02;                    // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Setting_C*        WBP_OBJ_DB_Direction_Setting_0;                    // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Setting_C*        WBP_OBJ_DB_Direction_Setting_1;                    // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Setting_C*        WBP_OBJ_DB_Direction_Setting_2;                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Setting_C*        WBP_OBJ_DB_Direction_Setting_3;                    // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Setting_C*        WBP_OBJ_DB_Direction_Setting_4;                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Setting_C*        WBP_OBJ_DB_Direction_Setting_5;                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_DB_Direction_Trigger0_C*       WBP_OBJ_DB_Direction_Trigger_0;                    // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_DB_Direction_List_1(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_DB_Direction_List_1_C">();
	}
	static class UWBP_OBJ_DB_Direction_List_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_DB_Direction_List_1_C>();
	}
};
static_assert(alignof(UWBP_OBJ_DB_Direction_List_1_C) == 0x000010, "Wrong alignment on UWBP_OBJ_DB_Direction_List_1_C");
static_assert(sizeof(UWBP_OBJ_DB_Direction_List_1_C) == 0x0006B0, "Wrong size on UWBP_OBJ_DB_Direction_List_1_C");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, UberGraphFrame) == 0x000630, "Member 'UWBP_OBJ_DB_Direction_List_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, SE_Window_Slied_In) == 0x000638, "Member 'UWBP_OBJ_DB_Direction_List_1_C::SE_Window_Slied_In' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, ANM_OUT) == 0x000640, "Member 'UWBP_OBJ_DB_Direction_List_1_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, ANM_Normal) == 0x000648, "Member 'UWBP_OBJ_DB_Direction_List_1_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, ANM_ShowIn) == 0x000650, "Member 'UWBP_OBJ_DB_Direction_List_1_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, IMG_LabelBase) == 0x000658, "Member 'UWBP_OBJ_DB_Direction_List_1_C::IMG_LabelBase' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, IMG_PreviewBase) == 0x000660, "Member 'UWBP_OBJ_DB_Direction_List_1_C::IMG_PreviewBase' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, WBP_CMN_ScrollBox) == 0x000668, "Member 'UWBP_OBJ_DB_Direction_List_1_C::WBP_CMN_ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, WBP_OBJ_DB_Direction_Detail_02) == 0x000670, "Member 'UWBP_OBJ_DB_Direction_List_1_C::WBP_OBJ_DB_Direction_Detail_02' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, WBP_OBJ_DB_Direction_Setting_0) == 0x000678, "Member 'UWBP_OBJ_DB_Direction_List_1_C::WBP_OBJ_DB_Direction_Setting_0' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, WBP_OBJ_DB_Direction_Setting_1) == 0x000680, "Member 'UWBP_OBJ_DB_Direction_List_1_C::WBP_OBJ_DB_Direction_Setting_1' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, WBP_OBJ_DB_Direction_Setting_2) == 0x000688, "Member 'UWBP_OBJ_DB_Direction_List_1_C::WBP_OBJ_DB_Direction_Setting_2' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, WBP_OBJ_DB_Direction_Setting_3) == 0x000690, "Member 'UWBP_OBJ_DB_Direction_List_1_C::WBP_OBJ_DB_Direction_Setting_3' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, WBP_OBJ_DB_Direction_Setting_4) == 0x000698, "Member 'UWBP_OBJ_DB_Direction_List_1_C::WBP_OBJ_DB_Direction_Setting_4' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, WBP_OBJ_DB_Direction_Setting_5) == 0x0006A0, "Member 'UWBP_OBJ_DB_Direction_List_1_C::WBP_OBJ_DB_Direction_Setting_5' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_DB_Direction_List_1_C, WBP_OBJ_DB_Direction_Trigger_0) == 0x0006A8, "Member 'UWBP_OBJ_DB_Direction_List_1_C::WBP_OBJ_DB_Direction_Trigger_0' has a wrong offset!");

}

