#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GRP_Title_Terms

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GRP_Title_Terms.WBP_GRP_Title_Terms_C
// 0x0168 (0x0608 - 0x04A0)
class UWBP_GRP_Title_Terms_C final : public USSTitleTermsManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SE_Page_Back;                                      // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SE_Page_forward;                                   // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               GRP_ButtonBox;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           GRP_MainBox;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Base;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_InearBase;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_10;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_11;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_12;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_13;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_14;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_15;                                      // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_16;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_17;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_18;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_19;                                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_20;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_21;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_22;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_23;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_24;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_25;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_26;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_00;                                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_01;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_02;                                      // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_03;                                      // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_04;                                      // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_05;                                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_06;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_07;                                      // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_08;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Terms_09;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Dialog_Button_C*               LeftButton;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Dialog_Button_C*               RightButton;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_UI_EULA_10_jp;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_RightsNotation;                               // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_TextRights;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Gallery_BTN_Category_L_C*      WBP_OBJ_Gallery_BTN_Category_L;                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Gallery_BTN_Category_R_C*      WBP_OBJ_Gallery_BTN_Category_R;                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Title_BTN_Language_C*          WBP_OBJ_Title_BTN_Language;                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GRP_Title_Terms(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GRP_Title_Terms_C">();
	}
	static class UWBP_GRP_Title_Terms_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GRP_Title_Terms_C>();
	}
};
static_assert(alignof(UWBP_GRP_Title_Terms_C) == 0x000008, "Wrong alignment on UWBP_GRP_Title_Terms_C");
static_assert(sizeof(UWBP_GRP_Title_Terms_C) == 0x000608, "Wrong size on UWBP_GRP_Title_Terms_C");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, UberGraphFrame) == 0x0004A0, "Member 'UWBP_GRP_Title_Terms_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, SE_Page_Back) == 0x0004A8, "Member 'UWBP_GRP_Title_Terms_C::SE_Page_Back' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, SE_Page_forward) == 0x0004B0, "Member 'UWBP_GRP_Title_Terms_C::SE_Page_forward' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, ANM_OUT) == 0x0004B8, "Member 'UWBP_GRP_Title_Terms_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, ANM_Normal) == 0x0004C0, "Member 'UWBP_GRP_Title_Terms_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, ANM_ShowIn) == 0x0004C8, "Member 'UWBP_GRP_Title_Terms_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, GRP_ButtonBox) == 0x0004D0, "Member 'UWBP_GRP_Title_Terms_C::GRP_ButtonBox' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, GRP_MainBox) == 0x0004D8, "Member 'UWBP_GRP_Title_Terms_C::GRP_MainBox' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Base) == 0x0004E0, "Member 'UWBP_GRP_Title_Terms_C::IMG_Base' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_InearBase) == 0x0004E8, "Member 'UWBP_GRP_Title_Terms_C::IMG_InearBase' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_10) == 0x0004F0, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_10' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_11) == 0x0004F8, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_11' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_12) == 0x000500, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_12' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_13) == 0x000508, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_13' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_14) == 0x000510, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_14' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_15) == 0x000518, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_15' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_16) == 0x000520, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_16' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_17) == 0x000528, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_17' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_18) == 0x000530, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_18' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_19) == 0x000538, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_19' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_20) == 0x000540, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_20' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_21) == 0x000548, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_21' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_22) == 0x000550, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_22' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_23) == 0x000558, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_23' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_24) == 0x000560, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_24' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_25) == 0x000568, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_25' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_26) == 0x000570, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_26' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_00) == 0x000578, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_00' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_01) == 0x000580, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_01' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_02) == 0x000588, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_02' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_03) == 0x000590, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_03' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_04) == 0x000598, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_04' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_05) == 0x0005A0, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_05' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_06) == 0x0005A8, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_06' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_07) == 0x0005B0, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_07' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_08) == 0x0005B8, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_08' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, IMG_Terms_09) == 0x0005C0, "Member 'UWBP_GRP_Title_Terms_C::IMG_Terms_09' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, LeftButton) == 0x0005C8, "Member 'UWBP_GRP_Title_Terms_C::LeftButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, RightButton) == 0x0005D0, "Member 'UWBP_GRP_Title_Terms_C::RightButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, T_UI_EULA_10_jp) == 0x0005D8, "Member 'UWBP_GRP_Title_Terms_C::T_UI_EULA_10_jp' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, TEXT_RightsNotation) == 0x0005E0, "Member 'UWBP_GRP_Title_Terms_C::TEXT_RightsNotation' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, VBox_TextRights) == 0x0005E8, "Member 'UWBP_GRP_Title_Terms_C::VBox_TextRights' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, WBP_OBJ_Gallery_BTN_Category_L) == 0x0005F0, "Member 'UWBP_GRP_Title_Terms_C::WBP_OBJ_Gallery_BTN_Category_L' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, WBP_OBJ_Gallery_BTN_Category_R) == 0x0005F8, "Member 'UWBP_GRP_Title_Terms_C::WBP_OBJ_Gallery_BTN_Category_R' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_Title_Terms_C, WBP_OBJ_Title_BTN_Language) == 0x000600, "Member 'UWBP_GRP_Title_Terms_C::WBP_OBJ_Title_BTN_Language' has a wrong offset!");

}

