#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GRP_BS_Custom_SF_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GRP_BS_Custom_SF_Base.WBP_GRP_BS_Custom_SF_Base_C
// 0x0070 (0x07B0 - 0x0740)
class UWBP_GRP_BS_Custom_SF_Base_C final : public USSSortFilterDialog
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0740(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_Alert;                                         // 0x0748(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x0750(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0758(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x0760(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IMG_Alert;                                         // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Line;                                          // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Window;                                        // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Window_1;                                      // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Com_BTN_Category_L_C*          WBP_OBJ_Com_BTN_Category_L;                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Com_BTN_Category_R_C*          WBP_OBJ_Com_BTN_Category_R;                        // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Guide_Btn_0_C*                 WBP_OBJ_Guide_Btn_0;                               // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 ClassSort;                                         // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ClassFilter;                                       // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GRP_BS_Custom_SF_Base(int32 EntryPoint);
	void OnCloseFailed();
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GRP_BS_Custom_SF_Base_C">();
	}
	static class UWBP_GRP_BS_Custom_SF_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GRP_BS_Custom_SF_Base_C>();
	}
};
static_assert(alignof(UWBP_GRP_BS_Custom_SF_Base_C) == 0x000010, "Wrong alignment on UWBP_GRP_BS_Custom_SF_Base_C");
static_assert(sizeof(UWBP_GRP_BS_Custom_SF_Base_C) == 0x0007B0, "Wrong size on UWBP_GRP_BS_Custom_SF_Base_C");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, UberGraphFrame) == 0x000740, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, ANM_Alert) == 0x000748, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::ANM_Alert' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, ANM_OUT) == 0x000750, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, ANM_Normal) == 0x000758, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, ANM_ShowIn) == 0x000760, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, IMG_Alert) == 0x000768, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::IMG_Alert' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, IMG_Line) == 0x000770, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::IMG_Line' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, IMG_Window) == 0x000778, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::IMG_Window' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, IMG_Window_1) == 0x000780, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::IMG_Window_1' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, WBP_OBJ_Com_BTN_Category_L) == 0x000788, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::WBP_OBJ_Com_BTN_Category_L' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, WBP_OBJ_Com_BTN_Category_R) == 0x000790, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::WBP_OBJ_Com_BTN_Category_R' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, WBP_OBJ_Guide_Btn_0) == 0x000798, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::WBP_OBJ_Guide_Btn_0' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, ClassSort) == 0x0007A0, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::ClassSort' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_BS_Custom_SF_Base_C, ClassFilter) == 0x0007A8, "Member 'UWBP_GRP_BS_Custom_SF_Base_C::ClassFilter' has a wrong offset!");

}

