#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Option_List_Language

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Option_List_Language.WBP_Option_List_Language_C.ExecuteUbergraph_WBP_Option_List_Language
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_1;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_2;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_3;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_4;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_5;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_6;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_7;                            // 0x0078(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_8;                            // 0x0088(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_9;                            // 0x0098(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_10;                           // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_11;                           // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_12;                           // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_13;                           // 0x00D8(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language) == 0x000008, "Wrong alignment on WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language");
static_assert(sizeof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language) == 0x0000F0, "Wrong size on WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, EntryPoint) == 0x000000, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable) == 0x000008, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_1) == 0x000018, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_2) == 0x000028, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_3) == 0x000038, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_4) == 0x000048, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_5) == 0x000058, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_6) == 0x000068, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_7) == 0x000078, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_8) == 0x000088, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_9) == 0x000098, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_10) == 0x0000A8, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_11) == 0x0000B8, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_12) == 0x0000C8, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, Temp_object_Variable_13) == 0x0000D8, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, K2Node_SwitchEnum_CmpSuccess) == 0x0000E8, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000E9, "Member 'WBP_Option_List_Language_C_ExecuteUbergraph_WBP_Option_List_Language::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

}

