#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Option_List_Language

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Option_List_Language.WBP_Option_List_Language_C
// 0x0068 (0x0530 - 0x04C8)
class UWBP_Option_List_Language_C final : public USSOptionListLanguageManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SE_Button_Active_In;                               // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Out_R;                                         // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Out_L;                                         // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_IN_R;                                          // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_IN_L;                                          // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_HIde;                                          // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Wait;                                          // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANI_Show;                                          // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_012_TextAlpha_C*   BackgroundEventButton;                             // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_012_TextAlpha_C*   BackgroundMenuButton;                              // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_013_Lang_C*        LocalizationTextButton;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_013_Lang_C*        LocalizationVoiceButton;                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Option_List_Language_LocalizationTextButton_K2Node_ComponentBoundEvent_0_OnSSMenuButtonFocusedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Option_List_Language(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Option_List_Language_C">();
	}
	static class UWBP_Option_List_Language_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Option_List_Language_C>();
	}
};
static_assert(alignof(UWBP_Option_List_Language_C) == 0x000008, "Wrong alignment on UWBP_Option_List_Language_C");
static_assert(sizeof(UWBP_Option_List_Language_C) == 0x000530, "Wrong size on UWBP_Option_List_Language_C");
static_assert(offsetof(UWBP_Option_List_Language_C, UberGraphFrame) == 0x0004C8, "Member 'UWBP_Option_List_Language_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, SE_Button_Active_In) == 0x0004D0, "Member 'UWBP_Option_List_Language_C::SE_Button_Active_In' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, ANI_Out_R) == 0x0004D8, "Member 'UWBP_Option_List_Language_C::ANI_Out_R' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, ANI_Out_L) == 0x0004E0, "Member 'UWBP_Option_List_Language_C::ANI_Out_L' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, ANI_IN_R) == 0x0004E8, "Member 'UWBP_Option_List_Language_C::ANI_IN_R' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, ANI_IN_L) == 0x0004F0, "Member 'UWBP_Option_List_Language_C::ANI_IN_L' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, ANI_HIde) == 0x0004F8, "Member 'UWBP_Option_List_Language_C::ANI_HIde' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, ANI_Wait) == 0x000500, "Member 'UWBP_Option_List_Language_C::ANI_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, ANI_Show) == 0x000508, "Member 'UWBP_Option_List_Language_C::ANI_Show' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, BackgroundEventButton) == 0x000510, "Member 'UWBP_Option_List_Language_C::BackgroundEventButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, BackgroundMenuButton) == 0x000518, "Member 'UWBP_Option_List_Language_C::BackgroundMenuButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, LocalizationTextButton) == 0x000520, "Member 'UWBP_Option_List_Language_C::LocalizationTextButton' has a wrong offset!");
static_assert(offsetof(UWBP_Option_List_Language_C, LocalizationVoiceButton) == 0x000528, "Member 'UWBP_Option_List_Language_C::LocalizationVoiceButton' has a wrong offset!");

}

