#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_SL_Content_Other

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_OBJ_SL_Content_Other.WBP_OBJ_SL_Content_Other_C.ExecuteUbergraph_WBP_OBJ_SL_Content_Other
// 0x0048 (0x0048 - 0x0000)
struct WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_1;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_2;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TArray<class UWidgetAnimation*>               Temp_object_Variable_3;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other) == 0x000008, "Wrong alignment on WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other");
static_assert(sizeof(WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other) == 0x000048, "Wrong size on WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other");
static_assert(offsetof(WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other, EntryPoint) == 0x000000, "Member 'WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other, Temp_object_Variable) == 0x000008, "Member 'WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other, Temp_object_Variable_1) == 0x000018, "Member 'WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other, Temp_object_Variable_2) == 0x000028, "Member 'WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other, Temp_object_Variable_3) == 0x000038, "Member 'WBP_OBJ_SL_Content_Other_C_ExecuteUbergraph_WBP_OBJ_SL_Content_Other::Temp_object_Variable_3' has a wrong offset!");

}

