#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OBJ_MainMenu_Notification_Window

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OBJ_MainMenu_Notification_Window.WBP_OBJ_MainMenu_Notification_Window_C
// 0x0030 (0x0530 - 0x0500)
class UWBP_OBJ_MainMenu_Notification_Window_C final : public USSUiCriticalNotification
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Normal;                                        // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_ShowIn;                                        // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_OBJ_Dialog_Button_C*               WBP_OBJ_Dialog_Button;                             // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OBJ_MainMenu_Notification_Window(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OBJ_MainMenu_Notification_Window_C">();
	}
	static class UWBP_OBJ_MainMenu_Notification_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OBJ_MainMenu_Notification_Window_C>();
	}
};
static_assert(alignof(UWBP_OBJ_MainMenu_Notification_Window_C) == 0x000010, "Wrong alignment on UWBP_OBJ_MainMenu_Notification_Window_C");
static_assert(sizeof(UWBP_OBJ_MainMenu_Notification_Window_C) == 0x000530, "Wrong size on UWBP_OBJ_MainMenu_Notification_Window_C");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Window_C, UberGraphFrame) == 0x000500, "Member 'UWBP_OBJ_MainMenu_Notification_Window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Window_C, ANM_OUT) == 0x000508, "Member 'UWBP_OBJ_MainMenu_Notification_Window_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Window_C, ANM_Normal) == 0x000510, "Member 'UWBP_OBJ_MainMenu_Notification_Window_C::ANM_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Window_C, ANM_ShowIn) == 0x000518, "Member 'UWBP_OBJ_MainMenu_Notification_Window_C::ANM_ShowIn' has a wrong offset!");
static_assert(offsetof(UWBP_OBJ_MainMenu_Notification_Window_C, WBP_OBJ_Dialog_Button) == 0x000520, "Member 'UWBP_OBJ_MainMenu_Notification_Window_C::WBP_OBJ_Dialog_Button' has a wrong offset!");

}

