#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GRP_TTR_Opt_Assist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SS_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GRP_TTR_Opt_Assist.WBP_GRP_TTR_Opt_Assist_C
// 0x00D8 (0x0570 - 0x0498)
class UWBP_GRP_TTR_Opt_Assist_C final : public USSOptionAssistControlManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ANM_OUT;                                           // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Wait;                                          // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ANM_Show;                                          // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Zero_IMG_Pad_Xone;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 One_IMG_Pad_PS;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Two_IMG_Key;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_000_C*             AssistCombo;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_OptionContent_TextArrowSet_C*  AssistComboButton;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_000_C*             AssistControl;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_OptionContent_TextArrowSet_C*  AssistControlButton;                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_000_C*             AssistDragonDash;                                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_000_C*             AssistDragonDashAttack;                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_OptionContent_TextArrowSet_C*  AssistDragonDashAttackButton;                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_OptionContent_TextArrowSet_C*  AssistDragonDashButton;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_000_C*             AssistGuard;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_OptionContent_TextArrowSet_C*  AssistGuardButton;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_000_C*             AssistPassive;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_OptionContent_TextArrowSet_C*  AssistPassiveButton;                               // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_000_C*             AssistPursuit;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_OptionContent_TextArrowSet_C*  AssistPursuitButton;                               // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Option_List_000_C*             AssistRevengeCounter;                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_OptionContent_TextArrowSet_C*  AssistRevengeCounterButton;                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_TextBG;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_TipsMain;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OBJ_Common_HoldBTN_Normal_0_C*     WBP_OBJ_HoldBTN;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_TipsImage;                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GRP_TTR_Opt_Assist(int32 EntryPoint);
	void OnHideStarted();
	void OnShowFinished();
	void OnShowStarted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GRP_TTR_Opt_Assist_C">();
	}
	static class UWBP_GRP_TTR_Opt_Assist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GRP_TTR_Opt_Assist_C>();
	}
};
static_assert(alignof(UWBP_GRP_TTR_Opt_Assist_C) == 0x000008, "Wrong alignment on UWBP_GRP_TTR_Opt_Assist_C");
static_assert(sizeof(UWBP_GRP_TTR_Opt_Assist_C) == 0x000570, "Wrong size on UWBP_GRP_TTR_Opt_Assist_C");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, UberGraphFrame) == 0x000498, "Member 'UWBP_GRP_TTR_Opt_Assist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, ANM_OUT) == 0x0004A0, "Member 'UWBP_GRP_TTR_Opt_Assist_C::ANM_OUT' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, ANM_Wait) == 0x0004A8, "Member 'UWBP_GRP_TTR_Opt_Assist_C::ANM_Wait' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, ANM_Show) == 0x0004B0, "Member 'UWBP_GRP_TTR_Opt_Assist_C::ANM_Show' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, Zero_IMG_Pad_Xone) == 0x0004B8, "Member 'UWBP_GRP_TTR_Opt_Assist_C::Zero_IMG_Pad_Xone' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, One_IMG_Pad_PS) == 0x0004C0, "Member 'UWBP_GRP_TTR_Opt_Assist_C::One_IMG_Pad_PS' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, Two_IMG_Key) == 0x0004C8, "Member 'UWBP_GRP_TTR_Opt_Assist_C::Two_IMG_Key' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistCombo) == 0x0004D0, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistCombo' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistComboButton) == 0x0004D8, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistComboButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistControl) == 0x0004E0, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistControl' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistControlButton) == 0x0004E8, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistControlButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistDragonDash) == 0x0004F0, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistDragonDash' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistDragonDashAttack) == 0x0004F8, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistDragonDashAttack' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistDragonDashAttackButton) == 0x000500, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistDragonDashAttackButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistDragonDashButton) == 0x000508, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistDragonDashButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistGuard) == 0x000510, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistGuard' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistGuardButton) == 0x000518, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistGuardButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistPassive) == 0x000520, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistPassive' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistPassiveButton) == 0x000528, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistPassiveButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistPursuit) == 0x000530, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistPursuit' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistPursuitButton) == 0x000538, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistPursuitButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistRevengeCounter) == 0x000540, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistRevengeCounter' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, AssistRevengeCounterButton) == 0x000548, "Member 'UWBP_GRP_TTR_Opt_Assist_C::AssistRevengeCounterButton' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, IMG_TextBG) == 0x000550, "Member 'UWBP_GRP_TTR_Opt_Assist_C::IMG_TextBG' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, TEXT_TipsMain) == 0x000558, "Member 'UWBP_GRP_TTR_Opt_Assist_C::TEXT_TipsMain' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, WBP_OBJ_HoldBTN) == 0x000560, "Member 'UWBP_GRP_TTR_Opt_Assist_C::WBP_OBJ_HoldBTN' has a wrong offset!");
static_assert(offsetof(UWBP_GRP_TTR_Opt_Assist_C, WidgetSwitcher_TipsImage) == 0x000568, "Member 'UWBP_GRP_TTR_Opt_Assist_C::WidgetSwitcher_TipsImage' has a wrong offset!");

}

